{"VOICE": [" An impact equivalent to ten thousand nuclear weapons detonating simultaneously.", " One hundred trillion tons of dirt and rock hurled into the atmosphere.", " A blanket of dust the sun is powerless to penetrate. For five thousand years our world is robbed of light as a nuclear winter falls. In that darkness, a civilisation is removed from existence."], "SHELBY": [" Houston, I can't get this thing to work...", " Okay, Houston, commence whacking.", " Ple...he...me"], "CLARK": [" Atlantis, what's the problem?", " What the hell was that?", " The press is going to want answers. What are we going to say?", " A big asteroid. E.T.A., eighteen days. A lot bigger than the five mile one that obliterated the dinosaurs.", " Three things the Russians make well, guys - vodka, gymnasts and rockets. Don't count 'em out.", " United States astronauts train for eighteen months. You have nine days. Officers Sharp, Truman, Watts and Weston are your military instructors and the only pilots to have flown the spacecraft. Each is a combat decorated officer and among the finest men and women we have in the service. Pay attention to them.", " You will vomit.  Your eyes will be sucked into the back of your heads. You'll be so tired you can't eat but that won't matter 'cause you'll be so sore you can't take a dump. By the way...good morning.", " We've got to warn.", " Lookin' real good, Freedom.", " Freedom, Independence. You're looking good. Prepare to start docking procedures at the MIR.", " How we doin', Freedom, over?", " You're on your own, Willie. You've got to raise your velocity 17 thousand miles an hour or you won't catch the target, over.", " We'll pick 'em up again in sixteen minutes, Danny.", " They're hittin' the big G's right about...now.", " Freedom, come in, over. Independence, come in, over.", " We'll take you in, guys."], "SHELBY (V.O.)": [" It just isn't working. Any suggestions?"], "CLARKE": [" Hang on Pete. We'll figure something out for you."], "GOLDEN": [" We got the top scientific minds in the world working on this. Try \"whacking\" the thing.", " Nothing. Not until we know what happened.", " I am secure. Go ahead, General.", " When?", " Tell the president it's called \"budget cuts.\" We don't have enough telescopes to track the skies.", " I don't know. We'll figure it out.", " Fly a team up to New York. Contact every Space Watch facility in the", " Did we find who made the phone call last night?", " Copies to the Pentagon, Colorado Space Command, and the Washington", " Okay guys, one of the worst days in N.A..S.A history just got worse. Ten million to one. A rogue comet came from deep space and collided with an asteroid. Some kids actually got a picture of the collision event and told no one. The stuff that hit this morning was the collision's forward- thrown matter, mere pebbles from what's about to come. Walter?", " The size of Texas.", " How many of you are as scared as I am?", " One giant leap for Mankind. Everyone remember that? This is what we are going to do. We're going to fly to that asteroid with a nuclear device, implant it and get off before it blows. Quincy?", " You're all looking at us like we're crazy. We're not.", " What I'm going to tell you is a breach of national security and could land me in jail, but in eighteen days there arnt' gonna be any jails, so shuttle. Gentlemen, I'm talking about the X-71.", " Time is our enemy. This is like the race to the Moon, guys - what this Agency was founded on.", " Quincy's been working on excavating the ice from the Moon - he's gonna reorient his thinking. Right, Quince?", " I don't care who he is, what he's doing.", " It's the late 20th century, I run the U.S. Space Program, and I'm praying to God the Russians are better at this than we are", " So, where's our oil driller?", " Mister Stamper.. Dan Golden, I'm Director of --", " That was a long time ago. I run this place now. And we've got a serious problem on our hands that Quincy here thinks you might be able to help us out with --", " I wonder if we might speak alone?", " Okay.", " Move it along, Quincy.", " Well, Mister Stamper, we need you to drill a hole. It's in a difficult place.", " Not...this place. This is really out there. Space, Mister Stamper.", " We're manning a mission to that asteroid to plant a nuclear device in it's core. To do that we need to drill an eight hundred foot hole.", " All we want is your advice in perfecting our drilling arm, any help you can provide. We'll pay your usual consultancy, of course.", " Ten million.", " Gentlemen, gentlemen, wait a second. The crux of the matter", " Or three", " You won't need one. You're not going up.", " Harry. Let's figure this out.", " The deal was for you, not others.", " It's out of the question.", " What kind of men are these?", " This is getting us nowhere. Can they fly, or not?", " We need to drill. Do you know how to drill, colonel? Neither do I. They're going up.", " General, it's our job to get them ready to go into space. They're there to do the drilling. And Colonel Sharp, we all have families.", " This is like putting the Hell's Angels in space.", " Projected impact tracking. I need stats!", " Warn who? The whole South Pacific?", " Stamper, answer me one question - have you ever let anyone down?", " ....and the two pieces will slide right past us. You cannot shatter it. Getting hit with 20 smaller asteroids is as bad as one big one. You have to drill, plant the nuke, lift off, and detonate -- all before the asteroid reaches this position. You have eight hours. Remember it. You must detonate by this point or, the two halves will hit us.", "", " These guys are fast. Harry, interior gauge check.", " A.J.'s off the team. We need a list of names from you to fill the slot.", " We don't want independent thinkers. And we don't need heroes. We need a team.", " One shot. Pull him in line or send him home.", " In the book of Revalations, the Bible speaks of a final day on Earth, when all mankind shall perish, shall cease to exist. This day is known as Armageddon.", " When you meet the Russian, you might want to go easy on the guy.", " I work for the President of the United States. But I think it's my duty as a scientist to tell the world what is happening. Three, days ago a manned space mission was sent to intercept an asteroid which has entered the Earth's orbit. This is a difficult mission. In all frankness, it is the most difficult mission anyone has ever flown. A little over fifty years ago we sent our Armed Forces half-way around the world to save the world from an evil empire that threatened mass extinction. The men and women of this nation united, answered the calland preserved our freedom. Once again we face a threat to our way of life. And once again we look to our military to preserve our future. The men and women selected to lead this mission are America's finest and most decorated career officers in the military. Our hopes and prayers are with them. Thank you.", " We'll do your best.", " They'll be pullin' nine and half G's for eleven minutes, General.", " If they're still alive.", " Come on, Willie, you can do this", " Willie? Come in, over. Willie, can you hear me...?", " Freedom. come in.", " What's the problem?", " How much deeper?", " Harry, your fault line's fifty yards off the starboard side.", " Yeah, Harry. What's your situation?", " You're forty minutes in. You should be down 150 feet. How far are you?", " \"Don't tell me what you can't do, tell me what you can.\" Remember that, Stamper? Go faster.", " How?", " What is going on up there?", " After 15 minutes? What do you expect?", " A surface detonation isn't going to do it, General. My scientists have already told you that. It must be detonated inside the asteroid. The alternative is that the Earth will be bombarded by smaller matter which will be just as catastrophic.", " The asteroid's surface is heating up.", " It means they may not be able to work on the surface for much longer. The temperatures will be unbearable.", " Say nothing.", " Now just get the thing in the hole.", " Harry, c'mon, we got thirty minutes.", " Is he alright?", " The situation: the hole is drilled but the remote detonator is not functional. One of the crew is going to stay behind and", " Don't stay for this.", " Stamper, you gave me your word. You have five seconds. PRESS THE BUTTON!", " Where are they, Flip? Give me some angles, give me some directions, give me speeds...", " I just want to tell you I'm proud to know the daughter of the man who just saved the world."], "GENERAL": [" \"WHAT THE HELL WAS THAT?\""], "N.A.S.A. TECHNICIAN #1": [" All systems crashing!"], "N.A.S.A. TECHNICIAN #2": [" Massive failure. We lost them."], "JIMBO": [" When are we going to let N.A.S.A in on what we've found?", " Yeah, but this is their sandbox were playing in.", " Hell with them, I'm going on Howard Stern", " Call N.A.S.A", " I have the number. I got it from \"Mega monster.\"", " He's some super-hacker, I went to high school with. Guy's totally wired into every encrypted government installation.", " They never proved he shut down the power in those seven states.", " I got mission control", " Uhh hi, I'm an astronomer in Kentucky, and I was wondering if you guys had seen some strange activity in the southern middle quadrant of the asteroid belt between Antares Major and Epsilom Scorpio", " My name? Uhh", " Lexington... Massachusetts.", " So, that N.A.S.A. guy wasn't kiddin; about bein' arrested and", " Yes, absolutely, yes sir.", " Him.", " I was calling the Houston area code, which is 713. I was calling 712, which is outside Spokane, Washington, where my Aunt Zelda", " Our math must've been off! we thought it was gonna pass the Earth!", " Hey, zipperheads! Ever watch \"L.A. Law?\" Right to remain silent, right to an attorney? My brother's a badass lawyer - he's gonna sue your asses to Mars. I was in pre-law for a month - you can't put somebody in jail for makin' a phone call!!!", " Yeah, that's why they were so hot for the co-ordinates. Do you think it's an asteroid? Or comet?", " If it's over then why aren't you lettin' us out of this goddamn cell?", " Don't walk away, I want to talk to my lawyer. You hear me?", " He flunked the bar three times.", " This definitely doesn't look like a glamorous job."], "THEO": [" We don't even know what we have yet. Comet, asteroid - it could be anything up there. And don't be so eager to red flag N.A.S.A. They don't call us when they discover anything.", " This is our discovery. We're going to hold a press conference. We're going to be famous. SPACEWATCH'll name this thing after us. Job offers are going to fly in from all the big companies. J.P.L., that think tank up at M.I.T., hell even N.A.S.A. 'll be chasing us.", " How?", " And say what? \"Hi, we're a couple astronomer geeks who found something really bitchin; floatin' in space.\" You can't just call N.A.S.A.  It's like calling the White House. Besides, you'll never get the number.", " He's also an ex-con.", " Hang up! Hang up now!", " Lexington.. uhh...Massachusettes. Idiot. I told you not to call them.", " Him.", " It's our discovery. No way.", " Something they're not telling the public.", " I dunno - but I bet it's a whopper.", " Southern Hemisphere?", " I'm hungry! When're we gonna eat?"], "PEARL": [" I'm going on Oprah, Larry King, Letterman...", " This things really acting up tonight. We should find out if anyone else knows about this.", " Who?", " Ascension 712, retention 345.", " It isn't about that, Jimbo. We saw something we weren't supposed to.", " This says that the asteroid came from the Southern Hemisphere.", " No kidding. It's a big sky - they want people to look the other way.", " I have p.m.s.!! I need some ibuprofen!"], "TECHNICIAN 1": [" Space junk?"], "TECHNICIAN 2": [" Too big, too much. It took out the whole shuttle."], "FLIP": [" Yeah, Mission Control.", " Who is this?", " This is a restricted line. How did you get it? Where are you?", " Can you tell me the exact co- ordinates..?", " The F.B.I.'s on it.", " Look it that sucker. They got a nuke up there in sixteen hours?", " Yeah. That Russian monkey in 1957.", " Engine ignition. Starting diagnostics.", " Nine hundred and eighty...Nine ninety...they're into the fault, they're doing it.", " The new courses are miss us!"], "LITTLE GUY": [" You kick my dog again and I'll go nuclear on you.", " Samson?"], "PEDESTRIAN": [" Somebody call 9-1-1!"], "RADAR TECH 1": [" I got one, two, three boggies...the whole board's lighting up!"], "ASIAN TOURIST": [" What's the problem?"], "STU": [" Could be a couple of things: shootin', stabbin', dead guy Well, it's Friday, payday. Could be a jumper.", " Rocks from space, my ass. That, my friends, was the work of the big Saddam. That was big-ass Iraqi missiles", " Kennedy lied about the Bay of Pigs, Nixon...Watergate, say no more. Clinton. One word. 'Women.' If I know one thing; ALL PRESIDENTS LIE."], "SECRETARY": [" We're getting reports as far away as Greenland and parts of Mexico!"], "TEMPLE": [" Get me Dan Goldman on the secure phone.", " I'm going to brief the President. What's going on here, Dan? Why didn't we have warning?", " Is it over?", " Dan, we're all here. Tell us what we're up against.", " Well, that's really positive, Dan. The President just got off the phone with the Russians. They're just about to launch a new Mars Probe on the biggest rocket in the world.", " They're going to pull off the probe and replace it with four Atlas Class IV nuclear warheads. Enough punch in their opinion - not to break it up - but to slow it down enough to miss Earth's orbit.", " They're going to move it up.", " Sixteen hours from now.", " Thank you for bringing up the impossible, Dan.", " You've watched the news the last 24 hours? You heard about the meteor shower? What you don't know is that an asteroid is on a collision course with Earth. If it hits us, Earth as we know it will be over.", " Of course, completely in order. What is the price?", " Mr. Stamper, this mission is to preserve the future of", " Done.", " I'll call the I.R.S., try to uhm, explain the situation.", " You want us to buy that, too?", " Rock what? Is that a dog?", " With my stars came the power to be blunt.  These drillers are not trained for this, Dan.", " If they can't drill this hole, my men are going to take over.", " Anyone done that before?", " This is an exercise in futility.", " Your drillers aren't doing the job, Dan.", " Golden, we are preparing for surface detonation.", " We have a lot better chance of surviving the \"smaller matter.\"  The drillers have two hours I want you ready on my command.", " What does that mean?", " Golden, tell your drillers the clock is ticking. I have 6 billion people down here relying on them!", " In 18 minutes we will be at Zero Barrier. Your father better be a man of his word.", " Well, find a solution!!", " STAMPER DETONATE!"], "TEMPLE (V.O.)": [" Can you go secure?", " shuttle.", " Well, you need to get it fixed unless you want to die along with that asteroid.", " Sharp, I NEED A SOLUTION!"], "(MORE)": ["", "", "", "", "", "", "", ""], "GOLDEN (CONT'D)": [" world. We gotta find what part of the sky this is coming from.", " office. We gotta compute size, composition, speed, impact point WE SEE the photo -- A HUGE ASTEROID", " Okay, who?", " Right now, that day conflicts with six billion schedules. For the first time in the history of this planet, s species possesses the technology to prevent it's own extinction. I've been with N.A.S.A. my entire adult life. Eleven years as an astronaut, another fifteen on the ground at Mission Control. Twenty- six years I've had to answer one question -- why? Why more money? Why the race for space? Why do we need to know what is up there? When we come through this, I'll take comfort in the fact that I won't ever have to answer those questions again. You are our warriors up there. You are our last hope. God be with you.", " Independence, come in. Come in, Freedom."], "SKIP": [" I'll call J.P.L. and get the Hubble telescope on it.", " Dan, our currant shuttle fleet is too old and too slow.", " It's done?", " Boss, we're good at space travel, but you're talkin' about drilling a hole.", " It'll never fly. Never.", " Twenty seconds till we lose radio contact, Director.", " No cabin pressure! Systems-wide failure!", " They overshot their landing 26 miles. There's a different fault line, but it's deeper.", " Two hundred feet.", " Look at these thermals. This is BEFORE sunlight hits the drill site.  She's really heating up", " They just lost the rig. The hole blew out.", " Dan, the surface is heating up!", " She's gettin' hotter! Gotta mean gas - methane, helium, probably water vapor.", " It's a mess up there...!", " They got Freedom goin'!", " Director? It's Mr. Stamper. He wants to talk to his daughter.", " The thrusters are down! 32 seconds."], "FRANK": [" This city sucks..."], "FRED": [" What the hell was it?"], "WILLIE": [" They're sayin' it's space rocks."], "FEDERAL AGENT": [" Please shut up.", " And which of you called N.A.S.A. Mission Control last night?"], "N.A.S.A. ASTRONOMER": [" I'm a N.A.S.A. astronomer. When were these photos taken?", " Tell us the exact ascension angle of your telescope when this was taken.", " Your \"discovery\" killed close to 100 people in New York alone - people who could've used a warning.", " J.P.L., please. Search co-ordinates..."], "F.B.I. AGENT 2": [" And you've told no one about this- not your teachers, not your friends?"], "J.P.L. TECHNICIAN 1": [" New info! Plot co-ordinates 712 by 345. Let's move on high-resolution imaging.", " Motherfu"], "GOLDEN'S SECRETARY": [" Director, the Pentagon."], "GOLDEN (V.O.)": [" In it's simplest terms? The end of Mankind. One asteroid, one mile wide or bigger, impacts the Earth with the equivalent force of all the nuclear weapons in the world, times a thousand. Half our population will die within 24 hours from tidal waves and heat pulses. The other half won't be so lucky. In the end, it will be men eating the flesh of other men. It's not the end of the world, General, the world -Earth - will still be here. But there will be no life - maybe cockroaches and some resilient strands of bacteria.", " With the worst guidance system in the world. Their Mars Probe in '96 was found by a pygmy tribe in Africa.", " Their launch date is set for next month.", " To when?", " What are they gonna do, glue, spit, and scotch tape it together? Even if they get a nuke out to the asteroid, a surface nuclear detonation is not going to work.  The only way is to split the thing in half and hope the two pieces slide past us.", " Mr President, finding this speck in the sky is a very hard thing to do unless you have the exact co- ordinates. There are only twelve telescopes powerful enough to see it right now. You've got a full moon goin' for four days - makes it all but impossible to see.. Once these things draw closer to Earth, you'll never keep a lid on this. No way.", " How's she look?", " Negative, A.J. Don't exceed ix thousand. Not on this run.", " Negative, A.J.", " A.J., shut the Armadillo down now.", " Firmly.", " If we're gonna pull this off, we have to have a little talk about time...and temperature. Zero Barrier's in two hours.", " Harry, your suits are good upto 150 degrees Celsius", " We didn't anticipate you being on the asteroid so long.  The clock is ticking...", " Three hundred and fifty degrees.", " Go ahead, Harry."], "COLINSWOOD": [" People, the President's joining us, Mr. President?"], "PRESIDENT (V.O.)": [" Well, this has been a tough day. The media's all over this. They're going to get nothing. Telling the public we might all be dead in eighteen days achieves nothing but panic."], "QUINCY": [" Look, set a fire cracker off in your open palm, you get a third degree burn. Close your fist, It'll do some serious damage. If we can get a nuke deep in one of the asteroid's fault lines, she'll split in two, like a diamond.", " Has been for three months.", " Right. And the first thing I'm gonna do is talk to the guy I ripped off. His name is Harry S. Stamper. He's the best oil driller in the world.", " He's here.", " I'm a big fan, Mr. Stamper.", " Nineteen eighty five. The first well drilled over 50 thousand feet. They said it couldn't be done. You did it. Incredible.", " Right, sorry. Mister Stamper, you're the world's foremost expert in deep drilling. You hold specialized patents in high speed bits, drilling fluids, downhole motors.  Can I call you Harry?", " The \"Armadillo\" - our fourth generation rover. It carries a six- cell solar engine with 824 horses. This was a joint venture with the Germans. It's designed by Porsche.", " This baby works without one.", " It works through a series of complexly designed differential gears.", " \"Drilling Power Transfer Without Conventional Hydraulics,\" by Harry S. Stamper. You registered it with the U.S. Patent Office last year.", " We just borrowed it, Mister Stamper.", " Twenty-our million.", " We're working on that.", " Pressurised titanium alloy cab. Airlocked life support. The chassis's by General Motors. Heavy duty suspension and six wheel drive.", " Turbo-jet engine fuelled by Kerosene and liquid oxygen.", " A jet engine can't do that.", " That's so simple it's brilliant.", " The new generation EMU - Extravehicular Mobility Unit - provides oxygen for seven hours, a pressurised enclosure, and temperate control. The gloves and helmet slide on and lock with a twist, like this. The cap is worn underneath. It contains a mike and headphones for two-way communication.  We'll be able to see you from a small video cam mounted inside the helmet. The Undergarment has 300 feet of plastic tubing circulating cooling water. Owen...", " Where' it headed? How big?", " We'll run your liquid oxygen from the shuttle through a tube into the intake manifold. No problem."], "BENNIE": [" Chick! take a look at this!  Chick : Pressure's been up all morning. She kicked twice on me.", " Jah, jah, jah. No bleeper. Too much pressure.", " Give me nickels on Miami, Washington, San Diego, and Green Bay.", " We're in astronaut training.", " We wouldn't know. What's the camera?", " Looks like you have a lot of free time on your hands.", " This Lev guy is a little off.", " Go to hell, man, I ain't dyin' on this thing!!!!"], "A.J.": [" What did our always-at-lunch-Swedish geologist say?", " What's his mood?", " I'm on top of it Harry, you have a second?", " I'll hurry. I've worked for you for a long time.", " And you've been real good to me", " No. The reason I am here, today, standing here, talking to you. I'm obviously talking to you...but it's, you know, not, uhh...it's not an oil- related matter exactly", " You know there comes a time in a man's life when... No, that's a cliché... Can I start again? I, uhh, fell...I've fallen...", " In love, I mean. Fallen in love. It's the damnedest thing, but this person you...know...really well.", " We gotta clear the Derrick!", " Harry, we've hit pressure. We gotta bleed it off. e go any deeper, we'll blow the rig.", " The bit's five thousand feet down! Full speed'll rip the pipe apart!", " I'm goin' down. Reattach it. Gimme a wrench and a band coupling.", " You know how I told you there were two obstacles? I didn't do the first,'cause he's tough...but I did the second...! I got it at uhm..Tiffany's. I can't give it to you until I talk to him, but try it on.", " Good plan, Harry.", " I don't think they shit people at N.A.S.A., Harry --", " No torque adjustment, no pressure release valve", " Wouldn't miss it, Harry.", " Chick, Max! Mack truck tranny!", " I figured out how to bring up the slag. Direct the jet turbine's exhaust down the drill pipe. It'll blow the stuff right up the hole.", " Let's see what this baby can do.", " We can do better. I'm increasing the RPM's to seven thousand. We can get more torque.", " Relax. I built this thing. She's got more in her. Increasing the RPM's.", " We can push it, further. Let's see what she can do.", " I pushed it, I screwed up.", " I don't know why I didn't just listen to them.", " I love you, Grace.", " I'm trying to work with the team.", " What do you want? You want me to quit?", " I don't have to prove anything to anybody, Harry.", " I'll follow it.", " Excuse me. You're really insanely gorgeous and I was jost sort of wondering if you --", " I love you, Grace.", " Yeah?", " Lev, the pressure's climbing.", " My name is A.J.", " Goddamn it!", " Freedom, come in, over. Freedom, come in, over Freedom...? It's you and me.", " Get up, we got work to do.", " Lev, we're getting off this rock, if I have to drag your ass the whole way. Now get up!", " C'MON LEV, PUT YOUR WEIGHT INTO IT!", " So move it.", " Over the hill.", " EARTHQUAKE!", " Listen, Mr. Negative. Everyone thinks we're dead.  We're not. So, suck it up. Because if we don't drill that hole, six billion people are going to die. And I'm not lettin' Harry Stamper get all the freaking credit for saving the world. We're gona do this, then we're going home.", " Hep me get these rocks over there.", " Stick a cork in it, Lev. I'm tryin' to think.", " Because I'm askin'. And turn your suit's thrusters off. Trust me, okay?", " Hey, Lev, we're gonna see what this Porche engine can do", " HOLD ON, LEV, I GOT HER WORKIN'!!", " You wouldn't happen to need a diamond tipper, would you?", " One hour.", " Harry, we can't stop.", " Drill right through the pressure to pay dirt.", " Sometimes crazy works.", " Full throttle!", " Something I've been meaning to talk to you about. When this is all over and we're back home, I'd like to marry your daughter", " THIS SUCKS", " I ain't gonna draw against you Harry.", " Well, I guess I won. Now I'm the guy who gets to save the Earth.", " We said we'd join these after we drilled the hole. It just ain't gonna be on Earth.", " About Grace, Harry. I know it ain't gonna happen now, but would you say...?", " Mean \"could have...?\"", " I'm not going home Harry.", " Goddamn it, HARRY", " LET ME GO", " HARRY!!", " Don't worry. He'll come through.", " Harry doesn't fail.", " What?", " Harry PEOPLE embrace", " What would Harry do?", " He's up there, Grace. And he'll never die. Will you marry me? I gotcha a new rock"], "CHICK": [" You askin' the old man?", " The uhh", " She's kickin'!", " Pressure's north of seven thousand!", " The drill hole's flooding!", " Get back, she's gonna blow!", " We're living LARGE!", " Charlie Bronson could kick Steve McQueen's ass and have enough left over to duke it out with Burt Reynolds in his \"Smokey and the Bandit\" period.", " Burt was trouble in that flick.", " All time? Well, let me think. \"Dirty Dozen,\" the first \"Death Wish.\" No, no!  That movie where he hunted the buffalo. I don't remember the name but he hunted a buffalo and he said like three words during the whole picture. That's my selection.", " He'da whooped his ass and then his father's. We'll settle this right now. Rockhound? You heard the debate. You're the Supreme Court.  What's the final verdict?", " There ain't no oil in this place. What the hell are we doing here?", " Harry, this is some \"Star Wars\" shit. This ain't for us.", " If Harry-the-iron-ass is going, I'm going with him.", " An Ena-WHAT?", " And you want to stick it where?", " Bodacious and Succulent and Sinful.", " No. I got to take care of something.", " Hey, Denise.", " Hi.", " I got a feeling you're going to be pretty big yourself.", " 'Bye, Tommy.", " What I did before was wrong. Every day of my life I regret it. I can see you've got a good thing going, Denise, I'm not trying to mess that up. But this thing's come my way and I got the chance to do something really right.", " It's no scam. You might just be proud of me.", " I can't tell you now. But if it comes out good, I'll be back. Then maybe you'd consider telling Tommy I'm not a...salesman. It's good to see you. You look really beautiful.", " I gotta tell you...I'm scared.", " Thirteen months, seven days. What the hell has he been doing all by himself?", " I didn't see him.", " My kid. You.", " Harry, what are you thinking?", " Wildcatters are superstitious, Colonel. Harry does this every time we break ground.", " The first ten better be the worst ten.", " Almost 60 feet and startin' to kick ass!", " You sure?", " I don't think she can take it.", " The last time we ran her at full throttle we ripped her up!", " The clutch is dead.", " I say we drill. They say we have until Zero Barrier.", " Clear the rig!!!", " Back to work!", " Mutha...it's getting warm.", " We just put it in.", " She's gonna blow!", " Max", " Yeah.", " Harry", " I've been with you fourteen years. I've never said this to you, never thought I would. It's over.", " Now you can die with us.", " It worked! She's goin' through her like a hot knife through butter!", " Eight hundred and twenty feet, Harry.", " Downhole pressure's goin' through the roof!", " Thousand and three, Harry. With a half hour to spare.", " Don't look at me.", " This thing definitely doesn't like us.", " What's that mean?", " I can't watch this.", " That means we might die too", " I'm dyin' for a Budweiser.", " What are you lookin' at?"], "HARRY": [" Almost caught that little bastard.", " Watch your language, Gracie.", " Stupid birds.", " Talking to him quite a bit these days", " Good. He's not vulnerable there.", " Thieves and cowards, all of 'em. Twist their arms.", " Keep twisting. Like a pit bull.", " Any kind of flying and oil company executives. Go deal with 'em. I always look better when you're doing the talking.", " What'd your mother call me?", " Yeah well", " I understand we're having problems with \"A\" rig.", " Yeah. One.", " Twelve years.", " Another company make you an offer, kid?", " You're sweating, A.J.", " You hurt yourself?", " We have results.", " Horseshit. What the...? Chick! Bennie! Somebody better tell me why the hell \"A\" derrick is not turning!", " Hey there, what can I do for you?", " 'Course it is. I love you guys. You like dolphins and whales, I like 'em too. Hey, I know you. You too. Didn't you have shorter hair?", " How'd you get out here? Canoe? Rowboat? Oh, that boat down there with a thousand horsepower diesel!", " The same way you did when you blow- dried your hair this morning.", " Can't wait! I'm a businessman! Those goons over there gave me 57 mil. to find oil and they ain't leavin' till I do! 'cause they have no lives!", " Sorry. Time is money. BENNIE!", " Bennie! Third gear!", " Chick, rig up another pipe. NOW, NOT TOMORROW.", " Thanks for that opinion. Chick, full speed!", " You learn all this in college? I been doing this thirty years, kid.", " There's your oil, gentlemen. Now get the hell off my rig.", " To Hole Number Seventy-Six!", " Say it now, say it quick, or get off my rig, Major. I've got a business to run here.", " Who's doin' the summoning?", " I know who you are. I watched T.V. once. Apollo 8, right? First manned lunar orbit.", " I kinda caught that. What's the problem, gentlemen?", " These two are my right and left arms. Grace Stamper and Albert Jack Frost. Stupid name, so we call him A.J.. They run my company.  You talk to me, you talk to them.", " Great, home movies.", " Stick with Stamper.", " I've drilled in them all.", " As in...outer?", " A.J., is this guy shitting me?", " An eight hundred foot hole. On a moving asteroid. In space.", " Show me your rig.", " Where's the Kelly?", " How does it work?", " This is my Patent.", " You stole it.", " What'd this cost?", " Boy, I'm in the wrong line of work. So, that's where my taxes go.  For thievin' incompetent, government employed rip-off artists?", " What happens if you hit gas? You have three seconds. Drill faster, run like hell, or pray. Time's up. You're dead., The rig just blew.", " Hang on. I betcha everyone in this room has a PH.D.", " I left school after tenth grade. I earned my PH.D every day offshore drilling holes. You can't get it in a book. Drilling holes is about instinct - about smellin' it. Drillin' holes is an art. You want the crux of the matter? You stole my patent, and you don't have a goddamn idea how to use it. As for this piece o' crap, don't insult me. I'll rebuild it - the right way - and drill the hole for you.", " Just give me a space suit.", " You don't have a choice. I think all you PH.D's know that.", " First of all, you're going to buy my patent.", " Fifty million dollars.", " You're right, too low. I'm still pissed. Seventy million.", " Give that money to my Greenpeace buddies. Told you...complicated.", " I have this great log cabin in Montana. It's kind of a nature...getaway...thing.", " No. I fly fish there. But the fly fishin's sucked ever since they put in that goddamn hydro-electric dam. I want it gone by the time I get back.", " I'm only as good as the men I work with. The ones in those home movies of yours.", " My chief tool pusher. You game A.J.?", " And my roughnecks, Roustabouts, and Rockhound?", " No. Just a meek, geek geophysicist.", " It's a job, like any other. Just a different location.", " I'd rather die up there fighting this thing than sit here waiting for it.", " Charles, but if you call him that, he'll kill you.", " With all due respect, Doctor, I don't know too army guys who are social when someone is trying to jam a tube up their butt.", " A lot of people take sedatives.", " I don't tell my men how to live their lives. They're with me to do a job and they do it well.", " That Armadillo car. Get it in here.", " How were you going to power your drill arm?", " I need to be able to start and stop. I need different speeds, and I need reverse.", " It can if it's hooked up to a clutch. A.J., get me a Mack truck transmission.", " I'm a simple man. But don't underestimate me.", " I've got a thing about flying.", " I hate to fly. I hate to fly. I hate it so much.", " Forty thousand people died last night. But I guess that didn't concern any of you. I hope you all had a good time last night.", " Well, you should be scared. We all should be. 'Cause if we fail, they say the Earth will die.", " You think these N.A.S.A. guys are a bunch of clean-cut pussies, that's it. They can out think you, they can outrun you. This job, gentlemen, is as real as it gets. I need every one of you. If you're not up to it, then walkout of that door.", " Good, A.J. Good.", " From all of your intel, the deepest fault line is here.", " You just worry about getting me on that rock, Colonel. Let me worry about the drilling.", " Done!", " We're on A.J.", " Lose the helmet, A.J.", "", " Torque adjuster's good. Fuel level good. A.J., downhole pressure?", " A.J. would be the first name on my list.", " You have to have confidence in the men you send up. I understand that. But I'm the one that has to land on that rock. Not you. I pick my own team.", " You tell me what the hell you think you're doing?", " Bullshit. You're trying to lead this team. You're trying to be me.  You're not me.", " If you can't bury this cowboy shit, yeah, I want you to quit.", " I listen to N.A.S.A., you listen to me. That's the chain. Either you follow it, or you're done.", " I stood up for you, because I've made a life of proving people wrong.", " When I was about your age, I was in Galveston, Texas.  I scraped together some money, bought some old equipment, a little land. I set up a rig and drilled my first hole. Then I sat there and watched her soak up the sun for six months -waiting for this baby to pop.  Everybody told me to quit. I wouldn't listen. My wife ran off with a drill-rigger, left me with Grace. Everybody in town thought I was a fool. But I stayed with it. And in the last hour of the last day, she popped. She spit out that black gold and I danced in it like a wild Indian. I captured the magic. This is the last piece of pipe that struck gold that day.", " You know I was thinking, Gracie. Over the years, I should have patted you on the back more", " No father has ever been prouder of his child, Gracie. I want you to know that.", " I love you too, Gracie.", " Sixty pounds.", " Wait here.", " Hey you. Yeah you. Come here.", " What's all this crap?", " We don't need music and we don't mind dirty utensils.", " Unhook the shuttles.", " Did A.J. make it?", " How beautiful it is. Thinkin' about all that oil I sucked out and spit into the air.Funny how a man can live 46 years and realize he ain't been doing the right thing.", " I hate to fly, I hate to fly, I hate to fly", " It did happen. They're gone. Deal with it. We got a lot of work to do.", " Rockhound.", " I'm gonna get you some surface samples and you're gonna tell me what I'm up against.", " The good news just keeps comin'. Load up, guys.", " Bedrock. Whole goddamn place is Bedrock.", " HOLE NUMBER 77. Let 'er rip!", " Chick, bring 'er up!", " Shut up, Max. What's with the look? Get that off your face. You've seen bits get eaten before.", " Go to the Terminator.", " I designed you. I built you. You are the enemy of all subterranean shit. You are the king. It's showtime.", " What do you make of that?", " Iron deposit?", " Give me Dan Golden.", " Situation? You put me down on the worst possible place on this asteroid. I'm drillin' into something I shouldn't. The hole just ate one of my diamond-tipped bits in thirty minutes. That has never happened to me in twenty years.", " Not far. Twenty-three feet.", " We will.", " How far?", " Increase r.p.m.", " We gotta get more power down to this bit. Full throttle.", " Yeah, I'm sure.", " She's gonna have to.", " I don't have time to argue, Chick, now goddamn it, throttle up, or I'll come up there and do it for you.", " Stop!", " We're goin' to the second rig.", " Why don't we cut to the chase, fellahs? What the fuck is going on with that other nuke?", " Well, it wasn't my scientists that told me about the fucking fire cracker inside the hand story. Are we detonating on the surface or are we gonna drill?", " We're drilling.", " ...You told me that the only way to deal with this hunk 'o crud is to get a nuke 1000 feet down. You sticking with that?", " Great. Glad we have that understanding.", " Wait...wait..what about temperature? When did temperatures come into the picture?", " And...? How hot is it going to get?", " How hot is it going to get?!", " Thanks for telling us now, Golden don't think my bits can handle those kind of temperatures", " Give me some more good news. You've got two new assistants who can fix your shuttle. Bear, Max, hop to it. There's not a machine they can't fix. We can handle the hole from here.", " Colonel Sharp, if we're going to blow this hole, you gotta help ME. I need some more manpower", " Goddamn it! We'' take the tranny from the other rig!  And if you wanna complain about the heat, go to some other fucking asteroid", " Move guys, move it", " Chick. Unbolt the tranny.", " Do it. NOW.", " Max, you gotta get those bolts undone!", " MAX, GET THE HELL OUT OF THERE!!!", " CLEAR THE RIG!", " Chick, get your butt over here.", " We're gonna fix this - make it work. If we weld those two together and go in one speed", " Get your ass up here!", " CHICK...BEAR!!!", " All the bits are gone, A.J. I've been inventing drill bits for twenty- five years and I don't know what to use.", " Boys, we're back in business!", " Time, A.J.", " Distance, Chick.", " We gotta do 180 in thirty minutes.", " Stop! Shut down.", " Got to, kid. No choice.", " That's crazy.", " Chick, A.J.'s callin' this one.", " One thousand feet.", " Get the pipe and bit outta there.", " Well, Dan, you're just going to have to goddamn wait 'CAUSE WE GOTTA BIG PROBLEM UP HERE IN HELL. Somebody's gotta go down there.", " Do or die, kid.", " Oh yeah, Golden?", " Your shuttle pilot just took a nasty shot from a drill string", " I hope so, he's gotta get us off this shithole.", " Get back!!", " Put it down, Chick.", " Means one of us ain't leaving.", " Your turn.", "", " Draw.", " I always wanted a son. And if I had", " No. Go home A.J., Marry Grace.", " It's my hole, I drilled it, and I'm staying with it till the end.", " You have three minutes and I'm not waiting.", " Let's go, Sharp. Get the hell off this rock. I WILL push this button.", " Sharp, you better get those engines goin'.", " SHARP, WHAT THE HELL ARE YOU DOING? GET THE HELL OUT OF HERE!", " All right, son-of-a-bitch, it's just you and me", " I beat you."], "GRACE": [" Having fun?", " Sure sliced the shit outta that one.", " Seagulls swallow those and they die.", " I just talked with A.J.", " \"A\" rig's acting up. The drill string kicked twice this morning, gave Chick a nasty bruise in the head.", " Chase Manhatten okayed the bridge financing for the Micronesia Project, but at 21 percent interest.  And Lloyd's of London refuses to underwrite the Venezuela Project...", " I am.", " Oh, and that magazine article - they want some human interest stuff - likes and dislikes. \"Likes\" I said Golf, Fly Fishing, Single Malt Scotch, Old Movies. What about \"Dislikes?\"", " You know you donate 300 grand a year to Greenpeace.", " Complicated.", " Complicated.", " He's good at public relations.", " So? What? What?", " A.J.!!", " Where's A.J.!!!?  Harry : RIGHT BEHIND ME! RUN!", " Never do that again!", " Don't worry! Tiffany's insures up to a week from purchase!", " Uhm, pop, could we discuss this...?", " These astronauts train for years for what you're training for in a few days.", " So, tomorrow you listen.", " Dad, you don't need --", " I love you, Dad.", "", " I'm engaged. But my father hasn't given him his blessing so you might still have a chance. Promise me you won't do anything stupid up there.", " I love you. Come back, Okay?", " A.J.--", " When you get back, ask them if you can keep the suit. It's kind of sexy.", " I'm not leaving.", " Daddy.", " I'm so proud of you, Daddy."], "OIL EXECUTIVE 1": [" You explicitly promised results at 25 thousand feet.", " Seventy-Six?", " The man's a legend."], "OIL EXECUTIVE 2": [" But we don't have oil. We've given you everything you've asked", " This is Harry's Seventy-Sixth straight hit."], "GREENPEACE LEADER": [" This is an official protest.", " Stamper, do you know what this thing does to the eco-system?", " How can you wake up every day and look at yourself in the mirror?", " Wait", " We", " STOP!!!!"], "HARRY (CONT'D)": [" And you used a curling iron, I betcha. Did you know most electricity's from burning oil?  I'' stop drillin' when the world - stops usin' it. Bennie, start 'er up!", " And I never want to pay taxes again.", " Now about my crew.", " This is my sweet spot. If I can get a clean hole in there, She'll blow in half", " Here, take it up there.", " Here. Fire up the Bad Boy bit.", " Hit it, Chick.", " We need the second Armadillo.", " GET THE TRANNY OUTTA THERE!  WE LOSE THE TRANNY, WE'RE DEAD MEN!!", " You're going to need some magic in the world. You can marry her, A.J.", " She's always going to be my little girl."], "ROUGHNECKS": [" Hole Number Seventy-Six!"], "MAJOR STINSON": [" Harry Stamper? I'm Major William Stinson, United States Army. I need a few words with you. In private.", " You've been summoned back to the States.", " Your Government, Mr Stamper."], "QUICY (CONT'D)": [" Dan Golden, meet Mister Harry Stamper, the finest oil riller in the world."], "QUINCY (CONT'D)": [" Nineteen Ninety-One.  Directional drilling through two miles of anthracite. They also said that couldn't be done. You did it. Incredible.", " We built this arm to mine ice from the moon -- greatest discovery in space in thirty years."], "QUICY": [" Nineteen Ninety-Three.  Over seven thousand. Once again they said --"], "BENNIE (CONT'D)": [" Quit whining. Last thing I need is to be friends with my bookie. Sundance Kid trapped in that Hacienda, did they wait to die?  Hell no. They went out guns blazing. I live by the code of that movie, man."], "MAX": [" I'm glad you qualified that shit 'cause you know the Burt Reynolds of \"Deliverence\" would have kicked Charlie's ass.", " What would you say the all-time, slam-bam, take-no-prisoners, kick- ass Charlie Bronson movie is?", " Fine. The buffalo movie. That's your pick. You relly think that buffalo Charlie could have thrown-down with the Steve McQueen form \"Bullitt?\"", " What did you ask him for? Guy makes his living looking at rocks.", " We work rigs. We understand rigs. We don't know dick about being astronauts.", " You're not taking any more blood. You vampires already have enough to feed your coven for a year.", " We're going to go pound some brews where they have a lot of sweaty, naked women. You in?", " Oh, man, did I have a dream.", " No, this was a bad dream. We were drilling and the ground ate the bit. Then it ate the pipe, then the derrick. Then it ate us.", " I'm not coming home.", " The dream. It's my dream.", " Freaky, man.", " I'm doin' it, I'm doin' it.", " DONE!!", " Pressure's through the roof! Shit, where's my helmet...!?", " I CAN'T DEPRESSURIZE!!"], "ROCKHOUND": [" Tough call. But for me though, one name -- Poncherello. Eric Estrada. You know, \"Chips.\"", " I might add that to get us up there they're going to have to strap our asses on one of those rockets. That means fire, involuntary shit release, and a slew of other stuff I can't hang with.", " Yes, sir.", " Rocks are my life.", " Oh my. Oh my, my, my. This isn't rock. It's uhh, it's uhh, it's", " I've only seen this once - at a volcano in Hawaii. You're drilling into a big slab of cast-iron, Mr. Stamper."], "BEAR": [" 'Bye, Mama.", " In front of the guys?", " ARE YOU OUT OF YOUR MIND?", " I don't like the idea of waiting around to croak. It's wimpy.", " Hell, I'm going just so I can say I went. Once we get up there, it's making hole.", " Sorry, we're late. Doc said we had... What do we got?", " Shit, the only zone I know is the one around my mama's grill.", " Houton, we have a problem. That is some vicious methane.", " Thing's made for a child - like my kid's car seat.", " So did Martin Luthor King.", " That's a dumb-ass dream.", " What are you thinking about, Chick?", " My Mom, she'd be proud to see me as an astronaut.", " What in hell's down there?", " Not after ten feet.", " I got one of those big-time crappy feelings about this.", " The Terminator's terminated.", " I didn't come up here to die.", " We got that sunrise, Harry. These bits are gonna fry up", " A.J. Frost. Back from the dead.", " I can't even get my foot in there.", " I ain't gettin' another enema from Nurse Ratchet.", " I think he'd go get a beer.", " Yeah, okay, you're right, we're the studs who just blew up the Death Star."], "MABEL": [" Reginald, get over here and kiss your Mama goodbye.", " Never too old to kiss your Mama."], "JUMBO": [" We don't have \"The Right Stuff,\" know what I'm saying? We're Roughnecks.", " Yo. This where we get our suits?", " Cholesterol difficulties. Said we gotta enter \"The Zone.\"", " But we're approved."], "TITO": [" I'm in.", " Nobody touches my hair but me.", " What, uhh, \"substances\" you talkin' about?"], "NURSE": [" We need to know what substances you've recently ingested.", " Drugs."], "HELGA": [" Enema.", " So did I."], "CHICK (CONT'D)": [" No way, lady. I came here to drill.", " That did not sound good."], "PSYCHOLOGIST": [" Say the first two words that come to mind, beginning with each letter."], "DR BANKS": [" Mr. Stamper, your men...are...take Mr. Chappel. I believe they call him Chic.", " I assume you're joking. Your men show aggression, extreme maladjustment to their surroundings, anti-social behaviour --", " Does your company have a drug testing program? These toxicology reports are a throwback to the sixties. All show huge levels of nicotine and alcohol. Three of the, four show illegal drugs. A couple I had to look up. One of them had \"Kematine\" -- a very potent sedative.", " This one is used on horses.", " Failed. Failed. Really failed. Under the circumstances... They're the finest physical specimens I've ever seen."], "MATHEMATICIAN 1": [""], "SHARP": [" I mean, they kind of look like Armstarong, Lovell, and Glenn. So, my wife and little girls' lives are in their hands, sir?", " We spend six months on emergency training - we're throwing that out. If we fail, everyone dies. Game over. That's a heavy load but it's ours to carry. The purpose of &nbspthis is to train you in the physical and mental rigors of working in a weightless enviroment so that you will not panic. So you can do your jobs.", " Trainees, AT EASE We are not done here. We're taking you for a little ride. This bird will climb to 40 thousand feet and drop to 10 thousand feet to give you the feeling of weightlessness for 30 seconds. Welcome to N.A.S.A.'s Vomit Comet.", " Drill an eight-hundred foot hole in eight hours? Is that possible?", " You two ready?", " Instituting roll manoeuvre. We have S.R.B. Sep, over.", " Listen up -- the MIR will be spinning to give us gravity so we can work faster. You might feel queasy or dizzy. We'll dock, transfer the fuel, then detach from the MIR.  Fast and safe. This stuff is very volatile.", " E-vac. E-vac. Unhook the shuttles. Move!", "", " It's them or ALL OF US. CLOSE THE DOORS NOW!", " We have to GO!", " WE GO NOW!", " Full thrusters!", " We have visual of target, Houston. Velocity thirty-three hundred miles an hour.", " Visual contact with target lost, Houston.", " See you on the other side, Houston.", " Time to suck it up, people.  Just pretend you're on the big roller coaster at Disneyland...(mumbles under breath) ...times a hundred", " We're awake, we're not pukin' ....well, Harry is. And we got a clear path to the target. Houston, over.", " Damn it", " Problem, Houston. We've got debris all over us!", " Houston, I don't know where we are. Tell me how far we overshot Harry's sweep spot. Advise on currant location, over.", " Sharp, over.", " On your order sir.", " We'll bring it out to you.", " Stamper, if you can't drill the hole, we're detonating this thing on the surface", " There's no way in hell you're gonna get that hole dug, and you know it.", " That hole better be dug in two hours, or we're detonating. Whether you're on this godforsaken rock or not!", " Let's move it", " Stamper, you ready to blow this? Let's get outta here...!", " Enter interface with the weapon.", " He's dead.", " Three on that side, the rest over here.", " I'd trade places with any one of you. But we need two people to fly this mother back. So, we either all stay or you guys draw.", " Who's first? Clockwise then.", " YOU HAVE NO OXYGEN...YOUR TUBES ARE RIPPED...LET IT GO", " This guy really is a hero", " Watts, we gotta get that thing going!", " Sir with all due respect, if I knew the PROBLEM, I'd give a SOLUTION, SIR..!", " Something's wrong.", " We should have detonation by now.", " We're going back.", " Every life, that you know, will die", " Watts, prepare for re-landing. NOW!!", " Stay seated. Let the medical quarantine trucks set up."], "OWEN": [" These are made for men 5'8\" to 6'2\", between 140 and 200 pounds. All of you fit within those parameters - thank God we won't have to do any re- tailoring"], "CHUCK JR.": [" On this mission, they tell me you will experience the worst G-Forces in the history of flight. It's like an elephant sitting on your chest. So, I intend to flip you, spin you, splat your bodies till your bones hurt. Now load up and enjoy the flight.", " What's the problem, Texas tough guy?", " Not good for an astronaut. Hammer, go easy, don't rip his guts out."], "HAMMER": [" Sure thing, Chuck."], "DENISE": [" What do you want, Chick?", " It's um...just a salesman, honey.", " Go inside and play, Tommy.", " What was I supposed to tell him? We've got a life here now, Chick, with someone we can depend on.", " This another one of your scams, Chick?", " What's going on, Chick?", " Hey, Chick. You be careful."], "TOMMY": [" Who is it, Mommy?", " You look like big foot.", " Okay, mommy. 'Bye, Big Foot."], "WOMAN": [" What are you boys doin' down here in good 'ol Houston?"], "N.A.S.A. TECH": [" Space Command spotted more incoming.", " Don't know.", " We have confirmation. The incoming is about the size of the Astrodome.", " T-minus six minutes and counting."], "TRACKING TECH": [" Eastern Asian Hemisphere... someplace...ETA 17 minutes."], "F.B.I. AGENT": [" Be real soon, son."], "RANDY": [" Okay, I'm done here!"], "N.A.S.A. TECHNICIAN": [" Harry wants to see you.", " Multi-track C.D. player."], "N.A.S.A. TECH 1": [" Sir, was that case authorised for transport?", " That can't go up with you, sir."], "N.A.S.A. TECH 2": [" Our weight to fuel ratio's calibrated to the kilogram, sir. How much does that weigh?"], "N.A.S.A. TECHNICIAN (CONT'D)": [" Anti-gravity hand washer, utensil washer, and micro-wave oven. We worked hard to make the X-71 feel more like home."], "MISSION CONTROL (V.O.)": [" Roger, Independence and Freedom, auto ground launch sequencer commencing."], "PITTS": [" AIRBORNE!", " What's he doing?", " Device armed."], "TECHNICIAN": [" Shuttles Freedom and Independence you are cleared for lift off.", " You are a 'go' for ET separation."], "LEV": [" FREEDOM! FREEDOM! GOT TO GIVE WHAT IT TAKES", " HELLO YANKEES! Welcome to the home of me, Cosmonaut Lev Andropov.", " I hear rumour on radio. My country broke. No steaks in freezer. They plan to sell me and the MIR Can you confirm this?", " Oh, I also di-rec-tor. Russian cinema. MIR movies. Each has title.", " \"Lev loves cargo.\" \"Lev sleeps.\" \"Lev prepares for Americans.\" \"Lev gets bored so he gets drunk.\"  Funny but...too long.", " Yeah. I alone by myself.", " Hello, fellow space colleague.", " Please allow me to escort you. You California girl?", " Leak. Run.", " Seal door.", " Run Yankee!", " I am Cosmonaut Lev Andropov, what your name?", " You just blew up my home.", " What happened to the others", " I feel like Skywalker Luke when he learned Darth Vader his father. What I should do?", " A.J., let me cash in my chips.", " YOU COME PUSH, YANKEE", " Wait A.J.! We drive over nuclear weapon and we finished before we started.", " This bad. Darth Vader. Darth Vader.", " I l-o-v-e this American confidence! Like John Wayne. This why I suspect you won Cold War.", " With this I can rebuild my MIR.", " This bad, this very bad, very, very bad...", " And why to do this?", " Okey-doke.", " A.J., up is bad! Down!", " Down! Not up! Up is bad! Down!", " Very bad idea, A.J.", " WE HAVE JUST THE SAME SHIT PART IN RUSSIA!! SOMETIMES IT NOT WORK SO WE HIT!! YOU GOTTA GIVE IT WHACK!! WHACK!! HIT!!", " GIVE IT WHACK!!"], "Hello Yankees! I love": [" you America. Would you prefer an appetiser or aperitif?"], "TRUMAN": [" Fuel teams prepare to unload.", " Copy that, Freedom.", " I've got no visibility. I've lost orientation to the target!", " Big guy! Dead ahead!", " I lost left thruster! No control! I have no control!", " Houston, MAYDAY, MAYDAY, we're going down!", " Crew, go to life support!", " MAYDAY, HOUSTON, MAYDAY", " Get away from that door!!!!"], "WATTS": [" I'll be in the docking port.", " We still have people out there.", "", " Nearing the Dark Side, Houston, a minute thirty and counting.", " Rockets ready for burn, Willie.", " Fourteen thousand thousand...twenty thousand miles an hour, Willie...!", " Where's the other ship", " Engine ignition system isn't responding.", " Willie, we might be stuck.", " Unbolt the housing. There and there.", " We've still gotta fix this shuttle, Stamper.", " Ignition! She's started!", " THE INTERIORR VALVE'S STUCK!", " WHAT!!?", " Houston, we have detonation!"], "LEV (CONT'D)": [" LEAK! RUN!"], "COLLINSWOOD": [" The President is counting on you to put out the fire, Dan.  Say whatever you have to. Just do it.", " Golden, your drillers better not let us down."], "REPORTERS": [""], "SKIP (V.O.)": [" Entering Dark Side, Freedom, and counting: ten, nine, eight, seven..."], "SHARP (V.O.)": [" Houston, you gotta see this to believe it", " Houston, it's Freedom. We just landed on this son-of-a-bitch, over.", " We lost her."], "CLARK (V.O.)": [" What is it, Willie?"], "WATTS (V.O.)": [" What's the status of Independence?"], "CHICK (O.S.)": [" Harry, Harry, Jesus Christ, this can't happen"], "SHARP (CONT'D)": [" Sir, the bird can't fly.", " Yes, sir.", " Stop...!", " The remote's shot. It'll have to be manually dDetonated."], "TEMPLE : (V.O.)": [" And I don't want those drillers knowing about this.  They have enough to worry about just drilling the damn hole."], "COLLINSWOOD (V.O.)": [" Colonel Sharp, this is Chief of Staff Collinswood.  Have Pitts and Fisk prepare to detonate that nuke on the surface. Too many lives are at stake here. Have them standing by."], "MILITARY ADJUTANT": [" Sir, we have interface with the weapon. Remote detonator standing by."], "TEMPLE (CONT'D)": [" A lot of people are die"], "A.J. (CONT'D)": [" Let's take a look.", " This outta cut into a sweet wedding ring.", " Hop on the back. Get our weight distributed better.", " Maybe I'll ask her again later"], "Toughen up.": [""], "HARRY (V.O.)": [" Go Max, go Max, get the last bolt", " We have good nes folks.  A.J. and the Russian just showed up. No other survivors.", " A.J., we need you. I need everything you got.", " Grace. I... This is so hard for me. I don't have", " ...I just much I love you.", " It's so beautiful up here. So pure. I remember something I read once...\"The world is a fine place...and worth fighting for.\" Gracie, I'm just an iron-ass-warrior doin' what's best. Take care of A.J. I'll look in on you from time to time"], "A.J": [" You never answered my question."], "WATTS (CONT'D)": [" BACK OFF!! YOU DON'T KNOW THIS COMPONENT!!"]}