{"VOICE (V.O.)": [" When I was lying there in the VA hospital, with a big hole blown through the middle of my life, I started having these dreams of flying.", " Sooner or later though, you always have to wake up..."], "JAKE (V.O.)": [" They can fix a spinal, if you’ve got the money.  But not on vet benefits, not in this economy.", " I became a Marine for the hardship.  To be hammered on the anvil of life.  I told myself I could pass any test a man can pass.", " Let’s get it straight up front.  I don’t want your pity.  I know the world’s a cold-ass bitch.", " You want a fair deal, you’re on the wrong planet.  The strong prey on the weak.", " It’s just the way things are.  And nobody does a damn thing.", " All I ever wanted in my sorry-ass life was a single thing worth fighting for.", " The strong prey on the weak.  A guy with a knife took all Tommy would ever be, for the paper in his wallet.", " The Suits’ concern was touching.", " The egghead and the jarhead. the scientist, not me.  He was the one who wanted to get shot light years out into space to find the answers.", " Me -- I was just another dumb grunt gettin’ sent someplace I was gonna regret.", " Nothing like an old-school safety brief to put your mind at ease.", " The idea is -- every driver is matched to his own avatar --", " Yeah, so what does hold them up? Grace explained it to me -- some kind of maglev effect because unobtanium is a superconductor, or something.  At least somebody understands it.  Just not me.", " Neytiri thinks I’m some kind of retard.", " Norm’s attitude has improved lately.", " It’s good he’s back on board, but he thinks I’m a retard too.", " My feet are getting tougher.  I can run farther every day.", " I have to trust my body to know what to do. With Neytiri it’s learn fast or die.", " I sweet-talked Mo'at into giving Norm and Grace a hall pass.  Now Grace even makes me coffee before link every morning.", " I’m learning to read the trails, the tracks at the water-hole, the tiniest scents and sounds.", " Sometimes I have no idea what she’s talking about.", " It’s been a month and I’m still not allowed to make a kill. She says the forest hasn’t given permission.", " There’s a lot of crap like that. She’s always going on about the flow of energy-- the spirits of the animals and what not --", " Everything is backwards now. Like out there is the true world, and in here is the dream.", " Iknimaya translates roughly as stairway to heaven.  It’s the test every young hunter has to pass.", " I may not be much of a horse guy.  But I was born to do this.", " It’s hard to put in words the deep connection the People have to the forest.", " They see a network of energy that flows through all living things. They know that all energy is only borrowed--", " -- and one day you have to give it back.", " Hard to believe it’s only been three months.", " I was a warrior who dreamed he could bring peace.  Sooner or later though, you always have to wake up...", " The Well of Souls.  The heart of the forest.  I knew the People would go there.", " Outcast.  Betrayer. Alien. To ever face them again, I was gonna have to change the rules.", " Sometimes your whole life boils down to one insane move.", " The way I had it figured, Toruk is the baddest cat in the sky.  Nothing attacks him.  So why would he ever look up?", " But that was just a theory.", " We rode out to the four winds. To the horse clans of the plain, to the ikran people of the mountains.  When Toruk Macto called them, they came.", " I was a warrior who dreamed he could bring peace.  But there was only one thing I was ever really good at. Ooh-rah.", " A few chose to stay. Fewer were chosen.", " The forest will heal, and so will the hearts of the People. New life keeps the energy flowing, like the breath of the world.", " This is my last videolog.", " I better wrap this up. There’s a funeral tonight, and I don’t want to be late. It was someone very close to me."], "PERKY NEWSCASTER": [" The Bengal tiger, extinct for over a century, is making a comeback.  These cloned tiger cubs at the Beijing Zoo are..."], "JAKE": [" I hope you realize you’ve just lost a customer!", " Candy ass bitch.", " If it ain’t rainin’ we ain’t trainin’!", " Step off.  You’re ruinin’ my good mood.", " Jesus, Tommy.", " Are we there?", " What’re you two limpdicks starin’ at?", " Yeah.", " That’s why I’m here.", " Damn.  They got big.", " It looks like him.", " -- so their nervous systems are in tune. Or something.  Which is why they offered me this gig, because I can link with Tommy’s avatar, which was insanely expensive. Is this right?  I just say whatever in these videologs?", " Right. So, whatever.  Here I am.  Doing science. Never been in a lab before.", " He’s dead.  I know it’s a big inconvenience to everyone.", " No.", " High school chemistry.  But I ditched.", " Like -- an hour.", " Don’t!  I got this.", " Maybe I was just tired of doctors telling me what I couldn’t do.", " Kiss the darkest part of my lily white --", " Grace?", " That’s kinda freaky.", " You guys’re packing some heavy ordinance.", " Yeah, no problem.", " I figured -- just another hellhole.", " That sounds real good, Colonel.  So -- am I still with Augustine?", " Just Marines comparin’ tattoos.", " Got it.", " Then how’s this supposed to work?", " How do we contact them?", " Or they may skin us and make a drum.", " What happened here?", " It’s already pissed off!", " What do I do?", " Oh yeah!  Who’s bad?! That’s right.", " That’s what I’m talkin’ about, bitch!", " That’s right motherf--", " What about this one?  Run, don’t run? What?", " I don’t have all goddamn night! Come on! Come on!", " Wait, don’t --", " Look, um, I know you probably don’t understand this.  But -- thanks. Thank you.  I owe you.", " I would have been screwed if you hadn’t come along --", " Hey, wait. Wait!  Where you goin’?", " Slow down a second will you.  I just want to thank you for killing those --", " Okay, I’m sorry.  Whatever I did -- I’m sorry.", " They attacked me.  How’m I the bad guy here--", " Okay, fine, you love your little forest friends.  So why not just let them kill my ass?  What’s the thinking?", " Yes, why save me?", " If I’m so ignorant, maybe you should teach me.", " Whooaa.", " Then teach me to “see.”", " Hey, slow down.  Look, I think we just got off on the wrong foot and --", " --you just have to get to know me. I’m Jake.  Jake Sull--", " Whooaaa -- shit!", " I need your help.", " So take me with you.", " What?", " What are they?", " What was that all about?", " What’s your name?", " What’s going on?", " Your father!? Uh, good to meet you, sir.", " Who’s Eywa?", " Jake Sully.", " I came to learn.", " My cup is empty, trust me.  Just ask Doctor Augustine.  I’m no scientist.", " I don’t know. I was a Marine -- uh, a warrior.  Of the Jarhead clan.", " What’s going on?  What are they saying?", " So it’s all good, right?  You and me --", " Don’t get up.", " You never told me your name.", " Okay, again, a whole lot slower.", " Nay-TEE-ree. That’s nice. Nay-TEE-ree.", " Your mom likes me.  I can tell.", " These rock. What are they?", " That’s some damn fine teylu. That’s like grandma’s teylu.", " Wha --? Oh.", " Yeah, Doc -- and you are not going to believe where I am.", " It’s not something you can teach.", " Yeah. They want to study me.  See if I can learn to be one of them.", " Does Augustine know about this?", " So -- who talks them into moving?", " What if they won’t go?", " I’m on it.", " Tsu’tey. Mo’at. Eytukan.", " Got it. So who’s this Eywa?", " Who’s got a date with the chief’s daughter?", " I didn’t meet the sister.", " Forward.", " I knew this guy could speak English.", " You’ve got outer columns, then a secondary ring here, and an inner ring. Then a core structure, it’s like a spiral, that’s how they move up and down.", " Roger that.", " Hey. You got a problem?", " Holy shit.", " When?", " Do I have to do this?  I need some rack.", " Yeah, yeah. The days are starting to blur together. The language is a bitch, but I figure it’s like field-stripping a weapon. Repetition.", " Seyri.", " Ontu, mikyun, nari.", " Ireiyo.", " I just hope this treehugger shit isn’t on the final.", " Excuse me -- this is my video-log here, okay?", " I See you Brother, and thank you. Your spirit goes with Eywa, your body stays behind to become part of the People.", " I made a kill today.  We ate it.  I know where that meal came from.", " Yeah yeah.", " Get rid of this shit, then you can lecture me.", " Not now. Tomorrow we leave for Iknimaya.", " That’s right, Grace. This is what I’ve been working for.", " What did happen at the school?", " Jesus.", " We doin’ this?", " How will I know if he chooses me?", " Outstanding.", " Let’s dance.", " That’s right! You’re mine.", " Heeeyyyaaaah!", " Shut the hell up!!", " Level out!  Fly straight!", " The People call it Toruk.", " Last one you ever see.", " That’s it.", " Hey, guys.", " That’s a long time.", " Sorry.", " I can barely remember my old life. I’m not sure who I am anymore.", " You called us back to report -- you want to hear it or not?", " No.  I can do this.", " I’ve gotta finish this thing.  There’s one more test -- the Dream Hunt. It’s the final stage of becoming a man. Then I’m one of them.  They’ll trust what I say...", " ... and I can negotiate the terms of their relocation.", " It’s the last door -- I’m going through it.  You can help me or get out of the way.", " I have to go all the way -- become one of them--", " You know why I’m here? Because Quaritch sent me.", " That’s right -- to embed with the Omaticaya.  To find out how to screw them out of their home.  By deceit or by force, he didn’t care. And if it turned out to be force, then how best to do it.", " I’m not that guy any more.", " But if I tell Quaritch the truth, he yanks me out -- I never see her again. And if I tell her the truth, the clan throws me out -- that’s if they don’t cut my heart out and show it to me.", " They don’t even have a word for “lie” -- they had to learn it from us.", " Grace. I’ve gotta go.  They’re waiting.", " It’s okay. Mo’at says an alien mind probably can’t survive the Dream Hunt anyway.", " It’s like -- a sound you feel.", " I don’t want Ninat.", " I’ve already chosen. But this woman must also choose me.", " Neytiri, you know my real body is far away, sleeping.", " We are?", " Really, we are?", " It’s cool. I’m there.", " Hey!  Heeeey!  Stop! Stop!", " Okay, listen. There’s something I have to tell you. It’s gonna be hard.  I just need you to --", " I accept.", " It’s the only way to get him to goddamn listen.", " Are you out of your goddamn mind?!", " You say you want to keep your people alive.  Start by listening to her.", " Just tell him what you know in your heart.", " Yup. That’s how it’s done.  When people are sitting on shit you want, you make them your enemy. Then you’re justified in taking it.", " When?", " Look Selfridge, you don’t want this kind of blood on your hands.  Let me try to talk them out.  They trust me.", " Eytukan, I have something to say, to everyone.", " A great evil is upon us.  The Sky People are coming to destroy Hometree.  They will be here soon.", " You have to leave, or you will die.", " They sent me here to learn your ways.  So one day I could bring this message, and you would believe it.", " Yes. At first it was just orders.  Then everything changed.  I fell in love-- with the forest, with the Omaticaya People -- -- with you.  And by then, how could I tell you?", " Neytiri. Please, I only wanted to --", " You have to get out of Hometree!  Run to the forest!  Please, I’m begging you!", " We’ve gotta move!  He’s gonna blow the columns.", " Neytiri!  Neytiri!", " I’m sorry --", " Thanks.", " So what do you say?  Time for a revolution?", " Come on.", " Get your ship fired up.", " Stay here. I need somebody on the inside I can trust.", " Take it nice and easy, troop.", " On the ground, face down. Hands behind your head.", " Go! Go! Go!", " Oh yeah, baby!", " Hang on, Grace.", " It’s strongest at the Well of Souls, right?", " Good, ‘cause that’s where we’re going.", " I’m gonna get you some help, Grace.", " No!  The People can help you. I know it.", " I’ve gotta try, Norm.", " Come on, boy.  Time to fly.", " I See you.", " Tsu’tey of the Rongloa, son of Ateyo. I stand before you, ready to serve the People. You are Olo’eyctan, and you are the best warrior. I can’t do this without you.", " Ireiyo.", " Grace is dying.  I beg the help of the Great Mother.", " Look where we are, Grace.", " Is that possible?", " Hang on, they’re gonna fix you up.", " I will.", " Grace!", " With your permission, I will Speak now. You would honor me by translating.", " The Sky People have sent a message that they can take whatever they want, and no one can stop them.  But we will send them a message. Ride out, as fast as the wind can carry you, tell the other clans to come. Tell them Toruk Macto calls to them. Fly now with me brothers and sisters! Fly! And we will show the Sky People that this is our land!", " Talk fast.", " Can you talk to Selfridge? Maybe we can cut some kinda deal before this thing goes all the way.", " When?", " Thanks.", " That’s right.  Because I gave it to him on a plate.", " Then I guess we better stop him.", " Gonna have to settle for coffee.", " Strike here and here.", " Yeah.", " What’s your point?", " I’ve never done this in my life.", " And I’m probably just talking to a tree right now. But if you’re there -- I need to give you a heads up.", " If Grace is there with you -- look in her memories -- she can show you the world we come from.  There’s no green there.  They killed their Mother, and they’re gonna do the same thing here.", " More Sky People are gonna come.  They’re gonna come like a rain that never ends --", " -- until they’ve covered the world. Unless we stop them.", " It was worth a try.", " We have to stop the shuttles, no matter what it takes.", " What the hell -- ?", " WHOO-HOOOO!", " Quaritch is gonna take out the Well of Souls! He’s got a clear shot. Hit him, anybody that can!  Do it now!", " Kinda hoped you’d say that.", " I See you, Tsu’tey te Rongloa Ateyitan.", " They’re safe.", " No. I’m not officer material.", " I’m not killing you.", " No.", " Forgive me, my Brother. Go now to the Mother Spirit.", " The science guys will keep the lights on, here. But I won’t miss this place."], "AGENT 1": [" Are you Jake Sully?", " Your brother represented a significant investment.  We’d like to talk to you about taking over his contract."], "AGENT 2": [" It’s about your brother."], "MED TECH": [" We’re there, Sunshine.", " People, you have been in cryo for five years, nine months and twenty two days. You will be hungry, you will be weak. If you feel nausea, please use the sacks provided for your convenience.  The staff thanks you in advance.", " Easy, Jake, I need you to sit down --"], "CREW CHIEF": [" Exopacks on!", " Remember people, you lose your mask you’re unconscious in 20 seconds and you’re dead in four minutes. Let’s nobody be dead today, it looks bad on my report.", " Exopack on, let’s go!", " Go directly into the base! Do not stop! Go straight inside!"], "WAINFLEET": [" Look at all that new meat.", " That is just wrong.", " Seen a lotta guys leave this place in a wheelchair.  Never seen anybody show up in one.", " Yo Chacon!  Get some!", " Whatever you say, Doc.", " Ya’ll have fun out there.", " They hit with banshees first.  Set the ampsuit on fire.  Driver’s toast.", " Six bodies -- that’s all of ‘em. And the equipment is totalled.", " Contact. Two hundred meters.", " I hear this is worse than death for you, chief.", " A and C squads -- rally at my pos.  I want -- Who’s screaming God damn it?!", " Shutup you crybabies!"], "FIKE": [" Check it out, man.  Meals on wheels."], "MAN (V.O.)": [" You are not in Kansas any more..."], "QUARITCH": [" ... You are on Pandora, ladies and gentlemen. Respect that fact every second of every day.", " Out beyond that fence every living thing that crawls, flies or squats in the mud wants to kill you and eat your eyes for jujubees.", " We have an indigenous population of humanoids here called the Na’vi.  They’re fond of arrows dipped in a neurotoxin which can stop your heart in one minute. We operate -- we live -- at a constant threat condition yellow.", " As head of security, it’s my job to keep you alive. -- not with all of you. If you wish to survive, you need a strong mental attitude, you need to follow procedure...", " For you pogues, this is a banshee.  A small one.  See, they like it when I bring fresh meat out here.  And this clearcutting really stirs up the hornet’s nest. So keep your head on a swivel. If it moves, shoot it.  If you’re not sure it’s moving -- shoot it! If it looks like a bunch of flowers you want to take home to Sally Rottencrotch -- SHOOT IT! What’re you gonna do?", " Outstanding. Let’s roll.", " This low gravity makes you soft. You get soft, Pandora will shit you out dead with zero warning.", " I pulled your record, Corporal. Venezuela -- that was some mean bush.  Nothing like this here, though.  You got heart kid, coming out here.", " I was in First Recon a few years ahead of you.  More than a few.  Two tours in Nigeria, not a scratch.  I come out here and --", " They could fix this if I rotated back. But you know what?  I kinda like it. Reminds me every day what’s out there. Besides, I can’t leave --", " This is my war, here.", " The avatar program is a joke -- buncha limpdick scientists.  But we have a unique opportunity here, you and I.  A recon Marine in an avatar body could get me the intel I need, on the ground, right in the hostiles’ camp.", " Looks good. I need you to learn about these savages, gain their trust.  Find out how I can force their cooperation, or hit ‘em hard if they don’t.  Maybe you can keep some of my boys from going home like you. Or bagged-and-tagged.", " On paper.  You walk like one of her science pukes, you quack like one, but you report to me.  Can you do that for me?", " Look, son -- I take care of my own.  Get me what I need, I’ll see you get your legs back when you rotate home. Your real legs.", " Jarhead clan? And that worked?", " That’s how you seize the initiative. I wish I had ten more like you.", " Guess.", " I’m betting they will.", " You got three months.  That’s when the dozers get there.", " I’m going to need accurate scans of all these columns.", " You’re not gettin’ lost in the woods, are you son?", " Your last report was two weeks ago. I’m starting to doubt your resolve. From what I see, it’s time to terminate this mission.", " Look, you’ve given me plenty of usable intel. Like this “Well of Souls” place -- I’ve got them by the balls with that, when it turns into a shit-fight. Which it will.", " So you’ll get your legs back, like I promised. It’s time to come in.", " Then you need to get it done, Corporal.", " Freeze it, right -- there.", " Get me a pilot!", " Did I tell you to announce us?", " You crossed a line.", " You let me down, son.  You got a little local pussy and completely forgot what team you play for.", " Shut your fucking hole!", " We understand them just fine.  Thanks to Jake here.", " Since a deal can’t be made -- it gets real simple. So thanks. I’m getting all emotional.  I might just give you a big wet kiss.", " The rest of the squad?", " I can do it with minimal casualties to the indigenous.  We’ll clear them out with gas first. It’ll be humane. More or less.", " Hey, don’t go limp on me now. This is exactly the incident we needed.", " Well, I’d say diplomacy has failed.", " I think they mean to cut their throats if we don’t back off.  Make sure you get a nice close-up of that. I can tack it onto the after-action report.", " Alright, let’s get this done. Give me forty millimeter gas rounds, right in the front door.", " Fire.", " That’s how you scatter the roaches. Okay, switch missiles. Give me H-E’s at the base of the west columns.", " Bring it down.", " Nice work people.  Alright, let’s light it up.", " People, you are fighting for survival. There’s an aboriginal horde out there massing for an attack. First slide.", " These orbital images show the hostiles’ numbers have gone from a couple of hundred to over two thousand in one day, and more are pouring in.  By next week it could be twenty thousand. Then they’ll be overrunning our perimeter here.  We can’t wait. Our only security lies in pre- emptive attack.  We will fight terror with terror.", " Next slide. This mountain stronghold is supposedly protected by their deity. When we destroy it, we will blast a crater in their racial memory so deep they won’t come within a thousand klicks of this place.", " I declared threat condition red.  That puts all on-world assets under my command.", " You’re a long way from Earth.", " Get him out of here.", " Fire for effect.", " Blue team, switch forties.  Fire at will.", " Blue team, stay with the ground units. Red team, with me.  We’re punching for the main target.", " There it is. Valkyrie One, this is Dragon. Target is in sight.", " Get back here you worthless pukes!", " What do you think?", " Stay on target.", " Switch missiles.  Arm all pods.", " Let’s see what these blue bastards do when I bitch-slap their goddess.", " Put your mask on.", " Nothing’s over while I’m breathing.", " How does it feel to betray your own race?"], "NORM": [" Hey, you’re Jake right?  Tom’s brother? You look just like him. Sorry, I’m Norm Spellman, I went through avatar training with him.", " He was a great guy -- funny.  It was a big shock to all of us.", " And duh! -- obviously you look like him. I mean, if you weren’t genetically identical, you wouldn’t be taking over his avatar.", " So -- you want to go check it out?", " Yeah, they mature on the trip out. So the proprioceptive sims worked pretty well.", " No, it looks like you.  This is your avatar now, Jake.", " Yeah. You just need to get in the habit of documenting everything -- what you see, what you feel -- it’s all part of the science.  Good science starts with good observation.", " Grace Augustine is a legend.  She's the head of the Avatar Program, and she wrote the book -- I mean literally wrote the book -- on Pandoran botany.", " May the All Mother smile upon our first meeting.", " There is still much to learn.", " Five hundred and twenty hours.", " I am a living god.", " This is failing as a pep talk.", " The bull has the red on the dorsal armor?", " How will they know we’re here?", " Why don’t they come back?", " Who’s Eywa? Oh, only their deity. The Great Mother.  The goddess made up of all living things.  You’d know that if you had any training whatsoever.", " The Hallelujah Mountains?", " Yesssss! The legendary Floating Mountains of Pandora?  Heard of them?", " Oh. My. God.", " I trained three years for this mission. I speak the language fluently. He falls off the frickin’ turnip truck and all of a sudden he’s cultural ambassador!?", " Yeah, well I didn’t come out here to wash the dishes while you’re on some interspecies booty call.", " Thank you?", " Irrrreiyo.  Irrrreiyo.  You’ve gotta roll the R, r-r-r-oll it.", " Last Shadow.", " Calibrating.  Thirty seconds.", " What?", " They won’t understand what you’ve done.", " Link is ready.", " Samson One Six?  Trudy? Crap.", " Hey, hang on, you can’t interrupt a link in progress, it’s dangerous -- wait!", " I can’t believe that.", " Baby, you rock.", " Tsu’tey is Olo’eyctan now.  He’s not going to let you get near that place.", " Holy shit.", " We’re screwed.", " If he takes out the Well of Souls -- it’s over. It’s their main line to Eywa, to their ancestors -- it’ll destroy them.", " Jake!  Jake! We’re falling back!", " No!"], "MAX": [" Me and Norm were out here to drive these remotely controlled bodies called avatars.  They’re grown from human DNA mixed with DNA from the natives here.", " Yeah, they’ve got great muscle tone. Give us a few hours, you guys can take them for a spin.", " Log off.  It’s time to meet your boss for the next five years.", " That's because she likes plants better than people.", " And here she is, Cinderella back from the ball.  Grace, I’d like you to meet Norm Spellman and Ja --", " Uh, Grace, this is Jake S----", " Grace, that’s not a good idea.", " Here, tomorrow, oh eight hundred.  Try to use big words.", " Initiate link.", " That’s a gorgeous brain.  Nice activity.", " That’s it.  Find your way home.", " He’s in.", " Take it slow, Jake.  We need to check your motor control.  Try touching your fingertips together --", " Jake! Wait, we have to run some tests --", " That’s awesome, Jake.", " Link is ready.", " That was unexpectedly satisfying.", " I don’t know how secure this channel is.", " It’s crazy here, Jake. It’s full mobilization. They’re rigging the shuttles as bombers. They’ve made up these big pallets of mine explosives. It’s for some kind of shock and awe campaign.", " No, Quaritch has taken over.  He’s rolling and there’s no stopping him.", " Oh six hundred tomorrow.", " Rogue One, Rogue One, this is Max.  Tell Jake we are in motion. Get in there.  Barricade the door!"], "GRACE": [" Who’s got my goddamn cigarette?!", " Norm.  I hear good things about you. How's your Na'vi?", " Not bad.  You sound a little formal.", " Yeah, yeah, I know who you are, and I don’t need you.  I need your brother. You know -- the PhD who trained three years for this mission.", " How much lab training have you had?  Ever run a gas chromatograph?", " Any actual lab work at all?", " You see?  You see?  They’re pissing on us without even the courtesy of calling it rain. I’m going to Selfridge.", " Parker, I used to think it was benign neglect, but now I see you’re intentionally screwing us.", " I need a research assistant, not some jarhead dropout.", " Lucky?  How is this in any way lucky?", " The last thing I need is another trigger happy asshole out there!", " That tends to happen when you use machine guns on them.", " How much link time have you logged?", " Tell me you’re joking.", " So you just figured you’d come out here to the most hostile environment known to man, with no training of any kind, and see how it went?  What was going through your head?", " Relax and let your mind go blank.  That shouldn’t be hard for you.", " Go figure. Alright, I’m going in.", " Well who’d you expect, numbnuts?  Think fast!", " Motor control is looking good.", " Lights out amigos.  See ya’ at dinner.", " Damn.  Same old sack a’ bones.", " Start calibrating. We’re on the flight line in ten minutes.", " What did Atilla want?", " Yeah. Well, listen to me, Marine --", " -- you’re driving an avatar, now.  That means you’re in my world, got it?", " That son of a bitch has screwed up this program enough.  All this -- -- exists so we can go out there and build a bridge of trust to these people, who could teach us so much.  But thanks to Quaritch and his thugs the Na’vi won’t even talk to us anymore.", " We have a new face. You’re fluent, you’ve studied the culture.  You’re non-threatening. The ones we know best -- the Omaticaya clan -- may give you a chance. Maybe you can get them back to the table before things go tits-up for good.", " We don’t.  They contact us. If they see us taking our samples, treating the forest with respect -- Not trampling everything in sight -- they may reach out to us.", " Just keep your mouth shut and let Norm do the talking.", " Looks like a bull, six cows and some juveniles.", " Stay with the ship. One idiot with a gun’s enough.", " Relax, Marine.  You’re making me nervous.", " I’m sure they’re watching us right now.", " Bring the soil probe -- right there, yellow case.", " The stingbats knock them off.  I guess I always hope somebody will come back and read them.", " The Na’vi learned as much about us as they needed to know.", " Are you going to help with this gear? We’ve got a lot to do.", " See, right here where the roots of the two trees interact.", " Don’t shoot.  You’ll piss it off.", " Jake, that armor’s too thick. Trust me.", " It’s a territorial threat display. Do not run, or he’ll charge.", " Hold your ground!", " Run.  Definitely RUN! He hacks manically at the end of a cut sapling with", " Shit.", " He’s not going to make it till morning.", " Come on back, kid, that’s it.", " Damn, you were dug in like a tick. Is the avatar safe?", " -- so the kid’s out there one night and he’s got the Queen Bitch herself offering him the spare room and the car keys. Unbelievable.", " For reasons I cannot fathom, the Omaticaya have chosen you.  God help us all.", " He’s the clan leader -- -- but she’s the spiritual leader.  Like a shaman.", " Knock it off. Jesus, it’s like kindergarten around here.", " Neytiri was my best student.  She and her sister Silwanin.  Just amazing girls.", " No, she’s dead. Okay, let’s go -- village life starts early.", " Don’t do anything unusually stupid.", " I’m not about to let Quaritch and Selfridge micro-manage this thing. We’re going up into the mountains.", " That’s right.", " See these magnetic formations.  We’re getting close.", " Yup. We’re in the flux vortex.", " Jake, take number two, it’s the least glitchy.  Norm, I need you to operate Jake’s link.", " It’s not our choice, Norm.", " He can’t go far.", " Let’s get you in.", " No -- now, when it’s fresh.", " I See you, Neytiri Mo’at’ite.", " This isn’t just about eye-hand coordination out there.  You need to listen to what she says.  Try to see the forest through their eyes.", " You’re still losing weight.  Here --", " Other body.  You need to take care of this body.", " Jake, I’m serious -- you look like crap. You’re burning too hard.", " I’m telling you, as your boss and someone who might even consider being a friend someday, to take some down time.", " Yeah -- you’re gonna go ride a banshee. Or die trying.", " And this is your check up from the neck up, Marine.  You’re getting in way too deep. Trust me, I learned the hard way.", " Neytiri’s sister -- Sylwanin -- stopped coming to school.  She was angry about the clear-cutting.", " One day, she and a couple of other young hunters came running in, all painted up -- they’d set a bulldozer on fire -- I guess they thought I could protect them.", " The troopers pursued them to the schoolhouse.", " They killed Sylwanin in the doorway. Right in front of Neytiri.  Then shot the others. I got most of the kids out, before they shot me.", " Yeah.", " A scientist stays objective -- we can not be ruled by emotion.  But I poured ten years of my life into that school. They called me sa’atenuk. Mother. That kind of pain reaches back through the link.", " It’s a job.  Learn what you can -- but don’t get attached.", " It’s not our world, Jake.  And we can’t stop what’s coming.", " The Great Leonopteryx is the apex aerial predator.  Not only rare, but the sightings tend not to get reported.", " Vitraya Ramunong -- The Well of Souls. It’s their most sacred place.", " Something big is going on in there, biologically. I’d die to get samples, but outsiders are strictly forbidden.", " Watch that stuff.  It’ll knock you into next week.", " Jake is making incredible progress, years worth in just a few months.  But -- we need more time.", " Parker, it’s their ancestral home. They’ve lived there since before human history began. You can spare them a few more weeks.", " Jake, I can’t allow this.  You’re just not strong enough.", " Will you listen to me? Sometimes the Na’vi themselves die in these vision quests. The venom takes you to the edge of death.", " No matter what you prove out there-- you are still in here. Right here.", " Goddammit, Jake, you can never be one of them!", " Our life out there takes millions of dollars of machinery to sustain.  You visit -- and you leave.", " You can never truly be with her.", " And what about now, Jake?", " I know.", " I know. I taught it to them.", " Jake.  You can’t carry this burden much longer.", " Prep my link.  I’m going in.", " Here -- eat this. I’d hate to have to force-feed a cripple.", " She’s not going anywhere.", " And when was the last time you took a shower?  Jesus, Marine.", " Please -- this will only make it worse --", " Oh shit.", " Jake, don’t --", " What the hell are you doing?", " Parker, listen, there may still be time to --", " Or what, Ranger Rick?  You gonna shoot me? You need to muzzle your dog!", " This is bad, Parker. Those trees were sacred to the Omaticaya in a way you can’t imagine.", " I’m not talking about pagan voodoo here -- I’m talking about something real and measurable in the biology of the forest.", " I can’t do this.  How am I supposed to reduce years of work to a sound bite for the illiterate?", " Alright, look -- I don’t have the answers yet, I’m just now starting to even frame the questions.  What we think we know -- is that there’s some kind of electrochemical communication between the roots of the trees.  Like the synapses between neurons. Each tree has ten to the fourth connections to the trees around it, and there are ten to the twelfth trees on Pandora --", " That’s more connections than the human brain. You get it? It’s a network -- a global network. And the Na’vi can access it -- they can upload and download data -- memories -- at sites like the one you destroyed.", " You need to wake up, Parker. The wealth of this world isn’t in the ground -- it’s all around us. The Na’vi know that, and they’re fighting to defend it. If you want to share this world with them, you need to understand them.", " Parker, we have to talk, like rational people.", " They bulldozed a sacred site on purpose, to trigger a response. They’re fabricating this war to get what they want.", " My God.", " Parker, wait.  Stop! These are people you’re about to --", " For God’s sake, there are children in there.  Babies!", " They never wanted us to succeed.", " I’m free.", " Do what he goddamn says!", " Aaahh, crap. Not again.", " This is gonna ruin my whole day.", " Forget it, it doesn’t matter.", " I need to take some samples.", " I -- always held back.  But you gave them your heart. I’m proud of you, Jake.", " Help them.  You do whatever it takes. You hear me?", " I’m with her Jake -- -- she’s real --"], "SELFRIDGE": [" Grace.  You know I enjoy our little talks.", " Actually, we got lucky with him.", " Well -- lucky your guy had a twin brother, and lucky the brother wasn’t an oral hygienist or something.  A Marine we can use. I’m assigning him to your team as security escort.", " Look, you’re supposed to be winning the hearts and minds of the natives.  Isn’t that the whole point of your little puppet show?  If you look like them, if you talk like them, they’ll trust you?", " But after -- how many years? -- relations with the indigenous are only getting worse.", " This is why we’re here. Unobtanium. Because this little gray rock sells for twenty million a kilo.  No other reason. This is what pays for the party.  And it’s what pays for your science. Comprendo?", " Those savages are threatening our whole operation.  We’re on the brink of war and you’re supposed to be finding a diplomatic solution.  So use what you’ve got and get me some results.", " Look, Sully -- find out what these blue monkeys want.", " Their damn village is sitting right over the richest unobtanium deposit for a hundred klicks in any direction.  Which sucks -- for them -- because they need to relocate.", " Yeah, she does, and she’s on the next ship back if she tries to cock-block me on it.", " Killing the indigenous looks bad, but there’s one thing shareholders hate more than bad press -- and that’s a bad quarterly statement. Find me a carrot to get them to move, or it’s going to have to be all stick.", " Good of you to stop by.  How’s it going out there?  Our blue friends all packed up yet?", " See, I keep hooking it.  It’s the damn pack.", " The low gravity and the high air density cancel out so --", " Go ahead.", " Not what I was hoping to hear.", " This thing is inevitable.  What does it matter when it happens? I’m sorry, Dr. Augustine.  You’re out of time.", " Roll on.  He’ll move. These people have to learn that we don’t stop.", " Son of a bitch!", " Can we just take this down a couple notches, please.", " You know what? You throw a stick in the air around here it falls on some sacred fern.", " Which is what exactly?", " That’s a lot I’m guessing.", " What the hell have you people been smoking out there?  They’re just. Goddamn.  Trees.", " Well, I’d cherish that, but unfortunately you’re out of here on the next shuttle. All of you. I’m shutting down the Avatar Program, effective now.", " Christ.", " Alright, let’s pull the trigger.", " They’re fly-bitten savages who live in a tree!  Look around -- I don’t know about you but I see a lot of trees.  They can move.", " You’ve got one hour.  Unless you want your girlfriend in there when the axe comes down, you get them to evacuate. One hour.", " Pull the plug.", " This thing is completely out of control!", " Listen to me! I am not authorizing you to turn the mine-workers local into a freakin’ militia!", " You think you can pull this palace coup shit on me?!  I can have your ass with one call --", " You touch me you’re so fired.", " What the hell is going on out there?", " What do you mean, off the board?!", " Oh shit."], "TECH": [" Phase-lock at forty percent.  He’s in transition.", " Phase-lock ninety nine percent. The link is stable."], "GRACE (O.S.)": [" Hey Marine!", " The kids were so bright, so eager to learn... they picked up English faster than I could teach it to them."], "NORM (O.S.)": [" Hey, check it out."], "TROOPERS": [" Shoot it, sir!", " Yeah baby!  Get some!"], "TRUDY": [" Sully -- Colonel wants to see you in the Armor Bay.", " Yeah, ‘cause we’re not the only thing flyin’ around out there.  Or the biggest. I’m gonna need you on a door gun, I’m a man short.", " See ya on the flight-line, zero nine. He’s down there.", " Sorry, Doc. He’s just gonna have to hang on ‘till morning.", " It only takes tiny inputs.  Here, put your hand on the cyclic --", " Feel how small the moves are? You barely have to think it, and the aircraft reacts.", " Yeah we are.  Look at my instruments.", " You should see your face.", " There usually isn’t time to key the mike.", " I saw one take out a gunship once -- WHAM! Total frickin’ yard sale. Ate the crew like peanuts.", " They’re coming back.", " If you don’t give him something, he’s gonna shut us down.", " Loveshack this is Samson One Six inbound hot to your pos.  I have Colonel Quaritch with me and --", " Sorry sir, it’s procedure.", " Sec-ops is rolling the gunships.  They’re gonna hit Hometree!", " Now.  We’re spooling up now! I gotta go.", " Screw it.", " Personally I think steak’s too good for these traitors.", " Oops. All the way down, pendejo.", " Well, at least they won’t be able to track us up here. Not this deep in the vortex.", " Yeah.", " Copy.", " Frickin’ daisycutters.", " You know he’s gonna commit those bombers straight to the Well of Souls.", " We both did.", " You need to get some rack.", " You know our chances suck.", " Going up against gunships with bows and arrows...", " Right.", " You’re not the only ones with guns, you pricks.", " On it.", " Norm, I love you."], "MECHANIC": [" That servo’s in, Colonel, if you want to try it."], "TRUDY (INTERCOM)": [" Sturmbeest herd, one o’clock.", " I’m going to have to call it, guys. We’re not allowed to run night ops.  Colonel’s orders."], "NEYTIRI": [" Rrreeyaaah!  Hyaaaah!!", " Raaaarrrr!", " Forgive me, my brother.", " Forgive me. May your spirit run with the Great Mother.", " Don’t thank!  You don’t thank for this! This is sad. Very sad, only.", " All this is your fault! They did not need to die.", " Your fault! You are like a baby, making noise, don’t know what to do. You should not come here, all of you! You only come and make problems.  Only.", " Why save you?", " You have a strong heart.  No fear.", " But stupid! Ignorant like a child!", " Sky people can not learn.  You do not See.", " No one can teach you to See.", " You should not be here.", " No. You go back.", " Atokirina’.  Seeds of the Great Tree -- very pure spirits.", " Come!", " Tsu’tey, what are you doing?! He is my captive!", " Stop!  There has been a sign. This is a matter for the Tsahik.", " I was going to kill him, but there was a sign from Eywa.", " Father, many atokirina came to this alien.", " My father is deciding whether to kill you.", " That is Mother. She is Tsahik -- the one who interprets the will of Eywa.", " Why me?  That's not fair!  I only--", " Do not speak.", " Neytiri te Ckaha Mo'at’ite.", " Neytiri. Nay-TEE-ree.", " Teylu. You call beetle larvae.", " This is shahaylu -- the bond. Feel her heartbeat, her breath. Feel her strong legs.", " You may tell her what to do -- -- inside.  For now, say where to go.", " Again.", " Again.", " Do not look in her eye.", " Ikran is not horse. Once shahaylu is made, ikran will fly with only one Hunter in the whole life.", " To become taronyu -- Hunter -- you must choose your own ikran. And he must choose you.", " When you are ready.", " Heeyaaahh!", " I See you, Doctor Grace Augustine.", " When you hear nothing, you will hear everything.  When you see nothing, you will See everything.", " A clean kill.  You are ready.", " Now you choose your ikran.  This you must feel -- inside. If he also chooses you, move quick, like I showed. You will have one chance.", " He will try to kill you.", " First flight seals the bond. You cannot wait.", " My grandfather’s grandfather was Toruk Macto -- Rider of Last Shadow.  Toruk chose him. It has only happened five times since the time of the First Songs.", " Toruk Macto was mighty -- he brought the clans together in a time of great sorrow. All Na’vi people know this story.", " You must dance!  It is the way.", " When your Spirit Animal comes, you will know.", " This is a place for prayers to be heard. And sometimes answered.", " We call this utraya mokri -- the Tree of Voices. The voices of our ancestors, who live within Eywa.", " You are Omaticaya now.  You may make your own bow from the wood of Hometree. And you may choose a woman.", " We have many fine women. Ninat is the best singer --", " There is Beyral -- she is a good hunter --", " She already has.", " Kissing is very good. But we have something better.", " This body is real. This spirit is real.", " When I was first your teacher, I hated all Sky People.  But you have also taught me. Spirit is all that matters.", " I am with you now, Jake. We are mated for life.", " Yes. It is our way. Oh. I forgot to tell?", " We are.", " Jake!  Wake up!  Where ever you are, come back to me now.  Jake!", " We are mated before Eywa. It is done.", " I have chosen.", " What are you saying, Jake? You knew this would happen?", " I trusted you, Jake!", " You will never be one of the People! NEVER!", " Get away from me, Jake. Go away! Never come back!", " Toruk Macto.", " Toruk Macto!", " I See you.", " I was afraid Jake -- for my people. I’m not any more.", " Our Great Mother does not take sides. She protects only the balance of life."], "TSU’TEY": [" These demons are forbidden here. I will kill this one as a lesson to the others!", " Bring him.", " A warrior!  I could kill him easily!", " These aliens try to look like people, but they can’t.", " I say she will kill him.", " You should go away.", " This alien will learn nothing.  A rock Sees more.", " Jakesully will go first.", " I thought -- enough drink -- you would not be so ugly.", " Your warriors -- hide inside machines -- fight from far away. I did not think a sky person could be brave.", " You do not speak here!", " You!", " You mated with this woman?!", " Neytiri was promised to me! Everything is changing. Everything is being destroyed!", " These aliens kill everything they touch, like poison.", " Yeeeeeaaa!", " I challenge you.", " This is a demon in a false body. It should not live.", " I will fly with you.", " I See you, Jakesully.", " Are the people safe?", " I can never ride again, or bond with my woman -- or hear the voice of Eywa. I can not lead the People. You will lead them, Jakesully.", " It is decided. Now do the duty of Olo’eyctan.  Set my spirit free.", " I am already dead.", " It is the way. And it is good. I will be remembered --", " -- I fought with Toruk Macto, we were brothers -- and he was my last shadow."], "EYTUKAN": [" Why do you bring this creature here?", " I have said no dreamwalker will come here, to offend our home!  His alien smell fills my nose", " No!  This is the first warrior dreamwalker we have seen.  We need to learn more about him.", " You speak truth.  We must understand these Sky People if we are to drive them out.", " Did your Spirit Animal come?", " You are now a son of the Omaticaya.  You are part of the People.", " Tsu’tey will lead the war party!", " Stop!  This is not a proper challenge.", " Speak, Jakesully.", " Take the ikran! Attack from above!", " Everybody outside! Go to the Forest.", " Daughter -- take my bow. Protect the People."], "MO’AT": [" Step back!", " I will look at this alien.", " What are you called?", " Daughter. You will teach him our way, to speak and walk as we do.", " It is decided!", " We cannot let this seed grow. Her path is with Tsu’tey.", " You are one of us.  Help us!", " Bring her.", " Wise ancestors who live within Eywa, guide us.  Give us a sign.", " The Great Mother may choose to save all that she is --", " -- in this body.", " Possible, yes.  She must pass through the Eye of Eywa -- and return. But Jakesully-- she is very weak.", " Her wounds were too great, there was not enough time.  She is with Eywa now."], "MO'AT": [" Why did you come to us?", " We have tried to teach other Sky People. It is hard to fill a cup which is already full.", " What are you?", " My daughter will teach you our ways. Learn well, Jakesully.  We will see if your insanity can be cured.", " He is your responsibility.", " He seems dim to me.  And his eyes are too small.", " Neytiri will test this “warrior.” Hey may learn nothing -- but we will learn much.", " Oh wise worm, eater of the Sacred Tree -- bless this worthy Hunter with a true vision.", " It is finished.", " Something has come. It will take time for the meaning to be clear.", " Is this true?", " Neytiri! If you choose this path, you can never be Tsahik. Your life will be wasted.", " Are you certain of this?", " Bring her, Jakesully."], "(MORE)": ["", "", "", ""], "SELFRIDGE (cont'd)": [" We try to give them medicine and education.  Roads! But no -- they like mud. I wouldn’t care except --"], "GRACE (cont'd)": [" There’s a mobile link up at Site 26 that we can work out of.", " And the psychoactive alkaloid in the worm- - we have no idea what that’ll do in an avatar brain."], "OPERATOR": [" Hey, I got one of the natives blockin’ my blade here.", " I’m blind."], "SUPERVISOR": [" What do we do?"], "JAKE (RECORDED)": [" They’re not going to give up their home -- they’re not gonna make a deal.  For what? Lite beer and shopping channel? There’s nothing we have that they want. We’re a horror to them. We’re the monsters from space.", " They’re never going to leave Hometree."], "TSUTEY": [" Bind them."], "GUNNER": [" Roger.  CS forties. Going hot."], "PILOTS (V.O.)": [" Copy, switching missiles."], "GUARD": [" They get steak?  That’s bullshit. Let me see that --"], "TROOPER": [" I need you to shut down and step out of the vehicle!  Now!", " Target in sight.", " Right flank -- something’s coming!  It’s all lit up out there.", " Dragon is down.  It’s off the board."], "CROWD": [" Toruk Macto... Toruk Macto..."], "JAKE (cont'd)": [" Look, you chose me for somethin’. And I’ll stand and fight, you know I will. But I could use a little help here."], "TROOPER (ON RADIO)": [" We gotta get outta here! Whoever’s in charge, call for extraction!"], "PILOT": [" Mains to a hundred percent!  Get me airspeed!", " We’re good!", " Valkyrie Two is breaking off. And if any of ya’ll want to get off this piece of shit planet, you better cover our ass, ‘cause we’re the only way back to orbit.", " Are we breaking off?", " Sir, all ground units are falling back to the LZ.", " Arming."], "GUNSHIP PILOT": [" Roger that."], "JAKE (O.S.)": [" It’s all over Quaritch --"]}