{"NARRATOR (V.O.)": [" Once upon a time in the hidden heart of France, a handsome young Prince lived in a beautiful castle...", " Although he had everything his heart desired, the Prince was selfish and unkind.", " He taxed the village to fill his castle with the most beautiful objects...", " ... and his parties with the most beautiful people.", " Then, one night, an unexpected intruder arrived at the castle, seeking shelter from the bitter storm.  As a gift, she offered the Prince a single rose.", " Repulsed by her haggard appearance, the Prince turned the woman away.  But she warned him not to be deceived by appearances, for beauty is found within.", " And when he dismissed her again, the old woman’s outward appearance melted away to reveal...", " ...a beautiful Enchantress.", " The Prince tried to apologize but it was too late.  For she had seen that there was no love in his heart.", " As punishment, she transformed him into a hideous beast...", " ... and placed a powerful spell on the castle and all who lived there.", " As days bled into years, the Prince and his servants were forgotten by the world.  For the Enchantress had erased all memory of them from the minds of the people they loved.", " But the rose she had offered was truly an enchanted rose.  If he could learn to love another and earn their love in return by the time the last petal fell, the spell would be broken.  If not, he would be doomed to remain a beast for all time.", " As the years passed, he fell into despair and lost all hope.  For who could ever learn to love a beast?"], "MAID": [" Poof poof..."], "MAJORDOMO": [" Master, it’s time."], "FOOTMAN": [" Oui, maître."], "DIVA": [" Oh how divine Glamour, music and magic combine See the maidens so anxious to shine Look for a sign that enhances Chances She’ll be his special one", " What a display! What a breathtaking thrilling array Every prince, every dog has his day Let us sing with passion, gusto Fit to bust - oh Not a care in the world", " Oh, Maestro."], "BOY’S MOTHER": [" Chip!  Chip!  Oh my..."], "BELLE": [" Little town, it’s a quiet village Every day like the one before Little town full of little people Waking up to say...", " There goes the baker with his tray like always The same old bread and rolls to sell", " Good morning, Monsieur Jean.  Have you lost something again?", " To return this book to Pere Robert. It’s about two lovers in fair Verona.", " There must be more than this provincial life", " Two cities in Northern Italy.  I didn’t want to come back.", " Thank you, Pere Robert.  Your library almost makes our small corner of the world feel big.", " Oh... isn’t this amazing? It’s my favorite part because you’ll see Here’s where she meets Prince Charming But she won’t discover that it’s him ‘Til chapter three", " You’ve read it?", " Sorry, not tonight.", " No.", " Papa, do you think I’m odd?", " I don’t know.  People talk.", " Just tell me one more thing about her.", " A rose like the one in the painting.", " And every year, you bring it.", " I’ll see you tomorrow!", " Stay safe...", " The laundry.", " ...over the dark wood.", " All I wanted was to teach a child to read.", " I’m not ready to have children.", " It's a small village, Gaston.  I've met them all.", " Gaston, we could never make each other happy.  No one can change that much.", " I might be a farm girl, but I’m not simple.  I’m sorry, but I will never marry you, Gaston.", " Can you imagine?  Me, the wife of that boorish, brainless...", " I want adventure in the great wide somewhere I want it more than I can tell And for once it might be grand To have someone understand I want so much more than They’ve got planned", " Philippe?", " Who said that?  Who’s there?", " Papa!?  Is that you?", " Oh, your hands are ice.  We need to get you home.", " Who?!", " I’ve come for my father.", " Liar!", " I asked for the rose.  Punish me, not him!", " A life sentence for a rose?", " Come into the light.", " Alright, Papa.  I will leave. I need a minute alone with him.", " I should have been with you.", " Forget you?  Everything I am is because of you.", " I love you too, Papa...", " He is my father.", " Don’t hurt him!", " My room?  But I thought --", " AHHH!", " What are you?", " And you can talk.", " Why would I be startled?  I’m talking to a candle.", " Why, what’s in the west wing?", " It’s... beautiful.", " Is everything here alive? Hello, what’s your name?", " But I’m not a princess.", " Just a minute.", " You’ve taken me prisoner and now you want to have dinner with me?  Are you insane?", " And I told you no!", " I’d starve before I ever ate with you!", " I told you to go away.", " I’m so worried about him.  He’s never been on his own.", " But he said, “If she doesn’t eat with me, she doesn’t eat at all.”", " Surely you’re as trapped here as I am. Don’t you ever want to escape?", " Lumiere mentioned something about the West Wing...", " Good night.", " Nothing.", " Getting out of here!", " You have to help me... you have to stand...", " If you held still, it wouldn’t hurt as much.", " Well if you hadn’t frightened me, I wouldn’t have run away.", " Well you should learn to control your temper.", " Why do you care so much about him?", " But he has cursed you somehow. Why?  You did nothing.", " How in the midst of all this sorrow Can so much hope and love endure? I was innocent and certain Now I'm wiser but unsure", " What happens when the last petal falls?", " I want to help you.  There must be some way to lift the curse.", " So you know Shakespeare?", " Actually, “Romeo and Juliet” is my favorite play.", " Sorry?", " Like what?", " It’s wonderful.", " Have you really read every one of these books?", " Was that a joke?  Are you making jokes now?", " The air is blue and keen and cold And in a frozen sheath enrolled", " But in that solemn silence Is heard the whisper Of every sleeping thing: “Look, look at me Come wake me up For still here I be.”", " There’s something sweet and almost kind But he was mean and he was coarse and unrefined", " New and a bit alarming Who’d have ever thought that this could be?", " What are you reading?", " Guinevere and Lancelot.", " But still... it’s a romance.", " I never thanked you for saving my life.", " They know how to have a good time.", " Me, too.  The villagers say that I’m a “funny girl,” but I don’t think they mean it as a compliment.", " Almost as lonely as your castle.", " How amazing.", " Paris.", " It’s so much smaller than I imagined.", " That’s the only story Papa could never bring himself to tell.  And I knew better than to ask...", " Let’s go home.", " I don’t know...", " Could anyone be happy if they’re not free?", " Very much.", " I’d like to see my father.", " What did you say?", " Thank you.", " Open this door!  He’s hurt!", " My father’s not crazy!  Gaston... Tell him!", " I have just come from the castle and there is a beast!", " You want proof?  SHOW ME THE BEAST!", " No, don’t be afraid.  He is gentle and kind.", " He’s not a monster, Gaston.  You are. The beast would never hurt anyone.", " This isn’t over Gaston, you’ll see!", " I have to warn the beast --", " He let me go, papa.  He sent me back to you.", " He took me there.  I know what happened to maman.", " I understand.", " Yes.  Yes it is.", " Where is he?!", " NEVER.", " NO!", " I tried to stop them!", " Stop!  Gaston, no!", " No!  It’s too far!", " Of course I came back.  I’ll never leave you again.", " We’re together now.  It’s going to be fine.  You’ll see.", " No... please, no...", " Please, don’t leave me.  Come back.", " How would you feel about growing a beard?"], "VILLAGERS": [" Bonjour.  Bonjour.  Bonjour.  Bonjour.", " Is Belle", " No one fights like Gaston Douses lights like Gaston!", " No one hits like Gaston Matches wits like Gaston", " Ten points for Gaston!", " “Belle...” “Is that Belle...” dress...”"], "VAGRANT": [" Bonjour."], "BELLE (CONT’D)": [" Every morning just the same Since the morning that we came To this poor provincial town", " Have you got any new places to go?", " Come!", " Madame Gaston, can’t you just see it Madame Gaston, his little wife No sir, not me, I guarantee it", " I want much more than this Provincial life...", " What happened?  Where is Papa?!", " Take me to him!", " Who’s there?  Who are you?", " Are you so cold-hearted that you won’t allow a daughter to kiss her father goodbye? Forever can spare a minute!", " I’m not afraid. And I will escape, I promise.", " Try to get some rest.", " Each branch, each twig, each blade of grass Seems clad miraculously with glass", " And now he’s dear and so unsure I wonder why I didn’t see it there before", " True that he’s no Prince Charming But there’s something in him that I simply didn’t see!", " This is the Paris of my childhood These were the borders of my life In this crumbling dusty attic Where an artist loved his wife I thought that I would find an answer Here where his heart has always lived", " Now I see it’s empty and abandoned Easy to remember Harder to move on Knowing that the Paris of my childhood Is gone", " My father taught me to dance.  I used to step on his toes a lot.", " Papa!  What are they doing to him?!", " There is your proof!", " Will you help me now?", " I love you."], "JEAN": [" Good morning, Belle", " I believe I have.  Problem is, I can’t remember what.  Well, I’m sure it will come to me.", " Sounds boring.", " Winter in June?", " Maurice, do you have any proof of what you’re saying?", " It’s true, Belle.  He’s been raving about a beast in a castle.", " Set to sacrifice our children To his monstrous appetite!", " This place seems familiar... like I’ve been here before...", " Darling!?", " Beatrice!  Chip!  I remember!  I do!"], "JEAN (CONT’D)": [" Where are you off to?"], "SCHOOL BOYS": [" Look there she goes That girl is strange, no question"], "NASTY HEADMASTER": [" Dazed and distracted, can’t you tell?", " What on earth are you doing?"], "WASHER WOMEN": [" Never part of any crowd ‘Cause her head’s up on some cloud"], "LITTLE GIRLS": [" No denying she’s a funny girl That Belle"], "FARMER": [" Bonjour, good day, how is your family?"], "PRETTY FISHMONGER’S WIFE": [" Bonjour, good day, how is your wife?"], "CLOTHILDE": [" I need six eggs", " We have to do something.", " Crazy old Maurice.", " He’ll wreak havoc on our village If we let him wander free!", " Silence that harpsichord!", " I’ve been so lonely."], "CLOTHILDE (CONT’D)": [" That’s too expensive"], "PERE ROBERT": [" Well!  If it isn’t the only bookworm in town.  So where did you run off to this week?", " I’m afraid not.  But you may reread any of the old ones that you’d like.", " Bon voyage."], "TOM, DICK & STANLEY": [" Look -- there she goes The girl is so peculiar"], "APOTHECARY": [" I wonder if she’s feeling well"], "CHEESE SELLERS": [" With a dreamy far-off look And her nose stuck in a book What a puzzle to the rest of us Is Belle"], "VILLAGE LASSES’ MOTHER": [" Now it’s no wonder that her name means “Beauty” Her looks have got no parallel", " Very different from the rest of us"], "VILLAGE LASS #1": [" But behind that fair facade I’m afraid she’s rather odd"], "VILLAGE LASSES": [" She’s nothing like the rest of us Yes, different from the rest of us", " Look there he goes, isn’t he dreamy Monsieur Gaston, oh he’s so cute Be still my heart I’m hardly breathing He’s such a tall, dark, strong and handsome brute", " But she really is a funny girl"], "GASTON": [" Look at her, LeFou.  My future wife. Belle is the most beautiful girl in the village.  That makes her the best.", " I know.  Belle can be as argumentative as she is beautiful.", " Yes, but ever since the war I’ve been missing something.  And she’s the only girl I’ve met who gives me that sense of...", " I don’t know what that means.", " Right from the moment when I met her, saw her I said she’s gorgeous and I fell Here in town there’s only she Who is beautiful as me So I’m making plans to woo and marry Belle", " Good morning, Belle!  Wonderful book you have there.", " Well, not that one.  But, you know. Books. For your dinner table.  Shall I join you this evening?", " Busy?", " No, LeFou.  It’s the ones who play hard to get that are always the sweetest prey.", " It’s outrageously attractive, isn’t it?", " You are the wildest, most beautiful thing I’ve ever seen.  No one deserves you, but at least I know our children will be beautiful.", " What is it, LeFou?", " Oh well.  It’s hero time. I’m not done with you yet.", " Belle!  Heard you had a little trouble with the headmaster.  He never liked me, either.  Can I give you a little advice about the villagers, though? They’re never going to trust the kind of change we’re trying to bring.", " The only children you should concern yourself with are... your own.", " Maybe you haven't met the right man.", " Maybe you should take another look. Some of us have changed.", " Belle, do you know what happens to spinsters in our village after their fathers die?", " Picture it, LeFou -- a rustic cabin. My latest kill roasting on the fire. Adorable children running around us while my love rubs my tired feet.  But what does Belle say? marry you, Gaston.”", " A great hunter doesn’t waste his time on rabbits.", " As a specimen, yes, I’m intimidating", " I needed encouragement; thank you, LeFou", " Yep.", " When I hunt, I sneak up with my quiver And beasts of the field say a prayer First I carefully aim for the liver Then I shoot from behind!", " I don’t care", " I’M ESPECIALLY GOOD AT EXPECTORATING!", " When I was a lad I ate four dozen eggs Ev’ry morning to help me get large", " Who can make up these endless Refrains like Gaston?", " Ah LeFou, you’re the best.  How is it that no girl has snatched you up yet?", " I’ll help you, Maurice!", " Everyone!  Stop making fun of this man at once!", " Don’t thank me, Maurice.  Lead us to the beast.", " Look, enough is enough.  We have to turn back.", " I’m done playing this game of yours. Where is Belle?", " There are no such things as beasts, or talking teacups, or... magic!  But there are wolves, frostbite, and starvation.", " So why don’t we just turn around go back to Villeneuve?  I’m sure Belle is at home, cooking up a lovely dinner...", " Because I want to marry your daughter! Now let’s go home.", " IF YOU SAY BEAST ONE MORE TIME, I WILL FEED YOU TO THE WOLVES!", " Widows...", " Please, forgive me, old bean.  That’s no way to talk to my future father-in-law, now is it?", " If Maurice won’t give me his blessing, then he is in my way.  Once the wolves are finished with him, Belle will have no one to take care of her but me.", " Are you coming?", " Oh, Maurice!  Thank heavens.  I’ve spent the last five days trying to find you.", " Maurice, it’s one thing to rave about your delusions.  It’s another to accuse me of attempted murder.", " Agathe?  You’d hang your accusation on the testimony of a filthy hag? No offense, Agathe.", " You’re right.  Don’t take my word for it.", " Maurice, it pains me to say this, but you’ve become a danger to yourself and others.  No wonder Belle ran away.  You need help, sir.  A place to heal your troubled mind.", " Have you ever seen the inside of a mad house, Maurice?  You wouldn’t last a week.  Just give me your daughter’s hand, and I’ll set you free.", " Take him away!", " Belle, you know how loyal I am to your family, but your father has been making some unbelievable claims.", " We all admire your devotion to your father, but you’d say anything to free him.  Your word is hardly proof.", " This is sorcery!", " The monster has put her under a spell! If I didn’t know better, I’d say she even cared for him.", " I have heard of the effects of dark magic, but never seen it with my own eyes before!  This is a threat to our very existence!", " DO YOU WANT TO BE NEXT?  Fetch my horse.", " So it’s time to take some action, boys It’s time to follow me!", " Screw your courage to the sticking place", " Call it war Call it threat You can bet they all will follow For in times like this they’ll do just as I say", " Show me the castle!", " Don’t lose your nerve, LeFou.", " Sorry, old friend.  It’s hero time.", " Hello, beast.  I am Gaston.  Belle sent me.", " Were you in love with her?  Did you honestly think she’d want you?", " When we return to the village, you will marry me, and the beast's head will hang on our wall!", " No.  Don’t let me go.  Please.  Don’t hurt me, beast.  I’ll do anything."], "LEFOU": [" But she’s so well-read, and you’re so... Athletically inclined.", " Exactly, who needs her, when you’ve got us!", " Je ne sais quoi?", " It’s never gonna happen, ladies. JAM SELLER JAM SELLER", " So.  Moving on?", " Dignity?", " A certain damsel is in distress.", " Me neither.", " You know, there are other girls.", " Gosh it disturbs me to see you Gaston looking so down in the dumps Every guy here’d love to be you Gaston Even when taking your lumps There’s no man in town as admired as you You’re everyone’s fa-vor-ite guy Everyone’s awed and inspired by you And it’s not very hard to see why", " Who’s much more than the sum of his parts like Gaston?", " Well, there’s no one as easy to bolster as you!", " In a wrestling match nobody bites like Gaston!", " Is that fair?", " In a spitting match nobody spits like Gaston", " Who has brains like Gaston? Entertains like Gaston?", " And his name’s ‘G-A-S-T... ’  Uh, I believe there’s another ‘T’ in there, it just occurred to me that I’m illiterate and I’ve never actually had to spell it out loud before... Gaston!", " I’ve been told I’m clingy, but I really don’t get it...", " You will?", " Ohhh.", " You really want to marry into this family?", " Deep breaths, Gaston.  Deep breaths.", " GASTON!  STOP!  Breathe.  Think happy thoughts.  Go back to the war.  Blood, explosions, countless widows...", " Yes, yes, that’s it, that’s it...", " I saw that coming...", " For the sake of exhausting all of our options, do we maybe want to consider a less gruesome alternative?", " Wow, this is some storm.  At least we’re not tied to a tree in the middle of nowhere, right?  You know it’s not too late, we could just go get him...", " Maurice!", " Me?", " It’s a complicated question on a number of accounts, but... no.  No, he did not.", " Gaston, with all due respect --", " There’s a beast Running wild there’s no question But I fear The wrong monster’s released", " Are you not the least bit concerned that this castle might be haunted?", " You must be the talking teacup.  And you must be his grandmother.", " Gaston!", " Well I used to be on Gaston’s side, but we’re in a bad place right now."], "ALL": [" Look there she goes a girl who’s Strange but special A most peculiar mademoiselle It’s a pity and a sin She doesn’t quite fit in!", " She really is a funny girl that Belle!", " Say it again - who’s a man among men? And let’s say it once more Who’s that hero next door? Who’s a super success? Don’t you know?  Can’t you guess? Ask his fans and his five hangers-on There’s just one guy in town Who’s got all of it down...", " Be our guest!  Be our guest! Our command is your request! It’s years since we had anybody Here and we’re obsessed!", " Days in the sun Will return - we must believe As lovers do That days in the sun Will come shining through", " We’ll wait and see! A few days more"], "VILLAGE MEN": [" A beauty but a funny girl"], "GASTON (CONT’D)": [" That’s what makes Belle so appealing. She hasn’t made a fool of herself just to gain my favor.  What would you call that?", " They beg for scraps, like poor Agathe. This is our world, Belle.  For simple folk like us, it doesn’t get any better.", " And now that I’m grown I eat five dozen eggs So I’m roughly the size of a barge!", " I use antlers in all of my decorating!", " LeFou, my dearest companion, did I, your oldest friend and most loyal compatriot, try to kill the father of the only woman I’ve ever loved?", " Everything’s going to be fine.", " Look at this beast.  Look at his fangs, his claws.", " We can’t have her running off to warn the beast.  Lock her up too.", " That creature will curse us all if we don’t stop him!  Well, I say we KILL THE BEAST!", " Through the mist, through the wood Through the darkness and the shadows It’s a nightmare but it’s one exciting ride", " Say a prayer, then we're there At the drawbridge of a castle And there's something truly terrible inside It’s a beast, he’s got fangs razor sharp ones Massive paws, killer claws for the feast Hear him roar, see him foam But we’re not coming home ‘Til he's dead, good and dead... KILL THE BEAST!", " Belle?"], "MAURICE": [" How does a moment last forever? How can a story never die? It is love we must hold on to Never easy -- but we try", " My daughter?  Odd?  Where did you get an idea like that?", " Oh.  People.  This village may be small, small-minded even, but small also means safe.", " Your mother was... fearless. Fearless.", " What would you like me to bring you from the market?", " You ask for that every year.", " Then I shall bring you another.  You have my word.  Come on, Philippe!", " Tomorrow!  With the rose!", " The woods are lovely, aren’t they Philippe...?  I only wish I recognized them.  Do you know where we are? Because I don’t.", " Go, Philippe!  Hurry!", " Oh Philippe, you saved my life... They’ll have to get their dinner somewhere else.", " Hm.", " Hello?  Anyone home?", " Mm... extraordinary.", " Wherever you are, I’m just going to warm myself by the fire...", " Oh, thank you!", " It’s all right.", " Thank you.  Really, I cannot thank you enough for your hospitality... ... And kindness.", " Roses!  Yes...", " Belle, you must leave here at once. This castle is alive!  Now go, before he finds you!", " No, he means forever.  Apparently that’s what happens around here when you pick a flower.", " Belle, I won’t let you do this.  I lost your mother.  I won’t lose you too.  Now go!", " Belle, listen to me.  It’s all right. Live your life.  Forget me.", " I love you, Belle.  Don’t be afraid.", " What?!", " Belle!  I’ll come back!  I promise!", " Help!  Somebody help me!  We have to go... not a minute to lose...", " He’s got Belle... locked in a dungeon!", " A beast... a horrible monstrous beast!", " The beast is real!  Do you understand?! Will no one help me?!", " Thank you, Captain.  Thank you.", " No!  I’m sure this is the way!  Do you hear those wolves?  That means we’re getting very close to the castle.", " Stop!  That’s it!", " So that means the castle is definitely that way!", " The beast took her!", " If you think I’ve made all this up, then why did you offer to help?", " Belle is not at home!  She’s with the --", " Future father-in-law...?  You will never marry my daughter.", " Thank you... Agathe.", " No!  You tried to kill me!  You left me for the wolves!", " Ask Agathe!  She rescued me!", " Monsieur LeFou!  He was there.  He saw it all.", " Never.", " Belle?  I thought I’d lost you!", " Warn him?  How did you get away from him?", " I don’t understand.", " Then you know I had to leave her there.  I had to protect you.  I’ve always tried to protect you... too much, perhaps...", " It’s dangerous.", " Of course I could try to pick the lock.  After all, it’s only gears and springs.  But I would need something long and sharp --", " Hello.  Oh, I believe this is yours."], "MAURICE (CONT’D)": [" Sometimes our happiness is captured Somehow a time and place stand still Love lives on inside our hearts And always will Oh, good, Belle, you’re back.  Can you please hand me the --", " And the --", " No no I don’t need --", " Actually yes, that’s exactly what I need.", " Even back in Paris, I knew a girl who was so different, so daring, so ahead of her time that people mocked her until the day they found themselves imitating her.", " Whoa!", " Hmm... yes, we can go this way.  Walk on!  One path closes, another one opens.", " It’s all right boy, it’s just a bit of snow... in June.", " Philippe!", " Go!  Go!", " Water, fresh hay.  Looks like you’re set, old friend.  Rest here...", " While I pay my respects to our unwitting host... whoever that may be...", " Forgive me, I don’t mean to intrude.  I need shelter from the storm.  Hello?", " This is beautiful...", " That’s better.  Oh, much better...", " Can’t go home empty handed...  I promised Belle a rose, didn’t I?  I think it’s safe...", " Ow!", " My daughter’s life is in danger, why do you laugh!?  His castle is hidden in the woods.  It’s already winter there!", " That’s the tree.  I’m sure of it.  Of course, it was downed by lightning at the time, but now it’s been restored to an upright position, through some sort of... magic.  Or other.", " Like that.  Perfect.", " She’s very headstrong.  Do you have children?"], "WASHER GIRL": [" What are you doing?", " The blue bird flies..."], "NASTY HEADMASTER (CONT’D)": [" Teaching another girl to read?  Isn’t one enough?"], "LEFOU (O.S.)": [" Am I catching you at a bad time?"], "(MORE)": ["", "", "", ""], "LUMIÈRE": [" Must have lost his way in the woods...", " A man of taste.", " Look, Cogsworth.  A beautiful girl.", " But what if she is the one?  The one who will break the spell?", " Oh, you are very strong.  That’s a great quality!", " I am Lumière.", " What do you want to be for the rest of your life, Cogsworth: a man or a mantle clock?", " You must forgive first impressions, I hope you are not too startled.", " Candelabra, please.  Enormous difference.  But consider me at your service.  The castle is your home now, so feel free to go anywhere you like --", " Uh... nothing.  Storage space.  That’s it.", " Or as I like to call it, the only wing!  Watch your step s’il vous plait.", " Welcome to your new home.  It’s modest, but comfortable...", " Of course.  Master wanted you to have the finest room in the castle.", " I would risk anything to kiss you again, Plumette.", " How can I be strong when you make me so weak?", " Do not be alarmed, mademoiselle.  This is just your wardrobe.  Meet Madame De Garderobe.  A great singer.", " Ah, stay with us, Madame!  We have someone for you to dress!", " Mm.  Subtle.  Understated.  I love it!", " Be calm, let me do the talking.", " We thought you might appreciate the company.", " That is true.  But if the girl is the one who can break the spell, maybe you can start by using dinner to charm her. Good thinking, Cogsworth!", " You must try, master.  With every passing day, we become less human.", " Yes.  The poor thing is probably in there, scared to death.", " You see, there she is.  Now, master, remember.  Be gentle.", " And when she opens the door, give her a dashing debonair smile.  Come come -- show me the smile.", " Oh master, you’ve returned!", " Eh, I got you there!", " Another petal fell...", " I know, darling -- Ow!  I’m getting more metallic every day.", " They’re coming!  Final checks, everyone, tout de suite!", " Yes, I will make sure of it.  But did you see her stand up to him?  I am telling you, this girl is the one. They must fall in love if we are to be human again, and they can’t fall in love if she stays in her room. Eh, Chapeau, you missed a spot!", " A broken clock is right two times a day, mon ami, and this is not one of those times.", " Of course, of course.  But what is dinner without a little... music?", " Maestro Cadenza, are you ready?", " Maestro, your wife is upstairs, finding it harder and harder to stay awake. She’s counting on you to help us break this curse.", " Ma chere, mademoiselle.  It is with deepest pride and greatest pleasure that we welcome you tonight.  And now, we invite you to relax.", " Beef ragout, cheese souffle, Pie and pudding en flambé!", " Come on and lift your glass You’ve won your own free pass To be our guest If you’re stressed, it’s fine dining we suggest.", " She’s our guest!", " Pudding?!", " Checkmate.  Again.", " Mademoiselle... what are you doing?", " Go go, Froufrou!", " Please, don’t go!  It’s dangerous!", " We are eternally grateful.", " Let him sleep.", " The master remains a beast forever.  And the rest of us become...", " Knickknacks.", " Well, who indeed?", " No, Master, it’s perfect!  The rose has only four petals left.  Which means tonight... you must tell her how you feel.", " Do not be discouraged.", " You care for her, don’t you?  Well then, woo her with beautiful music and romantic candlelight...", " Don’t worry, master, you’ll do fine.", " In the dark.", " Dark and very very dusty.", " Dip dip, snip snip...", " And the pièce de résistance...", " Master... how could you do that?", " Then why are we not human?", " At least he has finally learned to love.", " Could it be?", " I know what to do.", " Watch your toes!", " We did it, Plumette.  Victory is ours.", " It’s all right, Cogsworth.", " The honor was mine.", " Cogsworth, we beat the clock!", " Plumette... mon amour...", " Oh, my Prince!", " It’s so good to see you!"], "COGSWORTH": [" Shut up, you idiot.", " He was talking about me.", " I can see it’s a girl.  I lost my hands, not my eyes.", " Of course he can talk, it’s all he ever does!  Now Lumiere, as head of the household, I demand that you put her back in the cell at once!", " Except the west wing!", " To the east wing.", " Um... that’s a hair brush.", " When she can stay awake.", " Master, I can assure you that I had no part in this hopeless plan.  Preparing a dinner, designing a gown for her, giving her a suite in the east wing --", " No no, he gave her a bedroom.", " What?!", " ...sweet...", " You can’t talk to us like that!  I forbid it!  I... I... Am I too late?  Shame.  I was really going to tell him off this time.", " Oh, very funny.", " Oh, no!  It’s -- tick tock! -- happening again -- cuckoo!  Pardon me.", " No, you don’t!  If the master finds out you violated his orders and fed her, he will blame me.", " You know she will never love him.", " Not so loud!  Keep it down!", " Music?!", " But Maestro.  Play quietly.  Please.", " No, that’s it.", " Because you cheated.  Again.", " Stop!", " Yes Froufrou, stop her!", " Who’s a good dog?", " Rubbish.  We become rubbish.", " Well, there is one --", " Well, who’d have known?", " You know, perhaps there’s something there that wasn’t there before.", " You will feel slightly nauseous.", " Chapeau, brush those teeth!", " Well, master, I may have had my doubts, but everything is moving like clockwork. True love really does win the day!", " You... WHAT!?", " But why?", " Because she doesn’t love him!  And now, it’s too late.", " A lot of good that does us if she doesn’t love him in return.", " Well, there you go.  So much for true love.  Man the barricades, and hold fast!", " We need help!", " Pardon me, master.  I’m sorry to disturb you, but --", " No... the castle is under attack!", " Good show, Chip my boy!", " And stay out!", " Oh no.", " I... can’t... TICK... Lumière, my friend... TOCK... it was an honor to serve with you.", " Lumière!", " Mon ami.", " Oh.  DEAR!", " Turn back into a clock... turn back into a clock..."], "CADENZA": [" Oops!", " It has been so long since I’ve performed!  I can barely even remember how...", " Then, I shall play through the dental pain!", " Quietly?  Sotto voce?  Of course.  Are there any other tasteless demands you wish to make upon my artistry?", " Will I tremble again To my dear one’s gorgeous refrain?", " Move aside!", " Such sweet music!  Ha ha, I’ll play you like a concerto!", " Darling!  At last!", " Bravissima!", " Darling!  No, don’t leave me!"], "CHIP": [" Mom said I wasn’t supposed to move because it might be scary.  Sorry.", " Mama, there’s a girl in the castle!", " Is she pretty?  Is she nice?  What kind of tea does she like?", " Mama, am I ever going to be a boy again?", " Pleased to meet you!  Want to see me do a trick?", " What, mama?", " What is it, what’s there?", " Okay, I’m older!", " Did you hear that, mama?  Is it her!? Is she coming back?!", " One!  Two!  Three!  Four!  Five!", " Mama!", " Mama!", " Belle, it’s me!  It’s Chip!"], "MAURICE (O.S.)": [" Belle?  How did you find me!?"], "THE BEAST (O.S.)": [" Who are you?", " Your father is a thief.", " HE STOLE A ROSE.", " LUMIÈRE!"], "THE BEAST": [" I received eternal damnation for one. I’m merely locking him away.  Now... do you still wish to take your father’s place?", " CHOOSE!", " When this door closes, it will not open again.", " You took his place.", " He’s a fool.  So are you.", " YOU’RE MAKING HER DINNER!?", " YOU GAVE HER A BEDROOM!?", " That’s the most ridiculous idea I’ve ever heard!", " She’s the daughter of a common thief. What kind of person do you think that makes her?", " You will join me for dinner!  That’s not a request.", " Will you join me for dinner?", " I told you to come down to dinner.", " Well be my guest!  Go ahead and starve! If she doesn’t eat with me, then she doesn’t eat at all!", " Show me the girl.", " WHAT ARE YOU DOING HERE!?  WHAT DID YOU DO TO IT!?", " DO YOU REALIZE WHAT YOU COULD HAVE DONE!?  YOU COULD HAVE DAMNED US ALL! GET OUT!  GO!", " ROOOOAARRRR!  Ow!  That hurts!", " If you hadn’t run away, none of this would have happened.", " Well you shouldn’t have been in the west wing.", " And therefore is winged Cupid painted blind.", " I had an expensive education.", " Why is that not a surprise?", " All that heartache and pining and -- There are so many better things to read.", " Should be something here you can start with...", " Oh.  Yes, I suppose it is...  Well, if you like it so much, then it’s yours.", " Not all of them.  Some are in Greek.", " Maybe.", " She glanced this way I thought I saw And when we touched She didn’t shudder at my paw No, it can’t be I’ll just ignore But then she’s never looked at me that way before", " Nothing.", " Well actually, King Arthur and the Round Table.  Knights, and men, and swords and things...", " All right.  I felt like a change.", " Well I never thanked you... for not leaving me to be eaten by wolves.", " Yes.  But when I enter the room, laughter dies.", " I’m sorry.  Your village sounds terrible.", " What do you say we run away?", " Another little “gift” from the Enchantress...", " It was her cruelest trick of all.  The outside world has no place for a creature like me.  But it can for you.", " Where did you take us?", " Oh, I love Paris.  What would you like to see first?  Notre Dame?  The Champs- Elysées?  No?  Too touristy?", " What happened to your mother?", " Plague.", " I am sorry I ever called your father a thief.", " I feel like a fool.  She will never love me.", " I wish you’d stop saying that!", " But how will I know?", " I haven’t danced in years.  I’d almost forgotten the feeling.", " Really?  So you think you could be happy here?", " You must miss him.", " Would you like to see him?", " You must go to him.", " You must go to him.  No time to waste.", " I let her go.", " I had to.", " No.  I’ve set her free.  I’m sorry I couldn’t do the same for all of you.", " I’ll never shake away the pain I close my eyes but she’s still there I let her steal into my melancholy heart It’s more than I can bear", " She’s not coming back.", " It doesn’t matter now.  Just let them come.", " Belle?", " Stay there!  I’m coming!", " I AM NOT A BEAST.", " You came back.", " I’m afraid it’s my turn to leave.", " At least I got to see you one last time."], "LUMIÈRE (O.S.)": [" Forgive my intrusion, mademoiselle, but I have been sent to escort you to your room.", " What?  That once this door closes it will not open again, RARRR?  I know, he gets so dramatic."], "LUMIÈRE (CONT’D)": [" ‘Allo.", " Ready, miss? Trust me.", " This way, please!", " Oh dear!  We were not expecting guests.", " Oh mon dieu.", " Stand up straight! It’s time to sparkle!", " I have no taste buds, but I can tell this is exquisite.", " Let us pull up a chair... as the dining room proudly presents...", " ... your dinner. Be our guest, be our guest", " Put our service to the test Tie your napkin ‘round your neck, cherie And we provide the rest!", " Soup du jour, hot hors d’oeuvres Why we only live to serve Try the grey stuff, it’s delicious", " Don’t believe me?  Ask the dishes!", " They can sing, they can dance After all, miss, this is France!", " And a dinner here is never second best Go on unfold your menu", " We’ll prepare and serve with flair A culinary cabaret!", " You’re alone and you’re scared But the banquet’s all prepared!", " No one’s gloomy or complaining While the flatware’s entertaining!", " We tell jokes, I do tricks With my fellow candlesticks", " Oui our guest Be our guest, be our guest!", " Life is so unnerving For a servant who’s not serving", " He's not whole Without a soul to wait upon", " Ah, those good old days when we were useful Suddenly, those good old days are gone", " Too long we’ve been rusting Needing so much more than dusting Needing exercise A chance to use our skills", " Most days we just lay around the castle Flabby, fat and lazy", " You walked in, and oops-a-daisie!", " And who’d have guessed They'd come together on their own?", " Start with the hair!  Women love nice hair.", " OK, I can fix this!", " Sacrebleu!  Invaders.", " Bon voyage!  Safe trip home!", " Plumette...?  Oh!  My dear Plumette..."], "COGSWORTH (CONT’D)": [" Which we do not have.", " What?  No, it’s not playtime!  Bad dog!  Bad dog!", " Excellent!  The infantry’s arrived. Now go and teach them a lesson!", " Yes, those are called books, you third- rate musketeers!", " Oh, I’m off!", " Ah, terribly sorry, pardon me, I’m just a clock!", " Lumière... I... TICK... can’t... CHIME... speak..."], "PLUMETTE": [" Enchanté, Mademoiselle!  Don't worry, I'll have this room spotless in no time!", " No, my love.  I've been burned by you before.  We must be strong.", " ...charming...", " He’s losing it...", " Lumière, I grew three more feathers! And I just plucked yesterday.", " Lightly used houseware.", " Well, who’d have thought?", " Yes, and when the moment’s just right...", " Covered in dust.", " Eyes closed, poof poof!", " But she might still come back --", " No one to protect you now, eh?!", " Lumière, look!", " You saved our lives, mademoiselle."], "PLUMETTE (CONT’D)": [" This plan of yours is... dangerous."], "GARDEROBE": [" Cogsworth!  A diva needs her beauty rrr-", " Finally.  A woman.  Pretty eyes. Proud face.  Perfect canvas.  Yes!  I will find you something worthy of a princess.", " Nonsense!  Now, let’s see what I’ve got in my drawers.", " Froufrou, send my love to the maestro!", " WHAT!?  WHAT TIME IS IT!?", " Yes.  We all think so.", " Go.", " O I could sing Of the pain these dark days bring The spell we’re under Still it’s the wonder of us I sing of tonight", " Beautiful.  But something is missing.", " Yes, that’s it... put it on... pretty little boys!", " Maestro!", " I’m coming, my love!  That’s it!  The fat lady is singing!", " Oh, maestro!  You were so brave! Goodbye, my love...", " Tale as old as time Tune as old as song Bittersweet and strange Finding you can change Learning you were wrong"], "GARDEROBE (CONT’D)": [" Oh, how embarrassing.", " Come here, Froufrou.  Come help mama!", " Perfetta!", " Ahh, yes.  The finishing touch.", " Go!  Be free!  Be free!  Be FREE!"], "“Awww!”  LeFou decides it’s time to cheer": [""], "LEFOU (CONT’D)": [" No one’s slick as Gaston No one’s quick as Gaston No one’s neck's as incredibly thick as Gaston For there’s no man in town half as manly Perfect, a pure paragon! You can ask any Tom, Dick or Stanley And they’ll tell you whose team they prefer to be on!", " Too much?", " It’s just, every time I close my eyes, I picture Maurice stranded out there. And then when I open them, he’s --", " Gaston... help..."], "TOM/DICK/STANLEY": [" Who plays darts like Gaston? Who breaks hearts like Gaston?"], "LEFOU/VILLAGERS": [" My what a guy, that Gaston!"], "TAVERN KEEPER": [" Whoa.  Slow down, Maurice.", " Who’s got her?", " Gaston, did you try to kill Maurice?"], "MRS. POTTS": [" Yes, Chip.  We know.  Slow down.", " We’ll find out soon enough.  Slow down before you break your handle!", " Oh, you can’t judge people by who their father is, now can you?", " Gently, master.  The girl lost her father and her freedom in one day.", " Exactly.", " ...kind...", " Everyone, calm yourselves.  We still have time.", " Yes, Chip.  You’ll have your days in the sun again.  You just leave it to me.", " Chip. That was a very brave thing you did for your father, dear.", " Cheer up, my poppet.  Things will turn out in the end.  You’ll feel a lot better after dinner.", " People say a lot of things in anger.  It is our choice whether or not to listen. Coming?", " There you are, dear.", " It’s a guest, it’s a guest! Sakes alive, and I’ll be blessed! Wine’s been poured and thank the Lord I’ve had more napkins freshly pressed!", " We’ve got a lot to do -- Is it one lump or two? For you our guest!", " She’s our guest!", " The master’s not as terrible as he appears.  Somewhere deep in his soul, there’s a prince of a fellow, just waiting to be set free.", " Never you mind about that.  Off to bed with you, poppet.", " Nighty-night.  Straight to bed!", " You don’t want to go out there!", " What part of ‘stop her’ don’t you understand, dog?!", " Oh my...", " Thank you, Miss.", " We’ve looked after him all his life.", " You’re quite right there, dear.  You see, when the master lost his mother, and his cruel father took that sweet innocent lad and twisted him up to be just like him... we did nothing.", " Oh those days in the sun What I'd give to relive just one Undo what's done And bring back the light", " Antiques.", " It’s not for you to worry about, lamb. We’ve made our bed and we must lie in it.", " Well, bless my soul!", " It’s so peculiar, wait and see.", " There may be something there that wasn’t there before.", " I’ll tell you when you’re older.", " Oh Chip, you are a one!", " Just stop being a coward and tell Belle how you feel.  And if you don't, I promise you'll be drinking cold tea for the rest of your life.", " I’ll take the fingers and toes!", " Tale as old as time True as it can be Barely even friends Then somebody bends unexpectedly", " Just a little change Small to say the least Both a little scared Neither one prepared Beauty and the Beast", " Because he loves her.", " No.  This is the first time I’ve had any real hope she would.", " Ruffians!", " This isn’t working!", " Grand-mother?  ATTACK!", " How do you take your tea?!  Piping hot?!  Or boiling?!", " Oh!  Thank you.", " You’re too good for him anyway...", " CHIP!  CHIP!  Have you seen Chip!?  He ran off!  Oh, where is my little boy --", " Oh, Chip!  What did I tell you?  Look at you -- you’re a little boy again! Oh you smell so good!", " Mr. Potts!", " Winter turns to spring Famine turns to feast Nature points the way Nothing left to say Beauty and the Beast"], "CUISINIÈR": [" Heads up, Mrs. Potts!", " Off!  Off me while I work!  Pepper, get cracking!  Salt, shake a leg!"], "THE BEAST (CONT’D)": [" Idiots!", " A book that truly allows you to escape.", " Think of the place you’ve most wanted to see.  First, see it in your mind’s eye.  Now feel it in your heart.", " There is no one.", " It’s foolish, I suppose, for a creature like me to hope that one day he might earn your affection.", " No.  Keep it with you.  And you’ll always have a way to look back on me.", " Now go.  Our time is almost past.", " I was the one who had it all I was the master of my fate I never needed anybody in my life I learned the truth too late", " Now I know she’ll never leave me Even as she runs away She will still torment me, calm me, hurt me, move me come what may", " Wasting in my lonely tower Waiting by an open door I’ll fool myself she’ll walk right in And be with me for evermore", " I rage against the trials of love I curse the fading of the light Though she’s already flown so far beyond my reach She’s never out of sight Now I know she’ll never leave me Even as she fades from view She will still torment me, be part of everything I do Wasting in my lonely tower Waiting by an open door I’ll fool myself she’ll walk right in And as the long long nights begin I’ll think of all that might have been Waiting here for evermore", " BELLE!  You came back!", " Go.  Get out."], "MRS. POTTS (O.S.)": [" Don’t worry, dear.  It’s only Mrs. Potts."], "MRS. POTTS (CONT’D)": [" Oh, aren’t you a vision!  How lovely to make your acquaintance.", " It’s a very long journey.  Let me fix you up before you go.  I have found that most troubles seem less troubling after a bracing cup o’ tea.", " Slowly now, Chip.", " With dessert, she’ll want tea And my dear, that’s fine with me! While the cups do their soft shoeing, I’ll be bubbling, I’ll be brewing!", " I’ll get warm, piping hot Heaven’s sake, is that a spot?", " Clean it up, we want the company impressed!", " Stop her!", " Ever just the same Ever a surprise Ever as before Ever just as sure As the sun will rise Tale as old as time Tune as old as song Bittersweet and strange Finding you can change Learning you were wrong", " Certain as the sun Rising in the East Tale as old as time Song as old as rhyme Beauty and the Beast", " Tale as old as time Song as old as rhyme Beauty and the Beast", " Mister Potts?!", " Nicely handled!", " Shall we get back to it, then?!"], "CADENZA (CONT’D)": [" Another cavity."], "LUMIèRE (CONT’D)": [" Take a glance and then you’ll Be our guest, be our guest"], "LUMIÈRE AND COGSWORTH": [" Be our guest!"], "CHANDELIER CANDLESTICKS": [" And it's all in perfect taste That you can bet!"], "COGSWORTH, LUMIÈRE, MRS. POTTS": [" She’s our guest!"], "ALL (CONT’D)": [" With your meal, with your ease, Yes indeed, we aim to please", " While the candlelight’s still glowing, Let us help you, we'll keep going -- Course by... COURSE!  One by one! Til you shout “Enough, I’m done!” Then we’ll sing you off to sleep as you digest Tonight you’ll prop your feet up But for now let’s eat up... Be our guest!  Be our guest! Be our guest!  Please!  Be our guest!!"], "YOUNG PRINCE": [" Days in the sun When my life has barely begun"], "YOUNG PRINCE (CONT’D)": [" Not until my own life is done Will I ever leave you"], "LUMIÈRE & PLUMETTE": [" Will you now forever remain Out of reach of my arms?"], "AGATHE": [" Drink."], "BELLE (O.S.)": [" Love can transpose to form and dignity.  Love looks not with the eyes but with the mind.  And therefore --", " STOP!"], "BEAST": [" I feel as if I’m seeing it for the first time.", " I saw her in the ballroom, and I said, well, you’re making this so beautiful, we should have a dance tonight.  I never thought she’d actually say yes!  What was I thinking?!"], "BEAST (CONT’D)": [" Is there more?"], "ALL (CONT'D)": [" There may be something there that wasn’t there before."], "DOCTOR": [" You must leave.  Now."], "BELLE’S MOTHER": [" Quickly... before it takes her too..."], "LUMIÈRE (CONT'D)": [" She is the one."], "MONSIEUR D’ARQUE": [" I’m afraid we can’t do that, miss.  But we’ll take very good care of him."], "TOM": [" We’re not safe until he’s dead"], "DICK": [" He’ll come stalking us at night"], "MOB": [" Light your torch, mount your horse!", " We’re counting on Gaston to lead the way", " Sally forth, tally ho Grab your sword, grab your bow Praise the Lord and here we go!", " Raise the flag, sing the song Here we come, we’re fifty strong And fifty Frenchmen can't be wrong Let’s kill the beast!", " Kill the beast!  Kill the beast!", " Kill the beast!  Kill the beast!", " Kill the beast!  Kill the beast!"], "CASTLE STAFF": [" Hearts ablaze, banners high We go marching into battle -- Unafraid although the danger just increased"], "GASTON (O.S.)": [" I’m coming for you, beast!"], "PRINCE": [" Belle..."], "MAESTRO": [" Oh, Madame."], "CLOTHILDE (O.S.)": [" Henry?"], "THE PRINCE": [" Hello, old friend."], "ALL (V.O.)": [" Certain as the sun Rising in the East Tale as old as time Song as old as rhyme Beauty and the Beast"]}