{"scenarios": ["EXT. CASTLE GROUNDS - NIGHT", "A MAGNIFICENT CASTLE.  Resplendent, bespeaking great wealth and *", "power.  The grounds and stonework immaculate.", "RACK FOCUS to a single RED ROSE clinging to a rose bush on a", "stormy spring night.  A WEATHERED HAND plucks the rose.", "INT. BALLROOM ENTRANCE - CASTLE - NIGHT", "TIGHT ON THE PRINCE being groomed by his servants.", "see their faces.)  A FRENCH MAID paints an exotic animal mask", "on the Prince’s face with a feather brush.  A TALL VALET drapes", "the Prince with an elaborately bejeweled coat.", "The MAID dusts his wig with powder -", "- while a MAJORDOMO holds a POCKET WATCH, indicating that they", "are running late.", "With a haughty wave, the Prince instructs his FOOTMAN to", "bring more light.", "A CANDELABRA is lifted to the preening Prince as he looks at", "himself in an ornate HAND MIRROR.", "INT. BALLROOM - CASTLE - NIGHT", "The ornate room is filled with BEAUTIFUL PEOPLE from all", "corners of the world, each on display for the Prince’s", "pleasure.  A circle of eligible maidens bow their heads.", "Seated in a throne chair dominated by a majestic COAT OF", "ARMS, the Prince snaps his fingers impatiently at an ITALIAN", "MAESTRO, who smiles, revealing comically rotten teeth.", "The maestro sits at a harpsichord and motions to his wife, a", "LARGE DIVA holding a TINY BICHON FRISÉ.  As the music begins,", "the Prince steps forward.", "The diva fills the room with a voice as big as her frame.", "The Prince performs a ROUNDELAY with several debutantes:", "INT. BALLROOM - CASTLE - NIGHT", "The dance speeds up.  The Prince connects momentarily with a", "beautiful woman -- but quickly moves on when his eye catches", "someone even more dazzling:", "KNOCK KNOCK.  The Prince stops.  Then a gust of wind blows open *", "the windows.  Sconces flicker and go dark.  The figure enters", "in silhouette, hobbling on a CANE.", "Furious, the Prince grabs a lit candelabra from the Footman.", "He rudely pushes through the crowd, sweeping people from his", "path.  He crosses to the windows, finally revealing --", "AN OLD BEGGAR WOMAN shivering from the rain.  She looks to the", "Prince with hope and offers him -- A RED ROSE.", "The PRINCE’S HAND waves her off.  The woman begs on her knees.", "The Prince motions to the staff.", "The majordomo and footman approach to usher her out.  The woman *", "lowers her head as if to cry --", "Suddenly, the old woman’s cape and hood cocoon.  AN ERUPTION OF", "LIGHT as she transforms into...", "The wind picks up inside the room.  Frightened, the Prince", "falls to his knees.", "As the Prince begs for mercy, his body begins to transform.", "His jewelry pops off.  His clothing rips as he grows larger.", "The guests scream in horror and flee.  But pushing his way", "through the crowd, A YOUNG BOY slips into the ballroom,", "watching in wonder as -- the PRINCE’S SHADOW twists into the", "SHADOW OF A HIDEOUS BEAST.", "The boy’s mother frantically follows him inside --", "-- just as the doors slam shut, leaving the staff, the", "entertainers and the dog trapped in the room.", "INT. BALLROOM - CASTLE - NIGHT", "CLOSE ON a portrait of the handsome prince -- as the beast’s", "giant paw slashes it.", "EXT. CASTLE - NIGHT", "Years later, the enchanted castle stands isolated.  The", "property is surrounded by an ice hedge.  The only sound is the", "grim winter wind.  As we move closer:", "EXT./INT. BEAST’S LAIR - WEST WING - CASTLE - NIGHT", "At the highest window of the west wing, we see THE BEAST.  The", "ROSE, already wilting, floats before him.  To protect it, the", "beast has covered it with a glass bell jar.", "TIGHT ON THE ROSE -- another petal drops.", "EXT. BELLE’S COTTAGE - MORNING", "The front door of a cozy cottage opens to reveal -- BELLE, a", "pure beauty blessed with intelligent, fiercely inquisitive eyes.", "With book in hand, she takes a deep breath of morning air and", "gazes toward the church which peeks above the village rooftops.", "Belle looks at the clock on the church counting to 8am.  Wait", "for it.", "EXT. VILLAGE OF VILLENEUVE - MORNING", "On cue, the villagers begin their day.  A HOUSEWIFE opens a", "window, nods to a WOMAN shaking out a rug nearby.  A BUTCHER", "opens his shop, waves to a COBBLER moving past with his cart.", "An old VAGRANT is the only one to notice Belle, smiling at her *", "as he’s tossed inside a HOLDING TANK by two GENDARMES.", "Belle weaves between the villagers, making herself invisible.", "She passes a harried BAKER, buys a baguette --", "Belle approaches JEAN, the potter, tending to his MULE.", "Jean scratches his head, trying to remember something.  He", "searches his cart which is loaded with pottery.", "As she leaves:", "Later -- Belle passes SCHOOL BOYS as they march into the school *", "house.  Their heads turn in unison.", "The NASTY HEADMASTER ushers them in impatiently.", "As the boys scramble into school, Belle steps on the stones", "over the duck pond -- revealing GIRLS forced into “woman's", "work” chores, washing clothes in the circular laverie.", "They’re surrounded by women kneading clothes on barrels.", "A FLIRTATIOUS FARMER approaches a PRETTY FISHMONGER’S WIFE.", "THE FISHMONGER pops up next to his wife, sending the would-be-", "Lothario into retreat.  Another fishmonger, the shrewish", "CLOTHILDE, accosts him:", "The FARMER points out the price.  Belle moves past.", "INT. CHURCH VESTRY - DAY", "Belle escapes into the peace and serenity of a country", "church.  Jolly PERE ROBERT looks up as she enters.", "Belle hands “Romeo and Juliet” to Pere Robert, who dutifully", "returns it to the shelves of the town’s “library”: a COUPLE", "DOZEN BOOKS in total.  She remains hopeful.", "He smiles.  Belle picks up a new book and smiles back.", "EXT. VILLAGE OF VILLENEUVE - DAY", "ANGLE ON BELLE -- nose planted in her book, she walks down", "into the crowded market which is just being set up.  Belle", "passes TOM, DICK, and STANLEY - all burly, tough guys.", "Belle buys jam then glides past an APOTHECARY’s open cart:", "Belle ducks under CHEESE SELLERS carrying their trays:", "Behind her, FLORISTS pass with huge bouquets.  It’s a glorious", "parade but Belle remains oblivious as she continues to read...", "Three fashion-crazed VILLAGE LASSES -- all dressed in the same", "style -- pop their heads from the windows of the dress shop.", "Their MOTHER, who is besotted with Belle, heads outside when", "she sees her:", "Her daughters follow, seething with jealousy:", "Belle slips through the crowd.", "EXT. VILLAGE PROMONTORY - DAY", "Looking down on the village is GASTON, a dashingly handsome", "war hero clad in a dazzling gold breastplate.  The only thing", "bigger than his muscles is his ego.  Strapped on his saddle", "is a musket and the spoils of his hunt: rabbit, fox, and", "fowl.  Riding beside him is Gaston’s long-suffering aide-de-", "camp and devoted best friend LEFOU.", "Through his spyglass, Gaston spots Belle.", "EXT. VILLAGE OF VILLENEUVE - DAY", "Gaston and LeFou ride through the village gates.  Gaston", "motions toward Belle in the village square.  Geese flock", "around her feet, seeming to follow her.", "As Gaston passes, the lasses try to catch his eye.", "As Gaston dismounts, the lasses get splattered with mud from", "his horse’s hooves.  LeFou shoots them a look, whispers:", "Noticing Belle crossing the market, Gaston starts off in", "pursuit.  He grabs flowers from the PERFUME STALL and makes a", "bouquet.  As they each make their way through the market:", "Bonjour!", "Good day.", "You call this bacon?", "Some cheese...", "...One pound.", "I’ll get the knife.", "This bread...", "It’s stale!", "There must be more than this", "provincial life!", "The image swells to reveal the whole village, singing.", "Slightly out of breath, Gaston finally catches up with Belle.", "A mortified smile and Belle is off.  LeFou approaches.", "Gaston looks at the village lasses standing outside of the", "tavern.  They all give him the eye.  Gaston saunters over.", "EXT. BELLE’S COTTAGE - DAY", "Belle hears the tinkle of a sweet MUSIC BOX tune wafting out of *", "her father’s basement workshop.", "INT. CELLAR WORK ROOM - BELLE’S COTTAGE - DAY", "Belle descends into to her father’s dusty work room.  Sunlight *", "spotlights MAURICE hunched over his workspace.  Belle quietly", "watches as he sings along with the music box theme.", "Maurice tinkers with gears on the box, which depicts an artist *", "in a Parisian garret, painting his wife’s portrait as she holds", "a red rose above their baby.", "Before he can say the word “screwdriver” it’s in his hand.", "Tweezers.  Then Belle hands him a small hammer...", "... just as a spring pops off.", "He goes back to tinkering.  Belle gazes at other music boxes,", "each a small work of art, depicting famous landmarks from", "around the world.", "Maurice can see this line of argument doesn’t do much for his", "daughter.", "Maurice turns to the music box as if to change the subject.", "But looking back up to Belle’s eagerness, he relents.", "With that, Maurice closes his music box.", "EXT. BELLE’S COTTAGE - DAY", "As Maurice carefully loads his music boxes onto his wagon,", "Belle tends to the family’s old glue horse, PHILIPPE.", "Maurice climbs into the wagon, and smiles down at his", "daughter.", "As Maurice rides away, Belle’s warmth gives way to concern.", "INT. BELLE’S COTTAGE - TACKROOM - DAY", "Surrounded by design sketches, Belle’s workbench features a", "small model of her ‘washing machine’ prototype.  Belle places", "the miniature barrel in position... fastens a rope to a", "leather strap... shaves chips off a block of soap... collects", "the soap chips in a small sack... and rushes out.", "EXT. VILLAGE OF VILLENEUVE - LAVERIE - DAY", "A young WASHER GIRL watches as --", "Belle tosses clothes and some soap chips into an empty BARREL", "and rolls it into the fountain!  It bobs on its side.  Tying th", "other end of the strap to the mule’s harness, she sets him", "walking around the circular laverie...", "With a smile, Belle points to the rotating barrel, which now", "resembles a very early Whirlpool washing machine.  Belle takes *", "her book and quietly begins to read.  After a moment, she looks *", "up to find the washer girl staring at her, speechless.", "Belle waves for the girl to join her.", "EXT. VILLAGE OF VILLENEUVE - LAVERIE - DAY (LATER)", "The NASTY HEADMASTER emerges from the school house to see --", "The barrel is now filled with sudsy clothes.  Belle is sitting", "with the washer girl.  She holds a book open, teaching the girl *", "to read.", "He is joined by the fishmonger CLOTHILDE, outraged.", "Belle locks eyes with the headmaster, then turns back to the", "girl.  The headmaster seethes.", "EXT. VILLAGE OF VILLENEUVE - LAVERIE - DAY (LATER)", "Belle’s washing machine is hauled out of the laverie and", "dumped onto the ground.  She collects her laundry from the", "dirt, trying to remain poised before the gawking crowd.", "EXT. VILLAGE OF VILLENEUVE - DAY (LATER)", "Gaston shakes his head and laughs, absolutely smitten.", "A reverse angle reveals Gaston was addressing his reflection", "in a shop window.", "And he’s off.  LeFou steps up to the mirror.", "EXT. BELLE’S COTTAGE - DAY (LATER)", "Gaston follows Belle back to her cottage.", "Pursuing her into her garden, he trampling cabbages.", "Belle looks for a way out.  She doesn’t like where this is", "going.", "She climbs the steps to her cottage door.  Gaston follows", "close behind.", "Gaston motions to the street, where we find AGATHE, a", "spinster, late 30’s, dirty and homeless, rattling her cup:", "“alms for the poor?”", "Gaston keeps the gallant smile plastered as she shuts the door", "in his face.", "EXT. BELLE’S COTTAGE - SUNSET", "Belle watches Gaston leave.  She opens the door.", "She turns away from the home she thinks she will never", "escape.", "EXT. VILLAGE PROMONTORY - SUNSET", "Belle races up the hills to the outskirts of town.  When she", "reaches the highest point, we circle around to reveal the town", "spread out beneath her.", "As the last rays of light fade we RISE to reveal a forest in th", "distance, where the skies begin to rage.  A swirling wind and a *", "streak of...", "EXT. WOODS - EVENING", "Lightning.  The sky flashes.  The wind picks up.  Worried,", "Maurice urges Philippe on.", "As the woods get darker, a WITHERED TREE that looks like an", "ELDERLY PERSON’S CANE is struck by lightning.", "The tree splits in two, one half falling into the road,", "revealing... a HIDDEN PATH.  Philippe whinnies nervously.", "They leave the blocked road and head down the path.  Maurice", "looks down to see a light snow cover on the ground.  Philippe", "snorts.", "And they descend into --", "EXT. ENCHANTED WOODS - EVENING", "We have entered another world.  A light, whirling snow", "descends on Maurice, dusting his coat.  The clippity-clop of", "hooves echo in stillness.", "Suddenly, A WHITE WOLF roars out of the bushes, barely missing *", "them.  Gaze darting, Maurice notices WHITE WOLVES running on an *", "icy ledge above him.  The wolves keep pace, massing to overrun", "him.", "Maurice urges his horse on, but his rickety cart starts to", "buckle.  A HARNESS IS LOOSE.", "The wolves leap in front of the cart, which comes undone,", "tipping over on its side.  The chest of music boxes smashes ope", "on the ground.  Maurice is launched up onto a ridge -- and find", "himself face-to-face with the snarling and scarred ALPHA WOLF.  *", "Terrified, Maurice turns and begins sliding down the snowy ridg", "-- towards a trio of wolves waiting below.", "As Maurice drops from the ridge, Philippe appears beneath him -", "and Maurice lands on his back!", "Philippe rides.  PAWS crush twigs -- SLAVERING JAWS -- EYES mad *", "with hunger -- a gleam of FANGS -- Philippe gallops.  Maurice", "races toward the CASTLE ICE GATES -- which churn open as the", "wolves draw near.", "Maurice and Philippe speed through the gates as the wolves skid", "to a stop, their HOWLS turning to YELPS OF FEAR.", "EXT. CASTLE GROUNDS - EVENING", "Maurice stares in open-mouth awe at THE BEAST’S CASTLE.  A grey *", "edifice seemingly growing out of stone and reaching to troubled *", "skies.  It feels like a place hiding its face from the world.", "ANGLE ON MAURICE -- as he draws near the castle, he notices a", "colonnade filled with WHITE ROSE BUSHES.  Just beyond, he sees *", "the door to the STABLES swinging in the wind.  A LAMP has been *", "lit inside.  As if inviting a tired traveler.", "Maurice strokes Philippe’s neck.", "Warily, Maurice peers out at the intimidating castle.", "He leaves.  Philippe stares uneasily at a statue of a horse.", "EXT. TERRACE - CASTLE - EVENING", "Cautiously, Maurice approaches the castle door.  He gazes up at", "a row of TORCHES held by sculpted iron hands.  The hands are so", "life-like, does a double-take.", "Then --", "INT. FOYER - CASTLE - NIGHT", "-- the DOOR OPENS with a creak.  Maurice peers in.", "Silence.  Flashes of lightning illuminate a once-elegant space", "now fallen into disrepair.", "Maurice puts his hat and coat on a COAT RACK at the entrance.", "Maurice turns, not seeing the coat rack shake the snow off.", "Maurice explores, scanning the room and its FURNITURE --", "TABLES, CHAIRS, A FEATHER DUSTER.  A MANTLE CLOCK AND", "CANDELABRA SIT ON A TABLE.  As Maurice passes them, the", "candelabra slowly TURNS -- as if watching him.  This is", "LUMIÈRE, formerly head footman to the Prince.", "The candelabra continues craning -- while the mantle clock", "beside it remains rigid.  Meet COGSWORTH, every bit the stiff-", "upper-lip majordomo.", "Hearing this, Maurice spins -- but sees only an ordinary", "candelabra and clock on the table.  Curious, he approaches,", "leaning down to the clock...", "He picks up the candelabra, inspecting it.", "An echo of eerie harpsichord music makes Maurice turn toward", "the ballroom.  He places the candelabra back down and exits.", "INT. BALLROOM - CASTLE - NIGHT", "Maurice walks through a door into a dark cavernous room.  His", "eyes adjust to the light and he realizes he’s in a VAST", "BALLROOM.  Once the scene of joy, the ballroom knows only solemn", "decay.  Suddenly --", "-- The harpsichord stops playing.  Wary, Maurice goes back to --*", "INT. FOYER - CASTLE - NIGHT", "Maurice crosses to a crackling fire, speaking to his unseen", "host.", "Maurice warms his frozen fingers, rubs his hands together to", "spread the heat.", "As Maurice turns to warm his backside, he hears the clink of", "silverware from an adjoining room.", "INT. DINING ROOM - CASTLE - NIGHT", "Maurice enters to find a vast dining room dominated by a", "BANQUET TABLE where a meal has been set out.", "Famished, Maurice sits, tears off a hunk of bread and devours", "it ravenously.", "As Maurice looks around for something to wash down the food, a *", "CUP OF TEA slides into his hand.  Maurice calmly gives the cup ", "double-take.  Meet CHIP, an 8 year-old boy tea cup.  He", "whispers:", "Maurice chews, smiles benevolently.", "And bolts from the table.", "INT. FOYER - CASTLE - NIGHT", "Like any sane person, Maurice backs toward the door.  He bows", "and calls into the shadows...", "A flash of lightning briefly illuminates a BEASTLY SHAPE on the", "staircase.  At the next flash -- THE SHAPE IS GONE.", "EXT. CASTLE GROUNDS - NIGHT", "Maurice rides Philippe away from the castle.  He notices the", "colonnade filled with rose bushes again.", "Maurice dismounts, checking to see that he hasn’t been", "followed from the castle.  He strokes his nervous horse,", "leaving him outside as he enters.", "We catch GLIMPSES of A DARK SHAPE moving atop the colonnade.", "A taloned PAW.  A swishing TAIL.", "Philippe snorts, sensing danger.  Maurice spies a single", "PERFECT WHITE ROSE among the others.", "CLOSE on the beast’s EYES.  Enraged.  Wounded.", "Maurice reaches for it.", "Pricked by a thorn, he pulls his hand back -- then tries", "again.  He PICKS the rose -- only to hear a booming ROAR from", "above.", "ANGLE ON MAURICE -- terrified as the dark shape leaps down", "from the colonnade.  Maurice drops the rose, stumbling and", "falling as a DARK SHADOW is cast over him.", "Philippe breaks his harness, whinnies in terror and flees,", "charging through the castle grounds and out the ice gates.", "EXT. VILLAGE PROMONTORY - DAY", "A first whisper of dawn as Philippe bursts out of the forest.", "He thunders down to the village.", "EXT. BELLE’S COTTAGE - DAY", "The sun is fresh on the horizon, and Belle is already up.  A", "whinny disturbs her.  She looks up to find Philippe, thirsty", "and exhausted.", "Belle puts strokes the horse’s neck as he drinks deeply from th", "trough.", "Belle goes still.  Notices Philippe’s torn straps and tattered", "reins.  In dread, her gaze darts to the woods.", "EXT. WOODS - DAY", "Sunlight barely seeps through the thick branches lighting", "Belle’s way as Philippe gallops past the FALLEN CANE TREE.", "EXT. ENCHANTED WOODS - DAY", "Belle races through the enchanted woods, coming upon Maurice’s *", "tipped over wagon.  She sees the broken chest and scattered", "music boxes.", "With a mix of apprehension and determination, Belle sets her", "jaw, and continues the gallop until the path brings her to...", "EXT. TERRACE - CASTLE - DAY", "Belle dismounts Philippe.  Finding a THICK BRANCH, she wields i", "like a club, then bravely crosses to the castle and enters.", "INT. FOYER - CASTLE - DAY", "Club held high, ready to defend herself, Belle cautiously eases", "the door open and peeks inside.", "The atmosphere of the castle presses in on Belle.  Creepy DRAGO", "STATUES on the staircase seem like they're watching.  Eerie", "SHADOWS stretch down impossibly long hallways.", "Belle reacts.  Quickly moves towards the voices --", "Belle reaches the spot where she heard the voices.  No one", "there.  Only a clock and candelabra.  Suddenly, a COUGH echoes", "through the castle.  Belle grabs the candelabra and climbs a", "long staircase.  The clock shudders with dread.", "INT. PRISON TOWER - CASTLE - DAY", "Belle follows the cough up a labyrinth of stairs until she", "reaches the dark prison tower and a GRATED IRON DOOR.", "Belle sees Maurice through a grate in the door.  He looks", "terribly pale and sick, coughing.", "Belle puts the candelabra down and clutches his hands.", "The beast roars.  Belle spins quickly, swinging her club to", "strike, but the figure jumps onto another staircase.  Belle", "searches the shadows.  The voice circles her.", "In Belle’s wide eyes, we see her guilt.", "The figure remains still.  Belle grabs hold of Lumiere and", "thrusts the candle forward, illuminating a HIDEOUS HORNED", "FACE.  Belle’s eyes go wide as she clearly sees THE BEAST.", "The only part of him that seems human are his eyes.  BLUE.", "DEEP.  SOULFUL.  And flicked with pain when he sees Belle’s", "revulsion.", "Maurice falls into a terrible coughing fit.", "The beast doesn’t respond.", "Intrigued by her defiance, the beast moves toward her, reaching", "out with his massive paw.  Belle closes her eyes, bracing", "herself for his retaliation.  Instead, she hears -- CLANG.", "Belle opens her eyes to find herself eye to eye with the beast’s", "chest.  He has reached high above her head to pull down an iron", "lever, unlocking the door.", "INT. PRISON CELL - CASTLE - CONTINUOUS", "Belle rushes in and embraces her father.", "She pulls him close.", "With that, she pivots and swings her father through the door", "just as the beast slams it shut.  Maurice trips to the ground,", "giving the beast a second to turn to Belle.  They lock eyes.", "The beast turns and drags Maurice away.", "Through the latticework, Belle sees the beast and her father", "disappear down the corridor.  She rushes to the window and", "watches the beast carry her father down the spiral staircase", "of the prison tower.", "Once she is alone, Belle cannot help herself.  She slumps to", "the floor and the tears come.  We FADE OUT.", "OMITTED", "OMITTED", "OMITTED", "INT. CELL - PRISON TOWER - DUSK", "Belle huddles in the corner.  The cell door swings opens.", "Belle wipes her tears and stands.  She grabs a small stool,", "ready to strike.", "Belle bounds out of the cell, raising the stool to hit a grown", "man.  Instead, she sees... a candelabra wave at her.", "Like seeing a mouse, Belle bashes the candelabra.  It grunts as", "it clatters on the stone floor.  The candles extinguished.", "WHOOSH -- the first candle relights.  WHOOSH -- the second.", "Illuminated by the two arm candles, Belle makes out EYES and a", "rudimentary “FACE” in the design.", "The arms light the main candle to reveal a rakish smile.", "Cogsworth appears, out of breath.", "Officially freaked out now, Belle retreats to her cell, in", "search of a better weapon.", "They turn back to Belle, re-emerging from the cell.", "EXT. ROOFTOP WALKWAY - CASTLE - EVENING", "Holding Lumière, Belle follows Cogsworth across a stone walkway", "high above the grounds.  Her eyes dart, looking for an escape", "route.  Instead, she sees how vast the castle and woods are.", "Lumière throws him a ‘would-you-please-shut-up’ look.", "Belle looks back at the spooky tower of the west wing.", "INT. CORRIDOR/BELLE’S BEDROOM - CASTLE - EVENING", "Belle stands outside the bedroom door, anticipating worse", "squalor...", "Instead, the door opens to --", "INT. BELLE’S BEDROOM - CASTLE - EVENING", "-- the most beautiful, magical room she’s ever seen.  The entir", "ceiling is a painting of white clouds in a blue sky.  There is a", "LARGE DRESSER and a COMFORTABLE BED.  Opulence.", "Lumière leaps onto the bed and - POOF - dust fills the air.", "PLUMETTE, a feather duster, swoops into the room, giving the", "surfaces a quick dusting.", "She lands in the arms of Lumière, whose candles burn a little", "hotter once she speaks in her sexy French accent.", "He moves to embrace her, but she stops him.", "Cogsworth clears his throat.  Belle backs away from the", "strange creatures.", "Cogsworth looks up at her, puzzled.", "Belle hears a loud SNORE behind her, and turns to see the", "DRESSER bursting open with an operatic “laaaaaa!”  Belle", "shrieks and steps back.", "MADAME DE GARDEROBE yawns loudly.", "Garderobe’s gilded arms stroke Belle’s shoulder and face.", "Garderobe’s doors open and a few moths fly out.", "Garderobe places a large HOOP over Belle’s head, and proceeds", "to create an outfit using fabric and her pinking-shear hands.", "FROUFROU, a piano stool, runs in, barking like a dog.", "Froufrou tugs at the fabric, helping Garderobe complete the", "outfit -- which is garish and too too much, all wrong for", "Belle.", "Lumière and Cogsworth put on a game smile.", "With a deep bow and a whistle for Froufrou, Lumière drags", "Cogsworth out.  Plumette and Froufrou follow.  Garderobe calls", "out after her beloved dog.", "The door closes.  Belle is alone.  Garderobe instantly falls", "asleep with a big SNORE.  Belle has one beat of... where the", "hell am I?  She ducks down, then crawls out from underneath", "the enormous dress, which remains standing.", "Belle looks around the room with one thing in mind: escape.", "She quickly moves to the window.  Opens it.  She looks down", "at the 100 foot drop leading to the grounds.", "Belle turns back to the room, and gazes at the dress.  An", "idea taking shape.", "EXT. COUNTRY INN - NIGHT", "A LAMPLIGHTER is hard at work outside as we hear fiddle music", "coming from the inn.", "INT. COUNTRY INN - NIGHT", "Amidst the animal heads, antlers, and drunken villagers, there", "is an even sadder sight -- GASTON.  He drowns his sorrows in al", "while LEFOU listens.", "The village lasses perk up.", "The lasses deflate.", "up his best friend/boss.  Thus begins “GASTON.”", "LeFou gives a nod (and a large tip) to the FIDDLE PLAYER in the *", "corner, who nods back, and begins to play...", "LeFou hops onto the bar, squeezing himself between TOM, DICK,", "and STANLEY.", "LeFou hails a BARMAID and buys everyone a round of drinks.", "The villagers raise their mugs and cheer.", "Gaston stands, and clasps LeFou in gratitude...", "... only to find himself in an uncomfortably tight hug.", "LeFou moves his shirt up his arm to show an old wrestling wound -", "a nice teeth impression courtesy of Gaston.  The villagers gasp.*", "Gaston leaps onto the bar, and is handed a huge blunderbuss,", "with which he mimes shooting LeFou.", "And Gaston fires the rifle into the ceiling!  Plaster rains", "down.", "Gaston spits a big gloppy mess into a spittoon: bullseye!  Then,", "he moves around the inn, holding court.", "On one shoulder, Gaston lifts a pretty VILLAGE GIRL.  On the", "other, he lifts LeFou.", "The crowd hollers.  Gaston jumps on a long table.  The table’s *", "height plus his massive frame make him seem 10 feet tall.", "He engages in a dance-break sword-fight with several VILLAGE", "MEN, besting them all, until he’s perfectly positioned beneath ", "ceiling mural, mimicking it exactly: Gaston, saber raised,", "victorious in battle -- with LeFou swooning at his feet.", "Gaston tromps on the table.  He arrives at his WALL OF ANIMAL", "HEADS and ANTLERS.", "The villagers cheer as Gaston returns to his seat.  Gaston slap", "LeFou on the shoulder, genuinely moved.", "Just then, the door flies open to reveal a wild-eyed Maurice.", "The patrons begin to laugh.", "The villagers murmur in surprise.", "Maurice approaches.  So grateful.", "Maurice exits.  Gaston follows, gesturing to LeFou.", "INT. KITCHEN - CASTLE - NIGHT", "The staff is excited as they scramble to get ready for dinner.", "CHIP, the 8 year-old tea cup, rides his saucer around like a", "skateboard.  He circles his teapot mother MRS. POTTS, a no-", "nonsense yet loving governess.", "But Chip doesn’t slow down.  Before Mrs. Potts can chase,", "CUISINIÈR, the frustrated French chef-turned-oven, pours hot", "water into her to prepare tea.", "She flushes and reacts with pleasure as if stepping into a warm", "bath.", "INT. DINING ROOM - CASTLE - SAME", "The beast enters the dining room and sits at one end of a", "long dining table.  He looks at his place setting, surprised", "to find flatware and crystal.  Confused, he looks up.", "THE BEAST’S POV rises to find another place setting at the", "other end of the long table.  When he notices the romantic", "candles, he swats his own place setting off the table in", "anger.", "INT. KITCHEN - CASTLE - SAME", "A voice bellowing from the dining room causes Lumiere and", "Cogsworth to turn.", "Cogsworth balks with terror.", "A fuming beast storms in, and looks down at the assembled", "staff.  Lumière is as good a liar as Cogsworth is not.", "Cornered by the beast, Cogsworth has no choice but to...", "It’s a loaded statement.  The staff cringes, ready for his", "retaliation.  Instead, a grunt, and then --", "INT. CORRIDOR OUTSIDE BELLE’S BEDROOM - CASTLE - NIGHT", "KNOCK.  KNOCK.  The beast stands at Belle’s door while his", "servants stand by his side to play Cyrano.", "INT. BELLE’S CASTLE BEDROOM - CONTINUOUS", "Actually, Belle has been actively planning her escape.  Her", "makeshift rope of fabric hangs 50 feet out of the window.", "KNOCK.  KNOCK.", "INT. CORRIDOR OUTSIDE BELLE’S BEDROOM - CASTLE - NIGHT", "The servants react to hearing Belle’s voice.", "The words fly as they bury the beast with advice.", "The beast flashes the most hideous grin anyone has ever seen.", "The staff GASPS in horror.", "Contorting his mouth, the beast turns back to the door.", "We wait a perfect beat and then, cut to...", "INT. BELLE’S BEDROOM/ INT. CORRIDOR - CONTINUOUS (INTERCUT)51", "Belle moves to the door.", "The beast’s temper rises -- his eyebrows twitch, his tail", "thrashes -- recognizing the signs, Plumette inches away --", "The beast beats his fist on the door -- WHAM!  WHAM!  WHAM!", "Belle hits back.  WHAM!  WHAM!  WHAM!", "All the banging finally wakes up Madame de Garderobe.", "The staff hides, terrified, as the beast thunders off.", "Once the coast is clear, Cogsworth comes out of hiding with a", "sword and puts on a show of bravery.", "Cogsworth shrieks and spins -- only to realize he’s been", "duped.", "INT. BEAST’S LAIR - WEST WING - CASTLE - NIGHT", "Fuming, the beast returns to his lair -- a chamber of shredded", "furniture and walls ruined in rage.  He paces, muttering.  He", "grabs a decaying HAND MIRROR.", "The mirror lights up and gives him a view of Belle at the", "bedroom door.  She turns, slides down the wall, and curls her", "knees up to her.  A look of dread on her face.", "Her fear crushes the beast.  The mirror magic fades, and he is", "left with his own reflection and self-loathing.  He lowers the", "mirror to reveal the glass jar by the open window.", "In the jar, the ENCHANTED ROSE hangs in mid-air.  The rose is", "wilting.  Most of its petals have fallen.  Rage evaporating,", "replaced by shame, the beast lowers his head", "... as ONE MORE PETAL DROPS.", "The image moves inside the jar.  We see the beast through the", "glass as he leans down, peering in at the petal as it reaches", "the bottom and shrivels.  As it does, we hear a far off RUMBLE, *", "as if the foundation of the castle is trembling.", "EXT. CASTLE - NIGHT -- DAWN", "From a distance, we see stone statuary crack and tumble down", "from the castle walls...", "INT. FOYER - CASTLE - NIGHT", "The staff is gathered; the beginning of their evening.  Lumière *", "lights the fireplace.  He hears the crash of falling debris.", "Lumière moves to help, but his legs stiffen.  He holds his flame", "to his knee like a heating pad.", "Suddenly, Cogsworth begins making clock sounds.", "EXT. CASTLE - NIGHT", "Belle throws her makeshift rope out the bedroom window.", "INT. BELLE’S BEDROOM - CASTLE - NIGHT", "Belle looks down -- the rope is about 20 feet off the ground.", "Almost there.  A KNOCK on the door.", "Mrs. Potts bustles in on her cart with Chip.", "Belle tries to block her view of the escape rope, but Mrs. Potts", "is too sharp.", "The tea is poured into Chip, who wheels over to Belle.", "Belle picks up Chip and brings him up to her mouth.  Little", "Chip finds himself face-to-face with the most beautiful girl", "he has ever seen.  She takes a sip.", "Chip blows a huge bubble in his tea cup.  It pops loudly.", "Madame Garderobe’s doors swing open.", "And Mrs. Potts is out the door.  Belle looks to Garderobe.", "INT. KITCHEN - CASTLE - NIGHT", "The door opens.  Lumière races in to the excited staff.", "Cogsworth waddles in after him.  Plumette flutters nervously.", "Lumiere jumps up onto the sink, navigating sudsy dishes as", "CHAPEAU scrubs them.", "Lumière tosses the dish back in the sink, skipping onto a", "passing tea trolley.  Cogsworth climbs up in pursuit.", "Lumière leaps onto the table, and uprights a champagne glass.", "He leaps again, onto CUISINIÈR, and sips a spoonful from a", "bubbling pot.", "INT. DINING ROOM - CASTLE - MOMENTS LATER", "To Cogsworth’s horror, Lumière guides an ambulatory HARPSICHORD *", "into the room.  This is CADENZA, our neurotic Italian maestro.  *", "But with an abrupt flourish, Cadenza plays show-offy scales", "on the ivories until -- PLUNK.", "Mrs. Potts leads Belle to the end of the long dining table.", "Lumière LEAPS onto the table.  Floating at a high window,", "Plummette uses a silver platter to turn a shaft of moonlight", "into a SPOTLIGHT.  As Lumière begins “BE OUR GUEST.”", "Belle sits down in a chair, which moves in, bringing her", "closer to the table.  Lumière motions up to Plumette to", "steady her shaky spotlight.", "Cadenza plays a dramatic scale as a table cloth UNFURLS, and", "Lumière jumps up and LANDS in a pose.  Cadenza ends his scale on", "the wrong note.  Lumière shoots him a look, Cadenza plays the", "right note, and Lumière turns to Belle and smiles.", "The napkins on the place settings rise up and twirl.  Chapeau", "offers Belle a napkin.", "Spinning quickly, Chapeau presents the following to Belle:", "Belle reaches out to try it, but it’s gone before she can.", "The hors d’oeuvres plates go off, leaving the dinner dishes to", "levitate and spin.", "A small guillotine on the table drops, slicing the baguette.", "MENUS fly in overhead, buzzing a disgruntled Cogsworth.  Belle", "reaches up and grabs one.", "Cogsworth shushes Lumière, and Lumière jabs him back.  One by", "one the kitchen doors swing open, presenting:", "The fish pie explodes!  A piece of cod hits Cogsworth in the", "face, knocking him over.", "Flute glasses fill up with champagne and then break into a Bob", "Fosse homage.  Belle grabs a glass, but Lumière snatches it", "before she sips.", "Lumière coaxes the flatware to its feet.", "The flatware hold out a napkin, into which Lumière jumps, like ", "trampoline.  He is launched into the air, swinging between", "chandeliers a la Cirque du Soleil.", "Lumière falls and lands back in the middle of the champagne", "flutes.  They rise up around him.", "Cogsworth steps back as Lumière again takes center stage in a", "Martha Graham inspired solo.", "Belle reaches again for food but is stopped by Lumière’s", "melodramatic histrionics.  He wraps himself in a napkin for", "the full Martha Graham effect.", "Lumière does a ‘tragic walk’ down the table.  Reaching the end,", "he slides down to the floor on the tablecloth, then gathers it", "around his neck and continues on.", "Belle tries to stab a bite as the food moves past her, as if on", "a conveyer belt.  Sliding past her, Cogsworth wobbles.", "On the floor, snow swirls around Lumière.  We pull out to see", "several “ETTES” flinging salt at him to create the effect.", "Reaching the end of the table, plates dive and spin into neat", "piles --", "-- while Cogsworth lands on Lumière’s lap below.  Chapeau scoop", "them both up and drops them back on the table before Belle.", "Lumière playfully pokes Cogsworth in his pot belly -- then", "takes a flying leap!", "INT. KITCHEN - CASTLE - NIGHT", "Mrs. Potts hops along the edge of the sink basin.", "She ascents to the top of a tiered, circular pastry table, as", "napkins twirl around her.  Desserts appear and circle Mrs.", "Potts.  Then tea cups enter on the outer circle, moving in", "the opposite direction.", "From overhead, a la Busby Berkeley, we reveal desserts, teacups,", "napkins, the floor, everything circling in opposing directions.", "Mrs. Potts descends, jumping onto her tea trolley -- and notice", "a smudge of icing on Chip.", "She quickly steams it off him.", "The trolley rolls through the doors --", "INT. DINING ROOM - CASTLE - NIGHT", "-- and up to Belle.  Mrs. Potts pours a cup into Chip.", "Finally, unable to resist, Cogsworth joins in, pushing", "Lumière out of the spotlight.", "Plumette and her “Ettes” descend on a chandelier, which is", "lowered by Lumière.  They dance; a Beyoncé homage.", "Lumière ties the chandelier rope around Cogsworth, who falls", "over, causing the light to spin.  Plumette dives into a massive", "punch bowl, leading her “Ettes” into an Esther Williams moment.", "Splashes from the punch bowl launch us into a “Singin’ in the", "Rain” moment, with Lumière dancing under the fountain.  The", "grand finale is pure Bollywood, punctuated by explosions of", "candy-colored powders.", "As the table clears itself, whooshing back into the kitchen,", "Lumière whirls toward Belle, finally presenting her with --", "Overwhelmed, she laughs.", "INT. FOYER - CASTLE - NIGHT", "Mrs. Potts (on her trolley cart) escorts Belle from the dining", "room.", "Belle takes this in, a valuable piece of the puzzle.  She", "looks up at the massive staircase.", "Mrs. Potts moves off as Belle climbs the stairs toward her", "room.  At the top, she hurries up the staircase leading to", "the west wing.", "INT. STAIRCASE - WEST WING - CASTLE - NIGHT", "Belle sticks to the shadows.  She walks up to a massive wooden", "door -- slightly ajar.", "INT. BEAST’S LAIR - WEST WING - CASTLE - NIGHT", "Furniture lies in rubble, curtains are shredded -- evidence of", "the beast’s temper.  Wary, Belle investigates when --", "SHE GLIMPSES EYES PEERING AT HER OFF TO THE SIDE.", "With a start, Belle wheels to find -- the eyes belong to a royal", "portrait.  The subject seems to be a TEENAGE BOY but his face", "has been SLASHED BEYOND RECOGNITION.", "Only the eyes survived.  Bright blue.  Engaging.  Resembling the", "eyes of THE BEAST.  She realizes that this is the “prince of a *", "fellow” Mrs. Potts was referring to.", "Belle leans in to study the painting.  A ROYAL FAMILY stands by *", "the castle.  The FATHER’s image has been slashed.  The QUEEN", "remains pristine.  Kind.  Beautiful.", "Belle moves past a large four-poster bed, its faded coverlet", "gray with dust, like no one has slept in it for years.  On", "the floor, she sees a makeshift bed made of straw, torn bits", "of fabric and crumpled blankets: the resting place of a", "nocturnal carnivore.", "Belle turns and sees the glow coming from the GLASS JAR by an", "open window leading to the balcony.  Inside the jar -- THE", "ENCHANTED ROSE.", "Mesmerized, Belle approaches the rose.  She lifts the jar,", "leaving the rose unprotected.  She reaches out to touch the", "rose.  A shadow cuts across Belle’s face.", "The beast bears down on Belle, backing her up.  She puts down", "the bell jar.", "Belle runs.  The beast turns and covers the rose, panicked and", "protective.", "INT. FOYER - CASTLE - NIGHT", "Lumière and Cogsworth play chess on an upper landing, with", "Froufrou resting between them.", "Belle appears, racing down the west wing staircase.", "Cogsworth jumps onto the chess board as Lumiere hops to the", "floor.", "Froufrou jumps up and starts after Belle.", "Belle barrels down the main staircase, Froufrou in close", "pursuit.", "Mrs. Potts enters from the kitchen, wearing a tea cosy.", "At the top of the stairs, Cogsworth sounds a whistle.  In quick *", "cuts, WINDOWS drop and SHUTTERS close.", "Belle hits the bottom of the grand staircase and runs towards", "the door -- only to watch it bolt itself locked.", "Froufrou runs in front of Belle to block her exit, and growls.", "Then suddenly, his growls turn to playful yaps, as he stands", "on his hind legs and pants playfully.", "Froufrou spins and scrambles outside, scooting through the", "low postern door within the great front door.  In his", "excitement, he's provided Belle with an escape!", "Belle snatches her cloak from a bewildered Chapeau, and", "shimmies out through this same ‘doggie door.’", "Mrs. Potts rushes forward but it’s too late.  A look of dread", "settles on her face...", "OMITTED", "OMITTED", "EXT. ENCHANTED WOODS - NIGHT", "HOWL.  Philippe’s hooves hit the snowy landscape.", "through the woods.  She looks back to see if the beast followed", "her.  She only sees a glimpse of the castle.  She thinks she has", "escaped.  Surely, she has escaped.", "WOLVES HOWL NEARBY.", "ANGLE ON PHILIPPE’S MUDDY HOOFPRINT -- a WOLF’S PAW smashes down", "over the print -- the wolf howls --", "ANGLE ON BELLE -- out of the corner of her eye, she sees SHAPES", "OF A DOZEN WHITE WOLVES flitting through the trees, closing in", "on her.", "Belle forges on -- the wolves are not bothering to hide anymore,", "they’ve emerged from the trees to take down their prey --", "closing in fast --", "-- Belle pushes through the undergrowth to find she has reached *", "a FROZEN POND.  Philippe doesn’t hesitate.  He gallops onto the *", "ice, and across the pond.  The sound of ice CRACKING under his", "hooves is deep and low.  And increasing.", "Philippe’s hooves slide on the ice.  The wolves close in.", "Philippe makes it across the pond onto land.  But before", "Belle can feel any relief --", "A WOLF’S JAWS snap at Philippe’s thigh.  Then another.  The", "horse bucks wildly -- causing Belle to makes a controlled", "leap onto a snow bank.  She seizes a thick branch and wields", "it as a club -- as the wolves surround her, jaws slavering --", "Belle swings her club as one wolf lunges at her, its bared", "teeth like razors.  She beats it away.  She turns to confront", "another -- it bites the branch clean out of her hands.", "Belle turns, looks up -- on a rock promontory, the scarred", "ALPHA WOLF is about to take a diving leap onto her.  It", "jumps, and she flinches -- but just as the wolf is about to", "makes its horrible landing --", "THE BEAST APPEARS --", "-- and catches it in mid-air!  With supernatural force, the", "beast hurls the wolf across the frozen pond, howling!", "All the wolves dive on the beast at once, tearing shreds from", "his cloak.  He strikes at them -- wolves scurry, yelping --", "The oversize ALPHA WOLF climbs onto the beast’s back, goes", "for his neck.  The beast slams together the wolves on his", "arms, dropping them -- then reaches back and seizes the", "Alpha.  WOLF and BEAST snarl inches from each other -- the", "beast squeezes --", "Then hurls the Alpha into a stone ledge -- CRACK -- knocking him", "out.  The remaining pack retreats in panic, their yelps echoing", "through the trees.", "TIGHT ON BELLE -- watching as the beast whimpers in pain.  His", "shoulders slump.  He collapses in the snow.  This is her chance.", "Belle could run.  She looks past Philippe, to the woods -- to", "freedom.  But then turns back, and slowly approaches the wounde", "beast.", "Belle covers the beast with her blanket.  He stirs.  One eye", "opens.", "CUT TO:", "The beast is slumped across Philippe’s saddle.  As Belle takes *", "the reins and begins the long walk back to the castle, we RISE", "into the sky, where we can see the border that separates the", "enchanted woods from the outside world, and...", "EXT. WOODS - NIGHT", "WOLVES HOWL.  Gaston’s carriage moves through the scary woods,", "LeFou squeezed in back behind Gaston and Maurice.", "Maurice points up ahead to the WITHERED TREE that looks like an *", "ELDERLY PERSON’S CANE -- THE TREE IS STANDING AGAIN, the tunnel", "of trees now hidden behind it.  Maurice hops down from the", "wagon.", "An angry Gaston steps out and approaches Maurice.", "Gaston holds his fist to strike Maurice across the face.", "LeFou runs over to intervene.", "LeFou’s voice snaps Gaston out of his rage.  He puts on that", "Gaston smile like a Halloween mask.", "A beat.  Without a word, Gaston hits Maurice, knocking him out.*", "EXT. REMOTE FOREST ROAD - NIGHT (LATER)", "Maurice is now tied to a tree.  Gaston secures the knot and", "walks to the carriage.  Darkness has come over Gaston.", "Gaston climbs into the carriage.", "LeFou looks back to Maurice, an apology in his eyes.  He", "climbs into the carriage.", "Gaston and LeFou ride off, leaving Maurice to die.", "INT. BEAST’S LAIR - WEST WING - CASTLE - NIGHT", "The beast lies in his old human bed.  Belle dabs a large gash", "on the beast’s arm.  The beast bares his fangs and lets out a", "roar.", "The household staff anxiously watches the battle of words.", "The beast is momentarily silenced.  Belle looks down at the", "wound she has been dabbing.  It’s worse than she thought.", "The beast’s breath slows to a low rumble as his eyes slip", "shut.", "Belle notes their shame just as we HEAR the first notes of a", "beautiful melody coming from the ballroom downstairs.  This is", "the beast’s lullaby -- “DAYS IN THE SUN.”", "As the staff and Belle exit, the beast stirs.  We move from", "his face, shivering in a fever dream, to discover --", "INT. BEAST’S LAIR - WEST WING - CASTLE - NIGHT", "The YOUNG PRINCE gazes down sadly.", "We move around to reveal that he is looking at the pale body", "of THE QUEEN on her deathbed.", "Behind the prince, a figure approaches: his FATHER.  Cruelty", "written on his face.  Placing his large hand on the boy's", "shoulder, he pulls him out of the room.", "INT. CASTLE - BALLROOM/FOYER - NIGHT", "In the gloomy ballroom, Cadenza plays the beautiful melody.", "The melody drifts through the ballroom until we find Lumière an", "Plumette, dancing:", "INT. CASTLE - KITCHEN - NIGHT", "Drifting to Mrs. Potts and Chip, as she tucks him into bed in", "the cupboard:", "The melody wafts up to:", "INT. BELLE’S BEDROOM - CASTLE - NIGHT", "Madame de Garderobe joins in:", "Belle turns to the window, sings:", "I can’t go back into my", "childhood", "One that my father made", "secure", "I can feel the change in me", "I’m stronger now but still", "not free", "From the window, we PAN across to the castle, to the horizon -", "- where the sun is rising.", "OMITTED", "OMITTED", "INT. BEAST’S LAIR - WEST WING - CASTLE - MORNING", "The beast’s eyes are closed as he feels his mother’s hand on", "his head one more time.  The whole staff looks on:", "The beast opens his eyes weakly, takes in the low light of", "sunrise.  As his vision adjusts, the silhouetted figure by", "his bedside is revealed.  Not his mother, but Belle.  A smile", "forms on his lips, and he closes his eyes again.", "In the glass jar, a petal drops as if floating on the melody.", "Belle crosses to it.", "The staff exchange looks.", "Lumière candle-smacks him, leaving a waxy smear on his face.", "The BEAST opens his eyes, he’s been listening.  The years of", "shame and anguish haunt his face as he begins to remember what", "it is to be human.", "EXT. REMOTE FOREST ROAD - MORNING", "Maurice sleeps.  Suddenly, we hear the branches crack around", "him.  The sound gets closer, and just when we think that wolves", "have found Maurice, we see --", "A HOODED FIGURE emerges from the woods.  The figure looks at", "Maurice, his breathing making fog in the cold.  Alarmed, the", "figure rushes up and pulls down the hood to reveal --", "AGATHE.  The beggar woman.", "EXT. AGATHE’S SHELTER - WOODS - DAY", "Agathe, her arm around Maurice, guides him into a shelter in a", "small clearing.  Gently, she lays him down and removes her", "cloak, spreading it over him for warmth.", "She pulls a bundle off her back and rifles through it, removes", "herbs, a mortar and pestle, and expertly whips up a concoction", "that she brings to Maurice’s lips.", "He blinks, reviving, as he drinks it down.", "INT. BEAST’S LAIR - WEST WING - CASTLE - DAY", "The beast lies in bed, still bandaged.", "He opens his eyes to see that Belle isn’t reading, she’s", "reciting from memory.  He joins in --", "Belle looks up, surprised.", "The beast smiles.", "INT. LIBRARY - CASTLE - DAY", "The beast has lead Belle into the biggest grandest private", "library in all of France.  The chamber is vast and lined floor", "to ceiling with books.", "He turns to see Belle, speechless.", "The beast starts to leave.  He is stopped by --", "Belle shakes her head but is also charmed.  The beast turns", "and strides out.", "INT. DINING ROOM - CASTLE - NIGHT", "The beast eats at the table, reading a book which sits on a", "stand.  He looks up to see Belle sit at the other end with thre", "books.  She picks up her spoon and starts to eat.  The beast", "plants his face in the bowl.  Looks up a second later having", "inhaled the soup, half of which is dripping from his fur.  Bell", "attempts a smile.", "EXT. CASTLE GROUNDS - WOODED GLEN - DAY", "Belle and the beast cross a stone footbridge.  She reads", "aloud to the patient, who moves tentatively, favoring a", "wounded leg.", "The beast stops.  Belle, savoring the words, keeps walking.", "Belle notices that she’s walking alone.  She turns back, sees", "the beast staring out soulfully:", "As she follows his gaze, we reveal a splendidly desolate", "landscape.  The very thing Belle has just described, now", "spread out before her.", "Belle smiles, pleased that for a moment at least he’s become", "a fan of poetry.  She reads:", "Belle meets the beast’s eyes.  Both suddenly aware of hidden", "meanings in the poet's words.", "EXT. CASTLE GROUNDS - DAY", "In the fresh snow, Belle brushes Philippe’s coat.  The beast", "looks at Belle -- she nods -- and he pets the horse.  Philippe", "reacts skittishly, causing the beast to withdraw.  Belle takes", "his hand and places it on Philippe.  Then, as she turns away -- *", "She looks back -- sees the beast petting Philippe.", "Suddenly, a snowball hits the beast.  He turns to see Belle", "smiling.", "The beast builds a huge snowball, and hurls it at Belle.  It", "knocks her clean off her feet and into the snow.  Off the", "beast, grinning in delight --", "OMITTED", "INT. DINING ROOM - CASTLE - NIGHT", "Belle reads at her end of the long dining table.  She looks up", "and sees the beast looking at her.", "back to her book.  As he walks the length of the table:", "The beast sits.  He grabs his bowl and slurps down the soup,", "then catches himself as he sees Belle watching him.", "After a moment, she picks up her bowl and drinks the soup the", "same way.  The beast smiles.  They loudly slurp and laugh", "together.", "INT. BALLROOM - CASTLE / EXT. CASTLE GROUNDS - DAY", "Plumette and several Ettes remove dust bags from the", "chandeliers, as Belle stands on a balcony, sleeves rolled up.", "She scrubs a dirty window, causing a beam of sunlight to", "strike Cadenza.  Meanwhile Chapeau mops the floor, cleaning", "off years of grime, revealing the shiny marble underneath.", "Through the cleaned windows she sees the beast outside,", "walking Philippe -- and talking to him.", "INT. LIBRARY - CASTLE - DAY", "Belle stands on a ladder, pulling down book after book, and", "handing them to the beast.  The staff watches from the corner.", "The towering stack in the beast’s arms teeters until the LIBRAR", "TABLE scoots up behind him, allowing him to set the stack down.*", "The beast nods gratefully, and the wizened GLOBE on the tableto", "nods back.  As the staff moves away:", "Chip waits a long beat.", "Mrs. Potts laughs.", "EXT. CASTLE GROUNDS - COLONNADE - DAY", "Sitting in the beautiful rose garden, the beast looks up from", "his book as Belle approaches.", "He hides the book but Belle catches the title.", "The beast nods, a bit shyly.", "Belle laughs.  A quiet charged moment, which ends with the", "SHOUTS and LAUGHTER of the servants in the castle.  Belle and", "the beast can’t help but smile.", "He turns to her with a melancholy smile.  Then, an idea.", "Belle is surprised by the suggestion.", "INT. LIBRARY - CASTLE - NIGHT", "The beast unlocks a desk cabinet.  In it, resting on velvet,", "its gold-leaf cover faintly glimmering with magic, is a", "LEATHER BOUND BOOK covered in a thick layer of dust.", "The beast cracks open the book to reveal AN ANTIQUE WORLD", "ATLAS.  No countries.  Just land and sea.", "Belle moves closer to find the pen and ink drawing is alive.", "Waves lap the beaches.  Green trees sway in invisible wind.", "The beast offers his hand and Belle takes it.  He gently", "moves her hand to the book.", "Belle nods -- this isn’t a difficult decision.  The moment", "her hand hits the page, we ENTER it, SPINNING through", "celestial flares -- which blur and recombine -- as the lights", "of Paris.  We descend over the city and into...", "INT. ARTIST’S GARRET - MONTMARTRE - NIGHT", "... the top floor of a windmill in Montmartre.", "The beast looks out of a window and sees glittering lights.", "He turns to find Belle silent.  Her eyes brimming with tears.", "The beast watches Belle walk through her childhood home...", "the artist’s garret that Maurice recreated in his signature", "music box.  Abandoned years ago, the room is crumbling.", "Belle finds the remains of her father’s easel.  A tarnished", "wall mirror.  Her own broken crib.", "Belle notices something tucked into a corner of the crib.", "She pries it loose.  It is a BABY’S RATTLE carved into the", "shape of a rose.  The beast focuses on it.", "As she speaks, the beast notices something on a chair.  The", "dark, pointed mask of a plague doctor.  He looks up.", "The revelation lands on Belle’s face.  She looks around.", "IN QUICK TIGHT SHOTS ---", "Belle glimpses what must have happened.  A DOCTOR stands in", "the doorway, his face covered by the mask.", "A bag is hastily packed, Belle’s YOUNGER FATHER (barely seen)", "taking only what is necessary.  He stops to gaze at Belle’s", "MOTHER, who lies on her deathbed, surrounded by medicines.", "She closes her eyes, turns away.", "Maurice picks up the baby... who drops her beloved rose-", "shaped rattle.  Belle’s mother touches it to her lips as", "husband and child disappear.", "BACK TO THE PRESENT", "Belle stares at the rattle.", "Belle lifts her head, her wet eyes look at him.", "She means the castle.  The beast nods, takes her hand.", "EXT. COUNTRY INN - EVENING", "Wind and rain dance in front of the inn.  MUSIC and DRUNKEN", "LAUGHTER inside.", "Gaston doesn’t react.", "INT. COUNTRY INN - EVENING", "They enter and see MAURICE surrounded by Pere Robert and Jean", "the potter.", "LeFou realizes he shouldn’t be happy and tamps down his", "smile.  Maurice and Gaston lock eyes.  Gaston quickly", "assesses the situation.", "Just when we think Gaston might run or fight or deny, he smiles *", "warmly.", "Suddenly, the villagers shift their gaze to Maurice.", "Gaston’s argument lands.  The gentle Maurice feels the room", "slipping away from him.", "Before Agathe can speak --", "Agathe raises an eyebrow - but says nothing.", "He puts his arm around LeFou and pulls him close.", "All eyes turn to LeFou, who is clearly torn.", "The crowd reacts.  Maurice is crestfallen.  Gaston has won.", "Maurice lunges at Gaston -- who catches his flying fist, easily *", "subduing him.", "Gaston signals to Tom, Dick, and Stanley -- and Maurice turns to", "see them block the exit.  Gaston places his large hand on", "Maurice’s shoulder -- and squeezes.  Maurice winces.", "INT. BEAST’S LAIR - WEST WING - CASTLE - EVENING", "The beast sits in a tub -- far too small for him.  There's", "shadow-play on the curtain.", "The beast stands, appearing above the curtain, sopping wet.", "The beast shakes his coat dry like a dog.  The spray", "extinguishes Lumière's candles.", "The beast plops into his a seat in front of the mirror.", "Off the beast, taking this in --", "A brief MONTAGE, as the castle staff give the beast a very", "bad makeover.", "Chapeau wields scissors and a brush as Mrs. Potts pours hot", "water into Chip.  The beast is pushed and pulled, primped and", "snipped.  His fingers are dipped into Chip, his nails buffed", "by Mrs. Potts’ steam, as Lumière climbs onto his horns.", "Plumette powders the beast’s face --", "Chapeau places one of the Prince’s old wigs on the beast.", "Plumette pecks his cheek with a beauty mark.  The beast spins i", "his chair to see himself in the mirror, and -- he’s totally", "ridiculous.  The staff, dejected, takes in its handiwork.", "INT. BELLE’S BEDROOM - CASTLE - EVENING", "Garderobe finishes dressing Belle.", "Garderobe looks up.  There's dust around the gilding that glows *", "in the moonlight.  A moment of inspiration.", "Garderobe sweeps her arm, and the gold dust magically whooshes", "down, settling on Belle’s gown, and completing it.", "INT. GRAND STAIRCASE - CASTLE - NIGHT", "Belle is breathtaking as she is revealed on the upper", "landing.", "Mustering his courage, the beast descends from the west wing.", "She gazes over at the beast, who looks resplendent.  She sees", "him in a new light.", "“BEAUTY AND THE BEAST” begins.  From the bottom of the", "staircase, Mrs. Potts watches with Chip --", "The beast and Belle meet on the center landing and descend the *", "staircase.  Arm in arm, they enter --", "INT. BALLROOM - CASTLE - NIGHT", "-- the absolutely resplendent ballroom.  It has been cleaned an", "scrubbed to its former glory.  The great windows offer a", "magnificent view of the starry night.", "As the music rises, Belle bows.  The beast bows in return.  She *", "offers him her hands -- and nervously, he takes them.  They", "begin to dance, gliding across the ballroom --", "CAMERA sweeps up to see CARVED INSTRUMENTAL FIGURES --", "VIOLIN, VIOLAS, HARP -- which have come to life and are", "playing accompaniment with CADENZA -- sparkling with polish.", "ANGLE ON BEAUTY AND THE BEAST -- in this moment, nothing in the", "world exists except each other.  Despite his bulk, the beast is", "careful, gentle, graceful.  The lights in the ballroom grow dim *", "as he lifts her, spinning.  Belle is swept away.", "ANGLE ON THE HOUSEHOLD STAFF -- watching in mounting hope and", "excitement.  On top of Cadenza, Lumière puts an arm around", "Cogsworth, pulling him closer.", "The lights come back up as the terrace doors open, allowing", "Belle and the beast to step outdoors.", "Chip nuzzles his mother, as Belle and the beast move out to:", "EXT. TERRACE - CASTLE - NIGHT", "Belle and the beast stand together under the stars.", "Mustering his courage --", "She gazes wistfully toward the forest.", "INT. BEAST’S LAIR - WEST WING - CASTLE - NIGHT", "Belle stares into the beast’s hand mirror.", "A glow of magic.  When it clears Belle sees Maurice -- being", "manhandled in the village square!  He looks terrified.", "The beast reacts to her suffering.  A moment of choice.", "Belle looks at the beast as she has never done before -- with", "gratitude and appreciation.  She moves to return the mirror.", "She rushes out.", "INT. FOYER - CASTLE - NIGHT", "Belle runs down the grand staircase towards the door.  She", "stops, seeing Chapeau.  He bows to her, silently, sadly.", "Choking back tears, she is gone.", "Chapeau looks up to the landing, and sees Mrs. Potts standing", "there, watching.  Heartbroken.", "INT. BEAST’S LAIR - WEST WING - CASTLE", "The beast unclasps his beautiful coat and lets it fall to the", "ground.  Cogsworth enters, eager for news.", "Lumière and Plumette enter behind Cogsworth, followed by Mrs.", "Potts.", "The beast doesn’t answer.", "He turns away, unable to face them.", "The staff retreats.  As “EVERMORE” begins, the beast pulls on", "a dark cape.", "INT./EXT. TURRETS - CASTLE - NIGHT", "He steps onto the balcony of his lair.  From his POV, we see", "Belle mounting Philippe on the castle grounds below.", "Belle sets off and the beast begins to climb the castle", "turrets.", "The beast climbs higher and higher, to keep Belle in sight as", "she gets further and further away.", "The beast climbs, Belle riding, until he reaches the highest", "turret of the castle.", "The beast stands at the edge of the turret as Belle finally", "disappears through the castle gates.", "EXT. VILLAGE OF VILLENEUVE - SQUARE - NIGHT", "A horse-drawn asylum wagon thunders into the square where", "Maurice is surrounded by taunting villagers.  The eerie", "driver, MONSIEUR D'ARQUE, steps out as Tom, Dick and Stanley", "throw Maurice into his cage on wheels.  Villagers approach", "the wagon like 18th century rubberneckers.", "Gaston leans into the wagon.  The gathering crowd is just loud", "enough to mask a private plea to Maurice...", "Gaston clenches his jaw and locks the door with a CLANK.", "The wagon begins to move.  The rubberneckers watch the wagon", "until they are silenced by a loud...", "Belle’s voice cuts through the crowd.  They turn and gape at -- *", "BELLE, DAZZLING, IN HER EVENING GOWN.", "The crowd parts before her as she dismounts Philippe and", "moves to the wagon.  They whisper as she passes --", "Gaston stares, slack-jawed, unable to believe his eyes.  We", "linger on the jealous village lasses, the puzzled Jean, the", "confused LeFou, the foul-tempered Clothilde, the bewildered", "Pere Robert, and in the shadows... Agathe.", "Belle fearlessly strides right in front of the wagon.  The", "horses jump up, startled.  Belle runs to the locked door.", "Belle sees her father injured on the floor of the wagon.", "Monsieur d’Arque climbs down to calm her.", "Belle pulls out the magic mirror from her sash.", "In the mirror, the beast sits slumped against a turret wall.", "The villagers gasp.  Gaston’s face registers shock.", "Gaston snatches the mirror from Belle and holds it up to the", "villagers.", "The villagers recoil in fright.", "Raucous cries of “Gaston Gaston Gaston!” rise.  Gaston holds", "the mirror up.", "Tom, Dick and Stanley strong-arm Belle into the wagon with", "her father.", "Gaston hops onto the back of the wagon and addresses the", "crowd.  The “MOB SONG” begins as we move through the", "frightened villagers --", "Gaston grabs a TORCH from a villager and tosses it into a barrel", "of pitch.  Flames rise to the sky.", "Gaston lights Clothilde’s torch, then clasps the shoulder of", "Monsieur d’Arque, who watches helplessly as his asylum wagon", "horses are commandeered by the mob.", "Some villagers seize shovels, pitchforks, axes.  Some light", "torches in the pitch.  Others wrench a boar’s head PIKE STAFF", "from outside the country inn.  Pere Robert tries to calm the", "frenzy but the force of the mob pushes him back.", "EXT. WOODS - NIGHT", "Gaston and LeFou crash into the woods at a full gallop.", "LeFou’s doubts are growing:", "Gaston holds up the mirror.", "IN THE MIRROR -- Gaston sees the hidden path to the castle.", "INT. FOYER - CASTLE - NIGHT", "Plumette’s head rests on Lumière’s shoulder.  Mrs. Potts nuzzles", "Chip.", "ANGLE ON CHIP -- he hears a distant sound -- the rumble of", "MARCHING BOOTS -- puzzled, he hops to the window embrasure --", "The staff and Froufrou jump up, excited, and move to the window.", "They see torches in the distance.", "They look through the glass, distorted with frost, as the mob", "moves through the garden.  Lumière warms the windowpane with his", "flame to see more clearly.", "They hop down from the embrasure.", "INT. FOYER - CASTLE - NIGHT", "Lumière, Cogsworth, Mrs. Potts, Chip, Plumette and Chapeau stand", "at the front door, forming a sad barricade.", "Cadenza crab-walks in from the ballroom, standing vertically and", "propping himself against the door.  The others gather around", "him.", "EXT. TERRACE - CASTLE - NIGHT", "The mob hauls their boar’s head battering ram up to the door.", "INT. FOYER - CASTLE - NIGHT", "CRASH!  The battering ram breaks through the postern door,", "which falls out of the door frame.", "He lopes towards the staircase.", "INT. ASYLUM WAGON - VILLAGE OF VILLENEUVE - NIGHT", "Belle gazes out the prison bars, sees d’Arque pacing by the", "fountain.  She whispers to Maurice --", "She holds up the rose-shaped rattle.  Maurice recognizes it", "immediately.", "Maurice takes the rattle.  Stunned.", "He stops, eyes filled with tears.", "She takes his hand and kisses it.", "Maurice sees the courage and determination in her eyes.  And", "his own eyes light up with an idea.", "He stops as Belle, a step ahead, removes and hands him one of", "her long hairpins.", "Maurice gets to work.", "EXT. HIGHEST TURRET - CASTLE - NIGHT", "Cogsworth hops up the spiral staircase and out onto the", "turret.  He spots the beast, perched among the gargoyles.", "EXT. TERRACE - CASTLE - NIGHT", "The battering ram smashes against the door.", "INT. FOYER - CASTLE - NIGHT", "The door is giving way, the mob is too strong.", "EXT. TERRACE - CASTLE - NIGHT", "The battering ram smashes again.", "INT. FOYER - CASTLE - NIGHT", "The castle staff has now vanished, their barricade dismantled.", "A series of bolts on the door slide open one by one, top to", "bottom.  The door unlocking itself...", "EXT. TERRACE - CASTLE - NIGHT", "The battering ram smashes the door one last time --", "The door swings open easily and the mob tumbles inside, to find:", "INT. FOYER - CASTLE - NIGHT", "It’s EMPTY.  Met by eerie silence, Gaston and the mob cautiously", "enter.  The door barely hangs on its hinges.", "Villagers hold up torches.  The flickering light reveals", "FURNITURE.  Chairs.  A coat rack.  A feather duster.  A", "candelabra.  A tea pot and teacup.  A harpsichord.", "Gaston looks into the mirror.  ANGLE ON LeFou -- he notices", "Mrs. Potts.  Brings his torch close to study her.", "ANGLE ON THE MOB -- among them, Jean the potter stares at the", "eerie castle foyer --", "Gaston approaches the west wing stairs.  LeFou brings his face", "down to the tea pot and teacup.", "Mrs. Potts’ EYES open.  Furious.", "LeFou jumps back.  ALL HELL BREAKS LOOSE as the furniture comes *", "alive.  Chairs kick the shins of several villagers.  Plumette", "feathers villagers’ faces furiously, causing them to have", "sneezing fits.  As other villagers funnel in, the “Lend-a-Hand”", "lights outside the door bonk several of them on the head.", "They’re alive after all.", "Chapeau spins Gaston around and is about to land a blow when", "GASTON GRABS LEFOU and puts him in the line of fire.  LeFou", "becomes a human punching bag as Cadenza approaches and rears", "up on his hind legs.  His shadow falls across Gaston, who", "dives out of the way -- leaving LeFou exposed.", "Cadenza comes crashing down on LeFou, squashing him flat.", "Gaston looks down at his friend.", "Gaston looks from LeFou to the enchanted mirror, then to the", "grand staircase.", "Gaston rushes up the staircase.  Lefou passes out.", "INT. VILLAGE OF VILLENEUVE - NIGHT", "Monsieur d’Arque paces in the square, when he notices the", "door to the asylum wagon is ajar.  He runs to the wagon and", "flings open the doors, only to find it empty.  D’Arque slams", "the doors shut -- and there’s Maurice, smiling beside him.", "Maurice casually hands the wagon’s padlock to Monsieur", "d’Arque -- just as Belle rides past on Philippe!  As she", "charges out of the village gates, she tosses her ball gown to", "the ground.", "Maurice waves to her proudly, then turns back to d’Arque.", "Off d’Arque’s confusion --", "OMITTED", "INT. FOYER - CASTLE - NIGHT", "LeFou, bruised but alive, opens his eyes, sits up -- when", "Plumette furiously begins feathering his face.", "LeFou swats -- and Plumette flies away, laughing.", "INT. TURRET STAIRCASE - CASTLE - NIGHT", "Gaston finds himself at the landing of two staircases.", "Unsure which one leads to the beast, he holds up the mirror,", "which illuminates the right way.  Gaston bounds up them.", "INT. FOYER - CASTLE - NIGHT", "Chip rapidly fires saucers at attackers, counting them off as", "he dispatches them with glee.", "Above, Cogsworth looks down from the balcony, a tinhorn", "general surveying the battlefield.", "Just then, a platoon of books arrives on the large table from", "the library, battle-ready.", "The books rocket down into the fray, thwacking villager after", "villager.", "This draws the attention of Tom, Dick and Stanley.  Cogsworth", "shudders --", "-- and jumps down from the balustrade, as they bound up the", "stairs.  They face off against Cogsworth, and he backs up", "quickly.", "Suddenly, Garderobe leaps out, blocking the brutes’ path, and", "unfurls her fabric, wrapping them up.", "Tom and Dick look at each other and shriek, horrified at their", "girly make-overs.  Stanley, however, doesn’t seem to mind his", "new look.  Garderobe cackles.", "EXT. WOODS - NIGHT", "Belle on Philippe.  She whips past the withered tree and down", "the path toward the castle grounds.", "OMITTED", "OMITTED", "OMITTED", "INT. FOYER - BALCONY - CASTLE - NIGHT", "From the balcony, Mrs. Potts leaps onto a chandelier --", "-- and douses villagers below with boiling water.  She looks", "down -- seeing Jean the potter -- and gasps.", "Suddenly, Mrs. Potts slips and drops down towards the floor.", "Jean the potter looks on in confusion.  Chip looks on in", "terror.", "But just as she’s about to shatter, she is caught by a pair", "of human hands.  Mrs. Potts gazes up at -- LEFOU, who seems", "as surprised as she does.", "Suddenly, two villagers charge at LeFou from either side.", "LeFou ducks, the villagers wallop one another, Mrs. Potts", "spits hot water in their faces, and LeFou punches one out to", "finish the job.", "LeFou nods, emotional.", "Below, Cadenza bucks and rages against villagers, besting", "them repeatedly as he plays elaborate trills.", "Clothilde watches this, and seethes.", "Clothilde’s cry rallies a group of villagers, who raise their", "axes to turn maestro Cadenza into firewood.", "Cadenza looks up to see her.", "Garderobe belts out a deafening high note and throws her", "massive girth off the balcony, sending Clothilde and the", "villagers below scattering.  She lands with a graceful THUD.", "Before the villagers can retaliate, Cadenza’s “teeth” shoot", "out of his mouth like machine gun rounds.  BAM BAM BAM!", "Lumière runs around with gunpowder trail, creating a line of", "firecracker explosions that send villagers scattering.", "In the chaos, we find Agathe, moving quietly through the", "villagers and up the stairs.  What is she up to?", "As villagers pour out the doors, Lumière and Cogsworth meet", "at the base of the stairs.", "EXT. CASTLE GROUNDS - NIGHT", "Belle rides Philippe towards the castle.  She kicks his", "flanks and they double their speed.", "EXT. HIGHEST TURRET - CASTLE - NIGHT", "Gaston steps slowly up onto the beast's turret.  The beast", "senses his presence, turns.  They lock eyes.  Gaston cocks", "his pistol.", "INT. TURRET STAIRCASE - CASTLE - NIGHT", "Belle races up the stairs to the turret.", "EXT. HIGHEST TURRET - CASTLE - NIGHT", "With no hope left, the beast turns away from Gaston, whose", "finger tightens on the trigger.", "He fires.  The beast drops over the edge.", "On the turret below, his claws make contact with the slanted", "rooftop and break his fall.  He hugs the rooftop, heaving.", "Gaston looks down over the edge of the turret.  He pulls his", "crossbow and reaches back over his shoulder to draw an arrow", "from his quiver -- but there’s nothing there.", "Gaston spins to see Belle, and his arrows gripped in her", "hands.", "With that, Belle snaps Gaston’s arrows over her knee, and", "tosses them away.  Gaston grabs her arm.", "She pulls away -- and uses this pivot to grab the barrel of", "Gaston's pistol.  They struggle.", "With Gaston on the back foot for a split second, Belle yanks th", "pistol hard.  Gaston, not letting go, swings with it, and", "seeking balance on a loose stone, he drops off the side of the", "turret!", "Gaston's reflexes are quick.  He lets go of the pistol, grabbin", "a gargoyle and swinging himself down through a window of the", "turret.  He lands on the spiral staircase.", "Gaston's pistol, in the meantime, clatters down, coming to rest *", "on the landing of a stone footbridge below.", "EXT. CASTLE - VARIOUS TURRETS - NIGHT", "Wounded, the beast climbs around the lower turret.  All around *", "him, turrets quaver and crack.  The castle is imploding.", "Gaston continues down until he reaches the bottom of the", "spiral staircase.  He drops to a window box below, and jumps", "sideways onto another.", "The beast makes a second leap, onto another parapet.  Tiles", "slide away beneath him as he scrambles to hang on.", "Belle reaches the landing at the bottom of the spiral staircase,", "and leaps down onto another adjacent landing.  She looks out,", "trying to see the beast through the turrets.", "The beast swings around a third parapet and leaps onto another.", "He's now as far as he can get from Gaston.", "Finally, Belle reaches a point where she can see the beast on", "the faraway turret.  She screams out as his grip slips.", "The beast's head turns.", "And he spots her.", "Gaston drops onto the walkway lined with gargoyles, landing", "directly between the beast and Belle.  He sneers -- the upper", "hand is still his.  His eyes search for a weapon... he grabs", "a stone spire, and breaks it off.", "With superhuman agility, the beast makes a giant leap from the", "far parapet back toward the central turrets.  Back toward Belle*", "Belle descends the stairs, finally reaching the beast's lair.", "The beast lands on the gargoyle walk and Gaston jumps out,", "bringing his club cracking down on the beast's back.  The", "beast roars in pain.  But he pushes past Gaston.", "With Gaston landing blow after blow on the beast's back, the", "beast staggers down a set of stairs onto the landing of a stone", "footbridge (where Gaston’s pistol came to rest earlier).", "Belle watches the beast lumbering across the footbridge -- which", "crumbles under each mighty footfall.", "The beast reaches the cupola on the far side, directly", "parallel to the lair.  One giant leap stands between him and", "Belle...", "Gaston lifts the club to deliver the death blow -- when the", "beast snatches it.  He yanks the club away and hurls it", "against a far wall.", "With a snarl, the beast's paw is around Gaston's throat.  He", "lifts Gaston and swings him out over the edge of the landing.", "TIGHT ON THE BEAST -- his features twisted with rage and hate --", "but he controls himself -- and his anger fades.", "He sets Gaston down.", "Gaston scrambles to his feet, and the beast lunges, chasing", "him away down the outer staircase of the cupola.", "EXT. BALCONY - CASTLE - NIGHT", "Belle gazes proudly into the beast’s eyes, across the final", "chasm that separates them.", "EXT. CASTLE - CUPOLA - NIGHT", "The beast has just enough distance for a head start to leap", "across to the lair balcony.", "But the beast has already gotten down on all fours.  His hind", "claws dig into the stone.  And then he's off, gaining speed as", "he runs on all legs.  Belle gasps -- and the beast leaps.", "He's airborne, flying over the chasm -- and he just makes it to", "the balcony -- landing on all fours!  He rises, and smiles.", "BOOM!  The beast roars in agony.  Past him, across the chasm,", "Belle spots Gaston on the crumbling walkway, pistol back in", "hand.  He grins as he reloads for the kill shot -- and as Belle", "watches, helpless, he takes aim again -- and fires.", "The beast drops -- just as the walkway beneath Gaston", "collapses.  In an instant, there's nothing beneath his feet,", "and he disappears, screaming, in a cascade of stones.", "Belle cradles the beast’s head.  Anguished.  He lies there,", "breathing heavily.  Softly, the beast rests his paw on Belle’s", "hand.  Fading, his eyes look at her with perfect love.", "The paw drops as the beast dies in her arms.", "EXT. TERRACE - CASTLE - NIGHT", "As villagers stagger away in defeat, Lumière turns to Plumette, *", "takes her in his arms, about to give her a V-Day kiss.", "Plumette is silent in Lumière’s embrace.", "Cogsworth helps Lumière lower Plumette to the ground.  Opposite *", "them, Garderobe stands beside Cadenza, reunited at last.", "Her arms retract -- as the footlights inside her dim and die.", "Cadenza sobs.  We move along the few keys he has left until the", "freeze into silence.  We TILT UP to the music stand.  No hint o", "a face.  Froufrou emerges from the foyer, pawing at his master *", "and mistress, then goes still.  Nothing more than a piano stool *", "now.", "Mrs. Potts frantically approaches Cogsworth and Lumière.", "Lumière and Cogsworth watch in horror as Mrs. Potts’ face", "disappears into the painted ornamentation of the tea pot.", "Lumière turns to Cogsworth, panicked that Chip might see", "what’s happened.", "Just as he leaps up, his features fade away and gravity takes", "over.  The saucer plummets, shattering.  But Chapeau catches", "Chip in mid-air -- and lovingly places him, inanimate, onto", "the trolley cart beside Mrs. Potts.", "Chapeau straightens himself nobly, and becomes a coat rack.", "All around Cogsworth and Lumière, the staff goes still.", "The only sound Cogsworth makes is ‘tick tock, tick tock.’", "Lumière is alone.  Surrounded by objects.", "Lumière does a final twirl and stiffens.  He is a candlestick.", "INT. BEAST’S LAIR - WEST WING - CASTLE - NIGHT", "ANGLE ON THE BELL JAR.  The final rose petal drops -- just as", "a HOODED FIGURE appears.  We move up to reveal: AGATHE.", "TIGHT ON BELLE -- her lips touch the beast’s forehead in a", "kiss.", "Hearing these words, Agathe smiles benevolently and places", "her hand on the bell jar -- which explodes and releases a", "wave of rose petals, whirling into the air.", "A golden light begins to emanate from Agathe.  It encircles", "the beast and he too begins to rise.  Belle gets to her feet,", "watching as the beast is lifted and enveloped by the swirling", "aurora, and then buffeted gently back down to reveal --", "THE PRINCE", "He lands on his feet and looks down at his hands, his arms,", "his chest.  He turns -- and sees Belle.", "Slowly he steps toward her, and she to him.", "In silent disbelief, Belle runs her fingers through his hair.", "She looks into the Prince’s blue eyes.  It is him.  Tears of", "grief turn to tears of joy as they lean in for their first", "kiss.", "EXT. CASTLE - DAWN", "Magic explodes outwards.  And with it, the dawn breaks.  The", "castle transforms like someone is giving it a wash of gold.  The", "magic spreads across the balcony as the sun rises on the", "terrace, traveling down the castle facade -- creepy stone", "gargoyles turn into noble statuary --", "EXT. TERRACE - CASTLE - DAWN", "As the light passes over, an upside-down FROUFROU transforms", "back into a tiny BICHON FRISE basking in the sun.  He leaps up *", "and chases his tail (still a tassle), then trots over to CHAPEA", "and relieves himself on his leg -- which changes into a human", "foot.", "Chapeau transforms back into a VALET and shoos the dog away", "with his walking stick.  As the dog weaves through his legs,", "the valet loses his balance and bumps into the trolley cart", "holding Mrs. Potts and Chip.  It starts to roll toward the", "stairs.", "The valet backs into Garderobe, who waddles in and out of", "sunlight, changing from wardrobe to human to wardrobe again.", "Cadenza’s face comes alive as he sees the wardrobe falling", "onto him.  As it crashes, the wardrobe’s doors fly open,", "sending out a flurry of garments.  We follow them back to the", "ground, where the human DIVA now lies on top of the human", "MAESTRO.", "The maestro smiles his now-toothless grin.  She tearfully", "embraces him -- as their dog joins in.", "The trolley rolls past, taking us to Cogsworth, whose back is", "bathed in sunlight.  We move around to reveal the pudgy", "MAJORDOMO, human except for his moustache, which still", "resembles the hands of a clock.  He peers through his", "monocle, sees --", "The French FOOTMAN (formerly Lumière) come into view.", "They greet each other as a feather floats by, brushing the", "footman’s nose.  They look over to see --", "A pile of feathers... from which the footman pulls the", "sexiest French MAID in history, her feathers blossoming into", "a dress around her.", "And then, the greatest kiss ever.  Their passion ignites a", "tiny flame on the footman’s head, which the maid pats out.", "They turn as they hear --", "The trolley SQUEAKING as it nears the steps, about to crash", "down.  Mrs. Potts and Chip rattle on a tray, which suddenly", "jerks to a stop on the precipice.  The valet has hooked the", "cart with his walking stick, but...", "Mrs. Potts and Chip slide down the incline... shoot off the", "tray... and start to TRANSFORM IN MID-AIR!  They sled to the", "bottom of the steps and skid to a halt, fully human again.", "CHIP hugs his MOTHER... he finally got her to skate!", "From the castle grounds, astonished villagers approach,", "blinking, as the veil is lifted from their memory.", "They embrace -- a family reunited.", "OMITTED", "EXT. TERRACE - CASTLE - DAWN", "A wonderful emotion-filled reunion.  STABLE BOYS, KITCHEN", "MAIDS, ARTISANS, GROUNDSKEEPERS, GUARDS, and SEAMSTRESSES are", "reunited in human form.", "Among the happy villagers, we find Cogsworth.", "He spins to see Clothilde - his wife.  Gulp.", "She hugs him.", "He shuts his eyes tight and whispers to himself:", "Lumière and Plumette embrace, then...", "BELLE AND THE PRINCE emerge.  He rushes to Lumiere.", "Lumiere is taken aback by the warm embrace of his master.", "Belle and the Prince are surrounded by the staff.  Plumette", "curtsies to Belle --", "-- As Chip runs up and hugs her tight.", "“BEAUTY AND THE BEAST” starts to play.", "OMITTED", "INT. BALLROOM - CASTLE - DAY", "The entire village celebrates as Cadenza -- smiling with", "dentures -- plays the harpsichord with his beautiful wife", "Garderobe singing.", "We glide past various familiar faces: LeFou; Lumière waltzing", "with Plumette; Cogsworth with Clothilde; Chip and his father,", "Jean the Potter... and finally Mrs. Potts.  She beams as she", "watches Belle dance with the Prince, then crosses to", "acknowledge Maurice, who sits at an easel, sketching the", "celebration.", "Belle runs her hand down the Prince’s smooth cheek.", "He growls playfully.  As they laugh, we PULL OUT to reveal", "the ballroom in all its restored splendor.", "BLACK.", "OMITTED."]}