{"scenarios": ["INT. ELIO’S/OLIVER’S ROOM - PERLMAN VILLA - DAY", "The sound of an approaching car. ELIO, 17, barefoot and in", "his bathing suit, is in the process of moving his clothes", "from his room to the adjacent room - a cramped storage room", "somehow refurbished into a single bedroom. The two rooms are", "separated by a ruined wooden door, with cracks all over it", "and share a common bathroom.", "MARZIA, a girl of about his same age, is lying on the bed. It", "is obvious both have been on it together.", "ELIO goes to the window and looks down. A car pulls up below,", "blowing up clouds of dust, and stops at the villa’s main", "entrance.", "A tall young man steps out of the car, wearing a billowy", "bright blue shirt with a wide-open collar, sunglasses. This", "is OLIVER, 25.", "MARZIA jumps up to come stand next to him, looking down.", "ANCHISE, the gardener and handyman, appears below followed by", "the PERLMANS who introduce themselves to Oliver. Professor", "PERLMAN is in his fifties, distinguished, vigorous. ANNELLA,", "his wife, is in her mid-forties.", "INT. STAIRCASE - PERLMAN VILLA - DAY", "At the end of the stairs ELIO sees OLIVER being walked to", "Professor Perlman’s study. Oliver’s suitcase and backpack lie", "on the floor nearby. ANNELLA sees Elio approaching and", "gestures towards them.", "INT. PROFESSOR PERLMAN’S STUDY - PERLMAN VILLA - DAY", "ELIO enters his father’s studio. OLIVER, sitting on the sofa,", "is having a glass of fresh water. Even if exhausted by the", "heat, he remains elegant and somewhat iconic. Professor", "PERLMAN introduces the two formally.", "They shake hands.", "INT. STAIRCASE - PERLMAN VILLA - DAY", "They head up the stairs together; ELIO lunges for the heavy", "suitcase, OLIVER takes the backpack.", "They meet MARZIA coming down. More introductions in the", "middle of the stairs. She kisses OLIVER on both cheeks.", "OLIVER is curious about her and looks back as he continues", "up. She looks back after he does.", "INT. OLIVER’S ROOM - PERLMAN VILLA - DAY", "They enter Oliver’s bedroom. OLIVER drops his backpack and", "crashes on the bed, exhausted. ELIO lays the suitcase next to", "the bed.", "But Oliver is not listening, already asleep. Elio walks out", "and closes the door that separates their two rooms.", "INT. STAIRCASE - PERLMAN VILLA - DUSK", "Later. MAFALDA, at the bottom of the stairs, rings a bell.", "She looks up the stairs and, getting no response, rings the", "bell again.", "INT. ELIO’S/OLIVER’S ROOM/BATHROOM - PERLMAN VILLA - DUSK", "ELIO is at the desk in his small “new” bedroom; he is", "transcribing music. Next to his desk lamp a Sony Walkman is", "playing music. He hears the bell.", "He enters the bathroom and the door that connects it to the", "other room is open. OLIVER sleeps in the dim light of sunset.", "No answer. Elio enters Oliver's room and reaches over to the", "bookshelf, takes a book from it but then drops it on the", "floor. It makes a sharp clatter. Oliver is briskly awoken.", "Oliver looks up from his pillow scarcely knowing where he is.", "Elio, backing out of the door with the book, nods that he", "will. Oliver looks around for a moment.", "About to shut the door, ELIO nods.", "Oliver turns and goes back to sleep. Elio closes the door,", "leaving the room in almost complete darkness.", "INT. STAIRCASE/BOCCHIRALE - PERLMAN VILLA - DAY", "The following day. OLIVER is coming down the stairs. Not", "knowing where to go, he listens for the Perlmans' voices", "until he sees, through a corridor, the kitchen.", "Just beyond it, outside in the garden, he can see the family", "having breakfast.", "EXT. GARDEN IN FRONT OF THE KITCHEN - PERLMAN VILLA - DAY", "The PERLMANS are eating breakfast outside, in front of the", "kitchen.", "OLIVER comes out and sits down, watching how ELIO expertly", "cracks his soft-boiled egg shell, then attempts to do the", "same, but only a tiny bit of the shell is pierced, so he", "pretends to busy himself with his coffee and pushes the egg", "in its cup away.", "MAFALDA asks him if he would like juice. He says “Please”.", "She looks down at the discarded egg.", "She slices the top off and returns to her kitchen.", "ELIO, who has been trying not to stare at their guest and is", "concentrating on spreading honey on a piece of bread, now", "lifts his head and speaks, growing unnaturally loud:", "Both Professor PERLMAN and ANNELLA look up, interested.", "Elio turns in his seat to get a better view of Oliver, who is", "sitting beside him.", "Mafalda returns with a pitcher of apricot juice on a little", "tray and proceeds to fill Oliver’s glass. Oliver tastes it,", "then enthusiastically downs it.", "Elio realizes he is staring at Oliver, his head tipped back", "with his throat swallowing the juice, and notices the Star of", "David on a necklace around his neck. He lowers his eyes.", "Elio has never heard someone Oliver’s age say, I know myself.", "It’s somewhat intimidating.", "EXT. ROAD TO CREMA - DAY", "ELIO and OLIVER are riding bicycles, with Elio in the lead.", "They go along the country road towards the town of Crema and", "its bank.", "The day is already hot.", "The countryside shines under the soft sunlight of the Po", "Valley.", "EXT. CAFE - CREMA TOWN SQUARE - DAY", "ELIO and OLIVER are sitting at the little cafe with iron", "chairs and tables, drinking coffee. OLIVER examines bank", "application forms, then folds them up and puts them in his", "knapsack. He looks around the almost empty square.", "ELIO smiles, says nothing. They both laugh.", "OLIVER takes this in, his eyes hidden by dark sunglasses as", "he gathers up his things, cutting their conversation off.", "They silently reclaim their bikes.", "OLIVER seems to be miles away, but as ELIO is getting on his", "bike, he loses balance for a moment and OLIVER puts his arm", "around Elio’s shoulder, steadying him.", "He then speeds off, saying “Later”, leaving ELIO on his own.", "INT. PROFESSOR PERLMAN’S STUDY - PERLMAN VILLA - DAY", "PERLMAN is attempting to devise a new filing system for his", "correspondence; there are packs of letters lying about and", "open boxes with more letters.", "OLIVER is helping him and ELIO is with them.", "ANNELLA enters carrying a little tray with a pitcher of more", "apricot juice which she pours out into glasses. Everyone has", "some; OLIVER downs his in a gulp. He smacks his lips, says", "“Ah!”. Annella looks at him amused. Elio looks at his father,", "already knowing what he’ll say.", "He pauses to draw breath, then continues, warming to his", "subject.", "Through all this OLIVER has been listening carefully.", "ELIO and ANNELLA listen carefully. They have seen all this", "happening in the past.", "There is a moment of silence. Elio and Annella look at", "Perlman.", "ANNELLA, unable to resist, starts laughing.", "Oliver smiles, shaking his head. DISSOLVE.", "EXT. STREETS/CARD CAFE - TOWN STREET - DAY", "OLIVER and ELIO walk down a street; OLIVER steps into a small", "bar.", "Some men inside are sitting at two or three tables with", "playing cards. Waiters bring coffee and other drinks to the", "customers, the place is lively.", "Some of the men look up and nod at OLIVER. They know him. A", "game is starting at one of the tables and OLIVER is asked to", "join. He sits down to play.", "Oliver winks. ELIO pulls up a chair and sits, spectating.", "The cards are dealt. OLIVER, accepted at once, treats his", "fellow PLAYERS as equals. Despite being a ‘rich’ American", "‘intellectual’, a guest at the villa of one of the area’s", "richest men, he has the ‘common touch’.", "EXT. MAIN ENTRANCE LAWN - PERLMAN VILLA - AFTERNOON", "A few of ELIO’S FRIENDS play a volleyball game in a makeshift", "court set up on the lawn by the main entrance of the villa.", "OLIVER is playing with CHIARA, MARZIA’s slightly older", "sister, and another BOY. The three make up one side of the", "game, while the opposing team is made up of THREE OTHERS we", "haven't met.", "ELIO sits on the side with MARZIA and another friend MARIA.", "All eyes are on OLIVER, the glamorous American who has", "unexpectedly dropped into their midst. MARZIA and her friend", "ask questions about him.", "ELIO and MARZIA laugh.", "ELIO, bored and put off, gets up and goes to a nearby table", "under the lime trees, on it is some fresh fruit and a bottle", "of cold water.", "He takes the bottle and goes to his friends, offering it.", "OLIVER steals the bottle and drinks, then hands it back to", "ELIO without thanking him.", "OLIVER then puts his free arm around ELIO, gently squeezing", "his thumb and forefingers into Elio’s shoulder in a friendly", "hug-massage.", "ELIO, taken by surprise, is spellbound for an instant,", "yielding to Oliver’s hand, even leaning into it -- then he", "wrenches himself away from Oliver’s grab.", "Taken aback, OLIVER apologizes, asking ELIO if he’d pressed a", "nerve or something: “I didn’t mean to hurt you”. Honestly not", "wanting to discourage OLIVER, ELIO blurts out “I’m not hurt”.", "ELIO has the face of someone trying, but failing, to smother", "a grimace of pain. OLIVER goes along with this charade.", "MARZIA puts her hands on Elio’s back. OLIVER presses her", "flattened palm hard against it.", "ELIO tries to relax until the others lose interest and resume", "the game. Elio’s view of the players and of the ball in the", "air over their heads is often obscured by the OLIVER's", "muscular back, moving in closer from the side. Sometimes they", "collide, trip, fall into a heap. The girls shout rudely in", "Italian.", "Elio goes back to the table under the lime trees and sits in", "the shade, far from the others. He is inadvertently rubbing", "the spot that Oliver had massaged at the base of his neck", "with his free hand. MAFALDA and ANNELLA are setting up the", "table for dinner.", "INT. ELIO’S AND OLIVER’S BATHROOM - EVENING", "Upstairs ELIO is shaving his own upper lip. He looks at", "himself, almost disgusted.", "EXT. TABLE UNDER THE LIME TREES - PERLMAN VILLA - EVENING", "Guests are gathering at the table. PERLMAN makes a funny", "face, entertaining the younger kids at the table. Church", "bells ring in the distance.", "The absence of Oliver is commented upon. ANNELLA asks ELIO,", "who just showed up, whether Oliver will be joining them.", "The camera stays on ELIO as he considers the possibility.", "This is performed instantly and without a hint of regret.", "ELIO watches Oliver’s silverware, his place mat, glass,", "napkin, disappear as if he had never existed. He grows", "thoughtful at the sudden violence of Mafalda’s action - may", "even involuntarily put his own hand out to stop her.", "INT. LIVING ROOM - PERLMAN VILLA - NIGHT", "All the guests are in the living room watching a frivolous", "Italian TV show with songs and games. Ladies talk. PERLMAN is", "pouring drinks in the small bar. ELIO is bored.", "A burst of laughter from the kids. Perlman returns from the", "bar holding glasses. ELIO gives in, and goes over to the", "piano. He starts playing a lively piece.", "INT. ELIO’S BEDROOM - PERLMAN VILLA - NIGHT", "ELIO is on his bed, still dressed. He cannot sleep. He hears", "a noise outside and quickly strips off his clothes, putting", "on his pajama bottoms. But no one comes, there are no sounds", "on the stairs or activity in the adjoining bathroom.", "EXT. GARDEN - PERLMAN VILLA - DAY", "In front of the kitchen is a fruit orchard with a variety of", "fruit trees. One of the trees is shaking. In the dappled", "light under the tree we see ANCHISE reaching up into the", "limbs to pick the ripest peaches.", "EXT. PERLMAN VILLA - AFTERNOON", "The house is quiet and deserted, a typical lazy summer", "afternoon.", "OLIVER arrives on his bike from town, wearing the blue", "bathing suit and the blue billowy shirt he had when he first", "arrived.", "INT. ELIO’S BEDROOM - PERLMAN VILLA - AFTERNOON", "ELIO is on his bed wearing only boxer shorts. His right hand", "is down inside his shorts. He starts touching himself.", "All of a sudden footsteps outside his door.", "OLIVER, shirtless, enters the room from the bathroom.", "ELIO quickly pulls his hand from his boxers shorts with a", "jerking movement as if caught in an embarrassing position.", "ELIO is speechless, out of breath, says:", "ELIO shrugs. A beat.", "ELIO grabs his hand and turns on his side facing the wall,", "away from OLIVER, to prevent him from seeing his erection-", "but in his movement is also a slight tugging which could have", "pulled OLIVER down on the bed.", "OLIVER straightens up, pauses again to look down, and still", "grasping Elio’s hand, succeeds in pulling him upright.", "He leaves Elio’s room.", "ELIO puts his hand - the one Oliver had been holding - down", "inside his boxers, finds it damp, pulls it out, then hits his", "forehead with his fist saying: “Stupid! Stupid!”", "He strips off the underwear and, naked and defiant, goes out", "into the bathroom while grabbing a pair of swim trunks.", "INT. ELIO’S AND OLIVER’S BATHROOM - PERLMAN VILLA - AFTERN", "ELIO, while wearing his swimsuit, gets a glimpse of OLIVER", "naked in his room.", "STILL LIVES", "Still lives of Oliver's swim trunks of different colors", "drying on the bedroom windowsill denoting the passage of", "time.", "EXT. ABBEVERATOIO - PERLMAN VILLA - AFTERNOON", "At the bottom of a large stone staircase that leads from the", "patio outside the villa to the lower outdoor terrace, in the", "middle of a field, sits an old stone drinking trough for", "livestock, or an abbeveratoio, now used as a sort of swimming", "pool to freshen up on hot summer days.", "ELIO and OLIVER together in the narrow and long stone pool.", "Oliver swims, Elio writes music with his headphones on.", "Something is definitely going on here, there’s intimacy.", "ANNELLA is close, with a basket of freshly picked fruit.", "ANNELLA, amused, listens to the conversation.", "OLIVER gets out from the pool and reaches ANNELLA in the", "orchard, stretching into the branches for the ripe fruit as", "ELIO watches.", "ELIO goes over to them and offers to hold the basket, which", "is filling with apricots.", "EXT. SOUTH TERRAZZA - PERLMAN VILLA - DAY", "The same day. ELIO is sitting at a table in the shade of the", "house, practicing his guitar.", "OLIVER is lying on a towel spread on the grass nearby,", "reading a book, which we see is Heraclithus. He wears a green", "bathing suit and his straw hat. His belongings are spread out", "around him: sun lotion, a note pad and pen, espadrilles.", "On the nearby patio the PERLMANS and some FRIENDS are sitting", "around a table playing a card game.", "There are always people coming and going at the Perlmans’ -", "friends, relatives, acquaintances of Elio, like Marzia. We", "don’t always learn who they are, but they give a sense of", "ever-moving inhabitants of the place.", "Oliver lowers his book and stares at ELIO, who is focused on", "the fingerboard.", "ELIO raises his face to see if OLIVER likes what he is", "playing, but OLIVER looks back without expression, almost", "coldly. Unsettled, ELIO breaks off for a moment. OLIVER,", "aware that he has caused ELIO to interrupt his flow:", "ELIO gets up and enter the house through the big door.", "INT. LIVING ROOM - PERLMAN VILLA - DAY", "ELIO plays the piece on the piano. OLIVER leans on the door", "looking in. The music sounds very different from when he", "played it on his guitar.", "ELIO begins playing the piece again. OLIVER listens, then", "speaks:", "ELIO begins to play the Bach in its original form. OLIVER,", "who had turned away, comes back to the door. ELIO says,", "softly, over his playing:", "INT. ELIO’S BEDROOM - PERLMAN VILLA - LATER", "ELIO is writing his diary, the wind is moving the curtains.", "He then puts the open diary on the bed and goes into the", "shared bathroom to pee, shutting the door behind him. The", "camera moves close on to the diary and we read: “...I was too", "harsh when I told him I thought he hated Bach...”", "The wind blows the pages of the little book, then dies down", "so that we can go on reading: “What I wanted to say was that", "I thought he hated me...”", "EXT. LIME TREES - PERLMAN VILLA - AFTERNOON", "Another day. ELIO is sitting at his usual table under the", "lime trees, transcribing music. In the background, PERLMAN", "and OLIVER are discussing Oliver’s manuscript on Heraclithus.", "We can hardly hear their conversation.", "ANCHISE approaches Elio, carrying a large fish wrapped up in", "a t-shirt, which he uncovers for Elio.", "Anchise takes the fish towards the kitchen. Meanwhile the", "conversation continues.", "EXT. SOUTH TERRAZZA/ABBEVERATOIO - PERLMAN VILLA - DAY", "Later.", "ELIO sits nearby the pool with his head back on the cushion", "of his chair, his eyes closed. OLIVER, far away, is sitting", "on the edge of the trough, his feet in the water, reading the", "pages from the manuscript he showed Perlman.", "He looks towards Elio.", "He waves a sheet of his manuscript at him.", "Oliver gestures him to come closer. Elio does, slowly. He", "notices Oliver is wearing a red bathing suit.", "Oliver looks at Elio.", "ELIO is pleased that Oliver has asked his opinion on the", "manuscript.", "OLIVER, as if pretending to weigh Elio’s words carefully.", "He speaks ever so earnestly, as if hit by a sudden", "revelation, in a low tone. This makes ELIO feel ill at ease.", "He looks away.", "Silence returns. ELIO looks at OLIVER, in his red bathing", "suit, lying on the edge of the trough. And OLIVER lets", "himself fall in the water, to ELIO's surprise.", "EXT. RESTAURANT WITH DANCE FLOOR - NIGHT", "A restaurant bar with an open air dancing floor. Everyone", "dances a slow ballad from the “Flashdance” soundtrack. CHIARA", "and OLIVER are kissing.", "ELIO goes to their table with MARZIA and one or two of the", "others. He watches CHIARA and OLIVER.", "She moves her thighs in between his. Their moves are not the", "moves of people who stop at heavy petting.", "ELIO watches them dancing, thinks he’d give anything to be in", "her shoes. MARZIA studies the look on his face. He pretends", "to like watching them dance together.", "The music changes, “Love My Way” by the Psychedelic Furs hits", "the dance floor. At the sound of this song OLIVER changes his", "way of dancing to a more self-obsessed style. A perfect new-", "wave style.", "They all watch OLIVER’s solo act with surprise and amusement.", "ELIO looks at him, mesmerized, until MARZIA pulls him back on", "the dance floor. There is a strange energy and exchange of", "glances between them.", "Elio chooses not to be embarrassed and lets loose with a", "sharp little solo of his own. Close on Marzia amused.", "EXT. LAKE - NIGHT", "ELIO and MARZIA are at a small lake. One of their summer", "places. They strip their clothes off.", "ELIO shakes his head, feigning a puzzled look meant to show", "that he can’t begin to guess where she’d gotten such a", "notion.", "They run into the lake and swim in the moonlight.", "EXT. GARDEN IN FRONT OF THE KITCHEN - PERLMAN VILLA - DAY", "The next morning. OLIVER shows off his newly acquired talent", "with a soft-boiled egg, neatly shearing off the shell. He", "looks a bit hung-over, with circles under his eyes.", "ANNELLA comes in and while she is seating herself, asks:", "PROFESSOR PERLMAN and OLIVER laugh, then the Professor", "changes the subject.", "OLIVER looks awed.", "EXT. MAIN ENTRANCE - PERLMAN VILLA - DAY", "Later. ANCHISE is wiping the windshield of the Perlmans’ car.", "ELIO comes out just as CHIARA arrives on her bike. She asks", "him where Oliver is.", "CHIARA is disappointed.", "She leaves him and goes into the house. ELIO gets in the back", "seat of the car and waits.", "Then OLIVER and CHIARA come out. They speak for a moment,", "standing close. She kisses him on the cheek, then gets on her", "bike and takes off.", "OLIVER gets into the front seat of the car, but ELIO tells", "him to sit in the back.", "OLIVER gets in the back next to ELIO. He watches CHIARA", "riding away.", "OLIVER doesn’t respond.", "OLIVER turns to look at ELIO, surprised.", "While talking their bare legs briefly collide.", "There is a long pause as PROFESSOR PERLMAN comes out and", "speaks to ANCHISE.", "PERLMAN gets in the front seat. As there seems to be a tense", "silence behind, he turns around as the engine starts.", "OLIVER smiles at Elio as if to say: \"See?\"", "EXT. SIRMIONE - GROTTE DI CATULLO - DAY", "PERLMAN, OLIVER and ELIO walk through the magnificent ruins", "of the roman villa overlooking Lake Garda, the Grotte di", "Catullo (Caves). Perlman is explaining to Oliver that only", "part of the archaeological treasures of this area has come to", "light.", "A delegation of archaeologists is waiting for them. The", "senior member rushes up to PERLMAN and greets him. They all", "gather in the small beach that is dominated by the ruins.", "Perlman is showed with the arm of a statue. He is very", "excited. He goes in the water and walks through the shallows", "towards an inflatable boat that is standing by, ready to take", "them to the platform.", "Elio looks at Oliver with complicity. Takes the statue’s arm", "and offers it to Oliver, as for hand-shaking.", "Oliver accepts Elio’s apology and shakes the hand of the", "statue.", "EXT. FLOATING PLATFORM - LAKE GARDA - DAY", "A salvage operation is in progress. Some small boats surround", "a floating platform. At the center of the platform is a", "winch. There are scuba divers and other people all around.", "PERLMAN, OLIVER, ELIO and other men are on the boat, now next", "to the platform. At the center of the platform below the", "cable of the winch is a large opening. A steel cable is", "lowered into the water and steadied by the site workers.", "The wait. Finally the cable is pulled back up - it pulls an", "antique statue out of the water.", "PERLMAN, edging closer, watches the operation minutely.", "A bronze Boxer slowly comes up through the opening in the", "platform, secured by the husky divers, and as it does a chain-", "metal trap inches underneath it to prevent it from falling", "back into the water if something should go wrong.", "The statue, missing its left arm but otherwise intact, is of", "an athlete, a boxer, naked, a kind of finger-less glove and", "wrist-strap. Like the damaged arm and gloved hand, the statue", "is encrusted with the lake water deposits of a century.", "It is still possible to admire the beauty of the athlete’s", "face, set with enamelled eyes that seem to be staring", "straight out through the murky water at his rescuers.", "There is great excitement.", "EXT. SIRMIONE - GROTTE DI CATULLO (BEACH) - AFTERNOON", "Later, back on the beach. The bronze has been dried and", "cleaned. PERLMAN is speaking in Italian with the other men", "and women who took part in the operation, and who are", "analyzing the find. OLIVER gently caresses the statue.", "The sun is setting, casting its last rays on the long-missing", "athlete for the first time in more than a hundred years.", "EXT. WATER - LAKE GARDA - SUNSET", "They swim in a little cove not far from the rig that pulled", "up the bronze Boxer. It is almost dark, with a cloud streaked", "sky reflected in the water.", "The lights on the rig go on, including a big floodlight. The", "lake is surrounded by snow capped mountains.", "EXT. PERLMAN VILLA / MAIN ENTRANCE - NIGHT", "The Perlman car reaches the villa and all get out. ELIO runs", "around the house to get his bike and wheels it out on to the", "road.", "The two men smile at Elio's passionate haste.", "EXT. ROAD / RIVER - NIGHT", "ELIO is riding on his bike on the way to the river, trying to", "catch his date with Marzia. When he gets there, no one is", "waiting. He calls her name.", "INT. LIVING ROOM / KITCHEN / BOCCHIRALE - VILLA - DAY", "The next day. ELIO is playing the piano, immersed in thought.", "He breaks off, gets up, moves from room to room downstairs.", "The kitchen is empty as well. It’s the hour of siesta.", "Oliver’s bike is missing.", "Oliver’s book is on the big sofa in the bocchirale.", "Elio sits and opens the book. There’s a handwritten page", "inside.", "Elio closes the book.", "INT. STAIRCASE / CORRIDOR - PERLMAN VILLA - DAY", "ELIO goes back inside and up the stairs very quietly and", "along the corridor he shares with Oliver. He approaches", "Oliver’s door like a detective looking for clues.", "He is about to open it when he hears the sounds of someone", "coming up the back stairs; he opens the door to his own room", "instead, and walks in.", "INT. CORRIDOR / ELIO’S - OLIVER’S ROOM / SHARED BATHROOM - 42", "DAY", "MAFALDA appears in the corridor, holding the laundry of the", "two young men. She brusquely opens Oliver’s door, puts", "Oliver’s shorts, socks, handkerchiefs, maybe the blue", "“billowy” shirt, on his dresser. She goes out, then knocks on", "Elio’s door.", "ELIO says “Avanti” and she goes in with a pile of the same", "sort of clothes belonging to him. He’s lying on his bed,", "pretending to read a book. She leaves; he can hear her", "retreating footsteps.", "When she is safely gone he stealthily goes into Oliver’s room", "through the bathroom they share. He looks around Oliver’s", "room.", "INT. OLIVER’S ROOM - PERLMAN VILLA - DAY", "He goes to the little pile of laundry and examines it, sees", "the folded boxer shorts (or Jockey) - passes his finger tips", "over them, then goes to the closet.", "Hanging on a hook is the red bathing suit. He picks it up -", "it’s dry - and brings it to his face. He rubs his face inside", "it, smelling it, looks inside it as if searching for", "something, kisses every inch of it, licks the inside of the", "supporter as if trying to find a taste of Oliver.", "ELIO quickly slips out of his own bathing suit and pulls on", "Oliver’s. He undoes Oliver’s bed and gets into it, putting", "the pillow over his face and kissing it savagely, smelling it", "again and again, searching for Oliver’s scent, then wraps his", "bare legs around it.", "Suddenly he hears the sound of a bicycle approaching goes to", "look out the window. He can just partly see OLIVER leaving", "his bike by a wall and coming in the villa. Elio removes", "Oliver’s trunks and tidies up the bed, exiting the room.", "INT. CORRIDOR (1ST FLOOR) - PERLMAN VILLA - DAY", "ELIO runs towards the window at the end of the corridor and", "looks down from it. No one. Finally Oliver appears going down", "the steps and moving towards the stone trough.", "EXT. GARDEN - PERLMAN VILLA - DAY", "The following day. A thunderstorm and heavy rain dashes the", "plants in the garden and pours from the roof spouts.", "INT. LIVING ROOM - PERLMAN VILLA - DAY", "Inside the villa the three PERLMANS are sitting on a row on a", "big couch as the lights flicker.", "ANNELLA finds the book.", "The lights suddenly all go out in the house; the music from a", "long-playing record dies to a stop. There is a shout in the", "kitchen, MAFALDA.", "They have been sitting in near darkness. The rain beats", "against the window panes.", "EXT. ABBEVERATOIO - PERLMAN VILLA - DAY", "Later. ELIO is sitting under the trees with his score book", "open. OLIVER sits on the edge of the stone trough with his", "feet in the water, he is wearing his straw hat.", "Beat.", "OLIVER puts some pages of his manuscript into his old frayed", "book bag.", "EXT. PERLMAN VILLA - DAY", "On the way to the shed to collect their bikes, they pass", "ANCHISE, who hands OLIVER his bike with a wry smile. OLIVER", "smiles back.", "ELIO and OLIVER reach the road, where they pause for a", "moment. OLIVER pulls up his shirt and pulls down the top of", "his shorts to expose a big scrape and bruise on his left hip.", "ELIO leans over closely to see Oliver’s scrape, which is", "smeared with a black unguent. It looks painful.", "They continue on their way.", "EXT. TOWN SQUARE - DAY", "They arrive on their bikes at the little town square. OLIVER", "buys a pack of cigarettes, Gauloises. He lights one up, then", "offers one to ELIO.", "ELIO nods and OLIVER cups his hands very near Elio’s face and", "lights his cigarette.", "They walk their bikes towards the little World War I memorial", "in the center of the square which is dedicated to the youth", "of the town who perished in the Battle of Piave.", "They pause a moment to read the plaque.", "ELIO looks at OLIVER. He hesitates, then bursts out:", "ELIO looks him straight in the eye for once, summoning up his", "courage:", "Silence.", "There is a magnificent view. A tiny bus works its way uphill,", "with some bikers struggling behind it.", "To buy time, OLIVER turns to look at it before replying:", "OLIVER looks at ELIO for a long moment, then gestures towards", "the shop front where he takes his manuscript to be typed up.", "Two buses stop nearby to unload their passengers - older", "women arriving from adjoining villages to shop.", "ELIO turns to read the names listed on the monument. OLIVER", "returns.", "ELIO looks as if it has been his fault the typist made a", "mistake.", "OLIVER thinks about this.", "He slings his bag with its papers around him and the two are", "off down hill.", "EXT. COUNTRY ROAD/SPRINGS - FONTANILI GAVERINE - DAY", "Now that ELIO has laid his cards on the table, the scenery", "and the fine weather buoy his spirits. They ride together on", "the empty country road that at this time of day is all for", "them.", "Thirsty they stop by a factory. They ask for water to an old", "lady. Oliver is surprised to see a Mussolini picture hanging", "on a wall. They laugh.", "They’re again on their bikes. The countryside shines in all", "its grandeur.", "ELIO turns off into a little path towards some spring water", "ponds surrounded by willow trees. ELIO leans his bike against", "one of them, followed by OLIVER.", "Oliver puts his hands in the water.", "Oliver freshens up his face with this water.", "ELIO shakes his head. OLIVER waits for ELIO to say something.", "He stares at him.", "In the silence of the moment, ELIO stares back. It is the", "first time ELIO has dared to stare back at OLIVER openly.", "Before this moment he has always cast a glance, then looked", "away from Oliver’s steely gaze. It is as if, finally, ELIO is", "saying to Oliver: This is who I am, this is who you are, this", "is what I want.", "ELIO doesn’t back down. Neither does OLIVER.", "OLIVER sits down on the grass, then lies down on his back,", "his arms under his head, staring at the sky. Elio lays down", "next to him.", "ELIO doesn’t reply. OLIVER moves up close to him. Very close.", "He stares right in Elio’s face, as though he likes Elio’s", "face and wants to study it, linger on it.", "OLIVER touches Elio’s lower lip with his finger, lets it", "travel left and right, then right and left again. OLIVER", "smiles at ELIO as he lies there, and that very smile fills", "ELIO with a kind of apprehension about what will happen next.", "What happens next is that OLIVER brings his lips to Elio’s", "mouth in a warm I’ll-meet-you-halfway-but-no-further kiss, a", "conciliatory kiss. ELIO’s return kiss is so famished he loses", "himself in it.", "ELIO doesn’t answer. He kisses OLIVER again, lifting his", "face, as if to discover more, know more. Even with their", "faces touching, their bodies are angles apart. ELIO lifts one", "knee as if to face OLIVER.", "ELIO reaches for OLIVER in a quick, desperate move, lets his", "hand rest on Oliver’s crotch. OLIVER doesn’t move. With total", "composure, in a gesture that is both gentle and commanding,", "he brings his own hand there, letting it rest on Elio’s for a", "second. He twines his fingers into Elio’s, then lifts his", "hand. A moment of silence.", "He gives Elio his hand and helps him stand up. He pulls up", "his shirt to examine the scrape.", "EXT. ROAD - DAY", "They glide down the slope on their bikes, with wind in their", "hair.", "EXT. GARDEN IN FRONT OF THE KITCHEN - PERLMAN VILLA - DAY", "Lunch. A middle-aged Italian ART HISTORIAN COUPLE have been", "invited to lunch. The man, MARCO, is pompous, his wife,", "ELENA, no less so, dropping Italian expressions constantly", "into her conversation. ELIO and OLIVER can hardly keep from", "laughing.", "A few meters from the table Anchise laughs at the", "conversation.", "MAFALDA serves everyone ice-cream. As he begins to eat, ELIO", "notices red spots appearing on the dessert. It’s coming from", "above his head. He realizes that it is streaming from his", "nose, that he is having a nosebleed.", "Holding the napkin to his nose to stanch the stream of blood", "falling into his dessert, he rises and leaves.", "INT. KITCHEN - PERLMAN VILLA - DAY", "ELIO is in the kitchen looking for ice to stop his nose", "bleeding, but the freezer is empty.", "INT. BAR - PERLMAN VILLA - DAY", "In a very tight and confined space beside the living room is", "the Perlman bar. ELIO is sitting on the floor, his head", "tilted back, and is holding a napkin full of ice - now a", "mixture of blood and water - on his nose. Beside him is an", "ice bucket.", "OLIVER is in the bocchirale looking for him. Elio waves from", "the bar. Oliver goes over to him. ELIO smiles ruefully.", "ELIO shifts a little to make room. The place is very tight,", "his bare feet touch Oliver's ankles for a moment.", "OLIVER takes Elio's feet in his hands and begins massaging", "them, pulling on his toes until they crack. ELIO cries out in", "mingled pleasure and pain.", "Elio looks again at Oliver’s necklace with the Star of David", "on his chest.", "Oliver helps Elio up.", "INT. BOCCHIRALE - PERLMAN VILLA - DAY", "In the bocchirale OLIVER meets the sisters MARZIA and CHIARA.", "They’re giggling.", "As soon as the girls leave, Oliver takes off on his bike.", "INT. LIVING ROOM - PERLMAN VILLA - DAY", "The girls burst into the living room where Elio is lying on", "the couch. CHIARA sits at the foot of it, MARZIA stands", "peering down at ELIO. He looks up at her a bit sheepishly.", "CHIARA takes a cigarette out of a pack and lights it. She", "takes a drag on it, then holds it out close to the sole of", "Elio’s bare foot. He pulls it up fast.", "Marzia caresses his hair softly.", "She holds out her pack of cigarettes to him and he takes one.", "She lights it for him and he smokes it. CHIARA looks at him", "coolly, as if looking at a rival.", "EXT. RIVER - AFTERNOON", "ELIO walks into the fresh water and swims. Down the river is", "a group of his FRIENDS playing on the grass, Oliver isn’t", "there.", "Elio is not unhappy. There is a rippling shaft of sunlight on", "the water directly towards him. He swims into it.", "We see that Elio is now wearing his Star of David necklace.", "EXT. KITCHEN / PATIO - PERLMAN VILLA - LATER", "Elio exits the kichten as he drinks a smoothie, feeling", "rested. He calls to his mother who is sitting nearby.", "MAFALDA exits from the kitchen. While ELIO goes to sit with", "his mother.", "MAFALDA enters the kitchen.", "ANNELLA caresses ELIO’s hair. Notices the Star of David he is", "wearing now.", "EXT. SOUTH TERRAZZA - PERLMAN VILLA - EVENING", "After dinner. ELIO is in the terrazza, waiting for Oliver to", "return. He tries to read a book but he cannot concentrate.", "INT. ELIO’S BEDROOM - PERLMAN VILLA - NIGHT", "Late night. ELIO is sitting at his desk, wide awake. He has", "left the bathroom door intentionally ajar, hoping that the", "light from the foyer might stream in just enough to reveal", "his body. As ELIO hears OLIVER step onto the landing in the", "hall, he jumps back in his bed pretending to be asleep.", "OLIVER walks past Elio’s room without stopping, without even", "a hesitation, and goes into his own room and shuts the door.", "A few moments later ELIO hears Oliver open the door from his", "bedroom into their common bathroom. Then he hears the door", "into his own room from the bathroom click shut, as if being", "locked. ELIO sits up in bed.", "PERLMAN VILLA - DAY", "ELIO stands in the garden and looks up at Oliver’s window.", "There is a faint glow, like that of a desk lamp. A red", "bathing suit is drying.", "From inside we hear the sound of the Perlmans’ television.", "INT. LIVING ROOM - PERLMAN VILLA - AFTERNOON", "ELIO, restless, uncharacteristically idle, sits down with his", "parents to watch TV. Beppe Grillo, a standup comedian, is", "making fun of Bettino Craxi. ELIO half watches. He lights a", "cigarette.", "ELIO gets up and goes into his father’s study, to his desk,", "at the telephone. He dials Marzia’s number and she answers.", "EXT. STREETS - CREMA - EARLY EVENING", "Elio sees a bookstand and asks Marzia to wait for him. We", "stay with Marzia who sees Elio feverishly browse through the", "stand. He finds something he likes and buys it. Returns to", "her and gives her the book.", "On impulse, ELIO kisses MARZIA behind the ear. She seems to", "freeze. He kisses her again and whispers:", "EXT. STREETS/PIAZZA PREMOLI - CREMA - EVENING", "Outside in the street. They converse as they walk in French.", "They are walking very slowly, wheeling their bikes. There are", "frequent bursts of sound from behind shuttered windows: TVs,", "family arguments, music.", "They walk in the direction of Piazza Premoli, a beautiful", "town square dominated by a marvellous 18th century palazzo.", "She thinks for a moment.", "ELIO leans over in one of their pauses and kisses MARZIA", "lightly on the lips. She stops by the gate of Palazzo", "Premoli.", "Once they are close, he holds her face with both hands and", "leans into her as they begin to kiss, his hand going up under", "her shirt, hers goes in his hair.", "They enter the Palazzo courtyard and move into a dimly lit", "corner. Her hips respond to his, without inhibition. There is", "nothing between their bodies but their clothes. She slips a", "hand between them and down into his trousers.", "EXT. LAKE - NIGHT", "MARZIA and ELIO make love on the grass. He pulls out just in", "time and ejaculates on her belly. They burst out laughing.", "INT. ELIO’S BEDROOM - PERLMAN VILLA - DAWN", "Later. It is now dawn. ELIO is in his room sitting naked at", "his desk. His small lamp is on. He takes up a school notebook", "and tears out a page. He begins writing the note to Oliver:", "He crumples that up.", "He crumples that up too, and writes:", "He says to himself, out loud,", "He writes:", "He tears that up too, and tries again:", "He laughs, tears that one up, and writes once more:", "He reads this, liking it. He lifts his right hand to his", "face, smells his fingertips, his palm, then his other hand", "liking that too.", "ELIO gets up, folds the last note, and slips it under the", "door that separates his room from Oliver’s.", "INT. MAIN STAIRCASE - PERLMAN VILLA - MORNING", "ELIO coming up the steps as OLIVER is walking down.", "PERLMAN walks out of his office to join the conversation.", "PERLMAN and OLIVER exchange glances.", "INT. ELIO’S BEDROOM - PERLMAN VILLA - DAY", "ELIO enters his room. He sees the folded note he wrote to", "Oliver lying on his desk and opens it. Oliver has added:", "ELIO feels weak-kneed and has to sit down on his bed. He", "kisses the slip of paper, then holds it against his heart.", "Then he looks at the time on his watch: 10:30 AM.", "INT. PROFESSOR PERLMAN’S STUDY - PERLMAN VILLA - DAY", "PROFESSOR PERLMAN project images of classical athletes from a", "slide projector onto a screen in his study.", "On the screen is a close-up detail of a bronze navel in an", "impressively muscled stomach.", "There are several of these, and PERLMAN points out stylistic", "differences:", "Oliver, not unmoved by these images, steals a glance at", "Perlman to see if perhaps Elio’s father knows something about", "what is going on between Oliver and his son.", "EXT. TABLE UNDER THE LIME TREES - PERLMAN VILLA - DAY", "At the lunch table. A clock strikes two. Lunch is over and", "everyone folds his napkin and pushes back their chairs.", "Elio turns to Oliver to bring him into the conversation and", "to test his mood.", "But Oliver is non-committal and won’t be drawn into the", "decision.", "ELIO can’t help glancing at his wrist watch, but attempts to", "hide the gesture from OLIVER by reaching out for an uneaten", "cookie on a plate just as MAFALDA is removing it.", "Then, to tease ELIO:", "Oliver reaches for Elio’s wrist, but Elio pulls away and runs", "up the stairs.", "INT. KITCHEN - PERLMAN VILLA - DAY", "MAFALDA is cleaning up after lunch. OLIVER comes in.", "EXT. ABBEVERATOIO - PERLMAN VILLA - AFTERNOON", "By the abbeveratoio. ELIO and MARZIA jump into the water and", "wrestle with each other.  He darts a look at his watch: three", "fifty-five.", "She slips her hand inside his bathing suit and takes hold of", "him like she did in the street the night before.", "INT. KITCHEN - PERLMAN VILLA - AFTERNOON", "ELIO and MARZIA, in their swimsuits, run through the kitchen.", "Elio holds her hand, almost dragging her.", "They haven't dried up, and are wetting the floor as they go.", "INT. STAIRCASE/CORRIDOR (1ST FLOOR) - PERLMAN VILLA -", "AFTERNOON", "ELIO and MARZIA go up the stairs that take to the upper floor", "of the building.", "They enter a small door on the left end of the corridor.", "INT. SMALL SPIRAL STAIRCASE - PERLMAN VILLA - DAY", "A small and narrow spiral staircase. ELIO jogs up the steps", "with MARZIA.", "INT. ATTIC - PERLMAN VILLA - AFTERNOON", "ELIO and MARZIA enter the attic, it is filled with old", "furniture, books, and other unused stuff.", "Elio moves a mattress that was leaning on the wall and lays", "it on the ground. They pull off their bathing suits and lie", "on the mattress, ELIO on top.", "He takes off his watch, places it on a bed-side table, where", "he can see it. It is 4:29.", "The windows are open, but the shutters are half closed. The", "subdued afternoon light draws slatted patterns on the bed, on", "the wall, on MARZIA and ELIO making love.", "EXT. PERLMAN VILLA - LATE AFTERNOON", "ELIO comes downstairs  with Marzia as the evening guests pull", "up in their car: a GAY COUPLE one tall and thin, the other", "short and rotund. Both are professors on holiday, and both", "are wearing complimentary seersucker suits. Each carries a", "bouquet of white flowers which they present to ANNELLA.", "ELIO introduces them to MARZIA. They speak terrible Italian,", "one starting a sentence loaded with compliments, the other", "having to finish it.", "ELIO leads them into the house as MARZIA bikes off.", "INT. ELIO’S BEDROOM - PERLMAN VILLA - EVENING", "ELIO finds his father in his room going through all his son’s", "shirts hanging in the closet in order to pick out the", "unwanted present. He hands it to ELIO, who groans.", "The shirt isn’t so bad: a loose Hawaiian one with big white", "flowers on a black background. ELIO changes into it.", "EXT. TABLE UNDER THE LIME TREES - PERLMAN VILLA - EVENING", "ELIO bounds onto the scene, where PERLMAN is serving MOUNIR", "and ISAAC champagne, making something of an entrance.", "They rise and salute him with their glasses, exclaiming and", "exchanging delighted glances as their host’s beautiful son", "descends in their midst wearing the shirt they had given him.", "PERLMAN and ANNELLA look at ELIO for a moment, as if seeing", "him anew, then pour out a glass of champagne for him. On the", "table in front of them are a number of big black and white", "photographs of the bronze Boxer being pulled up out of the", "water.", "INT. LIVING ROOM - PERLMAN VILLA - LATER", "ELIO is playing the piano. For his final selection, he has", "chosen a piece by Poulenc. The others listen almost", "reverently. His wristwatch is on the piano.", "As he is concluding, OLIVER comes in from outside and makes", "his way towards the stairs.", "Only Elio sees him enter and Oliver makes “I don’t want to", "disturb you” motions with his hands before disappearing. ELIO", "is unperturbed. The sudden appearance of OLIVER may inject a", "dash of fire to the final - if wee-bit hurried - notes.", "ELIO stands up as his audience applauds and makes a little", "bow.", "He shakes hands with the guests, thanks them anew for his", "shirt, kisses his mother, and runs up the stairs. The big", "clock shows almost eleven.", "INT. ELIO’S AND OLIVER’S BATHROOM - PERLMAN VILLA - NIGHT", "In the bathroom ELIO pees. He says softly, looking down at", "his penis, “Do I know you?” He flushes the toilet and turns", "off the tap.", "INT. ELIO’S BEDROOM - PERLMAN VILLA - NIGHT", "When ELIO emerges from the bathroom he hears voices coming up", "from below as the guests are leaving. He reaches the window", "and looks down at “Sonny and Cher” who stand by the car", "saying their good-byes and laughing affectionately. The two", "men get into their car, the PERLMANS waving as it drives", "away.", "Right in that moment ELIO raises his gaze and sees OLIVER on", "the balcony above the main entrance.", "INT. CORRIDOR/EXT. BALCONY - PERLMAN VILLA - NIGHT", "ELIO walks onto the balcony where OLIVER is smoking.", "ELIO steps close to the ledge.", "INT. OLIVER’S BEDROOM - PERLMAN VILLA - NIGHT", "OLIVER sits on the bed, his legs crossed, looking smaller,", "younger. ELIO stands awkwardly at the foot of the bed, not", "knowing what to do with his hands. He keeps putting them in", "his pockets, then taking them out again.", "Hesitating, ELIO crawls onto the bed and sits facing him,", "cross-legged like Oliver, making sure their knees don’t", "touch. Needing suddenly to shed his shyness and inhibitions,", "ELIO decides he has to lean against something and slides up", "to the top of the bed, resting his back against the headboard", "beside OLIVER.", "ELIO looks down at the bed and at the two of them side by", "side on it, a moment he has dreamed of. Now here we are, he", "thinks, hardly able to believe it. As if to highlight that", "moment, OLIVER stretches his legs out, his bare feet next to", "ELIO’s own.", "With his toes, ELIO reaches over to Oliver’s toes and touches", "them. He slips his big toe in between Oliver’s big toe and", "his second toe in a kind of desperately playful mood.", "OLIVER reciprocates the movement, seeking out Elio’s other", "foot. ELIO moves closer to OLIVER, then hugs him. A kind of", "child’s hug, which OLIVER responds to only by saying, half-", "humorously:", "ELIO shrugs, not wanting to speak.", "It does, and ELIO nods yes, then no. Finally, OLIVER brings", "his arm around ELIO. He doesn’t stroke him, doesn’t hold him", "tight. ELIO loosens his own hold for a moment, giving him", "time enough to bring both his hands, seeking skin, under", "Oliver’s loose shirt and resume his embrace.", "ELIO nods again, Yes.", "OLIVER lifts Elio’s face with both hands and stares at him", "the way he did on the cliff, even more intensely.", "Then he suddenly pulls back, as if he might laugh, and runs", "his fingers through Elio’s hair, messing it up.", "ELIO brings his mouth to Oliver’s in a fiercely eager kiss.", "Something seems to clear away between them, and both abandon", "themselves to the kiss.", "ELIO hungrily kisses Oliver’s closed eyes, his nose, his", "ears, his throat, discovering them with his lips. OLIVER", "kisses him back as eagerly, even roughly.", "ELIO lies back on the bed. OLIVER climbs atop him and starts", "to undress ELIO.", "ELIO is soon naked and lies back in a kind of ecstasy as", "OLIVER moves his hands over his body, as inquisitive as", "Marzia’s had been the night before in the street. When OLIVER", "pulls the sheet back, ELIO loves being naked before him. No", "secrets. OLIVER kisses him, kisses his body, then returns to", "kiss Elio’s open lips again more deeply, as if he too is", "finally letting go. OLIVER is also naked, and not a part of", "him isn’t touching ELIO now. They stare at each other.", "An eternity seems to pass between Elio’s reluctance to make", "up his mind and Oliver’s instinct to make it up for him.", "They make love. Bodies are entangled. Elio is flushed,", "Oliver’s face is more implacable, his lips softly repeating", "what ELIO says, until he bends forward to say to him:", "They continue their rhythm, taking ELIO in a realm he has", "never known before, and murmuring his own name as if it were", "Oliver’s: Elio... Elio... Elio.", "The Star of David bounces on Oliver’s chest.", "A LITTLE LATER", "OLIVER, laying next to ELIO, picks up his billowy blue shirt", "from the floor and uses it to wipe the evidence of their", "lovemaking off his chest.", "OLIVER doesn’t answer and tosses the shirt aside. He takes", "ELIO in his arms, looks down into his face. He smooths out", "Elio’s hair with his hand. ELIO is falling asleep. OLIVER", "continues to hold him.", "INT. OLIVER’S ROOM - PERLMAN VILLA - DAWN", "Dawn. Light is coming in. OLIVER is still cradling ELIO in", "his arms but has shifted to a more comfortable position for", "them both.", "ELIO opens his eyes, sees OLIVER looking down at him but", "instead of smiling or lifting his face to be kissed, he", "closes his eyes again, as if blotting OLIVER, the bed, the", "room, and all that has happened out.", "He tries to sit up, stretches his limbs, and pulls the sheet", "over his nakedness. OLIVER stares at him, as if to register", "Elio’s morning after emotions.", "ELIO stays put on Oliver’s bed out of an exaggerated sense of", "courtesy. Relenting, he smiles back at OLIVER for the first", "time, though he wishes at that moment for OLIVER to be miles", "away.", "OLIVER continues to study his face, his own expression one of", "uncertainty.  Elio sits up, brushing Oliver’s hand away, and", "rises gingerly from the bed.", "INT. BOCCHIRALE - PERLMAN VILLA - DAWN", "In the dim light of dawn, OLIVER and ELIO leave the villa on", "bikes.", "EXT. RIVER - FIRST LIGHT OF DAY", "At the river, OLIVER walks knee-deep in the water with the", "blue shirt on, then dives in and swims away. Elio is swimming", "200 meters away, from a distance they look like two complete", "strangers.", "EXT. RIVER - DAY", "ELIO and OLIVER walk towards their bikes.", "He said this too swiftly to sound convincing.", "INT. STAIRS/ELIO’S ROOM - PERLMAN VILLA - DAY", "Back at the villa. There are some sounds from the kitchen but", "OLIVER and ELIO succeed to get back home without being seen.", "They reach their respective doors and, while ELIO is going", "in, OLIVER hesitates before going through his and steps into", "Elio’s room instead. ELIO is taken by surprise. OLIVER shuts", "the door.", "Surprised, ELIO, who doesn’t have it in him at this moment to", "disagree, lowers them and gets out of them. He feels awkward.", "ELIO does, and almost before he’s settled, OLIVER brings his", "mouth to Elio’s penis and takes it all in (off-screen).", "With that Oliver jumps up and exits the room, leaving Elio", "wondering what just happened.", "EXT. GARDEN IN FRONT OF THE KITCHEN - PERLMAN VILLA - DAY", "Breakfast.  Oliver, freshly showered, sits at the table lost", "in thought.", "The PERLMANS, MAFALDA coming in and out from the kitchen busy", "with breakfast.", "Finally ELIO comes in and gives his mother and father a kiss", "before sitting down at the table.", "He says nothing to Oliver.", "Everyone laughs, Oliver also is amused.", "The thought of Oliver's departure marks a shadow on Elio's", "face.", "More laughing. OLIVER leaves the table and walks away. ELIO", "watches him go.", "EXT. MAIN ENTRANCE - PERLMAN VILLA - DAY", "ELIO rides his bike out of  the gate.", "EXT. PIAZZA DUOMO - CREMA - DAY", "The central square with Crema's Duomo.", "ELIO sees OLIVER at the newsstand, scanning the headlines of", "the International Herald Tribune, before heading in the", "direction of the post office.", "ELIO rushes up to him.", "OLIVER stands still, dropping his hand with the bundle of", "unsent letters, and simply stands there staring at ELIO,", "shaking his head.", "Oliver leans in close to Elio and whispers in his ear...", "INT. KITCHEN - PERLMAN VILLA - EARLY AFTERNOON", "MAFALDA and several local women are busy making the local", "speciality, Tortellini Cremaschi.  They are talking politics.", "ELIO enters the kitchen from the outside, with two peaches in", "his hands and a towel on his shoulders. He says hello to the", "women and leaves the kitchen.", "INT. STAIRCASE - PERLMAN VILLA - EARLY AFTERNOON", "On the stairs he meets ANNELLA on her way up to nap and", "kisses her. She looks pleased by this unexpected show of", "affection from her teenage son. He eats a peach.", "INT. ATTIC - PERLMAN VILLA - EARLY AFTERNOON", "ELIO enters the attic. Puts the remaining peach on the old", "bedside table and lies down on the mattress where he made", "love with Marzia.", "He opens his book and starts reading but, easily distracted,", "starts looking outside the window at the glorious summer sky.", "He tries reading again, but still no chance. His gaze scans", "the room, the abandoned objects, the dark corners... the", "peaches.", "He stretches out his hand to one and plays with it. He turns", "its crease towards him. Then opens it half-way with his", "thumbs and pushes the pit out. The pit falls on the attic", "floor.", "He brings the fuzzy, blush-colored peach to his groin and", "lowers his swim trunks. He presses himself into it until the", "parted fruit slides down his erection. The fruit is leaking", "on him. Though firm, it breaks apart. Holding the two halves", "of the reddened core in either hand, he begins to rub himself", "with them.", "When his orgasm quickly comes, he carefully aims into the", "open peach. He holds the fruit in both hands and looks", "around. He places the two halves of the raped peach on the", "bedside table and covers himself with the towel.", "LATER:", "Elio wakes to the sound of someone entering the attic.", "OLIVER sits next to him on the mattress. He starts kissing", "him on one arm. He removes the towel to reveal, to his", "surprise, that Elio is not wearing his swimsuit.", "He then swiftly leans down bringing his lips to Elio's groin,", "but after a moment he looks up with a questioning expression.", "OLIVER looks at the broken peach beside them. He picks it up.", "ELIO nods in mock shame.", "Oliver pulls off his bathing suit.", "He peers into the peach for a moment, ELIO pretends to hide", "his eyes.", "But OLIVER dips a finger into the core of the peach and", "brings it to his mouth.", "OLIVER holds it farther away.", "ELIO lunges out again to grab the fruit from Oliver’s hand,", "but with his other hand OLIVER catches hold of his wrist and", "squeezes it hard.", "ELIO reaches out to him, bursting into tears. The emotion and", "intensity of their intimacy finally overwhelming him.", "He muffles his sobs against Oliver’s bare shoulder. Then", "OLIVER holds him close.", "They kiss as lovers committing themselves.", "EXT. GARDEN - PERLMAN VILLA -NIGHT", "The garden of the villa in the darkness, alluring and", "enigmatic.", "Oliver pulls Elio closer and kisses him deeply.", "INT. OLIVER’S BEDROOM - PERLMAN VILLA - DAY", "Next day. Elio wakes up to find himself alone in bed.", "Then he notices, hanging on the end of the bed, Oliver’s blue", "shirt, all clean and pressed by Mafalda, with an attached", "note from Oliver: “For Oliver, from Elio.”", "INT. STAIRCASE - PERLMAN VILLA - DAY", "Later. ELIO runs down the stairs wearing a bathing suit and", "OLIVER’s blue shirt, carrying a towel.", "The front door opens and MARZIA walks in. She looks at him", "questioningly. ELIO would like her not to be there.", "Elio doesn’t know what to say, or do.", "Elio doesn't reply. MARZIA leaves, trying to keep from", "crying.", "EXT. ABBEVERATOIO - PERLMAN VILLA - AFTERNOON", "By the pool. PERLMAN and ANNELLA sit at a table in their", "bathing suits having a drink.", "Perlman takes his wife’s hand in agreement.", "EXT. COACH STATION - MONTODINE - DAY", "OLIVER puts his suitcases in the open trunk of a waiting", "coach. He is saying his good-byes to the PERLMANS before he", "and ELIO get on the bus.", "ANNELLA kisses Oliver with great affection; PERLMAN shakes", "his hand warmly, all formality gone.", "Both say “Come back soon!\" The driver closes the trunk.", "ELIO says goodbye to his parents, unable to hide an honest", "smile of happiness.", "Chiara arrives driving her bike to say good-bye to Oliver but", "the coach is leaving...", "The Perlmans and Chiara watch the coach drive away as Elio", "and Oliver take seats inside it.", "INT./EXT. BUS - FROM CREMA TO ALPI OROBIE - DAY", "Oliver smiles and waves to Chiara from the back of the half-", "crowded bus.", "OLIVER takes his seat next to Elio.  They look at each other.", "Their gazes full of unaccountable emotions.", "Outside the window the summer landscape changes from the flat", "plains into the first Alps, the Orobie.", "EXT. BOSCO/PRATO - CASCATE DEL SERIO - DAY", "A small forest of beech and fir trees. ELIO and OLIVER walk", "on a trail with their backpacks.", "They cross a small bridge over a creek and reach a large", "mountain meadow, looking towards the mountain patiently", "awaiting something.", "Oliver looks at ELIO and hugs him, a friendly grab-hug.", "When they finally arrive at the massive cascade, the", "explosion of water from the mountain is violent and", "unexpected. The river leaps three times on the rocks before", "it reaches the bottom of the valley.", "OLIVER jumps up and in a very American impulse howls at this", "spectacle of water. ELIO laughs.", "They run to the water and disappear into the cascade as they", "call each other by their own names...", "INT. HOTEL BEDROOM - BERGAMO - AFTERNOON", "ELIO and OLIVER enter their hotel bedroom in Bergamo. They", "look around and laugh, for no apparent reason.", "There is a large window looking out over town of Bergamo.", "OLIVER stands looking out as ELIO comes up from behind him,", "putting his arms around Oliver’s waist. Their embrace", "transitions into a sort of wrestling as they fall laughing", "onto the bed.", "EXT. STREETS - BERGAMO - NIGHT", "Elio and Oliver are drunk. They stroll in the streets of the", "old town, stumbling, laughing. Taking advantage of a deserted", "alley OLIVER pushes ELIO against the wall and kisses him.", "Oliver suddenly stops.", "Among the soft sounds of the sleeping city is a distant", "melody.", "Elio tries to kiss him again but Oliver grabs his hand and", "pulls him away.", "EXT. PIAZZETTA - BERGAMO - NIGHT", "In a small square in the old part of town three young men and", "a girl are leaning on a wall. They are wearing oversized", "jackets and make-up; they are early examples of the \"New", "Romantic\" fashion.", "At their feet is a radio playing “Love My Way”, the song that", "was also playing at the open-air dancing bar a few weeks", "earlier.", "OLIVER looks at ELIO as if to say \"See?\", then salutes the", "youngsters, only to be ignored.", "The New Romantics seem uninterested.", "OLIVER starts dancing, as we already saw him do, alone. He", "then grabs the girl, intending for her to dance with him, and", "it seems like the situation could go badly.", "ELIO doesn't dance, he looks... uncertain.  Not at all well.", "At the song's climax he bursts out puking suddenly and", "abundantly.", "Oliver laughs as he runs to Elio’s side.", "EXT. STRADA CON FONTANA - BERGAMO - DAWN", "OLIVER holds ELIO's forehead as he pukes. Elio stands away", "from the wall making an \"I'm okay now\" gesture, and goes to", "the fountain nearby to splash water on his face.", "Oliver looks around to check that nobody is looking and", "starts kissing him again. Elio lets himself go.", "IT’S THE KISS OF A LIFETIME.", "INT. HOTEL BEDROOM - DAWN", "OLIVER stands naked on the balcony. He looks back in the room", "at ELIO sleeping in the bed.", "A flash of images suddenly appear- a rapid cut of moments", "from their time together over the summer.  It may be Elio", "dreaming or it may be Oliver’s memory.", "Oliver sits down on the bed next to Elio without waking him.", "He watches him sleep for the last time.", "A HISSING sound in the distance.", "EXT. BINARIO - STAZIONE DI CLUSONE - DAY", "It is the sound of a train arriving at the station, on the", "main platform.", "ELIO and OLIVER together look at the train come to a stop.", "ELIO is wearing Oliver’s blue shirt.", "On the platform are a few travellers ready to leave.", "Oliver's bags are those for his trip back home; they are", "about to say goodbye.", "The train doors open, some people come out, others get in", "while saying their good-byes to their counterparts.", "Elio and Oliver aren't moving, they try to delay the", "inevitable, if only for a few seconds.", "The voice on the intercom informs that the Express train for", "Milan is about to depart from Platform 1.", "The travellers are all on the train, except for Oliver..", "The conductor is a few cars down, looking at his watch. A", "moment of suspended, cruel silence.", "They hug tightly. After several moments OLIVER lets go first.", "Elio holds him tighter. Oliver hugs him back as they hold", "each other for the last time, letting their embrace say what", "words cannot.  Then they both let go and Oliver grabs his", "bags and enters the train.", "The train leaves. Elio watches it disappear in the distance.", "Wiped out, he walks along the platform and sits on a bench,", "his gaze lost in thoughts. After a long beat he stands and go", "to the...", "EXT. PHONE BOOTH - STAZIONE DI CLUSONE - DAY", "ELIO dials a number on a public phone, he does so", "mechanically. A few moments later somebody picks up.", "INT./EXT. CAR/COUNTRY ROAD - AFTERNOON", "ANNELLA is with ELIO in the car. She is driving back to the", "villa. ELIO is silent. Oliver’s blue shirt is open over", "Elio's bare chest and blows in the wind.", "She looks at him. She reaches out with her free hand and", "caresses his cheek, the sweetest gesture.", "Elio’s face crumples. He starts to cry. She wipes his tears", "away with her free hand but he cannot stop.", "EXT STREETS OF TOWN - AFTERNOON", "The Perlman car is parked in town. ELIO is alone, sitting on", "the passenger seat waiting for his mother. The car's radio is", "playing some summer song.", "In the distance, a group of Elio's friends are walking about.", "Among them is MARZIA, who notices the Perlman car, then Elio.", "She waves at her friends and leaves them to come towards him.", "Elio notices her only when she is close.", "Elio tries straightening up to hide his emotions, his face", "recently upset by tears.", "Elio nods, smiling back at her.", "Elio is surprised and comforted by Marzia's words. She", "extends her hand to him.", "Elio shakes her hand, then exits the car and hugs her,", "sighing. Annella is approaching.", "EXT. PERLMAN VILLA - AFTERNOON", "The car comes through the gate. ANCHISE comes forward to meet", "them at the car.", "ELIO avoids his eyes, not wanting to encourage him to say", "anything further, and goes inside.", "INT. OLIVER’S ROOM - PERLMAN VILLA - AFTERNOON", "Elio’s room, in which Oliver has stayed. Alone now, ELIO", "enters it and looks around. Everything of his has been put", "back, his clothes in the closet and drawers. He drops his", "backpack on the floor and throws himself down on the sunlit", "bed. The bedspread is the same. He closes his eyes. He is", "glad to be back in his old room, now full of sustaining", "memories of Oliver.", "INT. PERLMAN STUDIO - PERLMAN VILLA - EVENING/NIGHT", "Professor PERLMAN is sitting in his usual place. On his lap", "are proofs of his latest book. He is drinking.", "ELIO comes into the room to say good night. His father puts", "away his manuscript with a toss and lights a cigarette - his", "last of the day.", "PERLMAN takes a drag from his cigarette, then pauses a moment", "before speaking.", "Another pause, and another drag on his cigarette.", "In tapping his cigarette and leaning toward the ashtray, he", "reaches out and touches Elio’s hand. PERLMAN alters his tone", "of voice (his tone says: We don’t have to speak about it, but", "let’s not pretend we don’t know what I’m saying).", "ELIO looks at his father, then drops his eyes to the floor.", "ELIO is dumbstruck as he tries to take all this in.", "ELIO shakes his head.", "PERLMAN takes a breath.", "But the way he says this means “Even if she did, I am sure", "her feelings would be no different than mine.”", "EXT. CAMPAGNA - PERLMAN VILLA - WINTER DAY", "The Perlman villa in Winter. A snowy day. Six months later.", "ELIO walks in the countryside that surrounds the villa. He", "wears a heavy overcoat and beret.  Very New Wave looking.  He", "is listening to a Sony Walkman.", "He crosses the gate and comes back in the garden. He enters", "the house.", "INT. KITCHEN- PERLMAN VILLA - AFTERNOON", "A shot of someone finishing lighting the candles of a", "menorah.", "ELIO walks through the kitchen where Malfada is cooking", "latkes for Hanukkah. He stops to taste one and gives Mafalda", "a kiss on the cheek.", "He walks down the hall and past his father’s office.", "INT. PROFESSOR PERLMAN’S OFFICE- AFTERNOON", "The PERLMANS and are at a big table spread out with what look", "like application letters, with photos attached. It’s the", "ritual that takes place every year, they evaluate several", "letters of proposal sent by advanced graduate students in", "America. It's the ritual that brought about the choice of", "Oliver last year.", "ELIO walks past the room as his parents study the resumes.", "There are half a dozen young men and a couple of young women.", "But Elio is not interested in this. He walks into the living", "room to warm himself by the fire.", "INT. HALLWAY- PERLMAN VILLA- AFTERNOON", "The telephone rings and ELIO rushes to answer it, an", "expression of excited expectancy on his face. It is OLIVER,", "calling from New York.", "Before Elio can answer ANNELLA and PROFESSOR PERLMAN pick up", "the phone in the library.", "INT. PROFESSOR PERLMAN’S OFFICE - AFTERNOON (CONTINUOUS)", "They can hang up. Elio stays on the line...", "INT. HALLWAY- PERLMAN VILLA- AFTERNOON (CONTINUOS)", "Beat.", "INT. DINING ROOM - PERLMAN VILLA - NIGHT", "Elio enters the dining room which is decorated for a festive", "Hannukah dinner. The winter light is fading outside the", "windows.", "Activities continue around the table as Annella and Mafalda", "finish preparing for the meal. Placing flowers, filling wine", "glasses, etc.", "Elio crouches in front of the fireplace, the light of the", "fire reflected on his tear streaked face.", "We stay on his face, lost in thought.", "The entire end credit scrolls on his close up.", "Near the end of this close up we hear:", "Elio is so deep in thought that only after a long beat does", "he turns toward the sound of his mother’s voice.", "Fade to black."]}