{"ANDY": [" What floor is Elias-Clarke? Human Resources.", " This article was about the Take Back the Night march. This was a four-part series on the impact of busing on the public schools...", " And the other one--?", " Hi, I have an appointment with Emily Charlton--", " And you’re replacing yourself.", " Yes. Of course. Who’s Miranda?", " Sounds great. I’d love to be considered.", " What makes you think I’m not interested in fashion?", " What’s wrong?", " Wow, this is like self-esteem camp.", " My name is Andy Sachs. I recently graduated from--", " I think I could do a good job as your assistant and--", " No.", " No.", " That depends on--", " I was Editor in Chief of the Daily Northwestern. I won a national competition for college journalists with a series on the janitor’s union --", " --that uncovered the exploitation of--", " Thank you for your time.", " Don’t be a jerk.", " Okay, how is it that you know who she is and I didn’t?", " Yeah, it’s just that I’m not one of them.", " You should see the way the girls dress at Runway. I’m not sure I have anything to wear to work.", " I think I might.", " You are so full of it.", " Hello? Now?", " I’m almost there.", " Yes. She gave me the job.", " Actually, I’m from Cincinnati.", " What if the building’s on fire or my appendix explodes or something?", " Man the desk at all times. Got it.", " How do I prove I’m not a psycho?", " Wait. What do I do if--", " Hi, I’m Andy, I’m the new--", " That’s very nice of you, but I don’t need those. Miranda hired me. She knows what I look like.", " Actually, it’s Andy.", " What kind of--", " Demar--", " Yes?", " Demarchelier... Demarchelier...", " She called me in and asked me about Pier 59. She said something about Simone and Frankie and someone else. And she needs skirts from Calvin Klein. I think that’s the most important thing, but I couldn’t tell. Oh, and there was something about a pony.", " I tried to ask her, but--", " Me?", " So I just, what, go down to the Calvin Klein store and ask them--", " Of course not. I’m going... to his house.", " Sorry. Got it. What’s the nearest subway stop?", " Thanks.", " You’re going to say a million girls would kill for my job.", " I’m about to walk in. I’ll call you as soon as--", " There’s a um, variety of skirts. Let’s see...", " I’m sorry. What’s your name?", " It’s Liz.", " Is Ivan in by any chance?", " You haven’t peed since I left?", " The run-through. Right.", " Is it always like this?", " You eat lunch?", " None of the girls here eat anything?", " I’m a 6.", " Okay. You think my clothes are hideous. I get it, okay?", " No, no, no. It’s just...", " You should have seen the look she gave me. I thought the flesh was going to melt off her face.", " I just have to stick it out for one year. Then I can do what I came to New York to do. I can’t let Miranda get to me. I won’t.", " And give me that sandwich.", " Good morning, Miranda!", " I have Isaac.", " Dad! I’ll be right down!", " How did you-- I’m gonna kill Mom. Thank you.", " Oh, just go ahead.", " Hey. Not fair. I wrote those e- mails.", " Oh please. Not this again.", " Because it’s what you wanted. This is what I want.", " I’m an executive assistant.", " You have to trust me. Being Miranda’s assistant opens a lot of doors. Emily is going to Paris with Miranda in a few months, she’ll meet editors and writers from every important magazine.", " Absolutely, Miranda. Let me see what I can do.", " I need a jet from Miami to New York... A jet, any kind of jet... Yes, tonight, right now. From Miami to New York. As soon as possible. Please call me back as soon as the situation changes. I’m trying, Miranda. No one is flying out because of the weather.", " I’ve done everything I could think of. I don’t know what else to do.", " Oh my God. She is going to murder me.", " I’m so sorry, Miranda.", " I did everything I could think of--", " She hates me, Nigel.", " I need your help. I don’t know what to do. It’s like I’m completely beneath her contempt.", " That’s not fair. I’m lucky to be working for Miranda -- I didn’t get that at first, but I do now. I want to be here. But it just seems like no matter how hard I try, I don’t do anything right.", " Okay, fine!", " You do it with the other girls.", " Please, Nigel. Don’t make me beg...", " A... poncho?", " Miranda Priestly’s office. She’s not in. I’ll leave word.", " What do you think?", " Wanna lift, stranger?", " Bang & Olufsen. Charlie Rose sent it to Miranda for her birthday.", " Here... A bunch of Kiehl’s, some Mason Pearson hair brushes...", " It’s called “Pink”. For women.", " Sure you can.", " Thing is, it turns out there’s a lot more to Runway than fancy purses... you know who’s coming into the office Friday? John Updike.", " Look, there’s a piece by Jay McInerney, an essay by Joan Didion, an interview with Christiane Amanpour oh...", " Give me the phone.", " Give me the phone.", " Come on, guys. Give me the phone!", " I’m looking for James Holt...", " You.", " I’ll guard it with my life.", " Hi. I, um... I have to go.", " God, I love it when total strangers tell me how I feel.", " Christian Thompson? You’re kidding. You write for every magazine I love. I actually reviewed your collection of essays for my college paper.", " No, but I did point out some factual errors and a penchant for confessional semi-fiction that borders on self-indulgent.", " Well, I want to work somewhere like the New Yorker or Vanity Fair. I’m also a writer, but--", " Thank you. That would be great. Anyway, for now I’m Miranda Priestly’s assistant.", " Excuse me?", " I have to go.", " You. Are not a nice person.", " For your information, he’s really handsome. And we already live together!", " Where are you going?", " But I came back so we could hang out.", " Okay, look, I’m sorry about that--", " Yes, she explained every detail of her decision-making, then we brushed each other’s hair and gabbed about American Idol.", " What does that mean?", " Last time I was here, James was having this cool party and-- --and this is why you don’t like people riding up in the elevator with you.", " She pursed her lips and because of that he’s going to change his entire collection?", " --Galliano at Pastis. Done.", " It’s in the car.", " Of course. If I can deliver the Book, that means I must have done something right, that she doesn’t think I’m psycho. Oh, and she actually called me Andrea instead of Emily. Isn’t that great?", " Shit.", " But I can’t... Shh...", " Okay, before you start freaking out, it wasn’t such a big deal. The twins said hello, I said hello back, then I went upstairs and gave the book to Miranda--", " You’re right. I made a mistake.", " Wait a second. She’s going to fire me?", " Miranda, about last night, I--", " Of course. I’ll run down to Barnes & Noble right now.", " Not that I can recall.", " So you want the... unpublished manuscript.", " She doesn’t get it. There’s no way I can get that book. I don’t care who I call.", " Of course.", " No problem.", " Or--", " It’s for Miranda Priestly... it’s very important. Yes, I know, it’s impossible to get", " Anything? Can you try again? I would really appreciate any leads at all... thanks. No pressure. If I don’t have it by 3, I’m fired.", " Yeah. It’s a real party.", " Listen. I desperately need a favor. And I don’t know many people in the book world...", " We’re talking about Miranda Priestly. There is no plan B, only plan A.", " Is she back? Am I fired?", " Harry Potter. The manuscript. It’s for Miranda Priestly. I need it today. Can you make it extra hot? Like, center of the sun hot?", " Actually, it is. A million girls would kill for it.", " Want a mocha?", " I failed. She’s going to fire me anyway. Might as well beat her to the punch.", " Call you later.", " You didn’t.", " No. That would mean I actually... did something right. But see... thing is... See, I was about to...", " Yes, I’m meeting someone...", " I’m begging you. You have to stall her. Just ten minutes.", " Actually I made two copies. And had them color-copied, re-set and bound so they wouldn’t look like manuscripts.", " Anything else I can do for you?", " Listen, Nate--", " After I called you, I realized... It doesn’t make sense to throw away all these months of hard work. I just had a moment of weakness. That’s all.", " That’s all it is, Nate. Just a job.", " I get the point, Nate.", " Gstaad. It’s a ski resort. In Switzerland.", " Nate, it’s not like I run the magazine. I just work there, remember?", " What about these? These are pretty nice.", " Are you okay?", " Great. Thanks. That’s perfect, because I need to get to Magnolia Bakery before they close...", " Um... I thought only the first assistant went to the benefit.", " Don’t look at me. This is the last thing I want to do.", " I need to learn all these people by tonight?", " Lily, just start without me. I’ll be there as soon as I can.", " I will. I promise. Believe me, this is the last thing I want to--", " And you look... so thin.", " It’s definitely working.", " That’s... great.", " I was wondering how long you think we’ll have to stay because I was hoping to--", " That’s Massimo Cortileono, chairman of-", " Ambassador Franklin. And that’s the woman he left his wife for, Rebecca. The woman he’s leaving HER for is the man walking down the stairs in Valentino.", " That’s... Jacqueline Follet, right? From French Runway.", " Alors, Jacqueline, ditez-moi, avez- vous rencontré Brad Pitt?", " Are you sure?", " Thank you. Thank you so much.", " I’m sorry to bother you, but I’ve been dying to ask you... Is it true that John Cheever used to ghostwrite the editor’s page of Manhattan Magazine in the 50’s?...", " Hey, I figured out a few things on my own, too. Turns out I’m not as nice as you thought.", " Do you really say things like that to people?", " I have to go...", " Well, maybe I could-- No no no. I can’t. I just can’t.", " Can you go any faster?", " Happy Birthday.", " Can we at least talk about it this--", " I don’t understand what’s so difficult about scheduling a preview. If you want Miranda to give you any editorial, we’ll need to see the clothing at least three weeks before the show. Yes, please. See what you can do.", " Yeah. I’m... fine.", " Great. No problem.", " Sorry. Busy day. And my personal life is going down the drain. That’s all.", " Wait. You want ME to -- oh, no. No, no. Emily would die. Her whole life is about Paris.", " But--", " Okay. Emily. When you get in, I want to talk to you about something--", " Not exactly.", " I didn’t have a choice. You know how she is.", " Look, I know you’re mad. And I don’t blame you.", " Emily--", " Okay, now you’re scaring me.", " What are you talking about? I wouldn’t miss this.", " Come on.", " Actually...", " Sorry. I’ll be too busy working. You’ll have to find someone else’s life to change.", " He’s just a guy I know from work.", " You’re making a big a deal out of--", " It just happened--", " Great. Now you’re going to give me a hard time, too?", " Miranda asked me and I couldn’t say no, okay? I didn’t have a choice.", " Okay. I get it, you’re mad because I work late all the time, because I missed your birthday party--", " You hate Runway. And Miranda. You think fashion is stupid. You’ve made that clear.", " So now I have no integrity. Great.", " That’s absurd.", " You don’t mean that.", " Then maybe this trip is coming at a good time. Maybe we should take a break.", " Hello, Miranda...", " Wait. This is not right. Miranda is staying in the suite.", " This is my room?", " Oh, do I?", " Actually, Miranda has a dinner.", " Oh, you’re so full of it. You are not desolé at all.", " Sure. No problem. I have it right here, um...", " But your table is full.", " So Stephen is not... so you don’t need me to fetch Stephen from the airport tomorrow?", " Of course.", " Miranda, I’m so sorry. If you want me to cancel your evening, I can.", " Miranda, is there... is there anything else I can do?", " What do you mean?", " Oh, I just threw it on.", " What are we toasting?", " Nigel. I got my job months ago.", " You’re leaving? Nigel, I can’t imagine Runway without you.", " God. I’m so happy for you, Nigel. You deserve it.", " ...I’ve never seen anyone as dedicated as Miranda.", " I’m just saying, yes, there are things she does I don’t agree with, but...", " Okay, so she’s tough, but if Miranda were a man, no one would notice anything but how great she is at her job.", " I resent that.", " Sexy? Really?", " I have no idea where we’re going. You could be leading me anywhere...", " You are unbelievable. Do you write that stuff down and file it away to use on girls?", " Well, I never understood why everyone was so crazy about Paris, but now...", " What the hell is this?", " Of?", " They’re replacing Miranda?", " Miranda will be devastated. Runway is her whole life. He can’t do that to her.", " And she has no idea...?", " I have to go.", " Oh, thank God. Where are you?", " I need to talk to you. Right away. It’s about Jacqueline Follet, she--", " I have to talk to you.", " Miranda, wait. I have to talk to you. You can fire me if you want to after that, but... Irv is going to make Jacqueline Follet editor-in-chief of Runway. Christian Thompson told me, he’s going to work for her. Irv’s going to tell you today. I thought if I told you now, you could fix it.", " What? No. I specifically told them--", " You said it was your dream job.", " But you don’t need her. You could just leave anyway and-", " You sure about that?", " But I don’t think I am like that.", " That’s not what I -- that was different. I didn’t have a choice.", " But what if it’s not what I want? I mean, what if I don’t want to live the way you do?", " You’re such a pain.", " True.", " I just wanted to say...", " Nate, I’m just... I’m so sorry.", " And?", " That’s great, I... congratulations.", " You think?", " Not sure.", " You think so?", " Thanks. I actually have a job interview today.", " That’s fine.", " Learned a lot. In the end, though, I kind of screwed it up.", " Emily, it's Andy. Don't hang up. I have a favor to ask you.", " Thing is, I have all these clothes from Paris and I don't have anyplace to wear them, so I was wondering... is there any way you could take them off my hands?", " Thanks, Emily. I appreciate it."], "GUARD": [" Honey, you want West 57th."], "CLACKER #1": [" You look awesome today. I can’t wear cropped pants. I look like a whale.", " I know. She’s huge."], "CLACKER #2": [" Oh, please. I look terrible. I almost called in fat today.", " God, we should have a pig mask for Rhona."], "SHERRY": [" I have two positions available. One is assistant to the road test editor of Auto Universe magazine."], "EMILY (O.S.)": [" Andrea Sachs?", " While you’re out... Miranda needs you to go to Hermes and pick up twenty five scarves we ordered for her. Cassidy forgot her homework at Dalton, pick that up. And Miranda went out to meet with Meisel, she’ll want more Starbucks when she gets back.", " It should be there any second."], "EMILY (CONT’D)": [" Human Resources certainly has a bizarre sense of humor. Follow me.", " I can’t even talk about it.", " No, stay. I don’t want you walking past her. Just sit there and I’ll pray she doesn’t notice you marring the area.", " Okay, first of all, you and I answer the phones. The phone MUST be answered every single time it rings.", " Phones roll to voicemail, she gets very upset. If I’m not here, you are chained to this desk.", " I get to wear couture, go to all the shows, all the parties, meet all the designers. It’s divine.", " Okay, stay here. I’m going to the art department to give them the Book.", " The Book is a mock-up of everything in the current issue. We deliver it to Miranda’s apartment every night and she returns it in the morning with her notes. The second assistant is supposed to do it, but Miranda is very private and doesn’t like strangers going to her house. So until she decides you’re not a psycho, I get the lovely task of waiting around for the Book.", " Now, be prepared. The run-through is at 12:30 and people are panicking, so the phone is going to be ringing off the hook.", " After the loo, Serena and I are going to lunch. This is her. The new me.", " I told you.", " I get twenty minutes for lunch, you get fifteen. When I come back, you can go.", " --disaster.", " When Miranda gives someone an impossible task, it generally means one of two things. One, she thinks you can actually pull it off.", " You have to learn these too.", " John Folger. New artistic director, Circle in the Square.", " What gets me about this whole thing is, you’re the one who pretends you don’t care about this stuff. You don’t care about fashion, you just want to be a journalist, blah, blah, blah. What a load of bollocks.", " And you know what really kills me? The clothes you’re about to get. You don’t deserve them. You eat carbs, for Christ’s sake. It’s so unfair. Just go."], "EMILY": [" Okay, so... I was Miranda’s second assistant, but her first assistant recently got promoted so now I’m the first...", " I’m trying. Miranda sacked the last two girls after only a few weeks. We need to find someone who can survive here. Do you understand?", " You didn’t just ask me that. She’s the editor in chief of Runway. Not to mention a legend. Work a year for her and you can get a job at any magazine you want. A million girls would kill for this job.", " Andrea, Runway is a fashion magazine. An interest in fashion is crucial.", " Oh my God. No. No, no, no.", " She’s on her way -- tell everyone!", " Her driver text-messaged. Her facialist ruptured a disk. God, these people!", " Oh no. You’re still here. Go.", " I’m so sorry, Miranda. I did confirm last night, but--", " Right.", " Nobody. Human resources sent her up about the assistant job and I was pre- interviewing her for you, but--", " She wants to see you.. Go go go", " Andrea!", " Miranda decided to kill the Autumn Jacket story for September -- she’s pulling up the Sedona shoot from October. You need to go into the office right this second. Pick up her coffee order on the way. Write this down.", " Where are you?", " I hope you know this is a very difficult job for which you are totally wrong and if you mess up MY head is on the chopping block.", " One time an assistant left the desk because she sliced her hand open with a letter opener. Miranda missed Lagerfeld right before he boarded a 17 hour flight to Australia. She now works at TV Guide.", " Miranda Priestly’s office. She’s not available. I’ll tell her you called. Yet again. Remember, you and I have totally different jobs. You run errands, you get coffee, etcetera. I am in charge of her schedule, her expenses, her appointments. And, most importantly... I get to go with her to Paris for Fashion Week in the fall.", " I have no idea.", " I have Miranda Priestly calling. I have Patrick.", " Did she say which skirts? Did she say what kind? Color? Shape? Fabric?", " You never ask Miranda. Anything. All right, I’ll take care of the other stuff. You go to Calvin Klein.", " I’m sorry. Do you have a prior commitment? Is there some hideous pants convention?", " You’re not going to the store.", " You are catching on quickly. We always send assistants to a designer’s home on their very first day. You’re going to his showroom. I’ll give you the address.", " Good God. You do not. Under any circumstances. Take public transportation.", " Oh my God. What took you so long? I have to pee.", " You do the coat.", " The editors bring in options for a shoot and Miranda chooses. She chooses every single thing in every single issue. Run-throughs are a huge deal.", " No. Sometimes it’s busy.", " Oh, no. I was quite serious.", " Yes.", " Excuse me, where do you think you--", " I have no idea why Miranda hired her.", " I knew from the moment I saw her that she was a complete and utter--", " Guard this with your life.", " Yeah. Whoopee. Okay, now, it’s very important that you do EXACTLY what I’m about to tell you.", " Do not talk to anyone. Do not look at anyone. That is of the utmost importance. You must be invisible. Do you understand?", " You went upstairs? Oh my God. Why didn’t you just climb into bed with her and ask for a bedtime story?", " Don’t you understand? If you get fired, that might jeopardize Paris for me. And if that happens, I will search every Blimpie’s in the tri-state area until I find you and kill you.", " I don’t know. She’s not happy.", " Oh look, you’re getting paranoid. Yay. It’s not just me. Listen, don’t freak out. There could be a silver lining here.", " Or, you know, that thing you were saying about the cat.", " You know, I rarely say this to people who aren’t me, but you need to calm down.", " Tonight’s the benefit. I’ve been looking forward to it for MONTHS. I refuse to be sick. I’m wearing Valentino. Everyone’s going to be leaving to get dressed soon, so after you drop off Miranda’s Fendi bag at the re-beaders, you can just go home.", " I don’t see why she needs both of us.", " These are all the guests. Miranda invites everyone. We have to make sure they all think she knows exactly who they are. I’ve been studying for weeks.", " Don’t be silly.", " Oh my God, Andy. You look... chic.", " Do I? It’s for Paris. I’m on a new diet. I don’t eat anything, and then, when I feel like I’m about to faint, I eat a cube of cheese.", " I know. I’m just one stomach flu away from my goal weight.", " Ready?", " We need to make sure we’re there the second she walks in.", " There she is.", " She knows him.", " That’s... Wait... I know who that is... It’s...", " Thanks.", " Yes. Oh my God. Miranda hates her. She was supposed to arrive after Miranda left...", " You can go. I’ve got it from here.", " Go. Have fun.", " Everything okay?", " Sorry I’m late. Miranda wanted some scarves from Hermes and she told me yesterday but I forgot and so--", " I freaked out of course, but then I just called Martine at home and she opened the store early, so I got them.", " I hope it’s not another Miranda problem--", " Good. Because I’ve got so much to deal with before I go, I swear to God I can’t even--", " I don’t care if she was going to fire you or beat you with a red hot poker, you should have said no.", " Oh, please. That’s a pathetic excuse.", " Face it, Andy. You sold your soul the day you put on your first pair of Jimmy Choos.", " I said, go!", " My God, you call this a letter? Can you spell any word in the English language?", " You're joking. YOU have a favor to ask of ME?", " Well, I don't know. It is a huge imposition, but I suppose I could help you out... I'll have Roy pick them up this afternoon.", " Why can't you be more like Andy?"], "NIGEL": [" I thought she was coming in at 9.", " All right, everyone. Man your battle stations! Did somebody eat an onion bagel?", " We got the exclusive on the yellow Cavalli for Gwyneth, the one he showed with a huge feathered headpiece, but she’ll look like she’s working the mainstage at the Golden Nugget, so instead...", " Who IS that sad little person? Are we doing a Before and After piece I don’t know about?", " No...", " Clearly my opinion means nothing. Nigel Kipling. Fashion Director. Let’s see what we’re working with. Wow. It’s like Oklahoma and New Jersey had a baby out of wedlock.", " No, it’s not possible. Not you.", " I guessed 8 1/2.", " Do you?", " She means you. Go.", " Corn chowder. Interesting choice.", " Not since 2 became the new 4 and 0 became the new 2.", " Which is the new 14.", " You’re right. That’s what this multi- million dollar industry is all about. Inner beauty.", " Mr. Ravitz.", " Our biggest September ever.", " About 300,000.", " Always.", " I’m sorry... this is Andy Sachs, Miranda’s new assistant.", " Chairman of Elias Clarke.  You know what they say, tiny man, huge ego. We should have taken the stairs.", " You know me. A full ballerina skirt with a hint of saloon and I’m on board.", " --LaCroix from July? I thought of that, but with the right accessories, it could work...", " And that’s my problem because -- wait, no. Not my problem.", " So quit.", " Andy, please. Be serious. You’re not trying. You’re whining.", " Oh, no. No way...", " The other girls are different. They really want it.", " I don’t know what you expect me to do. These are all sample sizes -- 2 and 4.", " You’ll take what I give you and you’ll like it.", " They’re not expecting us until Tuesday. Did she say why?", " I see your point.", " And then there’s the pursing of the lips.", " Catastrophe.", " You still don’t get it, do you? Her opinion is the only one that matters.", " ...Posen’s doing some very sculptural suits, so Testino wants to shoot them at the Noguchi Garden in the Chase building.", " Of course. A few extra yards of fabric and a staple gun and we’re in business.", " Remember, there are two keys to wearing an evening gown -- one is to maintain a regal bearing. The second--", " ...this benefit is the social event of the season. It represents what Runway is about -- grace, style, elegance...", " The lizard’s better with the Dolce. Sometimes I can’t believe I talk about this crap all day.", " Get these to Miranda right away. Tell her I switched in the Dior for the Rochas.", " Hey. Adjust the attitude. Don’t make me feed you to one of the models.", " Join the club. You start to do well at work, that’s what happens.", " Hi. Listen, I need Miranda’s itinerary because--", " That outfit.", " Incredible. Well, I guess my work here really is done. Come on. Let’s have champagne. We’re celebrating.", " To getting the dream job, the one a million girls wanted.", " I’m not talking about you.", " Can you believe it? For the first time in eighteen years, I’m going to call the shots in my own life. One day I might be able to come to Paris and actually... see Paris.", " Bet your ass.", " For seventy-two years, Runway has been more than a magazine, it’s been a beacon of elegance and grace. Miranda Priestly is the finest possible guardian of that beacon, setting a standard that inspires people across the globe. Ladies and gentlemen, I give you Miranda Priestly.", " I’ve given her everything I have, Andy. She knows that.", " When the time is right, she’ll pay me back.", " No. But I hope for the best. I have to."], "CLACKER": [" Sorry, Miranda."], "MIRANDA": [" I don’t understand why it’s so difficult to confirm an appointment.", " The details of your incompetence do not interest me.", " And tell Richard I saw the pictures of for the feature on female paramedics and they’re all so unattractive. I don’t understand. How hard is it to find a decent-looking paramedic?... Also, I need to see what Nigel has called in for Gwyneth’s second cover try...", " I’ll do it. The last two you sent me were total disappointments. Send her in.", " Who are you?", " What are you doing here?", " So you don’t read Runway?", " And before today, you had never heard of me?", " And you have no style or sense of fashion.", " That wasn’t a question.", " That’s all.", " Is there a reason my coffee is not here? Was I unclear in some way?", " Emily!", " It’s too dark. I can’t see any of the clothes...", " And what is this? I want the title of the layout to bleed over the left side of the photo...", " No, no, no. That’s not what I want. I made that abundantly clear...", " What a fantastic story. So entertaining and full of useful information.", " Please bore someone else with your questions. Make sure we can get Pier 59 at 8 am tomorrow... Remind Jocelyn I want to see a few of those satchels Marc is doing in the pony... And tell Simone I’ll take Frankie if Maggie is not available tomorrow... And did Demarchelier confirm?", " Get him on the phone.", " Do you have Demarchelier?", " No... No... No... I swear I don’t understand why it’s so difficult for you to pull together a decent run- through. You had hours to prepare... Where are all the advertisers?", " We need more.", " Is it too much like the--", " Where are the belts for this skirt?", " Is something funny?", " This... stuff? Okay. I understand. You think this has nothing to do with you. You go to your closet and select, say, that lumpy blue sweater because you're trying to tell the world that you take yourself too seriously to care about what's on your body. What you don't know is that your sweater is not blue. It's not even sky blue. It's cerulean. You also don't know that in 2002,  De La Renta did a collection of cerulean gowns, Yves St. Laurent showed a cerulean military jacket, Dolce did skirts with cerulean beads, and in our September issue we did the definitive layout on the color. Cerulean quickly appeared in eight other major collections, then the secondary and department store lines and then trickled down to some lovely Casual Corner, where you no doubt stumbled on it.", " Get me Isaac.", " These eggs are frigid.", " Pick up the Polaroids from the swimwear shoot.", " The brakes in my car are making a weird noise. Take it in.", " We need the hat from the finale of the Zac Posen show.", " The girls need new boogieboards for spring break.", " Pick up my shoes from Manolo.", " ...and while you’re out, get Patricia.", " Get me Isaac!", " My flight is cancelled... Some absurd weather problem.", " Please. It’s just drizzling. Someone must be getting out. Call Donatella and get her jet. Call everyone with a jet -- Irv, Armani...", " Emily. Stop making excuses. GET ME HOME.", " The girls’ recital was wonderful. They played Rachmaninoff and everyone loved it. Except for me... because I was not there.", " Do you know why I hired you?", " That’s all.", " The gowns are fabulous, Ralph. We’re using the burgundy for the cover try and the lemon chiffon for the goddess story.", " Emily!", " Just let us out here.", " Yes. I did.", " Make sure you confirm my dinner with--", " And I need to see the look book for the November denim shoot.", " Fine.", " What did you want me to do? Walk out in the middle of a photo shoot?", " We were in a loft near the Seaport. My phone didn’t work. I told you.", " An-dre-a.", " I need the new Harry Potter book for the twins.", " Did you fall down and smack your little head on the pavement?", " We have all the published Harry Potter books. The girls want to know what happens next.", " We know everyone in publishing. Shouldn’t be a problem. You can do anything, right?", " My girls are leaving on the train to their Grandmother’s at 3. They’ll need the book by then.", " I’d like my steak in fifteen minutes.", " What is that doing here? I ordered it ages ago.", " One copy? What are my twins supposed to do with that... share?", " And where exactly are those fabulous copies? I don’t see them anywhere.", " Perfect. What about the accessories pages for April?", " We did that two years ago. What else?", " Florals. For spring. Groundbreaking.", " No.", " No.", " I want to make sure before the benefit that you are both fully prepped on the guest list.", " Only when the first assistant hasn’t decided to be disgustingly ill. You’ll come and help Emily.", " John. Good to see you.", " Massimo, you made it. I was worried you’d be too busy with your new factory in Ortezzano--", " Emily?", " Ambassador, Rebecca.", " Ah, Bonsoir, Cherie. Ta robe est rudement chouette.", " Thank you for coming to our little get together tonight.", " And we’re all so grateful.", " Darling, there you are.", " Come on, darling, let’s get something to eat. I’m starved, aren’t you?", " Andrea. Come up here.", " Paris is the most important week of my year. I need the best team possible with me.", " If you don’t go, I’ll assume you’re not serious about your future at Runway or any other publication.", " That’s all.", " Don’t forget to tell Emily.", " There you are. We need to go over the seating chart for the luncheon.", " By all means, move at a glacial pace. You know how that thrills me.", " Stephen won’t be coming.", " Well, if you speak to him and he decides to rethink the divorce, then “fetch” him. Fetch away.", " Another divorce in the papers... and we all know what they’ll say about me - - Dragon Lady, career-obsessed, drove away another “Mr. Priestly”.", " Don’t be ridiculous... why would you do that?", " Your job.", " Go.", " Excuse me?", " Excuse us a moment.", " Do not disturb me again.", " Are those freesias?", " If I see freesia anywhere, I will be very disappointed.", " Thank you everyone. Before I talk to you about James and everything he’s accomplished, I have news.", " I’m ready to go.", " You thought I didn’t know.", " Then I let Irv know Jacqueline was unavailable.", " Any of his other choices would find the job impossible and the magazine would surely suffer.  Especially because of the list--", " ...all of whom have promised to follow me whenever and if ever I leave Runway.  To any publication I choose. Of course, as soon as Irv understood, he reconsidered.", " I must say, I was impressed with you, how intently you tried to warn me.", " Of course you can. You already did. To Emily.", " No. You did choose. You chose to get ahead. You want this life, those choices are necessary.", " Don’t be silly, Andrea. This is what everyone wants. Everyone wants to be us.", " ...I don’t understand why it’s so challenging to get a car when I ask for one."], "MIRANDA (CONT’D)": [" Tell Simone I’m not approving the girl she sent in for the Brazil layout. I wanted clean, athletic, and smiling not dirty, tired and paunchy...", " RSVP yes to the Michael Kors party -- the car will drop me at 9:30 and wait until I leave at 9:45... Tell Natalie at Glorious Foods for the fortieth time -- no, I don’t want the tortes filled with warm rhubarb compote. I want the chopped almonds.", " Call my ex-husband and remind him the Parent-Teacher conferences at Dalton are tonight. Then call my husband and tell him to meet me for dinner at that place I went with Massimo...", " Who is that?", " Emily!", " There you are, Emily. How many times do I have to scream your name?", " I need ten or fifteen skirts from Calvin Klein...", " And Emily.", " What do you think?", " That’s all.", " I have to get home. Tonight. The twins have a recital at school tomorrow morning.", " I had hope. I always have hope. But you’re as disappointing as anyone else.", " Call James Holt’s office. Tell them I want to move the preview to today at 12:30. And tell everyone else. Be ready to leave in half an hour.", " Thank you.", " Oh, and you’ll be bringing The Book to my home tonight. Emily will give you the key, Andrea.", " Luckily, before I starved to death, Irv invited me to lunch. Get rid of that. I’ll be back at 3. Please have my Starbucks order waiting.", " And if you don’t have the Harry Potter book by then, don’t come back.", " Anyone have anything I can actually use?", " That no longer includes Emily.", " The decision is yours.", " Okay, so, first of all, let’s put Jay- Z at my table.", " When we get back to New York, we’ll need to think of a way to keep it out of the press.", " He knew who I was, you know. They all did. And at first they’re always proud to be with a powerful, accomplished woman. That’s what they say. But then...", " I don’t care what anyone says about me, of course. But it’s so unfair to the girls... another disappointment, another stepfather, gone...", " I mean, the point is--", " We really need to figure out where to put Donatella because she’s barely speaking to anyone.", " Have you lost your mind?", " Tonight is not just an important night for me, for Runway, and for James, it’s also important for someone else in this room...", " As of next month, James will be partnering with CFG in an expansion of his line.", " James and Runway have one important thing in common -- a commitment to excellence.", " And so it comes as no surprise that James has selected someone from the Runway family as the new copresident of JH International...", " My esteemed colleague, Jacqueline Follet.", " Let’s wish Jacqueline the best as she pursues this wonderful opportunity.", " And now to the business at hand. A celebration of one of my favorite designers...", " I’ve known what was happening for quite some time.  It took a little while to find a suitable alternative for Jacqueline, one she would accept. Turned out, that James Holt job is so absurdly overpaid--", " I never thought I would say this, Andrea, but I see some of myself in you. Your dedication, your focus.", " People think success happens to you. It doesn’t. You choose it. Every day, I choose excellence. Who else does what I do, at my level? Nobody. They don’t even understand what it takes, the days, measured in milliseconds...", " But now you know --and I know -- that you have it in you. That you can see beyond what other people want and choose for yourself."], "ANDY (CONT’D)": [" I came to New York to be a journalist and I sent letters to everyone and I finally got a call from Elias-Clarke and met with Sherry in Human Resources and basically it’s this or Auto Universe.", " Okay, you’re right. I don’t fit in here. I’m not glamorous or skinny and I don’t know much about fashion. But I’m smart, I learn fast and I will work very hard.", " Oh no. Mrs. Priestly’s office. That’s what I meant. Miranda Priestly’s office.", " She’s in a meeting. Can I take message? I’m sorry. Can you spell Gabbana-- Guess not.", " My name is Andy. Andrea, but people call me Andy.", " It’s just that both of those belts look the same to me. I’m still learning about this stuff, so--", " It’s not funny. She could be the most horrendous person I’ve ever met. She’s not happy unless everyone around her is panicked, nauseous or suicidal. And all the Clackers just WORSHIP her... They call them Clackers. Their stilettos in the marble lobby... clack, clack, clack...", " And they all act like they’re curing cancer or something. The amount of time and energy they spend on things that DON’T MATTER!!! Poring over these minute details. And for what?", " So tomorrow they can spend an extra 300,000 dollars reshooting something that was probably fine to begin with? To sell people things they don’t need?", " God, I’m not even hungry anymore. Maybe that’s why everyone there is so skinny.", " Wow. Thank God it’s Friday, huh?", " My Dad’s coming in from Ohio this weekend. We’re having dinner tonight. Then we’re seeing “Chicago”...", " You doing anything fun this weekend?", " It’s so good to see you. You want to start grilling me now or should we wait until after dinner?", " Dad, I swear. This is my break. This is my chance. This is my--", " -boss.", " I have to get it.", " I’m so sorry, Dad. I have to deal with this.", " I’m sorry, Dad. Miranda, you don’t understand. Even if I get you a plane, they won’t let you take off tonight and--", " You’re right. I’m screwing this up. And I know this could be a big break for me. I’m going to try harder, I promise. But there’s one thing I can’t do by myself.", " Can I help you, luv?", " Hello, Miranda. Fine. No problem. I’m leaving right now. You guys didn’t need to be such assholes.", " Hi, I’m Andy. I’m picking up for Miranda Priestly.", " Great. I have to get the impossible manuscript in four hours. And Smith and Wollensky’s doesn’t open until 11:30. How am I supposed to get the steak? She’s going to fire me, isn’t she? She’s just prolonging the kill. Like an evil cat with a tiny unfashionable mouse.", " Sorry, my boss is particular. Are you sure? You’re my last shot. All right, well, thanks for trying.", " Hello?", " I’m the same person I was. I still want the same things.", " I promise. Same Andy, better clothes.", " And this skirt? Okay. What about this?", " ...it’s Nate’s birthday and we’re having a little party for him--", " Anyway, have fun tonight.", " Oh, I love that. I’ll call you the second I’m leaving.", " Will that fit me?", " Nate, I’m so sorry. I was trying to leave, but there was a lot going on and I didn’t have a choice and--", " Miranda Priestly’s office. Thanks. I gotta go pick up the Polaroids from the shoot.", " She hasn’t eaten in weeks. I can’t do that, Miranda. I can’t.", " Lily, this show is amazing. I am so proud of you.", " Nate!", " It’s. So. Beautiful.", " I can’t do this.", " Nate and I only split up a few days ago. I’ve had too much wine and my judgement is impaired. I barely know you and I’m in a strange city. I’m out of excuses.", " Shit!", " I couldn’t do what you did to Nigel, Miranda. There’s no way I could do something like that.", " Nate, you were right. About everything. I turned my back on my friends, my family, on everything I believed in. And for what?", " Don’t know what I’m going to do without those late night grilled cheeses."], "NATE": [" Wow. You got a job at a fashion magazine. Was it a phone interview?", " And Lily works at that gallery doing-- What the hell is it that you do?", " You’re a corporate research analyst.", " You’re going to be answering phones and getting coffee. You need a ballgown for that?", " I think you look great. Always.", " Come on. Let’s go home. I can think of something you can do without clothes.", " Gimme that. There’s about eight dollars worth of Jarlsberg in there.", " Easy, Killer.", " Oh, no way. It’s mine now.", " I think we better get out of here before my girlfriend sees me with you.", " All for a woman who doesn’t need anything. Perfect.", " Why do women need so many bags? You get one, it holds all your junk, aren’t you done?", " Why, does he need a sweater?", " Look who’s drinking the KoolAid.", " Oh, look. The Dragon Lady. Of course.", " You got the nuclear briefcase from the undisclosed location. I’m proud of you.", " Doug and some of his banker buddies are playing Texas Hold ‘Em at his apartment. Gonna go get me some of that Wall Street cash.", " Man, I’m sorry. You didn’t make that crystal clear when you stormed off after calling me an asshole.", " I’ll see you later, okay?", " Quit? Are you sure?", " Wow. Good for you. Congratulations, Andy. You’re free.", " I went over to Dean & DeLuca -- man, they charge like five bucks a strawberry, but I figured, you quit, we should celebrate.", " So you quit, but you’re still doing the twins’ science project. Big of you.", " Either that or your job sucks and your boss is a wacko.", " No, no. It’s an important magazine. That’s what you said, right?", " The new Botox. The new pea coat. The new Gstaad. What the hell is--", " See? I now live with someone who knows that. Thank you, Miranda Priestly.", " That’s the thing -- I liked your old clothes.", " I like that.", " Don’t worry about it. I’m going to bed.", " You look really pretty.", " You’re going to Paris?", " I thought Paris was some big deal for Emily and--", " What the hell is wrong with you?", " I know, I know. That’s your answer for everything lately. I didn’t have a choice. Like this job was forced on you. Like you don’t make these decisions yourself...", " Oh, come on. What am I, four?", " Andy, I make port wine reductions all day. I’m not exactly in the Peace Corps. I wouldn’t care if you were out all night pole dancing if you did it with some integrity.", " You used to say this was just a job. You made fun of the Runway girls. And now you’ve become one of them.", " Look at you. Now that I know how much you’re willing to change to be successful, it makes me wonder if we ever had anything in common.", " I do. I really do.", " In case you’re wondering, the person whose calls you always take, that’s the relationship you’re in.", " I have to be at work in ten minutes. What’s up?", " Shoes. And jackets and belts and--", " I flew up to Boston while you were gone. Interviewed at the Oak Room.", " You’re looking at their new sous-chef. I’m moving up there in a few weeks.", " They have bread in Boston. Might even have Jarlsberg. We might be able to figure something out.", " You never know.", " I’m not worried about you. Anything you try, you’re gonna kick ass.", " No. I know it.", " And that’s what you’re wearing?"], "DOUG": [" Miranda Priestly is famous for being unpredictable.", " I’m actually a girl.", " Seriously, Miranda is a huge deal. I bet a million girls would kill for that job.", " Lucky for me, I have my dream job.", " -- which totally rocks. The free bagels on Thursday? The booze? The whores?", " Dammit, I love your job.", " Men can be pink. I have a pink side.", " Fashion is not about utility, Nate. An accessory is merely a piece of iconography used to express individual identity.", " That too.", " You’re going to Paris for the couture shows? That’s the coolest fashion event of the year -- who are you going to see Galliano? Lagerfeld? Nicolas Ghesquiere?"], "LILY": [" That would explain so much.", " You have to start somewhere. Look at this dump Nate works in. Paper napkins? Hello?", " Please. We’re eating.", " And it’s preeeetty.", " I’ll talk to her. Tell her she needs to get her own scrambled eggs.", " Okay, but hurry.", " I wasn’t sure you would be able to make it.", " I’m just glad you’re here. Start with the murals in the other room. They’re amazing...", " Yeah. That looked like work.", " The Andy I know is madly in love with Nate, is always five minutes early and thinks Club Monaco is couture. For the last 16 years I’ve known everything about that Andy, but this person?", " Sorry. Town car’s in the shop.", " And you’d be lost without me.", " Does this mean I have to give my purse back?"], "DOUG (CONT’D)": [" You’re right. There are no bagels. And only a few whores."], "NATE (CONT’D)": [" Asshole!", " Hello? Sure, Doug! I’ll get on it ASAP! A six- pack? No problem. Budweiser or Michelob? Chilled? Of course...", " Okay. Whatever. It’s your job.", " Let’s see... How to buy a custom-made 600 dollar bra. That’s important. A list of the 10 best wrinkle creams under $500. That’s important.", " I hope you two are very happy together.", " So, how about you? What are you going to do now?"], "NIGEL(CONT’D)": [" Welcome to the dollhouse, Baby."], "(MORE)": ["", "", "", "", "", "", ""], "JOCELYN": [" Run-through at 3, shoot 8 am tomorrow. Of course. No problem.", " Great. Fantastic. If you’ll excuse me, I gotta go pull a bunch of fringe purses out of my ass.", " Tough call. They’re so different.", " One thought was enamel -- bangles, pendants, earrings--", " Well, they’re showing a lot of florals for spring and so--", " No, no, no. I think Gisele should be the lizard and Vivian the donkey."], "JOCELYN (CONT’D)": [" Who the hell does she think I am, Houdini?"], "PAUL": [" ...I think he intended to use shadow to show the contours of the...", " I see, well, we needed room for the typeface to pick up the lines of the dress, which is cut on the bias, so we...", " But we thought about shooting them in an industrial space.", " --which--"], "ROY": [" Miranda’s new assistant. Congrats.", " You know--", " Actually, I was going to say those Jelly Beans are seven years old."], "MIRANDA (O.S.)": [" Are you there?", " What do they have?", " Who’s there? Who are you dealing with?", " Get away from her. She is useless and unattractive. Ask for Ivan, tell him we’re doing a reshoot tomorrow and need at least ten skirts."], "LIZ": [" You must be new. Congratulations. People would KILL for your job. I would. I love Miranda. She’s such an icon. I’ve dealt with her a couple times, but I’m sure she doesn’t remember.", " Liz.", " What did she say?", " I’ll get him."], "SERENA": [" I thought you were kidding.", " Me, neither. The other day we were in the Beauty Department and she held up the Shu Uemura eyelash curler and said “What is this?”"], "NIGEL (CONT’D)": [" You do know that cellulite is one of the ingredients of corn chowder.", " Something tells me you’ve got more polyblend where that came from.", " Miranda wants us upstairs. Chairman’s on his way down to her office.", " We could replace you in five minutes. With someone who really wants this job.", " You want me to say poor you, Miranda is picking on you? She’s just doing her job. Wake up, Six. You’re working at the place that first published some of the major artists of the century -- Halston, De La Renta, Lagerfeld. And what they made is cooler than art, because you live your life in it -- I mean, not you, but some people. This is not just a magazine. It’s a shining beacon of hope for, oh, I don’t know, say a young boy growing up in Rhode Island with six brothers, pretending to go to soccer practice when he was actually at sewing class and reading Runway at night under the covers with a flashlight.", " You have no idea how many legends have walked these halls and what’s worse, you don’t care. Because this is a “stepping stone” for you. This place, that people would die to work, you deign to work. And you want to know why she doesn’t give you a kiss on the forehead and put a gold star on your homework?", " Versace peasant skirt -- we can pull it up, belt it, make it a dress... Miu Miu boyfriend cardigan... Alberta Ferretti dress -- smocked, very forgiving. And let’s find you some Chanel. You’re in desperate need of Chanel.", " Don’t just stand there. We have to get you to the beauty department too. And God knows how long that will take.", " Make sure the girls face forward.", " Not bad. How do you feel?", " Let me know when your whole life goes up in smoke. That means it’s time for a promotion.", " Who put that together for you?", " James Holt. Massimo is investing in James’ company, taking it global with the rest of CFG -- shoes, bags, fragrances, the works. So James needs a partner. And that would be me. Miranda knows. She put me up for it."], "ANDY (CONT'D)": [" But I’m not going to be working in fashion forever. I don’t see any reason to change everything about myself because I have this job.", " I looked it up online. It’s 750 dollars. She doesn’t want it, so Emily told me to keep it. Oprah sent a present. So did Jessica Simpson. And Nelson Mandela."], "IRV": [" Nigel.  Issue going well?", " Great.  I heard Miranda killed Autumn Jackets and pulled up the Sedona shoot.  What’s that costing me?", " Must have been some lousy Jackets. But I’m sure she knows what she’s doing.", " Irv Ravitz.", " Congratulations, young lady.  A million girls would kill for that job."], "LUCIA": [" We have some pieces from Banana Republic and--"], "MIRANDA (CONT'D)": [" That color is worth millions of dollars and many jobs. And here you are, thinking you've made a choice that exempts you from the fashion industry. In truth, you are wearing a sweater that was selected for you by the people in this room. From a pile of stuff.", " I always hire the same girl, stylish, slender, worships the magazine. And often they turn out to be disappointing and stupid.", " But you, with your fancy resume and your big speech about your so-called work ethic-- I thought you would be different. I thought, go ahead, take a chance, hire the smart, fat girl."], "EMILY (V.O.)": [" They also need flip flops.", " The Book is assembled by 10 or 10:30, so you must wait around until then.", " You’ll be delivering Miranda’s dry cleaning with the book.", " The driver will take you to Miranda’s townhouse.", " Let yourself in.", " Open the door, walk across the foyer, then hang the dry cleaning in the closet across from the staircase."], "RICHARD": [" Here. Don’t want you to get behind in your rent.", " Thought I’d let you at least enjoy the bread basket first.", " We’re just a little worried. We get emails from you at your office at 2 am, your pay is terrible, you don’t get to write anything...", " I’m just trying to understand why someone who was accepted to Stanford Law turns that down to be a journalist and now you’re not even doing that--", " Why did you even bother applying to law school?", " This? Being a secretary?", " You hang coats, you go to Starbucks, you’re a secretary, Andy.", " Andy, come on. Let’s go in.", " Would it help if I talked to her?"], "ANDY (O.S.)": [" But--", " What’s a preview, anyway?", " And she tells them what she thinks?", " You probably don’t remember me. We met at James Holt’s party and I work for Miranda Priestly and--", " I’m sorry to ask you. I’m desperate.", " Emily--", " Emily, I have to talk to you."], "LILY (CONT’D)": [" Where did you get this? This is the new Marc Jacobs, sold out everywhere. It’s nineteen hundred dollars. I can’t take this.", " Have fun in Paris."], "JAMES": [" You must be the new Emily. Let me see.", " Duh.", " Come on. You work for Miranda, you must be in desperate need of hard liquor.", " Miranda. Great to see you.", " This season I started to think about the intersection of East and West..."], "JAMES (CONT’D)": [" Open-woven leather, pieced by hand and finished with a suede trim. Who made this fantastic thing?", " It’s a sketch of Miranda’s dress for the benefit, the centerpiece of my spring collection. Top secret stuff.", " She’ll have the punch. It’s deadly.  Have fun!", " You got the sketches for your dress.", " I didn’t want to do, say, a blonde in a kimono. It’s more about capturing the Eastern sensibility in the Western woman. Kind of Uma Thurman in Kill Bill in a kick ass dress with an obi belt. The modern woman as Geisha meets rock star, with a little Desperate Housewives thrown in.", " And this, of course, is the dress we’re making for you.", " A lush Asian fabric, tailored, but with a bit of movement to work against the modernism."], "CHRISTIAN": [" He’s right. I had the punch at James’s last party, woke up in Hoboken wearing nothing but boxers and a cowboy hat.", " But you want to stay. You’ve never been to a party like this.", " That’s my way. Christian Thompson.", " Did you mention my good looks and killer charm?", " You and the Times. And what do you do?", " Is that right? I should read your stuff. Send it over.", " You’re kidding. Oh, that’s too bad. You’ll never survive Miranda.", " You’re smart, you’re nice, you have a point of view. You can’t do that job.", " Let me guess. You have a boyfriend waiting. From... not high school... college? Nice-looking guy, devoted, about to ask you to move in with him, but you’re not sure...", " Nice to meet you, Miranda girl.", " Of course I remember you, Miranda Girl. You shaken off the college boyfriend yet?", " The Harry Potter manuscript? You’ve gotta be kidding.", " Just tell her it can’t be done. You’ll have to come up with a plan B.", " Oh yes. A friend of a friend does the cover art. She has the manuscript.", " You want this, you better hurry. Meet me at the St. Regis.", " You have one hour.", " Look at you... you’re a vision. Thank God I saved your job.", " God I hope not.", " Evidently.", " Are you sure? My editor from Vanity Fair is in there and I was going to introduce you to him. You sent me your stuff, remember? I have to be honest, I only read a couple -- that was quite a big packet - - but they weren’t half-bad. You’re pretty talented, Andy. He should meet you. Come on in. Just one drink.", " Say hello to the boyfriend for me.", " Hey, Miranda Girl.", " It’s true. I’m profiling Gaultier for Interview and I was making plans for Paris and found myself wondering if you would be there.", " That’s great. I’m staying at a fantastic little hotel in the Seventh across the street from a falafel restaurant that will change your life.", " But that’s just it. I’m starting to wonder if I can.", " You know, I’ve been thinking, and you still owe me for Harry Potter.", " Of course you do. You working tonight?", " So you’re free. Perfect. Oh, but there’s a problem, huh? Le Boyfriend.", " Yeah, not even a little. What time should I pick you up?", " That’s fantastic. Can we stop talking about her now?", " Oh, come on, Andy. You hate her. Just admit it. She’s a notorious sadist, and not in the good way.", " I can’t believe this. You’re defending her. The wide-eyed girl peddling her earnest newspaper stories -- you’re crossing over to the dark side.", " You shouldn’t. It’s sexy.", " Really.", " Don’t worry. I know this city like the back of my hand. It’s my favorite place on the planet. You know what Gertrude Stein said -- “America is my country and Paris is my hometown.”", " I work free-lance. Leaves me with some time on my hands.", " Thank God.", " What does it look like? It’s a mock- up.", " Of what American Runway will look like when Jacqueline is the new editor-in- chief.", " Yes. And she’s bringing me in to run all the editorial content. Are you really surprised? Jacqueline is a lot younger than Miranda. Has a fresher take on things. Not to mention that American Runway is one of the most expensive books in the business. Jacqueline does the same thing with a lot less money. Irv is a businessman, you know.", " It’s done. Irv’s going to tell Miranda after the party for James.", " She’s a big girl. She’ll be fine.", " It’s done, Andy."], "NIGEL (O.S.)": [" Miranda insists on seeing all the designer’s collections before they show them.", " In her way. There’s a scale. One nod, good. More than one nod -- very good. There is only one actual smile on record -- Tom Ford, 2001. If she doesn’t like it, she shakes her head."], "INTERCOM": [" Book’s ready!"], "EMILY (V.O.) (CONT’D)": [" And leave the Book on the table with the flowers."], "CASSIDY": [" It’s that door. On the left.", " We’ll give it to her.", " It’s okay."], "CAROLINE": [" You can give us the Book.", " It’s okay. Come on up."], "STEPHEN": [" I rushed out of an investment committee meeting early, then I sat there waiting for you for almost an hour...", " ...and I knew what everyone in the restaurant was thinking. There he is, waiting for HER again--", " It’s a banner evening. Three people have failed to recognize me, one person called me Mr. Priestly, and now the damned bartender refuses to serve me."], "MARTY": [" What an amazing job, working for someone like Ms. Priestly."], "BARRISTA": [" Sounds like a great job."], "CHRISTIAN (O.S.)": [" I’m brilliant. Really. Monuments should be erected in my honor."], "ST. REGIS BUTLER": [" Welcome to the St. Regis. Is there anything I can assist you with?", " Right this way."], "HENRY": [" Too much traffic on 5th. UN’s in session."], "PAUL (CONT’D)": [" We thought the contrast between the femininity of the florals--", " --and the um, the more raw, rough-hewn nature of the backdrop would create a tension which--"], "ANDY (V.O.)": [" Let’s see. My feet are killing me, everything pinches...", " ...my breasts are squeezed into a ball and this hairpiece is like having a boulder pinned to my head..."], "ANDY (V.O.) (CONT’D)": [" Never felt better."], "MASSIMO": [" I would never miss a chance to see you, Miranda, darling."], "JACQUELINE": [" I like your dress too. Very... Americaine. Sportif.", " Of course. I plan my whole year around it.", " After all, we’re family, no?", " Ah, no... Pas encore..."], "STEPHEN (CONT’D)": [" Why don’t you get me a drink? He’s gotta listen to you, right, little guy?"], "CHRISTIAN (CONT’D)": [" If you didn’t have that stupid boyfriend, I’d have to whisk you away right here and now.", " I was just thinking about you.", " Wait. Don’t tell me, The boyfriend is non plus? Je suis trés trés desolé."], "ANDY (cont’d) (CONT’D)": [" Okay, so lately I’ve missed a few things... a lot of things... almost everything.", " I am going--"], "LILY (cont’d) (CONT’D)": [" This glamazon who skulks around in corners with some random hot fashion guy? I don’t get her."], "BELLMAN": [" That’s correct, Mademoiselle. Miranda Priestly’s suite is down the hall."], "MIRANDA (V.O.)": [" --she jumped at it.", " Truth is, there’s no one who can do what I do, her included.", " --designers, photographers, editors, writers, models, all of whom were found and nurtured by me..."], "EDITOR": [" You know our pay is crap.", " Your clips were excellent. That thing on the janitor’s union... that’s exactly what we do here.", " That’s not what I hear."], "EDITOR (CONT’D)": [" My only question is... Runway? What the hell kind of blip was that?", " I called over there for a reference, left word with some snooty girl, next thing you know I got a fax from Miranda Priestly herself--", " ...saying that of all the assistants she had, you were by far her biggest disappointment.", " And that if I don’t hire you I’m an idiot.", " You must have done something right."], "EMILY (CONT'D)": [" Miranda Priestly's office."]}