{"scenarios": ["TITLES ON BLACK, APPEARING ONE AFTER THE OTHER", "Prologue about SPICE TBD", "DREAM SEQUENCE: EXT. ARRAKIS - END OF DAY", "The planet Arrakis, as seen from space.", "Track across its endless windswept terrain.", "We glide into a low-hanging dark cloud that’s generated by a", "massive mining vehicle, a HARVESTER, kicking up glowing", "flecks of SPICE. We PUSH through the SPICE, creating a", "dreamlike swirl of orange flakes.", "Through the swirl WE REVEAL a SECOND HARVESTER airborne,", "being hauled by a powerful CARRYALL.", "ON THE GROUND - HARKONNEN SOLDIERS flanking the harvester,", "leading the industrial nightmare through the darkness. One of", "them holds a massive flag bearing the HARKONNEN EMBLEM.", "Now these soldiers are observed through the P.O.V. of a", "thermal scope. Reveal that this scope is attached to a", "strange MISSLE LAUNCHER, one of multiple cloth-shrouded", "weapons being wielded by a small band of blue-eye FREMEN", "FIGHTERS taking cover behind a sprawling black rock. A young", "female fighter, CHANI, is among them; along with a man who we", "will know later as JAMIS. A closer look at Chani.", "Flickering Fremen PLASMA LASERS lance up at the second", "Crawler, EXPLODING it and the Carryall that carries it.", "Rockets are launched from the Harvester to retaliate,", "incinerating several of the Fremen in a brutal strike.", "The few surviving Fremen run for cover through a CREVASSE in", "their rocky position. Last through this opening is Chani.", "Before she disappears into this underground opening, Chani", "turns to look back with soul-piercing eyes, straight at us.", "INT. CALADAN CASTLE, PAUL’S BEDROOM - NIGHT", "In the wee hours of the night, PAUL ATREIDES, 16 years old,", "wakes up, startled by the dream.", "He sits in his bed... troubled.", "TITLES: CALADAN", "INT. CALADAN CASTLE - ROOM OVERLOOKING VALLEY - MORNING", "LADY JESSICA, 35, sits a table laden with food. Crystal", "glassware. She’s looking out at the beautiful valley. Wistful", "for the paradise she must soon leave behind.", "She turns to see Paul crossing the room to join her. As he", "takes his seat at the other end of the table and begins", "piling food on his plate...", "He slumps a bit at that. Much rather be in military...", "Paul can’t help but smile at that. His mother has a way of", "thinking two steps beyond him at all times...", "Jessica pours a glass of water for him. He reaches across the", "table, expecting her to hand it to him, but she doesn’t.", "Instead, she puts it down right in front of her.", "Paul knows what she’s doing, and he’s in no mood.", "A heavy sigh from Paul. Then... fine. He shrugs. Whatever.", "Looks right at her, and in a mocking impression of some kind", "of growly wizard...", "Lady Jessica is not amused. Not giving him any reaction.", "Okay. She wins. He takes a moment to collect himself, then", "stares at the glass, and:", "Nothing happens. He puts his hands up, like... “I tried.”", "There’s authority in her voice. It shakes him out of his", "impetuousness. A cleansing breath. He closes his eyes. Draws", "on something within himself.", "His eyes open, focused on Jessica:", "His words ripple through the air, folding in and around", "themselves, a hundred whispers but only one voice. It’s", "nothing you’ve ever heard a human do.", "Jessica watches her own hand as it reaches for the glass. Her", "mind struggles to defy his command. Has he done it...?", "She lifts the glass, begins to move it to him... and then", "stops. Puts the glass down. His Voice wasn’t strong enough to", "break her. But she’s pleased.", "He reaches far across the table and grabs the glass.", "Touché. He lifts his water glass to that, then drinks. And", "shovels more food in his mouth. Still boyish.", "He hesitates a moment too long before he gives her the lie:", "EXT. CALADAN TARMAC - DAY", "Several Atreides flags flapping in the wind.", "Paul squints at a distant spaceship in the bright morning", "sky. It comes in fast.", "The huge Imperial Spacecraft lands. Its door opens: a red", "carpet deploys automatically, rolling at high speed across", "the tarmac.", "A phalanx of dignitaries gets out, men and women in varying", "degrees of ceremonial dress, and led by strikingly formal man", "carrying an ornate SCROLL.", "They stride across the tarmac. On each side, ATREIDES", "OFFICERS in formation. Waiting at the end of the red carpet:", "DUKE LETO ATREIDES in ceremonial noble dress. A soldier’s", "build and a poet’s eyes. At his side, LADY JESSICA.", "To their left and right, THUFIR HAWAT, unmistakably a", "Mentat... and GURNEY HALLECK, who is as sour and", "uncomfortable as his Duke is warm and welcoming.", "Leto keeps his eyes straight forward, but:", "Gurney’s scowling face doesn’t change.", "Which makes the Duke actually smile, which makes Gurney", "actually smile juuust a little too.", "The question jolt’s Hawat’s mind into Mentat functioning. His", "eyes roll back as he calculates.", "Leto and Gurney sigh.", "At the end of the Atreides lineup... PAUL, in ceremonial", "dress, staring at this curious retinue in front of him.", "Among them are royal courtiers of some kind, as well as a", "woman in what appears to be religious garb. She keeps her", "eyes cast to the ground.", "The procession stops a respectful distance from the Duke, and", "the man with the scroll says, in a loud, officious voice:", "He gestures to those who have accompanied him.", "The RELIGIOUS WOMAN finally lifts her eyes to see JESSICA", "staring right back at her. They share a similar kind of", "adornment to their clothing. As if part of the same order.", "The Bene Gesserit woman does not look down anymore. And you", "would be forgiven to think she did not come here to witness", "the signing of a document... but for something else.", "With a flourished SNAP, the Herald unfurls the SCROLL.", "Leto steps forward, and the Atreides TURN AS ONE to face him.", "That was no mere formality. That was passion. And we can see", "in the faces of the Atreides men... they love their Duke.", "Paul feels it too. His father is a great man. An", "intimidatingly great man.", "With one voice, the officers shout out:", "The Herald is pleased. He gestures for Duke Leto to approach.", "Leto takes the ceremonial quill and signs the scroll.", "Then the Bene Gesserit sister steps forward and lights a", "small stick of wax, muttering a prayer to herself as the wax", "drips into a pool on the scroll.", "Duke Leto holds up his hand. On it, a SIGNET RING. He presses", "it carefully into the wax.", "THE BENE GESSERIT looks at Jessica once more... then casts", "her eyes toward PAUL... then back to Jessica.", "Jessica tries to keep her composure, but a message has just", "been sent. And whatever it is, it has frightened her.", "Leto pulls his ring away from the seal. The Herald checks it,", "is pleased, and then quickly rolls the scroll back up.", "The Herald looks right into the Duke’s eyes. The hint of an", "unsettling smile on his face.", "EXT. CALADAN - DAY", "Lush mountains. A ear-splitting noise breaks the silence.", "A FIGHTER SPACECRAFT flies by at high speed and ridiculously", "low altitude, then does a brutal maneuver between rocks,", "leaving only echoes of thunder in the valley.", "INT. CALADAN MILITARY HANGAR - MORNING", "The Fighter lands with reckless speed but great precision, in", "a military hangar.", "Nearby, a squad of ATREIDES COMMANDOS are prepping equipment:", "Swords, lasguns and rocket-launchers. Armor and shield", "generators. Survival gear. They radiate calm confidence.", "Comrades-in-arms who have come through many battles together.", "A powerfully large man, DUNCAN IDAHO, in his pilot’s uniform,", "helmet tucked under his arm, is circling the ship with an", "OFFICER (LANVILLE) and TWO TECHNICIANS.", "Duncan lays one huge hand on Lanville’s shoulder.", "Lanville grin and nods. Duncan turns to his commandos to give", "more instructions, then sees:", "Paul’s been waiting at the entrance of the hanger. Duncan", "runs to him and wraps the boy in a hug.", "Paul’s laugh is short: his mood is too serious for joking. He", "checks to make sure no one’s in earshot.", "Paul screws up the courage to ask the impossible. Then:", "DREAM SEQUENCE: EXT. ARRAKIS DESERT - DAY", "On the surface of a sand dune, orange SPARKS. Dancing into", "the air, shining in the sun like orange snowflakes. SPICE.", "We see glimpses: HARVESTERS. HARKONNENS. THE FREMEN AT WAR.", "CHANI LOOKS RIGHT AT US.", "Paul doesn’t react to Duncan’s humor, lost in his visions.", "EXT. SPACEPORT TARMAC, DAY", "Thousands of HARKONNEN SOLDIERS walk into the open bays of", "their SPACECRAFT. Flags bearing the HARKONNEN EMBLEM are", "everywhere. One huge spacecraft lifts off.", "ARRAKIS FROM SPACE", "An impressive fleet of military ships bearing the Harkonnen", "Emblem is leaving Arrakis.", "CALADAN MILITARY HANGAR", "Whoa. Silence. Then, very seriously:", "LAST DREAM SEQUENCE: EXT. ARRAKIS DESERT - DAY", "Duncan’s strong silhouette clearly visible among FREMEN,", "hiding in the shadow of a huge rock. They wear stillsuits.", "CALADAN MILITARY HANGAR", "Duncan is exhilarated:", "INT. KYNES’S LABORATORY CORRIDOR (ARRAKIS)", "Dead soldiers lie scattered across a sandy stone floor.", "Duncan lies among them.", "CALADAN MILITARY HANGAR", "Duncan is briefly shaken -- but Paul’s last words flood his", "face with relief. He claps his hands.", "He claps Paul on the arm and heads back to his men...", "Paul stays behind, lost in his thoughts, out of arguments.", "There’s only one person left to ask.", "EXT. CALADAN’S CLIFFTOPS - DUCAL CEMETERY - DAY", "An ancient graveyard overlooking the sea.", "DUKE LETO is carefully wiping stray dirt from a gravestone,", "on which is carved a bas-relief of a man fighting a giant", "bull.", "He sees PAUL walking to join him. Pleased at the sight of his", "son.", "A last look at the grandfather’s gravestone.", "Leto looks around him. The serenity of the Atreides cemetery.", "The centuries old tombstones.", "It takes all Paul’s courage to pronounce the next lines.", "Leto looks at his son directly in the eyes.", "Paul sighs. He has heard that before.", "Leto takes a deep breath. He needs to change the tone of this", "conversation. He raises his hand, his SIGNET RING glinting.", "Paul is surprised by this revelation.", "Leto looks into Paul’s eyes. Means this from his heart.", "Paul absorbs that, moved by his father’s honesty.", "Paul’s heart is broken, but his father has moved him.", "INT. CALADAN BARRACKS - OFFICERS’ MESS - NIGHT", "Duncan’s send-off party is in full roar. Three dozen officers", "of the Atreides legions are cutting loose, hair tousled and", "jackets unbuttoned. Drink flows freely. Leto is with them,", "celebrating with his men. Their leader, but also one of them.", "Gurney Halleck plays the baliset as two men dance on a table", "like cossacks.", "The men CHEER and toast!", "GURNEY HALLECK sits alone on a bench, glowering into his", "beer, and plunking with one hand on his baliset.", "Duncan drops down beside him.", "He clunks mugs in a one-sided toast, spilling beer.", "Duncan stares at Gurney, disturbed.", "Duncan looks up. There stands Leto. The Duke speaks in", "lowered tones, for their ears alone:", "Gurney nods reluctantly. Fine. He’ll stop grouching. He", "toasts Leto, who then turns to Duncan.", "Duncan’s grin ratchets down a few notches. Oh, shit.", "Gurney hands the Duke a trimmer. Duncan starts to rise, but", "Gurney and Lanville have him by the arms. The room erupts in", "laughter as Leto steps in.", "EXT. CALADAN TARMAC - DAWN", "From high above, we look down at the tarmac, as Duncan’s men", "are getting into the STEALTH SHIP.", "We see the unmistakable figure of DUNCAN IDAHO from behind as", "he strides toward the ship. Then something makes him stop.", "He turns and looks up, and we see now: he’s clean shaven.", "REVEAL: Paul, looking down at Duncan from a castle window.", "Duncan holds a hand up in goodbye. And in that moment, both", "of them want Duncan’s words to be true: maybe Paul hasn’t", "seen the future, but only what might be.", "Duncan’s Spacecraft takes off in a brutal swirl of dust,", "vanishing into Caladan’s blue sky. Paul is left behind, sad.", "INT. PAUL’S BEDROOM - SAME TIME", "Soldiers and servants are helping Paul to move his belongings", "out of his quarters.", "INT. PAUL’S STUDY- DAY", "Paul’s study has been mostly packed in boxes.", "Paul is reading a book about FREMEN, fascinated. Beside him,", "a FILMBOOK HOLOGRAPHIC DOCUMENTARY shows a distant cloaked", "silhouette walking in the desert, using strange erratic", "patterns. A FREMEN, using the sandwalk. The image is old, of", "bad quality.", "Paul tries to mimic the sandwalk.", "INT. TRAINING ROOM - DAY", "Paul stands in a fencing practice room, a sword in his hand.", "Dressed for practice, breathing deeply, sweat on his brow. He", "faces a battered old target dummy.", "He lunges in a precision attack, his arm strong and sure.", "Recovers -- and attacks again. Paul feels a presence but", "doesn’t turn. Someone else is in the room.", "Paul turns.", "Gurney stands behind him. His arms are full of swords and", "knives in scabbards.", "His tone is teasing. Gurney grins. He’s the closest thing to", "a friend Paul has among his father’s retainers. Gurney knows", "Paul since he was born and loves him like if he was his own", "son.", "He lays the weapons out on a table in matched pairs.", "Gurney picks up a rapier and without warning, he throws it in", "Paul’s direction. The blade thunks deep in the wooden table", "beside Paul and stands quivering.", "Paul drops his practice weapon and grabs the rapier.", "Gurney activates his shield. A shimmering force-field appears", "around him, then fades into invisibility. Paul follows suit.", "Gurney lunges forward. Their blades clash.", "Paul STRIKES, rapidly -- his blade making splashes of light", "in the air where Gurney’s shield blocks the blow --", "Then he lunges more slowly -- and slips his rapier into", "Gurney’s shield. Only the slow blade penetrates.", "They fence -- a sparkle of energy where their shields", "intersect -- until Paul attempts another slow attack. Gurney", "grabs Paul’s blade in his gloved hand, lunges through Paul’s", "shield and SLAPS PAUL’S FACE with the flat of his blade.", "Paul jerks back, shocked. Rubbing his cheek. Gurney glowers.", "Gurney appears to become genuinely angry.", "He attacks fiercely, his sword snaking into Paul’s shield.", "Paul falls back, hard-pressed. Backed up against the table.", "Paul rolls across the table-top and comes up on the far side", "with a dagger in his free hand. Two weapons now.", "He leaps over the table. His rapier a flickering flame.", "Paul’s in trouble. He takes a deep breath.", "Paul executes a surprising combat move.", "He deflects Gurney’s blades, gets inside his guard -- and his", "blade stops, quivering, an inch from Gurney’s throat.", "Paul glances down without lowering his sword. Gurney has a", "dagger in his left hand, the blade an inch from Paul’s groin.", "He grins and deactivates his shield, sheathing his blades.", "His menacing aspect melting away.", "Paul sighs and puts away his own weapons.", "He fingers the inkvine whip scar along his jawline.", "SPACE - GIEDI PRIME", "A charcoal-gray world orbits a cold blue sun.", "SUPER: GIEDI PRIME - HOMEWORLD OF HOUSE HARKONNEN", "EXT. CITYSCAPE OF GEIDI PRIME’S CAPITAL", "A synthetic megalopolis with rivers of plastic. A ship is", "landing inside some artificial mountain.", "INT. HARKONNEN PALACE - CORRIDOR - DAY", "“BEAST” RABBAN HARKONNEN strides down a passageway.", "He is a giant, raised in Harkonnen savagery. For him, cruelty", "is not a choice but the way of the world. The strong survive.", "He passes masked guards. Terrified slaves standing against", "the walls like furniture. These things are ordinary to him.", "HARKONNEN BATHS", "Rabban strides into the palace’s richly tiled bath-house. A", "wide doorway looks into a STEAM ROOM filled with white vapor.", "Outside the steam room stands PITER DE VRIES, a human", "stiletto. He is a MENTAT, his mind trained to superhuman", "acuity -- and dedicated to sadism in all its forms.", "As Rabban walks up, Piter nods at the steam room. In there.", "Rabban stops outside the doorway.", "The deep, resonant voice emerges from the steam. The vapor", "billows as something moves inside -- and we catch a glimpse", "of the steam bath’s occupant: the BARON VLADIMIR HARKONNEN.", "He is mountainous. Six hundred pounds of soft, naked flesh.", "Despite his vast bulk he considers himself beautiful. His", "movements are sensual.", "He waves Rabban away in a billow of steam.", "A fresh BLAST OF STEAM boils into the steam bath, drowning", "out Rabban’s question with a loud HISS. Rabban tries again.", "Rabban looks at Piter as though her were a strange insect. He", "replies to the Baron.", "The Baron’s voice issues from the mist:", "The clouds part and we see him: water beading on his smooth,", "corpulent face. He speaks slowly.", "EXT. SPACE - CALADAN ORBIT", "A HEIGHLINER maneuvers over CALADAN.", "A minuscule egg-shaped SHUTTLE emerges from the Heighliner", "like a seed and falls toward the planet.", "INT. CASTLE CALADAN - MEDITATION ROOM - NIGHT", "In a wide room of zen simplicity, Jessica sits in meditation.", "Her posture perfect. Her eyes closed.", "She is emotional. Striving to calm her heart, to slow her", "breathing.", "Jessica finds stillness. Her heartbeat slows. Her breathing", "slows...and stops. For a moment it seems time itself stops,", "with a crackle like ice. As if she has turned to stone.", "THUNDER RUMBLES overhead. Jessica’s eyes open.", "EXT. CASTLE CALADAN - NIGHT", "The SHUTTLE settles on a landing pad on the castle’s terrace.", "A gangway lowers from the shuttle outside. Six women in Bene", "Gesserit robes descend the ramp. The REVEREND MOTHER follows,", "her sure strong steps belying her age.", "INT. PAUL’S BEDROOM - NIGHT", "Paul lies sleeping. He stirs in his sleep. Eyes darting", "beneath closed lids.", "INSERT - A DREAM OF CHANI", "Shallow focus. In golden light, CHANI gazes into our eyes", "from kissing distance. Her eyes impossibly blue.", "BEDROOM", "Jessica stands over Paul in the dark room. The moon through", "the rain-streaked glass paints them in rivulets of light.", "For a moment Jessica looks down at her sleeping son. His", "eyelids flutter in the grip of his dream.", "His eyes open. Half-asleep. Confused.", "She takes a uniform from his closet and lays it on his bed.", "Her voice tight with controlled emotion. She turns and exits.", "INT. CASTLE CORRIDOR - NIGHT", "Paul is now pulling on the stiff military dress of Atreides", "nobility. Black with silver trim, a hint of military style.", "The green Atreides hawk emblazoned on his jacket.", "As he walks down a long corridor, Paul sees two figures", "waiting for him, silhouetted by the light at the end of this", "dark tunnel.", "His mother and a mysterious man with a diamond tattooed on", "his forehead, DOCTOR WELLINGTON YUEH.", "Lady Jessica is trying not to look afraid, but she’s failing.", "Jessica smooths Paul’s uniform, trying to ignore his", "accusation, but he brushes away her hand.", "She steps away a short distance, leaving Paul with Dr. Yueh,", "who offers his longtime patient a warm smile.", "He takes Paul’s pulse. Paul speaks in a whisper so Jessica", "won’t hear.", "Yueh shakes his head. He doesn’t know. He whispers, inches", "from Paul’s ear, as he continues his examination. His", "technique is Eastern: he touches centers of power on Paul’s", "body that some would call chakras, listening meditatively.", "Jessica arrives at their side, nodding her appreciation.  She", "makes elegant SIGN LANGUAGE MOVEMENTS with her left hand", "(subtitled): “Tell no one of this.”", "Yueh gives a slight bow and retreats down the corridor. Paul", "looks after him in confusion. Jessica reaches out to touch", "him one last time.", "With that, she OPENS the door to:", "INT. LIBRARY - NIGHT", "Jessica leads Paul into the library -- wooden shelves heavy", "with ancient books. Suspensor lights hover in the gloom.", "Paul is mystified about the purpose of this midnight", "awakening.", "He finds the REVEREND MOTHER MOHIAM, waiting for them. She", "sits in a heavy wooden chair, her aged face ghostly against", "her black cloak. Her eyes glitter as she studies him.", "Jessica curtsies to the old woman. Paul is astonished by this", "meekness in his mother. He studies the Reverend Mother.", "She takes the measure of him in turn. His stance. His stare.", "Jessica turns to go, reluctantly. She pauses by Paul.", "She hurries out. Paul glares at the Reverend Mother.", "The command cracks like a whip, her voice suddenly more than", "human. Compelling obedience irresistibly. This is THE VOICE.", "Paul crosses the room to her, helpless to resist. Shaken.", "Paul fights to remain on his feet -- but he cannot resist the", "command. He goes to his knees before the old woman.", "She lifts a green metal cube, six inches tall, from the folds", "of her robes. Sets it on the arm of her chair. One side opens", "into a black interior which no light can illuminate.", "She speaks in an ordinary voice now. Paul doesn’t comply.", "The invocation of his mother moves him. Reluctantly Paul puts", "his hand in the box.", "The old woman leans forward, placing her hand beside Paul’s", "neck. A glint of metal. He starts to turn his head --", "He freezes. Breathing hard. We see a long gleaming NEEDLE,", "rock-steady in the old woman’s hand. Almost touching him.", "Paul stares at her incredulously. This is madness.", "OUTSIDE THE DOOR", "Jessica stands with her back to the door like a sentry.", "Jessica’s face is taut with terror. Her son’s life hangs in", "the balance. She begins to whisper the Litany against Fear:", "IN THE LIBRARY", "Paul stares at the Reverend Mother apprehensively. And", "suddenly he feels it: a tingling sensation in his fingers", "that makes his breath catch. He hisses in pain.", "OUTSIDE THE DOOR", "Jessica’s voice shakes as she whispers the Litany.", "IN THE LIBRARY", "Sweat beads on Paul’s forehead as the pain grows into agony.", "He moans through clenched teeth. His left hand balled into a", "white-knuckled fist, his arm trembling. Pain!", "OUTSIDE THE DOOR", "Jessica closes her eyes.", "IN THE LIBRARY", "Paul trembles. The gom jabbar glints against his neck. The", "Reverend Mother’s eyes burn into him. He is panting.", "INSERT: Paul’s hand inside the box. Like a hand in a bonfire.", "The skin blackening. Splitting.", "Paul CRIES OUT involuntarily. The Reverend Mother hisses:", "OUTSIDE THE DOOR", "Jessica’s voice rises --", "IN THE LIBRARY", "Paul shudders in excruciating pain. Locking eyes with the old", "Reverend Mother. At the very edge of his endurance.", "INSERT: Paul’s hand. Crisp flesh falling from charred bones.", "Paul shuts his eyes. His mouth opens in a silent scream.", "The pain cuts off at once. Paul’s eyes snap open with a gasp.", "OUTSIDE THE DOOR", "Jessica opens her eyes.", "IN THE LIBRARY", "The Reverend Mother stares at Paul as he gasps in relief:", "sweaty, breathing hard.", "Reluctantly Paul complies -- sure he will see a ruined stump.", "But his hand is unmarked. He wiggles his fingers, amazed.", "He stares at her, his curiosity overriding his anger. The", "Reverend Mother smiles, concealing the box in her robes.", "Paul stares at her, disconcerted. What does she mean?", "OUTSIDE THE DOOR", "Jessica stands rigid, serene. Waiting.", "Jessica goes in, fear on her face. At the sight of Paul, her", "face floods with relief.", "Paul feels his mother’s presence behind him.", "Paul hesitates. This old woman knows all his secrets.", "INSERT: The luminous face of the girl from his dreams.", "The Reverend Mother stands, looks up at Paul with glinting", "eyes.", "She leaves, followed by Jessica. We stay with Paul.", "EXT. CASTLE CALADAN - TERRACE LANDING PAD - NIGHT", "Jessica walks Reverend Mother back to her ship in the fog.", "Her fear and relief have given way to cold anger.", "Her words drain the defiance from Jessica’s eyes.", "Mohiam also softens: a hint of compassion in her stony face.", "MOMENTS LATER", "Jessica stands in the fog in her hooded cloak, watching the", "shuttle lift off. Drops sheet off the ovoid spacecraft and", "dance in the floodlights. The ship rises into the clouds.", "Jessica turns to walk back inside -- and finds Paul standing", "behind her, a ghost in the fog. Staring at her. They face", "each other uncertainly, ten feet of empty space between them.", "Jessica throws back her hood.", "She stares at him. Caught off-guard.", "She swallows hard and chooses truth.", "She blinks at that. He sees so much! But she presses on:", "Paul is stunned. He looks around, seeing every part of his", "life in a new, bewildering light. His mother suddenly a", "strange, alien presence.", "He hesitates to ask the next question, looking very young.", "Jessica’s face crumples.", "She strides across the space between them and throws her arms", "around him. They cling to each other in the downpour. On", "Paul. On Jessica.", "EXT. CALADAN CASTLE - MORNING", "The Caladan Castle above the ocean in the morning light.", "The flag of the ATREIDES family in the wind is being removed.", "INT. GREAT HALL - DAY", "Servants lower a mounted bull’s head into a case. Leto and", "Jessica look on. Around them, the castle stands cavernous and", "empty.", "Paul close behind, observes his mother.", "Servants come to say goodbye, weeping and embracing them. The", "Atreides are beloved: their household is a family. Jessica", "tears up. Leto comforts her.", "Paul joins them.", "The bull head’s case is being closed.", "EXT. CALADAN’S SHORE - SUNSET", "Paul stands on a windy beach. Huge waves crashing on the", "shore. He looks up:", "A huge cargo ship takes off: the Atreides fleet taking leave", "of its homeworld. Wind plucks at Paul’s clothing as another", "ship rises off the ground.", "Paul takes a knee to curl his fingers into the water.", "He looks out across the sea at the sun sinking below the", "horizon. His last sunset in the land of his birth.", "EXT. ARRAKIS - DEEP DESERT - DAWN", "SUPER: ARRAKIS", "A bright star crosses the sky: a distant spacecraft.", "A MAN crosses the dune sea -- walking strangely, in broken,", "erratic strides. He wears a close-fitting STILLSUIT to", "protect him from this lethal landscape.", "He is walking toward a massive rock formation that looks like", "the back of some gigantic elephant.", "In the rock’s shadows, THREE SILHOUETTES are waiting for him:", "FREMEN in stillsuits.", "The man throws off the mask of his stillsuit, revealing a", "fierce dark beard. This is STILGAR, 45, master of the desert", "and a leader among the Fremen.", "High above, he sees the Guild Heighliner in orbit -- pale in", "the dark blue sky, like another moon. As he watches, the", "ships of the Atreides fleet begin to emerge.", "EXT. ARRAKEEN LANDING - DAY", "A sprawling spaceport: miles of concrete landing pads and", "cavernous hangars. There are spaceships large and small, and", "ORNITHOPTERS: aircraft that beat their wings like insects.", "The Atreides flagship touches down. The largest ship in view.", "On the perimeter of the field, Arrakeen natives have turned", "out to watch the Atreides arrive: thousands of people outside", "the barricades, huddling in the shade of the fences.", "INT. ATREIDES FLAGSHIP - BOARDING RAMP", "Flanked by bodyguards in combat armor, Leto, Jessica, Paul,", "and Gurney stand in darkness in the ship’s landing bay.", "Waiting for the gangway to open. An ATREIDES OFFICER,", "LANVILLE, gives an order to the guards.", "The guards activate their individual shields.", "In the shadows, Jessica reaches for Leto’s hand. He squeezes", "her hand in his. Gives her a little smile.", "A seam of light opens. The gangway lowering to the tarmac.", "They squint in the sunlight. Gasp at the blast-furnace air.", "Heat ripples off the pavement. Dust eddies around their feet.", "Paul stares into the blazing day. A new world before him.", "An ATREIDES BAGPIPE PLAYER exits the ship, under the sun", "blaze, playing a brief tune, like some call. He stops.", "EXT. LANDING FIELD", "Dozen of other bagpipes can be heard in the distance,", "answering to the lonely player. Nearby, the Atreides legions", "are marching out of troop carriers and forming up. An", "impressive force in combat gear: light armor, helmets, swords", "and daggers.", "Engulfed by dust, a familiar silhouette welcomes them, Thufir", "Hawat. He smiles as Paul steps forward to clasp his forearms", "fondly.", "Hawat hugs Paul. Bows to Jessica. Clasps forearms with Leto.", "Across the wide tarmac rippling with heat, the CROWD stands", "watching, in hooded cloaks and dusty masks of a dozen", "designs. Alien and strange. Worlds away from the elegant", "Atreides in their pristine uniforms.", "ORNITHOPTER PAD", "Hawat leads Paul and Jessica toward Duke Leto’s personal", "ornithopter: a craft both luxurious and powerful.", "As Paul and Jessica step out of the shadow of the flagship, a", "CHEER goes up from the throng outside the fences.", "Some of the crowed point at Jessica and Paul -- shouting with", "religious fervor. Lisan al-Gaib! Lisan al-Gaib! Paul frowns.", "EXT. LANDING FIELD, BESIDE ATREIDES ARMY FRIGATES", "Leto and Gurney head toward the ATREIDES TROOPS, aligned", "under the shadow of huge war frigates.", "The Arrakeen crowd watches as one occupying army is exchanged", "for another.", "Leto walks past the Atreides soldiers, reviewing the ranks:", "they stand ramrod-straight in the punishing heat. Their eyes", "following Leto with total devotion.", "Leto and Gurney greet the division commander, clasping arms", "and smiling like brothers. Leto turns to look over the men.", "An expectant hush hangs in the air. Gurney’s voice rings out:", "The troops respond with an exuberant cry, raising their fists", "to the sky. Their massed voices echo from the distant cliffs.", "Powerful horns resonate from the top of the frigates,", "mistreating everybody’s ear-drums.", "Here is a mighty military machine. A new power on Arrakis.", "INT. ORNITHOPTER - CONTINUOUS", "Hawat takes a seat beside the PILOT. Paul and Jessica sit in", "back. As the engines spin up, Paul stares out at the crowd.", "She speaks quietly, for Paul’s ears alone.", "Paul looks away from his mother.", "But Jessica just looks at her boy with quiet pride, her faith", "in him unshaken.", "Interrupting this moment, Hawat looks back over his shoulder", "as the ornithopter’s motors power up.", "INT./EXT. ORNITHOPTER (IN FLIGHT)", "The ornithopter lifts off, beating its powerful wings as it", "rises away from the spaceport. A squadron of ornithopter", "gunships lifts off with them and flies escort.", "As they rise, we see the vastness of the desert around them.", "As a wider vista opens up, they see a giant rocky rampart in", "the distance.", "Paul marvels at the sight. Turns to stare at a new wonder:", "ARRAKEEN: a low, sprawling metropolis of sloping concrete,", "with occasional spires of carved stone. A city that bows to", "the force of the desert by echoing its shapes.", "Hawat’s ornithopter and its escorts converge on the", "Residency, a brutalist palace of sloping concrete planes in", "the center of the city. Twenty DATE PALM TREES stand in the", "courtyard.", "INT. RESIDENCY - GREAT HALL - DAY", "Cyclopean in scale, built to last ten thousand years.", "Thufir Hawat, Paul and Jessica walk in with guards.", "EXT. RESIDENCY BALCONY - DAY", "A lofty balcony overlooking Arrakeen. Leto and Gurney look", "out through high-tech binoculars. Heat ripples off the", "concrete.", "Leto scans the city: austere lines, deadly heat waves, dusty", "land and dusty sky melted together. The Duke notes the", "unexpected SILENCE of this metropolis, almost admires it.", "Almost.", "The men lower their binoculars to look at each other with", "shared concern.", "Officer Lanville moves forward from a small group of nervous", "servants.", "Leto grins and sighs.", "INT. RESIDENCY - PAUL’S NEW ROOM - DAY", "Paul stands in a beautifully designed room. The bed has a", "carved headboard: an Asian-styled relief of fish in swirling", "waters. A shaft of sunlight fills the room with gold. Paul", "gazes out the window at the alien skyline of Arrakeen. Spice", "particles dance in the wind.", "INT. NORTH WING - CORRIDOR", "Paul walks down a corridor decorated with a long FRESCO of a", "SANDWORM among rolling dunes. He looks at it in amazement.", "INT. DINING HALL - DAY", "A formal dining room with a table long enough to seat thirty.", "The mounted BULL’S HEAD lies face-up on the table. A guard", "stand by the door.", "Eight Arrakeen women in servant dresses stand in a row. Hawat", "leads Jessica in and gestures at the women.", "He bows and leaves her. Jessica walks up to the women. They", "drop to their knees and prostrate themselves, startling her.", "One woman looks up: a weathered old woman of unknowable age,", "with wise eyes and a blunt demeanor. Her lean body corded", "with muscle. She is the SHADOUT MAPES.", "The women comply. Jessica walks down the row, studying each", "in turn. When she gets to the Shadout Mapes she lingers.", "Observing her with hyper-awareness. Her eyes. Lips. Hands.", "Jessica doesn’t take her eyes off Mapes.", "The other women file out, leaving Jessica and Mapes alone.", "There’s a tension between the two of them, like gunfighters.", "Shadout. That’s an old", "Chakobsa word. Well-dipper.", "You’re Fremen.", "Jessica registers that. The Missionaria Protectiva at work.", "Still she watches Mapes warily, as if she were a wild animal.", "Mapes trembles in superstitious dread, lowering her eyes.", "The guard promptly reacts. Jessica stops him with a discreet", "hand signal from Atreides Battle Language.", "Jessica speaks sternly, her body preparing for action:", "The Shadout Mapes’s eyes rise to meet Jessica’s, awed.", "Slowly she reaches into her dress. Pulls out a knife and", "draws it from its sheath -- revealing a milk-white blade,", "slightly translucent. Wickedly sharp. It’s beautiful.", "Jessica gazes at it in wonder. This is a mythical object.", "Jessica feels her way forward carefully, sensing the", "significance of the moment.", "The guard is on edge, ready to draw his sword.", "Mapes WAILS in ecstasy. Jessica trails off, startled.", "She sheaths the knife and presses it into Jessica’s hands.", "Jessica is troubled by Mapes’ fervor.", "EXT. ARRAKEEN RESIDENCY COURTYARD - SAME MOMENT", "Paul walks in the courtyard. Two rows of tall palm trees", "stand under the brutal sun. Paul touches one of the tree,", "looking at its fronds moving slowly in the wind. Paul notices", "few people press against the fence, gazing at the trees,", "praying. Some shout at him: Lisan Al Gaib! Lead us to", "paradise! Paul hears them and becomes uncomfortable.", "An old GARDENER wearing sun protective clothes and a wide", "hat, is taking care of one of the tree.", "The gardener touches one of the tree with affection, smiling.", "INT. LETO’S OFFICE - DAY", "A large office and receiving room for the use of the governor", "of Arrakis. Leto stands in front of the wide worktable,", "flanked by Gurney and Hawat. A few technicians of Hawat’s", "team stand by.", "They’re all looking at an ornate CHEST sitting on the table.", "The chest had been sealed closed. An envelope hanging from", "the latch reads LETO. Leto steps forward and opens the chest.", "It’s full of severed human fingers.", "For a moment Leto stands staring, tendons taught in his neck.", "Then he steps back. Tears the envelope from the chest, opens", "it and reads the note within.", "Gurney examines one of the fingers: an index finger, its", "fingertip stained orange.", "EXT. GEIDI PRIME - ESTABLISHING", "Harkonnen Military Fleet is on stand by above Geidi Prime.", "The dark ovoid Bene Gesserit ship flies through it.", "INT. HARKONNEN THRONE ROOM - NIGHT", "A BLACK RUBBER HUMAN SPIDER is eating flesh on the floor.", "The Rubber Human Spider leaves the room like a zombie.", "The Reverend Mother Mohiam stands like a column of obsidian", "in the Baron Harkonnen’s throne room.", "The Baron sits with Piter. The Baron seems gracious. Piter,", "on the other hand, is tense.", "The Baron waves at Piter. An electronic curtain surrounds the", "trio.", "The Baron can barely hide his excitement.", "The Reverend’s tone shifts subtly: she is playing her own", "hand now.", "Piter is about to protest, but the Baron extends his arms", "widely in acceptance, rudely obscuring his Mentat.", "She studies him. He’s suddenly become a closed book.", "Dangerous, but this is necessary. She nods to him and takes", "her leave.", "The moment the door shuts behind her, Piter turns to the", "Baron. Frustrated.", "And now the Baron begins to RISE INTO THE AIR, his hands out", "to the side, palms forward, like some horrible mockery of", "Christ.", "EXT. ARRAKEEN - NIGHT", "Moons over Arrakeen.", "PAUL’S DREAM: EXT. ARRAKIS DESERT - DAY", "Paul follows Chani in a narrow passage between huge rocks.", "Chani shows him a little nest of desert mice. They are close", "to each other. First intimate moment.", "INT. RESIDENCY, PAUL’S BEDROOM - NIGHT", "Paul is dreaming.", "PAUL’S DREAM: INT. ARRAKIS, DARK ROOM", "A little plate with some spice powder on it.", "An index comes into frame and grabs some grain with its tip.", "A man in shadow takes some spice powder with his index, and", "brings it to his mouth. We finally see Gurney’s face. He is", "wearing Fremen clothes and is very dirty, with long grey", "hair. He smokes SPICE with a strange narghile.", "He has blue Fremen eyes.", "OMITTED", "OMITTED", "OMITTED", "INT. ARRAKEEN RESIDENCY - WAR ROOM - MORNING", "We follow Paul into a conference room dominated by a long", "table, where Leto’s staff officers sit -- including Hawat,", "Lanville, and Gurney Halleck. Gurney grins as Paul enters.", "Chuckles and applause around the table. These officers love", "Paul as they love his father. Gurney pats his shoulder.", "Paul takes a seat beside his father’s.", "Leto enters, the burden of leadership lying on his shoulders", "like a visible weight. He nods to his staff officers, meeting", "their eyes in turn. Sits at the head of the table.", "That gets a reaction. A triumph of spycraft.", "The number hits the room like a bomb. A muted gasp of shock", "and awe. The officers sit up straighter in their chairs.", "In Leto’s eyes there is a sudden flare of hope.", "Paul studies the officers’ faces acutely. Reading the room.", "EXT. ARRAKEEN LANDING - TARMAC - DAY", "Hawat leads Leto, Paul, Gurney, and the other staff officers", "up to a SPICE FREIGHTER in a secured hangar.", "The ship’s cavernous cargo hold yawns open.", "A small stack of spice containers sits at the far end of the", "cargo hold, under armed guard.", "The THUMPING OF ORNITHOPTER WINGS turns their heads. A wing", "of THREE ORNITHOPTERS swoops toward them at speed.", "Gurney looks tensely at Hawat. Hawat touches his transceiver.", "The lead ornithopter comes in fast and low. Flares its wings", "dramatically and touches down lightly in a combat landing.", "Hawat’s security personnel rush to check the aircraft.", "The pilot’s door opens and Duncan Idaho climbs out. He is", "transformed: scruffy, stubbled and sun-blasted. He wears a", "Fremen stillsuit and robes. He wears a long sword like a", "knight, with a two-handed cruciform hilt.", "Three FREMEN disembark from his ornithopter.", "Members of Hawat’s security force approach. The Fremen watch", "them warily. Idaho reassures them in their own language:", "Go with them in peace.", "He greets Hawat’s men as they arrive with casual authority:", "The Fremen allow Hawat’s security team to lead them aside.", "The other two ornithopters land behind Idaho; squads of", "Fremen get out and fan out watchfully across the tarmac. They", "are lean desert warriors, male and female, proud and silent.", "Idaho walks toward Paul and the others with the smile of a", "conquering hero. Paul runs to meet him: they hug.", "Gurney and Duncan clasp arms.", "Leto looks at the Fremen standing on the landing field behind", "Idaho and a spark of hope kindles in his eyes.", "INT. RESIDENCY - LETO’S OFFICE - DAY", "Duke Leto and his lieutenants gather around the table to hear", "Idaho’s tale. The atmosphere is informal: Leto sits, but", "others stand or lean on crates. They talk rapidly, excited:", "A murmur of astonishment around the table. Duncan grins.", "Hawat smiles proudly.", "Leto’s face is flush with excitement.", "One of Hawat’s SPECIALISTS brings in the Fremen leader:", "Stilgar, the man we saw in the desert before. He is proud and", "stern-faced. In his hands he holds a sheathed CRYSKNIFE.", "Idaho leans close to Leto and whispers urgently:", "Stilgar enters. He is followed by two Fremen warriors: a man", "and a woman. Both lean, dark, and poised as dancers.", "Paul is fascinated: here is a Fremen leader, a warrior.", "Stilgar’s eyes touch on Paul as well: son of the Bene", "Gesserit, who some call the Lisan al-Gaib.", "Stilgar bends over and spits on the table. A gasp of outrage.", "Gurney leaps up snarling, a hand on his sword.", "And he spits on the table in his own turn. Duke Leto looks at", "Stilgar and Duncan, and spits on the table with a wry look.", "The Atreides officers chuckle -- but not Stilgar.", "Stilgar looks back at him without warmth.", "Paul stares at Stilgar, moved by his words.", "Gurney bristles at Stilgar’s arrogant air.", "Stilgar considers this gravely.", "Stilgar weighs these words and finds them worthy. He nods.", "Stilgar bows his head solemnly.", "Stilgar’s eyes find Paul. He gives a minimal nod of respect.", "Honor requires that I be", "elsewhere.", "I recognize you.", "Paul frowns, not understanding the words. Committing them to", "memory. Stilgar turns without further ceremony and strides", "back to his ornithopter, his Fremen bodyguard following him.", "Leto watches Stilgar go. He looks at Hawat, who has watched", "these proceedings.", "EXT. ARRAKEEN BARRACKS - DUSK", "Paul, Gurney, and Idaho sit in a military barracks. Reunited", "friends with tales to tell. Drinking wine.", "Idaho pulls out a rugged instrument and passes it to Paul.", "Paul turns the paracompass in his hands, admiring it.", "Idaho pulls a stubby pistol-shaped device off his belt and", "hands it over with a grin.", "Gurney examines the strange tool dubiously.", "EXT. SPACEPORT - MORNING", "Several old and rusty HARVESTERS are on repair. Very few", "CARRYALLS grab harvesters and take off with them.", "A little convoy of flying carryalls bring harvesters toward", "the open desert.", "INT. ARRAKEEN RESIDENCY - AIRCRAFT BAY - MORNING", "Duke Leto and Paul emerge from the Residency, followed by", "Gurney. All three wear stillsuits and desert gear. They", "approach a waiting ornithopter.", "There stands DR. LIET KYNES. A tall, lean woman in her", "forties who exudes pride and intelligence. She has the", "shocking blue eyes of spice saturation. She is dressed in a", "stillsuit and desert robes. Atreides troops stand by with", "drawn swords and live shields.", "She nods solemnly, meeting Leto’s eyes boldly.", "She moves toward Leto without waiting for an answer.", "The guards leap forward -- Gurney whipping his sword from its", "sheath by instinct -- but Leto holds up a hand.", "He opens his arms, letting Kynes inside his guard. Close", "enough to kiss or kill. She checks his stillsuit swiftly and", "efficiently, making many small adjustments.", "She shows Leto the filter and nose-plugs in his hood.", "Leto nods his thanks. Intrigued by this strange woman.", "She quickly inspects Paul’s suit -- with growing perplexity.", "Everything is perfect, not a strap out of place.", "It is the right way.", "He shall know your ways as", "though born to them.", "Paul studies Kynes curiously. Sensing something.", "She turns to the ornithopter. Paul and Leto exchange glances", "-- sensing hidden depths in this Imperial Planetologist.", "INT./EXT. LETO’S ORNITHOPTER (IN FLIGHT) - DAY", "Leto’s ornithopter flies over a rolling sea of endless dunes.", "Paul stares.", "Leto flies toward a SPICE CRAWLER, a massive harvester on", "caterpillar tracks, sixty meters long. It’s creeping across a", "SPICE BED -- a rust-red patch of melange in the desert. Its", "stack throws a plume of yellow sand high into the air.", "Three tiny one-seater ships -- SPOTTERS -- circle overhead.", "Leto makes an elegant U-Turn and brings the aircraft to a", "higher altitude.", "Paul notices Kynes’ last words: she seems please by the", "worm’s menace.", "She breaks off as the Duke kicks on the jet brakes. The ship", "bucks as its wings elongate and cup the air. The craft", "becomes a full “thopter” as the Duke banks it,  holding the", "wings to a gentle beat, pointing with his left  hand off to", "the east beyond the factory dune crawler.", "Where the dunes recede in curves to the horizon, a straight", "track cuts through them: a wave-crest approaching, the way a", "fish disturbs the water when swimming beneath the surface.", "She leans back and selects a frequency, looking at a grid", "chart on a roller over their heads. Speaks into a microphone:", "After a moment a reply crackles back, casual and laconic:", "Leto cranes his head around. He banks the ‘thopter past the", "crawler’s sand plume. Scanning the horizon.", "The carryall appears in the distance, flying slowly toward", "the harvester. It seems this is no emergency for them.", "The wormsign keeps coming, on a direct course to the crawler.", "The carryall hovers on top of the harvester and launches its", "anchors. But one of the four anchors stays stuck.", "He doesn’t sound so casual anymore. Gurney sits forward.", "The broken anchor doesn’t budge.", "The wormsign keeps coming.", "Leto and Gurney come to battle stations like the veteran", "soldiers they are.", "He brutally pushes the ornithopter’s commands. The", "ornithopter dives at high speed toward the crawler. Leto", "grabs the microphone.", "He lands his ‘thopter deftly despite the buffeting winds. His", "two escort craft land nearby. Paul looks out at the escorts.", "Leto looks at him with fierce approval.", "Gurney opens the door and climbs out into the wind, running", "to the escorts. Paul is shocked by the scent on the air.", "Paul jumps out onto the sand.", "EXT. SPICE CRAWLER - CONTINUOUS", "The spice bed is cinnamon-red underfoot. Paul’s feet sink", "deeply into it: it sounds different from sand. He touches the", "sand. Orange spice particles glow out of it. On Paul:", "ON LETO: Inside the ornithopter, Leto gets impatient: no one", "is outside yet.", "The crawler’s crew tumbles out onto the sand. Kynes looks at", "Leto in startled admiration. Here is a leader of men.", "BACK TO PAUL: in the distance, the approaching wormsign is", "clearly visible. Paul shouts at the spice workers stumbling", "through the dust. The Carryall flies away slowly.", "They run past him gratefully, in desperate haste.", "Then a GUST OF WIND slashes across the spice bed -- and COATS", "Paul’s face and body with a fine dust of melange.", "Paul’s breath catches. His pupils dilate. His heart POUNDS.", "Paul fall on his knees. Paul sees something we don’t see.", "He is terrified. We hear POWERFUL BENE GESSERIT GHOST VOICES.", "DUKE LETO’S ORNITHOPTER", "Kynes wrestles the back seat out of the aircraft and throws", "it on the sand. Spice workers crawl in and sit on the deck.", "Gurney arrives beside her. Sees Paul missing. He spins.", "Paul, on his knees, is a tiny inert figure almost under the", "spice crawler’s caterpillar treads.", "The worm is almost upon them. The other ornithopters are", "lifting off.", "ON PAUL", "He is lost in his vision, beside the crawler. The worm", "bearing down on him.", "As Gurney drags him to his feet, shaking him from the vision.", "The hissing of the great worm through the sand fills the air.", "A tidal wave of sand about to break over them.", "DUKE LETO’S ORNITHOPTER", "Leto lifts off with the ramp down, jets screaming. Eyes", "locked on his son. Driving the aircraft to its limits.", "The sand wave subsides as the worm dives under the crawler.", "Leto slides the ornithopter sideways with consummate skill.", "Paul and Gurney run out of the dust and leap onto the ramp.", "Gurney grabs a rail with one hand and Paul with the other.", "Leto gives it everything. The overloaded ornithopter claws", "for altitude, jets burning, wings beating. Metal CREAKS", "dangerously. Turbines whine like banshees...", "The crawler falls away below them --", "THE WORM ERUPTS. Swallowing the entire spice crawler in a", "gulp, its cavernous maw rising out of the desert like a", "nightmare toward the struggling ornithopter.", "Clinging to Gurney, Paul stares down into that mouth in a", "semi-trance. Smelling the spice on the worm’s hot breath.", "And then they’re away, watching the Worm sink back into the", "sand, swallowing all their treasure.", "Paul sees Kynes muttering under her breath with religious", "fervor, her eyes on the worm below:", "The rescued spice workers, out of breath, are praying.", "EXT. ARRAKEEN RESIDENCY - AIRCRAFT BAY - DAY", "Duke Leto and Paul get out of Leto’s ornithopter and walk", "toward the Residency. Leto speaks sternly to Paul:", "Paul leaves, shaken. Beside the ornithopter, Kynes stands", "watching. Leto strides towards her.", "She’s about to add something, like “you’re no different;” but", "bites her tongue.", "Still, Leto reads the fear in her eyes. The Harkonnens.", "EXT. SALUSA SECUNDUS - MILITARY SPACEPORT - DAY", "A harsh planet, its stony ground raked by strong winds. This", "is a massive military base. Scores of gunships and troop", "carriers are grounded here. Ornithopters buzz overhead.", "Gigantic Imperial flags flutter in the wind, bearing the", "Emperor’s crest: a golden lion.", "SUPER: SALUSA SECUNDUS", "Thousands of warriors in armored suits kneel on the tarmac.", "They are SARDAUKAR, the Emperor’s elite soldiers.", "They are pale-skinned and bearded, their hair worn long.", "Where the Atreides troops have an air of gallantry about", "them, these are savages: eyes full of aggression and", "bloodlust, empty of compassion. They were bred for murder.", "A cadaverous PRIEST sings a litany in some foreign tongue --", "the sounds menacing and strange.", "VICARS walk the rows of soldiers with BOWLS OF BLOOD. Dipping", "their thumbs, they daub each Sardaukar’s forehead and tongue.", "The blood flows from the sliced throats of prisoners", "crucified upside down at the edge of the field.", "A BASHAR of the Sardaukar, an officer, leads Piter de Vries", "on an inspection of the troops. Even Piter is daunted.", "The Bashar spins on him with a snarl, making Piter step back.", "The Sardaukar finish their ritual. They rise in unison and", "thrust their swords into the air with a cry. Piter flinches.", "INT. PAUL’S ROOM - SUNSET", "Paul sits on his desk chair as Doctor Yueh examines him.", "Jessica stands beside him, concerned.", "He nods respectfully and exits. Paul looks at his mother.", "EXT. ARRAKIS - DESERT - MORNING", "Chani is silhouetted by the rising sun behind her, creating a", "beatific halo. The young woman looks right at us with her", "otherworldly blue eyes. She smiles.", "She leans in close, as if to kiss “us”, Paul.", "But then Chani darkens.", "Shink.", "And now we/Paul look down to find the hilt of a CRYSKNIFE", "sticking out of our own chest.", "Paul falls on his knees (like he did in the desert).", "INT. FREMEN HOUSE, ARRAKIS - DAY", "Jessica is holding a baby in her arms. The baby is wrapped in", "Fremen clothes. Jessica’s face is covered with ancient Fremen", "words written with dark henna. A crysknife by her side.", "BACK TO PAUL AND JESSICA IN PAUL’S BEDROOM.", "Paul stares at her, shaken.", "Jessica stares at Paul in dread, hand going to her belly. Her", "voice a whisper of disbelief:", "INT. RESIDENCY CORRIDOR", "Jessica in tears walks in the corridor, trying to control her", "emotions: Paul is the One!", "INT. MAIN HALL - SUNSET", "Paul stands staring at a huge worm fresco in the hallway, his", "face troubled.", "The Shadout Mapes comes down the hall. In a glance she takes", "in his turbulent emotion. She pauses at his side.", "She lays a hand on his shoulder, indifferent to protocol.", "She walks on. He looks after her in astonishment.", "EXT. ARRAKEEN RESIDENCY - BALCONY - DAY", "Paul looks out over the city. And to the dunes beyond.", "Paul turns to see his father join him.", "He sees something in Paul’s face. His jaunty tone sobers.", "Paul lowers his eyes, startled by how much Leto sees. But", "this his father. And he trusts him more than he trusts", "anyone. He bares his heart.", "Leto joins him at the railing to look out over Arrakis.", "Paul nods. Like a weight has been lifted.", "And their formality gives way to a hug. Because Paul is", "scared. And Leto knows.", "And loves him no matter who he’s meant to be. Prophecies be", "damned.", "INT. ARRAKEEN RESIDENCY - PAUL'S ROOM - NIGHT", "Paul wearily strips off his uniform. Lost in thought.", "Doctor Yueh appears in the doorway. He sets a white tablet on", "a tray on the nightstand. Paul nods.", "INT. ARRAKEEN RESIDENCY - WAR ROOM - END OF DAY", "Duke Leto stands in front of Duncan Idaho. Leto communicates", "with precise hand signals using THE ATREIDES COMBAT SIGN", "LANGUAGE. We can read the translation with subtitles.", "Leave at dawn. Give this message to the FREMEN.", "The Duke gives him a tiny object.", "Trust no one.", "Duncan bows and leaves. Leto stays alone, lost in thoughts.", "INT. ARRAKEEN LANDING - BARRACKS - NIGHT", "Gurney leans his baliset against his shoulder. His callused", "fingers draw mournful arpeggios from the strings.", "The troops listening.", "INT. MASTER BEDROOM - NIGHT", "Leto and Jessica lie in bed. A tense frown on Leto’s brow.", "She reaches for the silver tray on her bedside table: a", "sleeping pill from Doctor Yueh.", "She smiles, knowing what he wants.", "He obeys. She lays her fingers on his temples, her thumb on", "his third eye, and hums softly, a beautiful, hypnotic drone.", "Instantly Leto’s breathing deepens. The lines in his face", "smooth away. A smile touches his lips...and he’s asleep.", "Jessica lies back. She lays a hand on her belly with a", "listening expression, meditative. She smiles serenely.", "She takes her sleeping pill and closes her eyes.", "OMITTED", "OMITTED", "EXT. RESIDENCY - NIGHT", "One by one the lights in the windows go out. The house", "shields shimmer in the moonlight.", "INT. MASTER BEDROOM - HOURS LATER", "Leto awakens with a little gasp of anxiety. The room is dark", "now. The city outside is silent.", "He looks at Jessica: she sleeps deeply beside him. His eyes", "stray out the window. Far away, on the Shield Wall cliffs, a", "FLICKERING LIGHT draws his attention. He gets out of bed,", "staring at it. It’s barely visible at the edge of the window.", "INT. MAIN CORRIDOR - NIGHT", "Leto walks down a hallway to a wide window with a clearer", "view of the Shield Wall. The flashing light is unmistakable:", "Blink-squirt, flicker, flash. A signal!", "From a roof nearby he sees another light flash in answer. He", "frowns. What does it mean?", "A strange MEWLING NOISE turns his head. An odd animal sound.", "Inside the house. He switches on his shield. Draws his knife.", "Follows the sound, touching his transceiver as he goes:", "No answer. A faint hiss of static.", "Something moves in the shadows: a figure, dragging itself", "along the floor. A knife jutting from its back. A trail of", "blood stretching away behind.", "It’s the Shadout Mapes. Dying by inches. Leto kneels beside", "her. Turns her on her side. Her eyes find his in the dark.", "She mumbles some inaudible words.", "She dies. Leto looks down the passageway in alarm. He runs.", "INT CORRIDOR ADJACENT TO SHIELD GENERATOR - NIGHT", "Swift and silent, Leto races to the door of the Shield", "Generator Room. The door, clearly labeled, stands ajar.", "Inside, the massive generators are still humming. Power on.", "BEHIND LETO", "A DART PISTOL comes to bear and FIRES. A dart shoots out. As", "it approaches Leto’s shield it opens tiny wings and slows,", "swooping like a swallow through the shield at low speed --", "-- then folds its wings and DIVES INTO HIS BACK.", "Leto stiffens as the drugged dart takes effect. He spins --", "but his legs buckle. He staggers and slides down the wall to", "the floor. Knife clattering from nerveless fingers. Leto is", "paralyzed.", "Doctor Yueh walks in.", "INT. ARRAKEEN LANDING - BARRACKS - NIGHT", "Long rows of steel bunks. Gurney Halley lies sleeping beside", "his regiment. A LIEUTENANT bursts in and shakes him awake.", "EXT. ARRAKEEN LANDING - NIGHT", "Gurney and his men spill out into the night, pulling on", "jackets and belts.", "In orbit overhead they can see the running lights of a", "colossal Guild Heighliner -- and from that mighty ship a VAST", "HARKONNEN WAR FLEET is issuing: big frigates, fast gunships,", "troop carriers. Quartering the sky in their hundreds.", "Gurney stares at the sight and despair fills his face.", "The spaceport control tower BLOWS UP in a brutal and", "spectacular explosion.", "EXT. ARRAKIS ORBIT", "Below, the night side of Arrakis is a sea of darkness. The", "massive explosion of the spaceport control tower illuminates", "the desert. The shadow of a huge Harkonnen Frigate glides in", "the foreground.", "EXT. ARRAKEEN LANDING - NIGHT", "Gurney and his men run toward one of the Atreides frigates.", "The ship explodes. The whole spaceport is being bombarded.", "Gurney leads his men across the tarmac, swords drawn, shields", "on. Troopships are spilling Harkonnen soldiers ahead of them.", "Gurney charges three Harkonnen soldiers. A swift exchange of", "blades -- and Gurney kills the Harkonnens, taking an enemy", "sword as last one falls.", "He looks around. His men vastly outnumbered. Harkonnen", "raining down all over the spaceport. He roars like a lion:", "He charges, a sword in each hand, a wolfish smile on his", "face. And his men follow him into the jaws of hell.", "EXT. ARRAKEEN - NIGHT", "A flock of Harkonnen troopships land around the residency.", "EXT. ARRAKEEN RESIDENCY - NIGHT", "The Atreides house guards are holding against the Harkonnens,", "bodies piling up at their feet. Then Sardaukar begin dropping", "from the sky. They join the battle. Atreides guards fall. The", "invading force breaks through. Into the Residency.", "SERVICE CORRIDOR", "Duke Leto sits slumped against the wall, shield deactivated.", "Yueh stoops over him. Leto tries to rise and cannot move.", "He is in agony at the thought, tears streaming down his face.", "He pulls the Ducal signet ring off Leto’s hand. Holds it up.", "The thought of his family drives Leto to desperation. But his", "paralysis is deepening and he cannot speak.", "Leto stares at him, not understanding.", "He holds up a new false tooth.", "INT. RESIDENCY - PAUL’S BEDROOM - NIGHT", "Paul stirs in his sleep. Eyes moving under closed lids. An", "Harkonnen soldier opens his door.", "INSERT: CHANI", "She looks at him in the warm light of the sun, so close.", "EXT. RESIDENCY - NIGHT", "The date palms out front are on fire, casting a lurid light", "over the scene.", "There are hundreds of soldiers flooding into the house.", "Harkonnen ornithopters landing in the streets below.", "This is a massacre. In a courtyard Atreides soldiers lined up", "on their knees. The Sardaukar begin to BEHEAD THEM with", "methodical swiftness. Rabban takes part in the execution with", "bloodthirsty zeal.", "INT. RESIDENCY CORRIDOR - NIGHT", "Duncan Idaho’s shadow appears into the hallway.", "He sees a Sardaukar at the end of the corridor. He switches", "on his shield, as two other Sardaukar run toward him.", "Idaho slips through the Sardaukar’s guard and kills them.", "A fourth Sardaukar fires TWO DARTS from a SLOW-DART PISTOL:", "they slam into Idaho’s shield and begin to tunnel inward...", "Idaho slashes one dart with his sword, destroying it. Parries", "a blow from the Sardaukar who fired it -- then slashes the", "other dart out of existence just before it punches through.", "He leaps and strikes the Sardaukar down.", "INT. RESIDENCY, MASTER BEDROOM - NIGHT", "Duncan runs into the Duke and Jessica’s bedroom. Empty.", "INT. RESIDENCY, PAUL’S BEDROOM -NIGHT", "Duncan enters Paul’s bedroom. Paul isn’t there anymore.", "INT. ORNITHOPTER (GROUNDED / IN FLIGHT) - NIGHT", "Jessica and Paul are loaded roughly into an ornithopter by a", "DEAF TROOPER with a scarred face and TWO OTHER TROOPERS.", "The troopers wrestle them into seats and strap them down.", "The Second Trooper pilots. The First Trooper and Deaf Trooper", "sit in the copilot and navigator positions, respectively.", "Paul and Jessica are immobilized. Ankles bound. Hands tied", "behind them. Jessica still gagged. They look in horror at the", "devastation of Arrakeen. The impossible multitude of", "Harkonnen troops and warships.", "Their eyes meet. A calm descending on both of them. This is", "life or death. Their minds shift into higher levels of", "thought. Bene Gesserit awareness. Mentat calculation.", "Paul twists away. Behind his back he flashes a hand signal.", "Jessica turns to study their captors. The ornithopter. She", "sees a BLACK DIAMOND OF THE SUK SCHOOL etched on the back of", "the seat in front of her. Something’s stashed under the seat.", "The ornithopter lifts off.", "A haunting HARKONNEN GUN SHIP, THE PLAGUE, hovers over the", "city, pouring hell.", "EXT. SHIELD WALL - NIGHT", "The ornithopter passes over the Shield Wall into the desert.", "In the distance we see Arrakeen Landing on fire.", "EXT. ROOFTOP - NIGHT", "Idaho crawls on the edge of a landing pad where a Harkonnen", "military ornithopter has landed. The aircraft is protected by", "several guards. Idaho comes down on top of a soldier and", "stabs him through the top of his head. Turns and cuts down", "four others without mercy.", "Terrorized, the rest of the soldiers move away.", "Idaho gets in the ornithopter and lifts off, mechanical wings", "kicking up dust.", "As he rises above the next landing pad, he fires every", "rockets he’s got on Harkonnen Troop Transports.", "An enemy frigate spots him and immediately fires.", "Duncan avoids the missile by diving toward the surface of the", "city, hiding at a lower level into an atrium filled with", "Harkonnen troops.", "He spins around firing at the troops and rushes at high speed", "into a street, as the atrium explodes, bombed by the frigate.", "The street is a dead end.", "His ornithopter brutally stops and does a radical vertical", "maneuver to get back to the surface, as massive explosions", "eradicate what’s left of the atrium.", "Being hunted by the frigate again, Idaho launches his", "ornithopter at high speed toward the edge of the protective", "wall of the war-torn city.", "Reaching the edge, he barely avoids several missiles, dives", "and disappears into heavy clouds of dark smoke.", "He finally escapes.", "EXT. ARRAKEEN RESIDENCY - BALCONY - NIGHT", "Harkonnen warships hang triumphant over the war-torn city.", "Weapons fire and cries of agony ring out in the streets.", "Piter de Vries stands watching with a bound and battered", "Thufir Hawat, guarded by four Sardaukar. Piter is gloating.", "Hawat, humiliated, doesn’t answer.", "INT. ORNITHOPTER (IN FLIGHT) - NIGHT", "The ornithopter holds its heading, leaving the Troopers", "little to do. They turn. Their eyes finding Jessica.", "The Deaf Trooper reads lips; he’s followed this exchange.", "Paul studies the First Trooper with Bene Gesserit intensity.", "His eyes. His lips. His hands. The pulse in his neck.", "The Deaf Trooper gets up and kicks Paul in the stomach. Paul", "grunts in pain, gasping for air.", "The ornithopter enters the desert proper, low over the dunes.", "Paul slows his breathing. Masters his body. Gets his breath.", "Beside him, Jessica sees what he’s about to do and stiffens.", "He’s not ready. She tries to catch his attention in vain,", "doing precise hand signals.", "Paul focuses on the First Trooper.", "No effect. The Deaf Trooper backhands Paul across the face.", "The First Trooper taps the Deaf Trooper on the shoulder.", "The Deaf One nods and hauls the side door open: wind buffets", "through the ornithopter as it skims the dune-tops. Paul looks", "at his mother.", "The First Trooper leans over Paul and unstraps him from the", "seat. As soon as his buckles are loose, Paul tries again.", "Perfect tone. His voice echoes with unnatural authority.", "As if it were his own idea, the First Trooper turns to", "Jessica, pulls his knife and cuts her gag free.", "Too late, the Deaf Trooper sees what he’s doing. He pulls the", "First Trooper away. They stumble back, struggling.", "Instantly the First Trooper plunges his knife into the Deaf", "Trooper’s throat.", "The Deaf Trooper stands like a statue, the knife jutting from", "his throat. Paralyzed. The First Trooper stares at his hands,", "horrified by his own actions. A SOB bursts from him.", "The First Trooper unlatches Jessica’s seat harness. He yanks", "his knife from the Deaf Trooper’s throat. Blood gouts from", "the deaf man’s neck. He sways but does not fall.", "The First Trooper kneels and cuts Paul’s ankles free -- but", "then the Second Trooper abandons the controls, rushes back", "and shoves the First Trooper aside.", "Desperately he tries to gag Jessica again. His clumsy", "struggles keeping her from speaking.", "The ornithopter’s AUTOPILOT kicks in: SAFE LANDING PROTOCOL.", "Paul leaps from his seat, hands still bound behind him. He", "kicks hard into the Second Trooper’s solar plexus, his foot", "digging deep and doing damage. The Second Trooper doubles", "over -- and Paul kicks him out of the moving ornithopter.", "A KNIFE whistles toward Paul’s neck: the First Trooper", "returning to the fight. Paul throws himself backward, dodging", "the blow, but falls to the deck.", "The First Trooper comes for him.", "Swiftly and efficiently he cuts the bonds on her ankles, and", "then on her wrists.", "The First Trooper begins to weep. He gives her the knife.", "Instantly Jessica rams the blade up under the Trooper’s chin", "into his brain, and yanks it free again. He falls dead.", "The Deaf Trooper, bled out on his feet, collapses beside him.", "Jessica bends over Paul with the knife and frees his hands.", "EXT. DUST BASIN - NIGHT", "The ornithopter, unpiloted, settles to the desert floor.", "INT./EXT. ORNITHOPTER - NIGHT", "Jessica and Paul pick themselves up. On the horizon, many", "miles off, they can see the Shield Wall that shelters", "Arrakeen. Explosions flash above the wall.", "She reaches under the diamond mark left by Yueh. Pulls out", "the bundle under the seat: a compact, well-made BACKPACK.", "Jessica opens the pack. A little light illuminates inside.", "Paul studies the contents.", "Suddenly a HARSH VOICE squawks over the ornithopter’s", "communicator: a guttural string of strange syllables.", "The harsh voice speaks again. More demanding now.", "Suddenly the displays of the cockpit avionics go red. Warning", "labels with threatening symbols.", "They clamber out of the ornithopter.", "EXT. SAND DUNES - NIGHT", "Paul and Jessica runs away from the ornithopter.", "They find themselves on a rise: in one direction, Arrakeen", "burns, convulsed by war. In the other, a sea of dunes rolls", "away to the horizon. They’re totally exposed. They press into", "the dunes, barefoot in the sand in the dark. Paul lugs the", "fremkit. The wind picks up, spice-dust swirling around their", "feet. Paul and Jessica stare at the city on fire.", "INT. ARRAKEEN RESIDENCY - DINING HALL - NIGHT", "Baron Vladimir Harkonnen sits at the head of the table, under", "the mounted bull’s head. He wears a Harkonnen uniform with", "military trim for his day of triumph.", "Before him is laid a lavish dinner for one: a steaming roast,", "cheese and wine. He eats the roast directly from the platter", "with fork and carving knife, breathing like a buffalo.", "Arrakis-born servants stand ready at either side, petrified.", "Guards stand with their backs to the walls.", "He directs his words to the far end of the table -- where", "Duke Leto sits, naked, chained to a chair under the portrait", "of his father. He is slumped over, still woozy from Yueh’s", "drug: the Baron just a blur to him at the head of the table.", "Outside the high windows, the night of Arrakeen is torn by", "violence everywhere the eye touches. Columns of smoke rise", "over the city, lit from below by lurid red flames.", "Piter enters with Doctor Yueh. They stop beside the Baron.", "He glances uneasily at the far end of the table, where Leto", "stares at him glassily from beneath his tousled hair.", "The Baron squints at Doctor Yueh’s face, drawn and tragic.", "The Baron stabs his fork into the roast and rises, his feet", "briefly leaving the floor as his suspensors overcompensate.", "He reaches out and takes Doctor Yueh by the hair. His grip", "shockingly strong. Yueh gasps.", "He lifts the carving knife and SAWS OFF YUEH’S HEAD. So", "brutally and swiftly that Yueh has no time to struggle. A", "spray of blood spatters the servants, who dare not move.", "The Baron shows Yueh’s head to Piter and lets it fall.", "He swings the knife slowly around, theatrically, to Leto.", "The Baron walks slowly down the long table with floating", "strides, dragging the knife-point along the table.", "Leto lifts his head to stare at the Baron. Eyes focusing now.", "There is death in his look. He is a chained lion.", "Instantly the Baron’s hand goes to his belt and activates his", "shield. Piter giggles. Angry, the Baron prowls closer.", "Leto lowers his head. Taking a moment for his grief and rage.", "We see a brief mental image of Paul and then, one of Jessica.", "The Baron grabs Leto’s hair and drags his head up. The", "carving knife at the ready. Leto takes a deep breath.", "Muscles clench in Leto’s jaw. A tiny crunch. Leto opens his", "mouth -- and blows out a cloud of poisonous vapor.", "The vapor is slowed by the Baron’s shield, revealing its", "curving boundary. Penetrating only partially.", "The Baron leaps backward, retching and screaming. He slaps", "his suspensor system into overdrive and shoots up to the", "ceiling, tumbling head over heels.", "Below him the vapor spreads across the room with shocking", "rapidity -- guards and servants falling dead in a wave from", "one end of the hall to the other. Piter among them -- his", "face twisting into a spectacular rictus.", "More guards rush inside -- and fall dead in their turn.", "The doors slam shut from the outside.", "INT. STILLTENT - DAWN (BEFORE SUNRISE)", "Dim light filters through the tent walls as the sky brightens", "outside. Sand hisses softly over the tent.", "Paul unpacks the fremkit, taking inventory. Laying out items.", "His breath catches. Beneath the manual there is a folded slip", "of paper bound in a ribbon. Paul unfolds the paper. Inside he", "finds a transmitter. The paper itself is a handwritten note", "in elegant calligraphy.", "Paul pulls it out -- and at the end of the ribbon dangles", "Leto’s SIGNET RING.", "They both stop breathing. Paul takes the ring off the ribbon", "and hands it to Jessica. Heavy, ancient, obviously authentic.", "It means death. They both know it. Tears shine in Jessica’s", "eyes as she struggles for control. Her chin trembles.", "Paul unfolds the paper. Inside he finds the compact edition", "of the Orange Catholic Bible that Yueh gave him. The paper", "itself is a handwritten note in elegant calligraphy.", "Jessica gives a short, sharp wail and covers her mouth.", "Paul watches the sand hissing over the tent, darkening the", "interior as it covers the translucent fabric.", "Jessica curls up and sobs. The love of her life gone forever.", "INT. ARRAKEEN RESIDENCY - DINING HALL - SUNRISE", "Duke Leto Atreides lies back in the chair, eyes open, looking", "at eternity. A white dust covering him and his surroundings.", "Around him, an apocalyptic sight: dozens of bodies scattered", "across the floor, frozen in contorted positions like the dead", "of Pompeii. Amongst them, Piter de Vries.", "Harkonnen guards enter the hall in sealed spacesuits --", "wheeling a filtration device to purge the air of poison.", "A sinister sound -- like ice breaking up on a lake in winter.", "The soldiers look up.", "The Baron’s massive body is glued to the high ceiling, curled", "up like a gigantic dead spider. Suddenly it begins to move,", "crawling monstrously down the wall.", "The soldiers step back in superstitious dread. The Baron, his", "face hidden under his cloak, crawls out of the room. The", "soldiers exchange terrified looks.", "EXT. STILLTENT - DAWN (BEFORE SUNRISE)", "The windblown sand covers the last of the tent’s exposed", "surface, concealing it completely. The sand keeps coming.", "INT. STILLTENT - SUNRISE", "Dark now. Paul illuminates a glowglobe that fills the tent", "with a dim green radiance. An eerie and unsettling light.", "Spice particles dancing in the light.", "Jessica sits up. Struggling to comprehend what has happened.", "Still wracked with grief. But Paul is remote. Analytical.", "Paul closes his eyes. Seeing patterns. Awareness expanding.", "Flashes of orange SPICE VISION pulse through his awareness in", "the scene that follows. Glimpses of possible futures.", "SPICE VISION: EXT. ARRAKIS - DESERT - DAY", "A vision of the future, Paul’s most distant yet.", "We’re looking at Chani, who’s standing at the edge of some", "natural wonder overlooking a vast swath of desert.", "She seems more mature than in previous visions, and is now", "dressed in a long linen dress.", "Chani lovingly motions for us to join her.", "As we approach this overlook, we begin to hear what sounds", "like ROARING.", "Chani points down at what’s happening below, asks us a", "question:", "Rather than finding an adoring crowd, what we see is nothing", "short of HELL, a ferocious BATTLE TO THE DEATH between", "thousands of FREMEN FIGHTERS and even more SARDAUKAR", "WARRIORS.", "The scene is one of endless blood and screaming and fire and", "terror.", "A WARRIOR KILLS EVERYTHING IN HIS PATH, WITHOUT ANY MERCY.", "WE FINALLY SEE HIS FACE.", "IT’S PAUL.", "EXT. CALADAN - OPEN BAY OF WAR SPACECRAFT", "An army of Fremen are cheering at their leader who’s standing", "in the opened door of a spacecraft, hovering above the", "soldiers.", "We get closer and see that the dark leader figure is Paul,", "flanked by Chani and other soldiers.", "CLOSER LOOK AT Paul, dark and silent.", "INT. STILLTENT - SUNRISE", "PAUL SNAPS BACK TO REALITY.", "He shakes his head in bewilderment.", "He closes his eyes as spice visions shake him, like a drug", "altering his awareness.", "He glares at her with cold intensity. Jessica is shocked by", "this turn in him. His coldness.", "He sounds half-mad. Jessica recoils, afraid of the visionary", "light in his eyes. Afraid of what he sees.", "She looks at him closely. He’s trembling. His eyes far away.", "She grabs him by the shoulders. Anchoring him.", "He looks up his eyes are shining with tears.", "Jessica moves back.", "Jessica slowly goes back closer to him. She pulls him into", "her shoulder, holding him. He bursts into sobs, finally. She", "cries with him.", "EXT. KYNES’S HOME - DAY", "A house high up on the edge of the city, with commanding", "views. Accessible on one side from the street and on the", "other side from the desert. The home of Liet Kynes.", "Kynes stands on the terrace, looking out at the Harkonnen war", "fleet in the skies of Arrakis. Her face is grim.", "Her eyes widen as a Harkonnen ornithopter swoops directly", "toward her -- flares its wings in a daredevil maneuver -- and", "lands lightly on the ledge in front of her house.", "Duncan Idaho gets out, haggard, and ROARS:", "Kynes’s hand goes to the hilt of a crysknife sheathed at the", "small of her back.", "Idaho draws his sword. Trembling with rage. Spits the words:", "Idaho stares at her bleakly as the import of that sinks in.", "Kynes lowers her head. Speaks almost to herself:", "INT. STILLTENT - DAY", "The dark tent is dimly lit by a pale glowtab. Scant beads of", "condensate form on the tent wall and drip into a reclamation", "system. Jessica lies sleeping.", "Paul is looking at his father’s ring.", "He slowly put it on his finger.", "We hear a signal from the transmitter.", "She wakes to see Paul bending over the water reclamation", "system.", "He detaches the catchpocket and hands it to her: a scant", "offering of water. She drinks half of it and hands it back.", "He finishes it. Both look haggard: skin dry, lips cracked.", "He picks up a SAND COMPACTOR and turns to the tent door.", "Opens the sphincter door.", "A trickle of sand pours in -- but Paul activates the sand", "compactor: its electrostatic field repels the sand and causes", "it to pack more tightly. He tunnels toward the surface.", "EXT. ARRAKIS DESERT - SUNSET", "Sand dunes glow in the light of an orange sunset. The twin", "moons rising in the sky. Silence and stillness.", "A sudden movement: a minuscule animal, a DESERT MOUSE with", "impressive huge ears, climbs a dune.", "The mouse reaches the top of the dune where a faint evening", "mist is blowing. It stands up in the wind, opening its ears", "wide like sails: capturing moisture. Tiny beads of water", "catch in the fine hairs and form droplets. The mouse drinks.", "A MOVEMENT IN THE SAND nearby sends the mouse scurrying off.", "Paul burrows up out of the sand with the compactor. Looks", "around. Ten feet away, the desert mouse stands frozen. For a", "moment they look at each other. The mouse hops away.", "Paul climbs out. Reaches down into the hole again and pulls", "out the Fremkit pack. Reaches down one more time and drags", "Jessica out. She comes out drawing a trailing strap behind", "her.", "AN ORNITHOPTER approachs, fast and low. Nowhere to run.", "The ornithopter flares its wings aerobatically and touches", "down light as a feather. Paul bursts into a smile.", "Idaho swings out of the pilot’s seat. His eyes wide with", "astonishment and joy. He runs to them across the sand. Throws", "his arms around them. His voice husky with emotion.", "Tears rise in his eyes. He takes Paul by his shoulders.", "Duncan stiffens in realization. Drops to his knees.", "He presses his forehead to Paul’s hand, overwhelmed. Jessica", "lays a loving hand on Duncan’s head.", "INT. IDAHO’S ORNITHOPTER - NIGHT", "Paul and Jessica clamber into the rear seats -- and find", "Kynes sitting in the co-pilot’s seat.", "Idaho passes a ration kit back to Paul and Jessica. They pull", "out water flasks and ration bars, and drink thirstily as", "Idaho takes the controls and lifts off.", "Paul looks out the windows at the ornithopters flanking them.", "Idaho shakes his head grimly. Remembering the carnage.", "Kynes looks back at her sadly.", "EXT. ROCKY PROMONTORY - DAWN", "Swiftly the Fremen cover the ornithopters with camouflaged", "tarpaulins and anchor them to the ground.", "Paul looks: far off he can see the storm as a column of", "darkness blotting out the stars. At its edge the stars shine", "blood-red through a haze of sand and dust.", "The Fremen find a subtle marking on the rock. Using sand", "compactors they dig down until a DOOR is revealed. The Fremen", "work a hidden latch. The stone slab swings inward, revealing", "a corridor. Kynes leads them inside.", "INT. RESEARCH STATION - NEXUS - DAY", "A huge circular chamber with a central pillar of stone.", "Passages lead away to laboratories and other facilities.", "Rough-hewn vents open in the rocky ceiling: warm, indirect", "sunlight shines through some fissure high above. The floor is", "drifted with sand. Kynes nods at her Fremen escort.", "INT. LABORATORY - DAY", "Kynes leads Paul, Jessica, and Idaho through a door. They are", "accompanied by two Fremen: TANAT and SHAMIR. They enter a", "wide hall: lights flicker on. They see science facilities on", "each side: botanical labs, chemistry labs, storerooms.", "The Fremen hurry off with unquestioning obedience. Paul", "watches this curiously.", "Kynes smiles slightly and does not answer.", "Idaho, ever cautious, prowls across the station, peering into", "laboratories. Hands on his weapons. Kynes looks at Paul.", "INT. LABORATORY - DAY", "Duncan Idaho wanders into a lab where DESERT-ADAPTED PLANTS", "grow under glass domes -- not in soil but in sand. He walks", "the rows in quiet wonder, hand on his sword-hilt.", "INT. LABORATORY OFFICE - DAY", "A square chamber carved from bedrock, lit by glowglobes. A", "row of metal file cabinets stands against one wall.", "In the middle of the room, a desk with a milk-glass top shot", "full of yellow bubbles is ringed by four suspensor chairs.", "Kynes sits at the desk with Paul and Jessica.", "Tanat returns and lays two bundled stillsuits and their", "fremkit on a shelf for them.", "Tanat exits. We glimpse Idaho taking up a guard position", "outside the office as the door closes.", "The audacity of his words takes their breath away.", "Paul’s voice cracks like a whip:", "Jessica frowns. Paul is accepting the religious mantle. A", "dangerous game. She murmurs:", "But Kynes looks away, shaken. Her heart wants to believe.", "Kynes stares at Paul, suddenly vulnerable.", "INT. NEXUS - DAY", "Kynes’s Fremen companions -- six warriors, men and women --", "sit drinking coffee from little silver cups.", "A quiet SCRAPE makes them all freeze like deer. A spill of", "sand from the vents overhead draws their eyes.", "We tilt up to see SARDAUKAR dropping through the vents,", "falling in slow motion on suspensors.", "We track them as they fall -- fifty Imperial soldiers --", "landing lightly on the chamber floor. They look around.", "The Fremen have vanished. One of the Sardaukar stoops to pick", "up a silver coffee cup -- a trickle of coffee in the bottom.", "He frowns thoughtfully --", "-- and the Fremen ERUPT FROM THE SAND all around the", "Sardaukar, KNIVES DRAWN! They leap into battle like", "dervishes, six against fifty. Fighting with superhuman skill.", "INT. LABORATORY CORRIDOR - DAY", "Duncan Idaho looks up as one of the Fremen comes in from the", "Nexus -- and falls on her face, a knife in her back.", "Sardaukar pour through the door behind her. Twenty of them.", "Idaho looks at them and sees his death. A strange wild joy", "starts up in him. So this is how it ends.", "He SLAPS the door behind him twice. Draws his sword and walks", "to meet the enemy.", "INT. LABORATORY OFFICE / CORRIDOR - DAY", "Hearing the clash of steel, Paul leaps up and opens the door.", "Halfway down the hall, Duncan Idaho stands against a wall of", "Sardaukar -- his longsword slashing, his shield sparkling.", "There are five Sardaukar dead at Idaho’s feet already, but", "there’s still fifteen more trying to kill him. Swords and", "daggers snaking into his shield. Idaho fights like a god of", "war. His blade too fast to follow. There’s freedom in knowing", "this is his last stand. He ignores the damage he’s taking.", "But as Paul watches, a Sardaukar sword rams through Idaho’s", "chest and out of his back. Idaho kills the Sardaukar but", "staggers to one knee. Another knife rams into him. Idaho", "kills one more Sardaukar... and falls, dying.", "Paul pulls his knife and leaps forward with a cry.", "She drags him back into the office.", "The Sardaukar advance down the hallway toward them.", "Kynes slams the door and locks it. Paul throws himself", "against the door with a howl.", "Kynes swings a steel file cabinet away from the wall,", "revealing a dark narrow passage. She grabs their stillsuits", "and fremkit from the shelf. Hands them over.", "They hurry through. She swings the door shut behind them: it", "closes like a bank vault, a thick slab of steel.", "HALLWAY", "The Sardaukar reach the Laboratory Office door and find it", "locked. The lead Sardaukar pulls out a laser cutter to cut", "through the door", "...and behind them, impossibly...Duncan stands up.", "A sword through his body. A dagger in his shoulder. He sways", "on his feet as he lifts his long sword.", "The Sardaukar turn. Duncan pulls the sword out of his chest", "as he walks toward them. Dread fills their eyes.", "Duncan goes to his death with a roar, his longsword blazing.", "INT. LABORATORY PASSAGEWAY - DAY", "Kynes leads Paul and Jessica swiftly down a narrow tunnel.", "Glowtabs light up at their approach and go dark behind them.", "They come to a fork in the tunnel. Kynes points one way.", "She disappears down the other passage.", "Paul and Jessica turn and press into the dark -- following", "the dim arrows that light up before them and fade behind.", "INT. LABORATORY CORRIDOR - DAY", "Duncan lies dead, surrounded by nineteen fallen Sardaukar.", "INT. CAVERN HANGAR - DAY", "Paul and Jessica enter a cavern where a small ORNITHOPTER --", "sits in a pool of light from an opening in the roof. It’s a", "fast, delicate craft compared to the military airships we’ve", "seen previously: its cockpit a bubble of glass.", "They stow their equipment in the ornithopter and climb in.", "Paul adjusts the pilot’s seat. Tests flight controls.", "EXT. ROCKY SPIRE - DAY", "The sun still low in the sky. The cloud-wall of the storm", "looms apocalyptically near, wild with lightning.", "Kynes emerges from a rocky spire, rigged for the desert in", "stillsuit and robes. A fremkit on her back. She looks out", "across the desert: in two places WORMSIGN is closing in,", "drawn by the active shields nearby.", "She moves away from the rocks along the ridge of a sand dune.", "As she walks she takes two MAKER HOOKS from her belt and", "telescopes them to full length. Surveying the desert.", "She watches the light ornithopter flown by Paul and Jessica", "mount into the sky and race for the storm. A moment later,", "THREE MILITARY ORNITHOPTERS lift off in pursuit. She frowns.", "Suddenly THE BLADE OF A DAGGER ERUPTS FROM KYNES’S CHEST. She", "screams and tumbles down the dune, losing her maker hooks.", "A SARDAUKAR ASSASSIN walks down the dune after her with a", "bloody blade. At the bottom Kynes lies gasping for breath,", "reaching for her crysknife which has fallen out of reach.", "She looks up. Watches the Sardaukar come. Sand slipping down", "the dune face under his boots.", "He stops, standing over here with a cruel sneer.", "Kynes hears a sound the Sardaukar fails to notice: a HISS of", "sand beneath them, growing louder.", "She begins to pound the sand with her fist, a steady", "drumbeat. THUMP. THUMP. THUMP.", "She snarls at her killer.", "The desert opens up beneath them as a SANDWORM surfaces, its", "great maw open wide. It devours them both in a flood-tide of", "sand and sinks back down into darkness.", "INT. ORNITHOPTER - DAY", "Paul pushes the power bar forward and pulls back on the yoke.", "The little ornithopter’s engines whine as it dashes for the", "storm, sinking them into their seats as it climbs.", "Paul looks back. Sees three Harkonnen ‘thopters in pursuit.", "He slams the power arm forward. The ‘thopter leaping like a", "frightened animal across the sky. Ahead of them, the rust-", "colored cloud wall of the sandstorm. Big as a hurricane.", "Each of the pursuing ornithopters fires a MISSILE. The three", "missiles track them and close fast. COLLISION WARNINGS whine", "inside Paul and Jessica’s cockpit.", "Paul banks closer to the cloud wall, watching the altimeter.", "3000 meters and climbing...", "He weaves desperately: but the missiles track the ornithopter", "easily. Closing fast. They’re not going to make it.", "Paul twists the yoke -- and BANKS THEM INTO THE STORM-WALL.", "The storm tumbles the ornithopter like a leaf in a gale. The", "wings buckle dangerously. Paul closes the aircraft’s wings.", "The missiles follow into the hurricane -- and they, too, are", "snatched from their courses and hurled chaotically away. They", "explode, painting ribbons of fire through the storm.", "The Harkonnen ornithopters break off: the sandstorm is death.", "Paul and Jessica are crushed into their seats by their", "ornithopter’s spin. Sand SINGS against the fuselage. Paul", "fires jets in bursts. Slowing their rotation.", "Visibility drops to zero. Only the wash of dust over the", "windscreen and the green light of the instrument panel.", "Paul eases the wings open to short stubs, struggling for", "control -- and the engines die. (Instruments retain power.)", "The only sounds are the wind, and creaking metal, and sand", "scouring the hull. The altimeter still spins: tumbling", "chaotically, they are rising. Climbing past 4000 meters.", "Jessica hears him and joins him, in an attitude of prayer:", "Paul fights to controls the tumbling ornithopter, flying dead-", "stick. The engines are out.", "EXT. ARRAKEEN RESIDENCY - DAY", "The Harkonnen Dreadnought still hovers over the great house.", "Harkonnen guards stationed at every door. In total control.", "INT. ARRAKEEN RESIDENCY - BATH ROOM - DAY", "The Baron reclines in a high-tech tub filled with a viscous", "orange fluid. He’s coated to the collarbones.", "One of his cheeks is spiderwebbed with white threads, like", "cracks in an old painting. The after-effects of the poison.", "Two teenage SLAVES tend to him: a boy and a girl, both very", "pretty, in revealing tunics. Both terrified. The boy feeds", "the Baron fruit from a platter while the girl dabs", "tentatively at his craquelured cheek with a medical swab.", "Rabban enters and approaches the tub. Averting his eyes.", "The female slave touches the Baron with a swab and he jerks", "away in pain, slapping the swab from her hand. She cringes.", "The Baron takes a deep breath.", "He beckons to the slave girl to resume her ministrations.", "INT. ORNITHOPTER (IN FLIGHT) - DAY", "The altimeter reads 8000 meters.", "On Paul.", "Dust has penetrated the cockpit. It swirls across the deck", "and hangs in the air, laden with spice -- orange motes", "drifting before his eyes. Jessica coughs in the dust.", "Paul opens the wings. It takes all his strength. They creak", "and whine -- but they unfurl.", "EXT. DUST STORM - DAY", "The little ornithopter breaks out of the vast storm, miles", "up. Banking away from the hurricane into blue skies.", "The aircraft’s glass bubble has been scoured to a milky", "translucence by dust. The wings are bent and trembling. The", "engines choked by dust compacted hard as concrete.", "The ornithopter is a glider now.", "INT. ORNITHOPTER (IN FLIGHT) - DAY", "Descending silently and swiftly, Paul sees warning lights", "multiply across his instrument panels as systems fail.", "Jessica nods, bracing herself against the fuselage.", "EXT. DESERT - DAY", "The ornithopter skips across the sand, struts breaking, wings", "crumpling, and comes to a stop tilted onto one side.", "Paul and Jessica climb out, grab their gear, and run --", "struggling through the deep soft sand toward the rocks.", "Halfway to the ridge they hear the deep HISS of sand...the", "rending of metal behind them as a worm takes the wreck.", "Only when they reach the rocks do they look back -- in time", "to see a huge wormsign disappearing into the deep desert. The", "sun beats down. Heat shimmers off the rocks and dunes.", "Jessica peels off her nightgown. Paul turns his back and", "undresses. They slither into stillsuits.", "CUT TO", "They are ready to go.", "EXT. ROCK RIDGE - DAY", "Paul walks followed by Jessica. He’s lost in thoughts.", "EXT. ARRAKIS DESERT - DAY", "From Paul’s point of view, we’re sitting inside a cave.", "We turn to see a rugged male Fremen named JAMIS, who", "instantly puts us at ease with his calm and pleasant", "demeanor.", "Jamis looks now very close to camera...", "EXT. ROCK RIDGE - DAY", "Paul and Jessica work their way along the rocky ridge,", "staying close to cover -- until the ridge peters out. They", "gaze across a four-kilometer stretch of open sand to a rock", "formation on the far side. Paul studies the paracompass.", "Jessica stares across the sand through binoculars.", "She passes the binoculars to Paul. He peers through them,", "seeing cactus and sage growing high in the rocks.", "EXT. ROCKY RIDGE - NIGHT", "The stars are out. Both moons nearly full, painting the", "desert with blue light.", "He demonstrates. Step-step...step-drag...wait... She follows.", "Together they cross the sand under the moonlight, side by", "side. The extraordinary skill of their bodies pressed into", "service in a strange new motion. They leave strange tracks.", "They continue sandwalking, without rhythm. It’s exhausting.", "A low HISSING. Jessica points. Far off, WORMSIGN: a wave of", "sand cresting nearer. They stave off panic and keep walking.", "Fatigue makes Paul stumble onto a plain of hardened sand.", "BOOM BOOM! His steps echo like explosions across the plain.", "The worm, which had been headed for the thumper, immediately", "changes course and drives straight for them.", "They run, heedless of the drum sand, raising an unholy", "thunder. The worm gaining on them. They run into sand, then", "into pea gravel that rolls underfoot. The worm still gaining.", "As they reach the rocks on the far side, Paul stumbles and", "falls. Jessica runs on without him before she realizes Paul’s", "been left behind. She turns back.", "Paul rises to his feet as the sandworm surfaces -- the first", "time we’ve seen a worm’s mouth fully revealed. A vast half-", "circle of death ringed with crysknife teeth in the moonlight.", "Paul stands frozen in front of it. Its spice-laden breath", "washes over him.", "A distant THUDDING echoes across the sand. A thumper!", "The giant eyeless beast turns away, submerging and questing", "away across the sand after that rhythm. Paul and Jessica", "watch the worm go.", "They turn back to the rock outcrop.", "They climb upward.", "EXT. ROCKY BASIN - NIGHT", "At the top they find a natural amphitheater with rough rock", "walls and a floor of sandy earth. PLANTS are growing here:", "sage and saguaro and mesquite among the jagged stones.", "Paul makes a hand signal: we are not alone.", "Quiet STIRRINGS all around them. Dozens of silhouettes rise", "against the stars. They are surrounded by an entire tribe!", "Paul and Jessica spin, seeking escape -- but there’s no way", "out. They are encircled. They stand back-to-back.", "Four ATTACKERS move forward, hands on their knives, to claim", "the interlopers’ lives.", "A startled silence.", "The Attackers stop advancing. Stilgar walks out into the", "moonlight to face Paul. Paul meets his eyes.", "Stilgar studies his face in the moonlight, and nods.", "One of the four attackers, a rangy wolf of a man with a", "bristling beard, snarls in answer. This is JAMIS.", "Stilgar clenches his jaw.", "He does know the law.", "He considers Jessica and Paul, and passes sentence.", "Stilgar looks at Jessica with grave courtesy.", "He reaches for his crysknife.", "Jessica flashes into motion: trapping his hand, pummeling his", "body. She spins him around. The knife she seized from the", "troopers on the ornithopter flashes into her hand.", "In a moment she’s backed up against the cliff, Stilgar pinned", "before her in a chokehold, her knife at his throat.", "Paul darts for the shadows. Jamis leaps to intercept him.", "Paul kicks him in the solar plexus, chops his neck with", "perfect precision, and catches his pistol as it falls.", "The Fremen swiftly close in on Jessica, weapons ready -- but", "she tightens her grip until Stilgar shouts:", "Paul swarms up the rock face until he finds a ledge that will", "hold him. He crouches in the shadows, controlling his", "breathing. The pistol aimed at Stilgar.", "She bears down on his neck until he cries out again.", "The words send a superstitious shiver through the tribe.", "Cautiously Jessica releases Stilgar. He steps free and calls", "out to the tribe.", "The night is fading. We must", "reach Sietch Tabr. The fates", "of these strangers will be", "decided there. Until then", "they have my countenance! My", "word is on them.", "Tell your boy to come down.", "He made more noise than shai-", "hulud climbing that cliff.", "Fremen rush into the shadows and help Jamis to his feet.", "ON THE LEDGE", "Paul stands, lowering the pistol. A SLIM YOUNG WOMAN rises", "from the shadows beside him, masked by her stillsuit. Her", "crysknife shines in the moonlight. This is CHANI.", "She opens her stillsuit mask to look at him curiously.", "Paul stares at her: at a face he knows as well as his own.", "The girl of his recurring dreams. Chani smiles.", "EXT. ROCKY BASIN - NIGHT", "Chani leaps lightly down the rocky slope to rejoin the", "others. Paul slides down behind her, less gracefully.", "Stilgar points at the maula pistol in Paul’s sash. Beckons", "for it. Paul glances at Jessica. She nods. He gives it up.", "Stilgar tosses the gun to Jamis, who holsters it furiously.", "The girl nods. Paul’s eyes go to her. Her name is Chani!", "A murmur of shock and excitement among the Fremen.", "All eyes turn to Paul. He finds himself stepping forward.", "Jamis snarls in satisfaction. This is what he wanted. He", "begins to strip off his stillsuit.", "EXT. ROCKY BASIN - PRE-DAWN", "The Fremen have cleared the ground of a rocky platform. Jamis", "paces the circle, a crysknife in his hand. Eager to fight.", "Jessica watches in dismay as preparations are made for her", "son to fight this seasoned warrior. The sky grows lighter in", "the east: the gray twilight before dawn.", "Paul is facing a wall, lost in thoughts. He has a sudden", "vision.", "PAUL’S VISIONS", "Paul fights with Jamis. Paul feels a pain in his chest. He", "has been stabbed. He falls on his knees. Jamis holds a", "crysknife with blood on it.", "PAUL SNAPS BACK TO REALITY.", "Paul removes his gear and gets ready for the fight. He feels", "alone like never before. He looks at his father’s ring and", "puts it back in one of his pockets.", "Chani comes beside him.", "She places her own crysknife in his hands.", "Paul considers telling her about his visions... Paul looks at", "Chani in the eyes. She is troubled. A strange intimate", "silence between them.", "Chani walks Paul to the circle. Paul steps into the circle,", "weighing the strange knife in his hands. He tosses and", "catches it a few times to get the feel.", "Paul salutes with his knife in the chivalric manner. They", "begin to circle one another.", "He attacks immediately and repeatedly: swift brutal blows,", "each one a killing stroke. He is utterly confident: taller,", "stronger, contemptuous of this weak foreign boy.", "But in Paul, Jamis has met a level of training the Fremen", "have never seen. Paul evades and deflects every attack", "without breaking a sweat, calm and steady. Each time his", "counter-attack is exquisitely graceful, on-target", "...and slow. Timed as if Jamis wore a shield. Each time Jamis", "jerks away in time to survive.", "Swiftly it becomes plain that Jamis is badly overmatched. He", "is tiring, covered with sweat, while Paul is unruffled.", "He lunges -- and Paul meets his arm with the point of his", "blade, dealing a nasty wound. Jamis leaps back with a snarl.", "A murmur of protest among the Fremen. Stilgar speaks up.", "Kill or be killed. Paul swallows hard and comes on guard.", "The fighters clash again and again. Every time Paul proves", "untouchable, but fails to strike a killing blow.", "Stilgar’s eyes widen as he understands what he’s seeing.", "Jamis makes a savage, desperate run at Paul. He leaps,", "spinning in the air -- and as he spins his knife switches", "hands, striking from a new angle --", "But Paul has seen the switch. He too switches knife hands --", "blocking Jamis’s knife arm with his empty hand. With the", "other he drives his knife under Jamis’s ribs into his heart.", "A gout of blood slashes across Paul’s body.", "Paul steps away like a matador as Jamis crashes to the floor.", "A few Fremen rush in, wrapping Jamis in a plasticine sheet.", "MINUTES LATER - DAWN (BEFORE SUNRISE)", "The light of daybreak grows stronger in the East. Chani looks", "at Paul with something like awe.", "The Fremen flock around Paul, congratulating him, touching", "him. Marveling at his skill. A glow of pride creeping across", "Paul’s face. This combat is sacred to them. He is accepted.", "Jessica is troubled. Seeing her son become a killer, a", "tribesman among these savage people...", "She looks at her son. Paul’s eyes flash in the light of the", "breaking day. His vision is clear.", "Jessica nods. Not understanding, but trusting him. Paul looks", "at Stilgar.", "EXT. ROCKY RIDGELINE - DAWN", "The tribe moves single file along an elevated ridge. Stilgar", "leads: at the tail of the column, three Fremen carry Jamis’s", "wrapped body. A treasure of water.", "In the middle of the column, Paul clutches at Jessica’s arm.", "Staring at the sun. She turns to look.", "Far-off, silhouetted against the sunrise, a SANDWORM passes,", "traveling on the surface. On its back, hanging on with “maker", "hooks,” FREMEN are riding -- robes fluttering in the wind.", "Paul and Jessica watch the worm pass by in awe. Paul turns to", "whisper to his mother in fierce triumph.", "She smiles in the golden light, making his heart skip a beat.", "This is the image from his visions. The dream girl.", "She turns and walks on across the rocks in the golden light.", "He follows. Around them the sands stretch toward the horizon.", "Toward a future he cannot see."]}