{"": [" Based on the novel 'Dune' by FRANK HERBERT"], "CHANI": [" Paul...", " But not me.", " I knew.", " Paul. You need to wake up.", " Lisan al Gaib.", " I would not have let you hurt my friends.", " I don’t believe you are the Lisan Al Gaib. But I want you to die with honor.", " Jamis is a strong fighter. He won’t let you suffer.", " Yes?", " This is only the beginning."], "PAUL (O.S.)": [" Mother."], "JESSICA": [" It’s good you’re up early. Your father wants you in full dress before the Emperor’s Herald arrives.", " Ceremonial.", " Ceremony.", " If you want it, make me give it to you. Use the Voice.", " The glass can’t hear you. Command me.", " Almost.", " Better than any man has ever done.", " Get dressed and come with me.", " The Reverend Mother Gaius Helen Mohiam is here. She was my teacher at the Bene Gesserit school. Now she is Truthsayer to the Emperor himself. She would like to meet you. She wants to know about your dreams.", " I’ll give you a moment.", " Paul, please. Remember your training.", " You must do everything the Reverend Mother tells you.", " I must not fear. Fear is the mind- killer. Fear is the little death that brings obliteration.", " I will face my fear. I will permit it to pass over me and through me.", " Where the fear has gone there will be nothing!", " Only I will remain.", " Was this necessary?", " Was I wrong?", " Do you see so little hope?", " Paul. I’m so sorry.", " I know. It’s a terrible ordeal. But there are reasons...", " You heard.", " You don’t know everything. For thousands of years, we’ve been carefully crossing bloodlines to bring forth...", " A mind powerful enough to bridge space and time. Past and future... who can help lead us into a better future. We think he’s very close now. Some believe he’s here.", " Yes!", " Lisan al-Gaib. Voice from the Outer World. It’s their name for messiah.", " Preparing the way. These people have been waiting for centuries for the Lisan al-Gaib. They look at you and see the signs.", " Oh. Is this Arrakeen custom?", " Please rise.", " The rest of you may go.", " I know many things. I know you have a weapon concealed in your bodice.", " Not now.", " It’s a crysknife.", " Be ready for violence.", " Thank you, Dr Yueh.", " What did you see?", " You can’t know that. I barely know that. It’s only been a few weeks...", " You have to sleep.", " Close your eyes.", " Don’t do this. You are not ready!", " Your pitch was too high.", " KILL HIM. NOW.", " Harkonnen battle language. They’re demanding a counter-phrase.", " They’ll be on their way.", " Paul...", " You’re afraid. What do you see that you fear?", " Paul.", " Your name is Paul. Paul Atreides. You are the Duke Paul Atreides.", " Dr. Kynes.", " You’re sure?", " So. The Emperor’s taken a side. What says the Judge of the Change?", " Chaos. Across the Imperium.", " Careful...", " Paul, no!", " You’re not coming with us?", " How?", " Jet-flares behind us.", " There’s greenery over there.", " Run!", " We have powerful friends. If you help us get offworld, to Caladan -- you’ll be well rewarded.", " The conversation ran short.", " Paul. Come down.", " No. Paul has never killed a man.", " Paul needs to get offworld. You must have ways. Smugglers. Ships..."], "PAUL": [" Full dress. Military?", " Why do we have to go through all this, when it’s already been decided?", " I just woke up. Can I please-- ?", " GIVE ME THE WATERRRRRR.", " GIVE ME THE WATER.", " Almost?", " No.", " Duncan.", " I did?", " So... you’re going back to Arrakis tomorrow. With the advance team.", " I would like you to take me with you.", " Duncan--", " Can I trust you with something?", " I’ve been having dreams. About Arrakis.", " And there’s...", " ...there’s a girl.", " I saw the Harkonnen legions...", " The first dream was a month ago. Before any of this happened.", " I dreamt about you. With the Fremen.", " I saw you lying dead. Fallen in battle. Your face clean-shaven.", " Duncan...", " You don’t think we’ll ever come back?", " Father, I’m here to ask you to join Duncan Idaho’s scout mission on Arrakis. I’d be an asset to him.", " Great leaders are raised in the mud, not around tables.", " Grandfather fought bulls for sport!", " What if I’m not?", " The future of House Atreides.", " You never told me that.", " I will.", " I could tell it was you by your footsteps, Gurney Halleck.", " Not today. Without Duncan, what’s the point?", " I guess I’m not in the mood today.", " I have you.", " Will it be that bad?", " Mother. What’s wrong?", " What is this?", " How does she know about my dreams?", " What is happening?", " What are you saying?", " You dismiss my mother in her own house.", " How dare you use the Voice on me?", " What’s in the box?", " Why are you doing this?", " Because I’m a Duke’s son?", " My father rules an entire planet.", " He’s getting a richer planet!", " I had one tonight.", " A girl. On Arrakis.", " Many times.", " Not exactly. Sometimes.", " I could have died.", " What does it mean? That I could be the One?", " You steer the politics of the Imperium from the shadows. I know.", " ...the One?", " All part of a plan. Do you... love my father?", " Thufir Hawat.", " I’m excited to say the least!", " They were pointing at us. What are they shouting?", " Planting superstitions.", " They see what they’ve been told to see.", " What about them?", " I didn’t know date palms could be found here.", " Should we remove them?", " Thanks for the humiliation old man.", " All of them?", " How can this stand? Isn’t there a Judge of the Change to oversee the transition?", " Duncan!", " Well, you smell much worse.", " How big was the place?", " It’s true.", " Won’t you stay? We would honor you.", " The Fremen make these?", " You admire them.", " You’re the Imperial Ecologist. Thank you for the stillsuits.", " This is the first time.", " It seemed the right way.", " Are you Fremen?", " What would you do if your ornithopter went down out here?", " Why don’t we shield the crawlers?", " Is there any way to kill that thing?", " That’s still three short.", " A shield generator weighs a hundred kilos.", " Yes Sire!", " THIS WAY! Seven there! Seven in here!", " I’m sorry. It won’t happen again.", " This wasn’t an allergic reaction. I inhaled spice and I had visions. With my eyes wide open.", " I know you are pregnant.", " Legend is a pretty word for a lie.", " How can I make my way if my destiny was written before I was born?", " The scarred trooper is deaf.", " Don’t you dare touch my mother!", " REMOVE HER GAG.", " REMOVE HER GAG.", " It’s a fremkit. Fremen survival gear. It’ll give us a chance.", " They’ve crippled the ship.", " Sand compactor. Paracompass. Thumper. “Maker hooks,” whatever they are. The Manual of the Desert. No stillsuits. The one thing we...", " There’s something awakening in my mind.", " Holy war. Spreading across the universe like unquenchable fire. A warrior religion that waves the Atreides banner. Fanatical legions worshipping at the shrine of my father’s skull. A crusade. In my name. My name. That’s the future. It’s coming.", " GET OFF ME!", " Someone is near. You need to drink.", " That’s Duncan!", " Fremen?", " Is there anyone else left?", " Yet you risk your life to help us.", " Who are you to the Fremen?", " Do you know what the Great Houses fear most? Just what’s happening here. The Sardaukar picking them off one by one. Only together can they stand against the Imperium. Would you bear witness? Testify that the Emperor moved against us here?", " But suppose I presented the Emperor with an alternative to chaos. The Emperor has no sons. Only daughters.", " You will call me my Lord or Sire. Fremen speak of the Lisan al-Gaib, the Voice from the Outer World who will lead them to Paradise.", " I know you loved a Fremen warrior, and lost him in battle. I know you walk in two worlds and are known by many names. I know your dream.", " Duncan!", " Thank you. Good luck!", " I must not fear. Fear is the mind- killer.", " As soon as we’re down, run for the rocks.", " Now we have to find the Fremen.", " That has to mean people. We’ll cross after dark. Like the Fremen do.", " Remember. Walk without rhythm. Like the Fremen do. Erratic movement.", " Someone called it.", " Stilgar!", " I was there when you came to my father’s council. With Duncan Idaho. You know me.", " One move and you die.", " Chani...", " I... Never mind.", " Do you yield?", " No.", " Desert power!"], "PAUL (CONT'D)": [" Give. Me. The Water.", " Better than anyone else has ever done.", " Are you the new Weapons Master?", " That is rude.", " Old man.", " Why is Doctor Yueh here?", " This is Doctor Yueh’s handwriting. “There is an Atreides transmitter in the Fremkit. If anyone survives. They’ll find you.”", " You did this to me! You BENE GESSERIT. You made me a freak!", " Let’s get out of here.", " As Emperor, I could make a Paradise of Arrakis with a wave of my hand.", " Drum sand!", " The Emperor sent us to this place. And my father came -- not for the spice, but for the strength of these people. I am the Duke now. And my road leads into the desert. I can see it. If you’ll have us.", " We will come. And learn your ways."], "JESSICA (CONT'D)": [" You look tired. More dreams?", " Paul.", " And when it has gone past I will turn the inner eye to see its path.", " The Bene Gesserit serve as powerful partners to the Great Houses, but there’s more to it.", " Oh, Paul.", " It means the Bene Gesserit have been at work here.", " What is your name?", " If you mean to harm me, I warn you: whatever you’re hiding won’t be enough.", " It’s a maker of...", " SET US FREE.", " STOP!", " CUT ME LOOSE.", " GIVE ME THE KNIFE.", " He’s gone!", " We’re not high enough!", " Paul...!"], "LETO": [" Smile, Gurney.", " How much will they spend traveling here for this formality?", " For centuries, House Atreides has stood for honor. Not only for itself, but for the benefit of all. Now the Emperor gives us his unconditional trust. He wants us to BRING PEACE ON ARRAKIS!", " I miss him.", " I think Arrakis is far away.", " Out of the question. You’ll travel to Arrakis in a few weeks, like the rest of us.", " Don’t throw my words back at me. You have responsibilities Duncan Idaho will never have.", " Yes. And look where that got him.", " Not what?", " I told my father I didn’t want this either.", " My father said, A good man doesn’t seek to lead. He’s called to it, and he answers. If your answer is no, you’ll still be the only thing I’ve ever needed you to be -- my son.", " To Duncan’s last night on Caladan!", " The Emperor is no stranger to treachery. Nor the Harkonnens. We have to be ready for anything. But this is our time. The Atreides never back down from a challenge. And when we prevail, it will mean a better life for the people of Arrakis. For all of us. Until then-- we keep our spirits up for the men. Hmm?", " How are you, old friend?", " It’s so quiet.", " Our two most vulnerable points are the spaceport and the refinery. I want you guarding them around the clock. If we can’t harvest spice and ship it off-world, we’re dead here.", " What do they say about this hell hole again?", " That’s what they say.", " My dear cousin Leto. Welcome to Arrakis. There’s a lot to learn. I thought I’d give you a few pointers. Baron Vladimir Harkonnen.", " Let’s get started. Thufir. Operations.", " How bad is it?", " I want to see the harvesting fields for myself.", " Have The Judge of the Change accompany us. We will make our case and at the same time have some Imperial protection.", " This sietch. How was it hidden?", " Millions of Fremen. You were right.", " Well done.", " Let him pass!", " Diplomacy!", " I know you’ve suffered under the Harkonnens. Name what you want. If it is in my power to grant, I will give it and ask for nothing.", " Gurney. The Emperor has given me Arrakis as my fief, to rule and protect. I cannot promise not to travel in the desert, if duty compels me: but your sietches will be yours forever -- and you will never be hunted while I govern here.", " But it will take time.", " It’s all right.", " I see it.", " Wormsign?", " Is that a worm?", " How many men on that crawler?", " Our ships can take six each.", " We’ll find a way.", " Yes! Gurney, have our escorts throw out their shield generators.", " Paul stay behind and help the workers to get in!", " Where are they? Delta Ajax niner! Put seven men each in my ships!", " Damn the spice! I want every man off that crawler. Now!", " You cannot take such risks. You have responsibilities.", " Go!", " You know what’ll happen if I fail to get spice production back on track. The Harkonnens will return.", " I think you’re afraid it might be true.", " If I tell you one day you’ll find yourself on a mountaintop -- what does that change? You still have to climb the mountain. Destiny grants us nothing -- and takes nothing away. We have to fight and bleed for the future we want. Because when all’s said and done, there’s only one way to find out if a prophecy is true. We earn it.", " Not like that.", " Security. Security. Hawat.", " Why...?", " Here I am, here I remain."], "GURNEY": [" I am smiling.", " You think we’ve won something?", " So it is. The other Great Houses trust and admire us. And the Emperor is a jealous man. So. Maybe he’s giving Arrakis to us. Or maybe he’s giving us to Arrakis.", " He knows. He -- He’s right here.", " Don’t stand with your back to the door. How many times do we need to tell you?", " With Duncan Idaho gone, I must make do as best I may.", " Never let a man inside your guard! Even in sport! Not even me!", " Mood?! What has mood to do with it? You fight when the necessity arises, no matter your mood! Now fight!", " Aye. But look down, m’lord.", " Bad is a child’s word. You don’t get it, do you? You don’t really understand the grave nature of what’s happening to us.", " “My lungs taste the air of Time, Blown past falling sand...”", " Atreides!", " Yeah. That’s what worries me too.", " “To shower, you scrub your ass with sand,” my Lord. That’s what they say.", " Spice workers.", " Paul Atreides! Late to his first strategy meeting! Sorry to drag you out of bed.", " “For they shall suck of the abundance of the seas and the treasure hid in the sand.”", " Who did the Emperor appoint?", " A hostage. I love it.", " You will address the Duke as “Sire” or “My Lord...”", " I don’t like him.", " What the hell’s a sand compactor?", " My God, man, you’ve gone native.", " The Judge of the Change, Sire. Dr. Liet Kynes.", " Dust cloud!", " A worm always comes?", " They seem pretty calm about it.", " What happens now?", " Yes Sire!", " Paul!", " We have to run, Paul! Now!", " I remember salt smoke from a beach fire, The seagulls crying on the strand...", " God in Heaven. Get everything with guns off the ground!", " WITH ME! WITH ME!"], "HAWAT": [" Three Guild Navigators, fifty-two parsecs...figure a hundred and forty decagrams of spice...a total of one-point-four-six million solaris, round-trip.", " Young master! How does it feel to walk on another world?", " My Lord, my advance team has secured the city. We’re still smoothing out a few rough spots.", " Don’t be fooled by the welcome. They follow their old masters’ rules. Mandatory attendance. That’s Harkonnen love out there.", " Let’s get you out of the sun. The heat can kill in this place.", " Candidates for housekeeper, my Lady.", " I secured a copy of the Harkonnens’ account books.", " We won’t see profits like that for a while. Not with the equipment they left us.", " These are spice silos. We must fill every crate.", " Every twenty-five standard days.", " Dr. Liet Kynes. Imperial Ecologist. Been here twenty years. Eccentric, from what I’m told.", " I wouldn’t recommend that my Lord.", " He’s here, my Lord!", " The Harkonnen estimate was fifty thousand on the whole planet!", " Our plan bears fruit...", " Yes, it will take time."], "HERALD OF THE CHANGE": [" By the grace of Shaddam IV of House Corrino, Ascendant to the Golden Lion Throne and Padisha Emperor of the Known Universe, I stand before you as Herald of the Change.", " Your seal.", " It’s done."], "HERALD OF THE CHANGE (CONT'D)": [" We are witnessed by members of the imperial court, representatives of the Spacing Guild, and a sister of the Bene Gesserit.", " House Atreides is one of oldest and most respected members of the Landsraad. In the wake of the failure of House Harkonnen, the other Great Houses have turned to you in hope. Shaddam IV agrees.", " House Atreides will immediately take control of Arrakis and serve as its steward. Do you accept?", " The Emperor has assigned a Judge of the Change to oversee the transition. The Judge will meet you upon your arrival."], "LETO (CONT'D)": [" We are House Atreides. There is no call we do not answer. There is no faith that we betray. The Emperor asks us to lead. House Atreides... ACCEPTS.", " That damned bull.", " I wish we could bring them all with us.", " You know why. You’re the future of House Atreides, Paul.", " I understand your impatience. When we get to Arrakis, I want you to have a seat on my council. It’s time to teach you how we lead.", " I wanted to be a pilot.", " I found my own way to it. You might find yours.", " In their memory, give it a try.", " Duncan, you’re a fine fighting man. But you look like a barbarian. Tonight, that beard comes off.", " Stilgar. Welcome. I respect the personal dignity of any man who respects mine.", " I’m glad you’ve come. I think your people and mine have much to offer one another.", " This is Duke Leto Atreides. We are coming down to take off Delta Ajax niner’s crew. We’ll put down on the west.", " Everything they left is in shambles. It’s plain to see. We’ve been set up to fail. When you report to the Emperor, you must say the rules weren’t followed.", " That’s what they call you, isn’t it? Voice From the Outer World.", " It troubles you."], "OFFICERS": [" ATREIDES! ATREIDES! ATREIDES!"], "DUKE": [" So... it’s done?"], "DUNCAN": [" Stabilizers still too lose.", " Dial faster.", " You put on muscle!", " No. Try eating something.", " Yeah.", " You do? Oh. Too bad. Because no.", " You trying to get me court- martialed? What’s going on?", " Always. You know that.", " Now we’re talking...", " Okay, so... you dreamed about stuff we all know about.", " Well... that’s a hell of coincidence.", " So I will find them! There’s a good omen! Right?", " Whew! Okay! Not gonna die! I shave for no man!", " That’s why you want to come with me! Listen. Dreams make good stories. But everything important happens while we’re awake. Because that’s when we make things happen.", " Gurney Halleck. You look grouchy. To Arrakis!", " Hey. We did. Our star is rising!", " Did you tell the Duke?"], "LANVILLE": [" We’ll dial ‘em in.", " Shield.", " My Lord, the sun is too high now. We have to seal the doors."], "DUNCAN (CONT'D)": [" PAUL!", " I hope the girl part’s true!"], "PAUL (V.O.)": [" I saw the spice sands in the deep desert. The Fremen, fighting for their lands.", " I watched them leave Arrakis.", " I recognize your footsteps, old man.", " My father is dead. Why can’t I cry?", " 8000 meters. We’re still climbing.", " I’ll need to time the top of the vortex. I can see it. It will be there... In few seconds... I can see it"], "CHANI (V.O.)": [" Paul...", " Paul...", " Some of my people thought a savior might never come.", " Bless your coming and going.", " May your passage cleanse the world.", " Will you keep it for your people?"], "Golden Rev. (06/12/20)": ["", "", "", "", "", "", "", "", "", "", ""], "FILMBOOK (V.O.)": [" The Fremen, the native tribes of Arrakis, use the sandwalk to avoid worm attacks. Sandworms are drawn to rhythmic noises. The sandwalk is designed to emulate the natural sounds of the desert... (etc.)"], "Buff Rev. (05/24/20)": ["", "", "", ""], "GURNEY (CONT'D)": [" Choose your blade.", " Come on!", " You’d have joined me in death.", " I see you found the mood.", " For eighty years Arrakis belonged to House Harkonnen! Eighty years! Owning the spice fields! Can you imagine the wealth? Now they are losing Arrakis... to us. You need to be ready. -- Your eyes. I need to see it in your eyes! You never met Harkonnens before. I have. They're not human. In the slave pits of Geidi Prime, Rabban Harkonnen himself killed my family and he gave me this scar to remember him by.", " And I will never forget.", " I say it’s good for the spirit.", " Go go go!"], "(MORE)": ["", "", ""], "RABBAN": [" Milord Baron.", " The last of our ships have left Arrakis. It’s done.", " Uncle. How can we let this happen?", " What does he mean?", " We chased them into a Coriolis storm. Winds at eight hundred kilometers an hour. Nothing survives such a storm. They are dead. It is a certainty.", " Yes, Uncle. And the Fremen?"], "BARON HARKONNEN (O.S.)": [" Rabban."], "BARON HARKONNEN": [" Very good.", " When a gift is not a gift?", " What is the Emperor’s message?", " With his Sardaukar army.", " House Harkonnen would never dream of violating the sanctity of your Order. You have my word. We will not harm them.", " No Atreides will live.", " I said I would not harm them. So I shall not. But Arrakis is Arrakis. The desert takes the weak.", " You have a good kitchen, cousin.", " The Traitor! What do you want?", " The bargain to the letter! And what was I to do for you?", " Ah. Yes.", " What did you say?", " So?", " So it’s done. At last.", " The Fremen? Kill them all."], "RABBAN (CONT'D)": [" How can the Emperor give everything we’ve built to that Duke?"], "PITER": [" Don’t be too sure it’s an act of love.", " If the Duke’s son lives --", " My lord, you gave your word to the Witch. And she sees too much.", " The Atreides legions are the finest in the Imperium. Trained by Gurney Halleck and Duncan Idaho.", " Just so. Three battalions. As agreed.", " Milord Baron. Doctor Yueh."], "BARON HARKONNEN (CONT'D)": [" To break a virtuous man, give him a burden too heavy to bear. A lesser man would drop it: but a good man will carry it ‘til it crushes him.", " My desert. My Arrakis. My Dune.", " I said that I would set her free. That you could join her.", " So join her.", " What’s next?", " For centuries we traded blood for blood. But no more. Your son is dead. Your concubine is dead. Tonight House Atreides falls. Your bloodline ends forever.", " Send word to Giedi Prime to begin selling our spice reserves. Slowly! We don’t want the price to fall. You cannot imagine what it cost me to bring such force to bear here. I want you squeeze, Rabban. Squeeze hard."], "JESSICA (PRE-LAP)": [" Paul. Wake up."], "DOCTOR YUEH": [" Hello, young master. Your mother asked me to check your vitals.", " I am only a doctor of the Suk School. But I know a little of the Bene Gesserit. They say they exist to serve -- but, meaning no disrespect to your lady mother -- they also serve their own designs.", " Go carefully. His heart is strong as ever, my Lady.", " Spice is a psychoactive chemical. You seem to be sensitive to small doses. A liability on Arrakis. You’ll be fine.", " I’m sorry, my Lord. I am. But I’ve made a bargain with the Baron.", " I had no choice. The Harkonnens have my wife. Wanna.", " I jammed their comms and lowered the shields. I delivered the Duke and his family.", " Deliver my Wanna from her agony."], "REVEREND MOTHER MOHIAM": [" Defiance in the eyes. Like his father. Leave us.", " COME HERE.", " Put your right hand in the box.", " Pain.", " An animal caught in a trap will gnaw off its own leg to escape. What will you do?", " Silence!", " Enough!", " No woman-child ever withstood so much. I must’ve wanted you to fail.", " Because you are Jessica’s son. You have more than one birthright, boy. You’ve proven you can rule yourself. Now you must learn to rule others. It’s something none of your ancestors learned.", " He’s losing it.", " We’ll see.", " Tell me about these dreams.", " What did you see?", " Have you dreamt of her before?", " Do you dream things that happen just as you dreamed them?", " Goodbye, young human. I hope you live.", " You chose to train him in the Way, in defiance of our rule. He wields our power: he had to be tested. So much potential, wasted in a male. You were told to bear only daughters! But you in your pride thought you could bring forth the Kwisatz Haderach.", " You’re lucky he didn’t die in that room. If he is the One, he has a long way to go. His Sight is barely awakened. And now he goes into the fire. But our plans are measured in centuries: we have other prospects, if he fails his promise.", " On Arrakis, we have done all we can for you. A path has been laid. Let’s hope he doesn’t squander it.", " Activate the cone of silence.", " He will strengthen your hand.", " It must never be known. As far as the Great Houses are concerned -- what you do, you do alone."], "REVEREND MOTHER MOHIAM (CONT'D)": [" KNEEL.", " Your mother bade you obey me.", " STOP.", " I hold at your neck the gom jabbar. A poison needle. Instant death. This test is simple. Remove your hand from the box, and you die.", " No need to call the guards. Your mother stands outside that door.", " Take your hand from the box, boy, and look at it.", " Pain by nerve induction.", " Like sifting sand through a screen. We sift people. If you were unable to control your impulses, like an animal -- we could not let you live. You inherit too much power.", " Your mother was tested thus, when she was your age.", " Duke Leto Atreides means nothing to our Order, but his wife is under our protection, and by extension, her son. You may not harm them. Allow them the dignity of exile."], "REVEREND MOTHER MOHIAM (V.O.)": [" No one will get past her."], "REVEREND MOTHER MOHIAM (O.S.) (CONT'D)": [" Jessica!"], "STILGAR": [" So. He has come.", " You are Outworlders, come for the spice. You take it, giving nothing in return.", " I ask this: Do not seek our sietches or trespass in our lands. The desert was ours long before you came. Come and dig your spice. But when you have it, go back to this side of the Shield Wall. Leave the desert to the Fremen.", " That is honorable.", " This is the Duke’s son.", " This is the boy I told you about. The chosen one. We can’t touch him.", " Jamis, hold. That was a brave crossing they made in the path of Shai Hulud. He does not speak or act like a weakling. Nor did his father.", " What wealth can you offer beyond the water in your flesh?", " Why didn’t you say you were a weirding woman and a fighter?", " Peace, woman! I judged hastily.", " You will have your own maula pistol, when you’ve earned it.", " Jamis! I have spoken. Be still.", " You may not challenge a Sayyadina.", " Jamis. Don’t do this. The night is fading.", " The boy doesn’t know our rule. There can be no yielding under the amtal rule. Death is the test of it.", " You are one of us now. A life for a life. Come with us to Sietch Tabr. The night is flown: We must travel under the sun."], "SHADOUT MAPES": [" My Lady, the Harkonnens demanded it.", " The Shadout Mapes, my Lady.", " You know the ancient tongues.", " I meant no offense, my Lady!", " The weapon is meant as a gift, if you are truly the One.", " Do you know its meaning?", " A Maker of the Deep Desert! Sayyadina! When one has lived with prophecy for so long, the moment of revelation is a shock. Sayyadina. Lisan al-Gaib. The Mother and the Son!", " You are touched by Shai-Hulud."], "SHADOUT MAPES (CONT'D)": [" Do you know this?", " It is yours. Tooth of Shai-hulud.", " The vision is a gift. Don’t be afraid to see."], "RESIDENCY GARDENER (O.C.)": [" You shouldn’t be outside at this hour of the day."], "RESIDENCY GARDENER": [" Pilgrims. They don’t care about heat strokes.", " These aren’t indigenous. Imported a long time ago. They can’t survive without me! Each one of these drinks every day the equivalent of five men. Twenty palm trees. A hundred lives.", " No! These are sacred. Old dream."], "REVEREND MOTHER MOHIAM (O.C.)": [" The thing must go.", " GET OUT."], "PITER (O.C.)": [" You can speak without fear. Our pet doesn’t understand your language."], "REVEREND MOTHER MOHIAM.": [" It understands."], "GURNEY (O.S.)": [" They say: everybody here is addicted to it."], "GURNEY (O.S.) (CONT'D)": [" They say: it’s everywhere. In the food. In the air."], "HAWAT (CONT'D)": [" The Harkonnens took ten billion Solaris out of here every year.", " Harkonnen sabotage slows us down."], "IDAHO (CONT'D)": [" Treat them well. These are friends.", " And there are hundreds of sietches.", " Sire. Milord Duke."], "IDAHO": [" I swear you’re taller.", " I have so much to tell you.", " For four weeks I lived with the Fremen, in a community called a sietch. Hidden in the desert. Stilgar, the leader of that sietch, has come with me to meet you, Sire.", " Underground. Arrakis is full of caverns.", " I’d say ten thousand people.", " The Fremen watched me search for them for days. I never saw them. Finally they sent a warrior out to kill me. I’ll tell you, I’ve never been so close to dying. There are no finer fighters in the Imperium. They fight like demons.", " Thank you, milord.", " A crysknife. Sacred to his people.", " HOLD! Thank you, Stilgar, for the gift of your body’s moisture. We accept it in the spirit in which it is given.", " This is for you. A paracompass. The moons here have magnetic fields, so a simple compass needle won’t point north. It takes a clever piece of clockwork to sort it out.", " And stillsuits, and sand compactors ...all kinds of ingenious things.", " That’s a sand compactor.", " I do. They’re fierce, but loyal. Attuned to the desert. Part of it. It’s part of them. Wait ‘til you see. It’s beautiful out there.", " Kynes!", " Will you tell the Great Houses of the Landsraad how we were betrayed? How the best of them was murdered here?", " The Emperor sent us here to die.", " Paul. I’m so sorry. Your father...", " She’s found us a place to hide. And friends to watch over us.", " I listened on the combat channels. Gurney gave ‘em hell at Arrakeen Landing, but lost the day. They must have landed ten legions. Hundreds of ships. There were Sardaukar with them. At least two battalions.", " You cross swords with a Sardaukar, you know it."], "SPECIALIST (O.S.)": [" Sire!"], "SPECIALIST (CONT'D)": [" He has a knife he won’t surrender, Sire. He won’t let us inspect it."], "STILGAR (CONT'D)": [" That is all I have to say to you.", " The boy is young. He can learn. Liet favors him. He may have sanctuary. But the woman is untrained and too old to learn our ways.", " Back, you dogs! She’ll cut my throat!", " Chani. Take charge of the newcomers. See that they are safe on the journey.", " Is he toying with him?"], "KYNES": [" My Lord Duke. Welcome to Arrakis.", " They are of Fremen make. The best. With your permission, Sire, I must check the integrity of your suits.", " A stillsuit is a high-efficiency filtration system. It cools the body, and recycles the water lost to sweat and other bodily fluids. Without one of these you wouldn’t survive two hours, even in the morning. Your body’s movements provide the power.", " Your desert boots are fitted slip- fashion at the ankles. Who taught you to do that?", " I am accepted in both sietch and village. But I remain an out- worlder in the Emperor’s service. Now. Come and see the spice sands on which your livelihood depends.", " You wouldn’t want to go down out there. It’s worm territory.", " That’s one of your harvesters.", " A sand wave moving toward the crawler. Worms travel deep but get closer to the surface when they attack. If you are patient, we should see one.", " Always. They’re drawn by rhythmic noises.", " A shield’s a death sentence in the desert. They attract the worms and drive them into a killing frenzy.", " A big one. You have good eyes.", " Unlisted flight, Imperium business. Wormsign north and east of you three point seven kilometers.", " They’ll call the carryall to lift the crawler. They’ll harvest right up to the last minute.", " Short of atomics? No.", " Crew of twenty-one.", " Contact in two minutes.", " Bless the Maker and His Water. Bless the coming and going of Him. May His passage cleanse the world and keep the world for His people.", " All I can report is what I saw. That carryall was not sabotaged, just old. The desert isn’t kind to equipment.", " I’m not here to take your part. Arrakis has seen men like you come and go.", " It’s not safe for you here.", " I am commanded to say nothing. To see nothing.", " God created Arrakis to test the faithful.", " People I trust.", " My title is hollow. The Emperor forbids me to say anything at all.", " We have to get inside. There’s a storm coming.", " Tanat, will you find stillsuits to fit our visitors? Shamir, coffee service, please.", " Do you know what this place is? It’s an old Ecological Testing Station. They were meant to tame the planet. Free the water locked beneath the sands. Arrakis could be a paradise. The work had begun. But then we discovered the spice! And suddenly no one wanted the desert to go away.", " Thank you, Tanat.", " If they believed me...there would be general warfare between the Great Houses and the Emperor.", " You’d make a play for the throne? You’re a lost boy, hiding in a hole in the ground.", " Superstition.", " Come!", " Follow the arrows. You’ll find a desert-rigged thopter ready to fly. That storm out there’s your best shot. Above five thousand meters, they’re mostly dust. Climb into it. Stay on top. You might just live.", " It only seats two. I’ll get to the next station and report this attack to the Landsraad.", " I’m Fremen. The desert’s my home.", " Good luck!", " I serve only one master. His name is Shai-Hulud!"], "KYNES (CONT'D)": [" In the open desert you wear these nose plugs and this filter across your face. In good working order, your suit won’t lose more than a thimbleful of water a day.", " Let’s have a look at you, lad.", " You’ve worn a stillsuit before?", " A rich spice bed, by the color. If you get a little higher you’ll have a better view.", " There, you see the spotter aircraft, looking for wormsign.", " Calling crawler Delta Ajax niner. Wormsign warning! Acknowledge.", " There."], "CRAWLER RADIOMAN (V.O.)": [" Who calls Delta Ajax niner? Over.", " Copy, Spotter One.", " Copy. Delta Ajax niner crew, be ready for docking.", " Alpha Zero. We’re waiting.", " You’re out of your mind! We’re not going out there! All call. All call. Any carryall in the sector please respond."], "SPOTTER ONE PILOT (V.O.)": [" Delta Ajax niner, this is Spotter One. Wormsign confirmed. Stand by for contact fix. Worm is on intercept course your position, contact in six minutes.", " Contact in four minutes.", " Contact in THREE minutes."], "CARRYALL PILOT": [" Alpha Zero on approach. Prepare for docking.", " Docking sequence initiated. Brace yourself.", " We have an issue with one of the anchors. Stand by.", " Hydraulics are dead. We won’t make it. You’ll need to evacuate."], "CRAWLER RADIOMAN 2 (V.O.)": [" We got a full load of spice! We can’t just leave it!"], "BENE GESSERIT GHOSTS (V.O.)": [" KWISATZ HADERACH! LISAN AL GAIB ! KWISATZ HADERACH! LISAN AL GAIB!"], "SARDAUKAR BASHAR": [" You outnumber the Atreides three to one. Still you come to us.", " We are the Sardaukar. The Emperor’s blades. All who stand against us fall.", " The Emperor commands it. It is done."], "CHANI (SNEERING) (CONT'D)": [" I knew you couldn’t stay the hell away."], "BENE GESSERIT GHOST VOICES": [" HE IS THE ONE! KWISATZ HADERACH! LISAN AL GAIB!"], "LETO (O.S.)": [" Lisan al-Gaib."], "GURNEY (V.O.)": [" Now worlds away, in stranger skies, They call no more, they call no more.", " I remember perfume on a silken veil, Lovers’ arms pale against the dusk...", " Now worlds away, those winsome ladies They call no more, they call no more.", " I remember garrisons of old campaigners, Years washed with weariness and wine... Now worlds away, the wars forgotten...", " They call no more, they call no more."], "DOCTOR YUEH (CONT'D)": [" They take her apart like a doll. I will buy her freedom. And you are the price. But you and I will make another bargain, between us.", " For Paul. I will do what I can.", " And you will kill a man for me.", " I’m going to replace the peg tooth in your mouth.", " If you bite down hard, this tooth will crush.", " Breathe out, and you will fill the air with poison. It will be your last breath. But if you choose your moment well ...it will also be the Baron’s."], "FIRST TROOPER": [" We’ll drop ‘em in the desert. Someplace the worms’ll get ‘em.", " It’s the Duke’s family. We could face a Truthsayer for this. Gotta be able to say we didn’t kill ‘em.", " I never had a highborn. You?", " Highborn enough for me.", " We’re far enough out. Let’s toss the boy."], "SECOND TROOPER": [" Why not just cut their throats?", " Bene Gesserit ain’t all highborn."], "PITER DE VRIES": [" Checkmate, old friend."], "DEAF TROOPER": [" Let’s feed the cub to the worms and give her a long goodbye.", " Don’t talk."], "HARKONNEN GUARD": [" GAS!"], "CHANI’S VISION": [" Paul!"], "SHAMIR": [" Yes, Liet."], "SARDAUKAR ASSASSIN": [" Kynes. You betrayed the Emperor."], "PAUL & JESSICA": [" Fear is the little death that brings total obliteration. I will face my fear..."], "KYNES (V.O.)": [" Above five thousand meters, they’re mostly dust. Climb into it. Stay on top. You might just live."], "VOICE (O.S.)": [" My dear friend."], "JAMIS": [" Deep in your heart you know it’s not you. You are not the One. Don't take that burden on your shoulders. You are free. I’ll show you the ways of the desert. Come with me.", " Why are you waiting? We need their water.", " They are weaklings!", " My thumper saved his life. Come to your senses, Stilgar. He’s not the one.", " I will not have them!", " No. You talk like a leader. But the strongest leads! She bested you. I challenge her! I invoke the amtal!", " Then who will fight in her name?", " Then Al-lat, the Sun, will witness this death. Where is her champion?", " May thy knife chip and shatter!"], "STILGAR (O.S.)": [" Do not run. You will only waste your bodies’ water.", " Hold!"], "FEMEN WOMAN (NAME?)": [" How can he be the Lisan Al Gaïb?"], "FREMEN MAN": [" He hasn’t proven himself."], "CHANI (CONT'D)": [" They say you are the Mahdi. But you look like any boy.", " You chose the hardest way up. Follow me.", " This crysknife was given to me by my great aunt. It’s made out of a tooth of Shai-Hulud. The great sandworm. This will be an honor for you to die holding it."], "JAMIS (CONT'D)": [" I accept her champion!", " You should welcome my blade! This world will kill you. Quicker this way."], "JAMIS (O.S.)": [" Where is the outworlder?!"]}