{"scenarios": ["FADE IN: EXT.  FOREST - DAY", "Germania.  The far reaches of the Roman Empire.", "Winter 180 A.D. Incongruously enough, the first sound we hear", "is a beautiful tenor voice.  Singing.  A boy's voice.", "CREDITS as we hear the haunting song float through dense", "forests.  We finally come to a rough, muddy road slashing", "through the forest.  On the road a GERMAN PEASANT FATHER is", "herding along three sickly looking cows.  His two SONS are", "with him.  His youngest son sits on one of the cows and sings", "a soft, plaintive song.", "They become aware of another sound behind them on the road --", "the creak of wood, the slap of metal on leather.  The Father", "immediately leads his cattle and his sons off the road.  They", "stand-still, eyes down:  the familiar posture of subjugated", "peoples throughout history.", "A wagon train rumbles past them.  Three ornate wagons", "followed by a mounted cohort of fifty heavily-armed", "PRAETORIAN GUARDS.", "The young boy dares to glance up at the passing Romans. His", "eyes burn with hatred.", "INT.  WAGON - DAY", "Mist momentarily obscures a man's face.  Frozen breath. The", "man is in his 20's, imperious and handsome.  He is swathed in", "fur, only his face exposed.  He is COMMODUS.", "He glances up.", "The woman across from him returns his gaze evenly.  She is", "slightly older, beautiful and patrician.  A formidable woman.", "She is LUCILLA.", "A beat.  Their breath turns instantly to mist.", "She arches an eyebrow.", "A beat.", "The wagon rumbles to a halt.  Voices are heard outside.", "Commodus leaps out...", "EXT.  WAGON - OUTPOST - DAY", "Three Roman SOLDIERS guard an outpost, a watchtower, on the", "roadside.", "Commodus tosses off his furs -- beneath them he wears a", "beautiful set of Lorica Segmentata -- the traditional formed", "armor of Rome.  He moves to a horse as:", "He leaps onto the horse and canters back to the Praetorian", "Guard unit.", "Soldier #2 climbs on his horse and leads them.  Commodus", "rides off with most of the Praetorian Guard unit.", "Lucilla peeks her head from the wagon.  She glances at the", "remaining soldiers.  Distinctly unpromising.", "EXT.  HILL - TWILIGHT", "The mighty catapults dwarf the humans.  Soldiers from the", "elite Felix Regiment -- a legion of the Roman Army -- haul", "the monstrous machines up a hill.", "The commanding General of the Felix Regiment, MAXIMUS, walks", "between two of the catapults.  He is a striking and intense", "man in his 30's.  Like all the soldiers who surround him, he", "is caked with mud and exhausted.", "He trudges up the hill with his two lieutenants, TITUS and", "QUINTUS.", "They have reached the top of the hill.  Stunning martial", "preparations are underway.  The catapults join ten others.", "Archers are taking up position.  Brutal \"Scorpions\" --", "devices for firing multiple crossbow bolts -- are being", "loaded.  Soldiers are also loading the catapults with", "enormous \"Greek fire pots\" -- large, round terra cotta pots.", "Maximus and his lieutenants gaze down from the hilltop. Below", "them they can see a German encampment.", "A beat as Maximus gazes down at the German position.", "A beat.", "A beat as he gazes down at the enemy.", "EXT.  TREES - TWILIGHT", "Maximus and Titus are on their horses, the cavalry of two", "hundred Felix Regiment warriors surrounds them.  Steam flares", "from their horses' nostrils.  They wait in a thick stand of", "trees -- the German position can be seen across a muddy", "plain.", "A large wolf -- \"The Wolf of Rome\" -- waits at Maximus' side.", "Maximus nods to an archer.  The archer lights the tip of an", "arrow and sends it flaming into the night sky.", "EXT.  HILLTOP - TWILIGHT", "Quintus waits.  The catapults are loaded and waiting.  So too", "the Scorpions.  So too the 200 archers of the Felix Regiment.", "He sees the flaming arrow flying up from below.", "The mighty catapults are released.  The Greek fire pots arc", "dramatically through the air.  A moment later soldiers", "release the Scorpions and hundreds of bolts streak through", "the sky.  The archers fire a murderous barrage of flaming", "arrows.", "EXT.  TREES - TWILIGHT", "The screaming is almost immediate.", "Maximus and his cavalry watch as the fire pots crash down", "into the German encampment.", "EXT.  GERMAN CAMP - TWILIGHT", "The fire pots shatter -- pitch splashes everywhere -- seconds", "later the bolts and flaming arrows slice down and ignite the", "pitch -- FLAME EXPLODES -- it is a hellish, napalm-like", "vision -- the conflagration illuminating the twilight.", "The deadly rain of flaming arrows spreads terror through the", "German camp --", "EXT.  TREES - TWILIGHT", "Maximus watches the German camp.", "He can see the nightmare destruction of the encampment", "continuing -- fire pots and Scorpion bolts and flaming arrows", "-- panic in the German encampment.", "He sees the Germans begin fleeing across the plain.  He", "quickly raises his sword and whispers a prayer, then turns to", "his men:", "He spurs his horse and races out of the trees to the plain...", "EXT.  PLAIN - BATTLEGROUND - TWILIGHT", "Maximus leads the terrifying and relentless cavalry charge --", "Titus at his side -- the Felix Regiment screams out fearsome", "war cries as they gallop across the muddy plain toward the", "Germans --", "Fire pots and flaming arrows are crashing down everywhere", "around them --", "The cavalry SLAMS into the Germans at full gallop --", "It is carnage.", "The Felix Regiment warriors slash ruthlessly with short", "swords -- slicing a path of sheer destruction through the", "Germans -- but the Germans fight with equal brutality -- and", "the Germans also fight with the desperation of a hopeless", "last chance -- they pull and spear Roman soldiers off horses", "whenever they can --", "Maximus spins his horse and swings his sword with expert", "efficiency -- a spear stabs through the neck of his horse and", "it immediately collapses forward --", "Maximus sails over the horse's head and crashes to the muddy", "ground -- he jumps up and is in the midst of the battle --", "The flaming arrows and exploding fire pots create a ferocious", "inferno everywhere around the battle -- the flames", "silhouetting the fighting --", "On the ground, Maximus proves his absolute worth as a warrior", "-- he hacks and dodges -- ghastly images of true ancient", "warfare -- Maximus' eyes burn with a zealous fire as he", "fights for his life --", "He finds he is momentarily at a terrible disadvantage --", "Germans are surrounding him from all sides -- as he fights he", "looks for an advantage -- for his soldiers -- for anything --", "he is doomed --", "Then -- an almost mystical image -- Maximus' wolf leaps", "through a wall of flame --", "\"The Wolf of Rome\" savages several Germans around Maximus --", "giving him the help he needed.", "The wolf and his master fight, side-by-side.", "EXT.  HILLTOP - TWILIGHT", "We see an old man's face, staring down at the battle.  The", "face is weather-beaten, ailing.  The roaring flames from the", "battlefield below flicker in his sad eyes.", "MARCUS AURELIUS, the Emperor of Rome, is on a horse.  A metal", "brace extends from the back of his saddle.  He is strapped to", "the brace with thick, leather straps.", "He watches as the Felix Regiment below concludes the battle.", "The cheering of the Regiment can be heard as the final,", "isolated pockets of Germans are cut down.", "Behind Marcus the sun is setting, painting the world blood", "red.", "EXT.  BATTLEFIELD - SUNSET", "Maximus, bloody and spent, walks through the aftermath of the", "carnage.  The Wolf of Rome is at his side.  Dead and dying by", "the hundreds are scattered everywhere.  Roman surgeons are", "attending to the wounded.", "Marcus walks to him, embraces him warmly.", "Marcus takes Maximus' arm and they walk through the masses of", "bodies.  Maximus holds Marcus' arm firmly, quietly supporting", "him as they walk.", "Suddenly, a tethered GERMAN PRISONER they are passing calls", "out to them:", "Maximus and Marcus stop.  A soldier moves quickly to silence", "the German Prisoner.", "The soldier moves to kill the insolent Prisoner.", "The soldier leads the German Prisoner away.", "Maximus and Marcus continue walking in silence for a beat.", "Then:", "They continue walking through the mountains of bodies...", "EXT.  ROAD - SUNSET", "Maximus and Marcus are now walking along a road through the", "dense forest.  Slaves follow behind them, leading their", "horses.", "Both sides of the road are filled with the men of the Felix", "Regiment.  As Maximus and Marcus pass, the battered and", "bloody soldiers drag themselves to their feet, raising their", "swords, paying silent homage.", "Just then Commodus canters into view with his Praetorian", "Guard escort.  He watches the army honor Maximus with rank", "envy as he nears.", "He rides up to Maximus and Marcus.", "He leaps from his horse.", "Commodus embraces him, awkward.", "Commodus embraces Maximus, even more awkward.", "They walk, Maximus still supporting Marcus, as:", "Maximus laughs.", "Maximus waves for Marcus' horse.  It is brought up. Several", "soldiers carefully help the old man into the saddle.  He is", "then tethered to the brace on his saddle. It is a slow,", "graceful and embarrassing ordeal for the Emperor of Rome.", "When at last he is strapped in, he looks to Maximus.", "Without a word to his son, Marcus nods and the horse is", "slowly lead away.", "Commodus and Maximus watch him go.", "A beat.", "He turns and stalks away.", "EXT.  TENT CITY - NIGHT", "We see the Roman encampment, a sea of tents.  Hundreds of", "campfires burn before the tents.", "INT.  HOSPITAL TENT - NIGHT", "Maximus enters a large tent and is met by a spectacle of the", "dead and dying.  Roman surgeons are working feverishly to", "save lives.  Limbs are amputated, the bloody stumps quickly", "cauterized with hot irons.  Leeches and bronze cups are", "employed for blood-letting to balance \"humours.\"", "Anesthesia as we know it is nonexistent.  Wine amphoras are", "passed around and orderlies fan narcotic smoke toward the", "patients.  Mostly, though, they just hold down the writhing", "patients.", "Maximus moves through the tent, offering a word of comfort", "here and there.  All the wounded are delighted to see him.", "He goes to an older soldier, GALLUS, who has one wooden hand.", "His other hand is bandaged.", "Maximus smiles and moves on.", "He stops at a young soldier, VALERIUS, whose head has been", "shaved.  A hole has been bored into his skull to relieve the", "pressure on his brain.  The young soldier is dying.", "A beat.  Maximus sits by his cot.  He takes Valerius' hand.", "A beat.", "He smiles.  And he is dead.", "Maximus sits for a moment.  He gently closes Valerius' eyes.", "And Maximus finds that he is weeping.", "He is not ashamed of the tears.", "INT.  MESS TENT - NIGHT", "An immediate swirl of noise.  The grand mess tent is crowded", "with soldiers.  They are still filthy with caked- on mud and", "blood.  Wounds are bandaged and tankards are raised in", "celebration of the victory.", "Marcus sits in a central position and receives visitors.", "Currently two Senators, FALCO and GAIUS, are bowing before", "him.", "Meanwhile, Maximus stands with his lieutenants, Titus and", "Quintus.  A wound on Maximus' arm has been bound.", "Commodus perambulates up to them.", "An awkward glance between the soldiers.  This sort of talk is", "offensively premature.", "Senators Gaius and Falco join them.", "Laughter.", "Meanwhile, a dark eye is studying the men through a hidden", "slit in the tent wall.  The eye is particularly drawn to", "Maximus.", "A beat.  Commodus' eyes flash fire at this public rebuke. He", "very quickly gets control.", "He notes his father being helped out of the tent by several", "body slaves.", "INT.  TENT CORRIDOR - NIGHT", "Marcus is helped out of the mess tent into a tent corridor", "attached.", "He sees his daughter Lucilla in the corridor, spying in", "through the slit in the tent wall.  He watches her, smiles.", "She turns to him.  He leaves his body slaves and goes to her.", "A beat.  They stare at each other.  He finally smiles.", "She smiles and takes his arm.  They slowly walk down the tent", "corridor as:", "They disappear into darkness.", "EXT.  TENT CITY - DAWN", "Maximus is slogging through the mud and snow that blankets", "the Rome camp.  He stops to observe an unusual sight.", "Commodus is stripped almost naked, his chiseled body covered", "in a fine sheen of sweat.  He and his six CENTURION BODY", "GUARDS are going through their daily ritual.  They defy the", "sub-zero temperatures and hack at small trees with swords.", "It is an eerie, zen-like workout.  Commodus' intense", "concentration is unnerving.", "Maximus watches for a moment then moves on.  He approaches a", "large network of tents.  He enters.", "INT.  MARCUS' TENT - DAY", "Maximus enters Marcus' darkened tent.  Flickering braziers", "provide the only light in the enormous Imperial tent. Heavy", "beams support the canopy and they creak like the timbers of a", "ship as the tent sways slightly in the wind. Marcus stands", "before a map of the Roman Empire.", "Marcus holds out a scroll.", "A stunned pause.  Maximus stares at him.", "A long beat.", "A beat.", "Marcus sits.  He doesn't look at Maximus.", "A pause.", "A beat.", "He holds out a hand to Maximus.  Maximus takes his hand,", "deeply moved, kneeling.", "A beat.", "A beat.", "Maximus looks at him.", "A beat.", "Maximus nods and rises.  He begins to go.  Stops.", "He goes.", "INT.  TENT CORRIDOR - DAY", "Maximus emerges from Marcus' tent into a long tent corridor,", "deep in thought.", "He turns.  Lucilla is waiting.  She glides to him.", "He turns to her.", "He turns and walks.  She walks with him.", "A beat.", "A beat.", "A beat.", "She smiles sadly.", "A moment between them.  We sense there is much to be said,", "much that could be said.", "Finally:", "He goes.  She watches him walk away.", "INT.  MAXIMUS' TENT - NIGHT", "Maximus kneels before a small altar in his tent.  He faces", "six small figures that represent his dead ancestors.", "He looks at his \"ancestors\" for a moment and then blows out", "the candles around them.", "INT.  MARCUS' TENT - NIGHT", "Commodus' eyes are red with weeping.  He sits, head down, at", "the foot of Marcus' bed and speaks to his father.", "He stands.  We see that he is holding the scroll denoting", "Marcus' intention to nominate Maximus as Emperor to the", "Senate.  Commodus cannot control his tears.", "Commodus weeps.", "INT.  MAXIMUS' TENT - NIGHT", "Quintus is waking Maximus --", "Maximus leaps up and throws on a cloak, strides out with", "Quintus...", "EXT.  TENT CITY - NIGHT", "Dead of night.  Maximus and Quintus stride quickly through", "the sleeping camp toward Marcus' tent.", "They continue on toward Marcus' tent.", "INT.  MARCUS' TENT - NIGHT", "Maximus and Quintus stride into the tent -- Maximus slams to", "a halt.  Stunned.", "Commodus stands before him.  Lucilla stands in a corner of", "the tent, head down.", "And Marcus Aurelius dead, lying on his bed.", "Maximus stares at Marcus.", "Maximus, not even hearing, steps past him to Marcus.", "He stands for a moment and then slowly kneels before Marcus", "and gently kisses the old man's forehead.  A ritual farewell.", "A moment of silent mourning and then Maximus stands.  He", "turns very, very slowly to Commodus.", "Maximus glares at him:", "Commodus does not respond.", "Maximus glances to Lucilla, she avoids his eyes.", "A beat.", "Maximus turns back to Marcus.", "Without a glance to Commodus, he stalks out.", "A silent beat.  Then Commodus nods to Quintus.  Quintus goes.", "Lucilla looks at Commodus for a long moment, her face an", "enigmatic tornado of complex emotions.", "Then:", "INT.  MAXIMUS' TENT - NIGHT", "Maximus is kneeling before his ancestors, head down, his", "fists clenched, praying.", "Quintus and four Praetorian ASSASSINS suddenly burst in --", "the assassins move immediately to bind Maximus -- swords at", "his throat --", "Quintus goes to Maximus' armor, which hangs nearby, and", "slowly removes his seal of office.", "They pull Maximus out --", "EXT.  MAXIMUS' TENT - TENT CITY - NIGHT", "Five horses are waiting.", "They are almost run over by a stern cohort of twenty", "Praetorians who gallop past.  Maximus knows immediately what", "this means.", "A beat.", "Maximus lunges at him -- the Praetorians subdue him --", "slamming him with a sword hilt -- knocking him unconscious.", "EXT.  FOREST ROAD - DAWN", "The four Praetorian assassins lead Maximus along a road. He", "sits slumped in his saddle, drained.", "The three other assassins climb from their horses. Assassin", "#2 pushes Maximus from his horse.  He falls to the ground", "hard.", "Assassin #3 and Assassin #4 drag Maximus down a densely", "forested hill along the road.  Maximus' hands are still bound", "in front of him.  He seems totally lacking in any resistance.", "EXT.  FOREST - BELOW THE ROAD - DAWN", "Maximus eyes the two assassins as they troop down the hill", "away from the road, he notes their sparkling armor. The armor", "of men who have never seen real battle.", "They stop.  They are far down the hill, out of sight of the", "road.", "Maximus kneels, his whole body secretly coiling.  Assassin #3", "stands over him as:", "Maximus points his bound hands at a spot on the back of his", "neck.", "Assassin #3 dutifully puts the point of his sword on the spot", "on Maximus' neck.", "A grave mistake.", "Maximus instantly grabs the blade of the sword with his hands", "and yanks it from Assassin #3 -- EXPLODING up -- his hands", "are bleeding but he tosses the sword into the air and catches", "it -- swings the sword with brutal efficiency -- decapitating", "both assassins --", "EXT.  FOREST ROAD - DAWN", "On the road above, the other two Assassins are on their", "horses, waiting.", "They hear a quick yelp from below.  And then nothing.", "Assassin #1 nods for Assassin #2 to check on the execution.", "Assassin #2 canters off the road and down the hill...", "EXT.  FOREST - BELOW THE ROAD - DAWN", "Assassin #2 canters down the hillside.", "He senses movement behind him -- spins around, drawing his", "sword -- too late --", "Maximus throws a sword -- it flashes through the air -- and", "into Assassin #2.", "EXT.  FOREST ROAD - DAWN", "Assassin #1 waits on his horse.  He hears the commotion below", "-- spins his horse around just as Maximus bursts to the road.", "He stands with a sword.", "Assassin #1 spurs his horse and gallops toward Maximus at", "full speed -- Maximus crouches and prepares --", "Assassin #1 and Maximus swirl together for an instant -- both", "slashing brutally --", "Assassin #1 continues to gallop past Maximus.  He stops. He", "looks down.  A wound in his stomach.  He falls off his horse.", "Dead.", "Maximus has also been wounded -- a deep gash on his side. He", "fights the pain as he moves toward the horses...", "EXT.  FOREST ROAD - DAY", "Maximus is galloping through the forest at lightning speed,", "leading four horses behind him.  The gash in his side", "bleeding.", "EXT.  TENT CITY - DAY", "A gloomy day.  Emperor Commodus stands before the assembled", "Felix Regiment. The soldiers are already uneasy.  They note", "Quintus standing by Commodus, wearing Maximus' seal of", "office. Where is Maximus?", "Titus glances quickly to Gallus, whose hand is bandaged from", "surgery.  They know this cannot be true.", "The Felix Regiment responds, many unsure.", "Commodus strides off and the Felix Regiment slowly disbands,", "muttering to one another in confusion. Titus and Gallus go to", "Quintus.", "He stalks off.  Titus and Gallus, concerned, watch him follow", "after Commodus.", "INT.  MAXIMUS' TENT - DAY", "Lucilla stands in Maximus' tent.  She looks around.  She", "gently touches his Lorica Segmentata.  Her fingertips move", "along the contours of his armor.  She tries to retain her", "neutral demeanor.", "She notes his \"ancestors\" on the small alter.", "EXT.  HILLSIDE - NIGHT", "Maximus continues to gallop, he is on a different horse. He", "leads only two horses now.", "EXT.  VINEYARD - DAY", "Maximus' home in Spain is beautiful beyond measure.", "We see verdant farmlands and vineyards and a spacious house", "nestled amid gently rolling hills.", "Maximus' eight-year-old SON is in a paddock playing with his", "pony.  He stops, sees something.  Over a hill, he can just", "glimpse a battle flag, approaching.", "He screams with joy and runs toward the flag as he calls:", "Maximus' WIFE emerges from the house, drying her hands on a", "cloth and smiles.", "Maximus' Son races toward the flag.  He can just see the", "soldiers beginning to appear over the hill.", "Not a Roman Legion at all.  Twenty Praetorians canter over", "the hill. Maximus' Son stops, confused.", "EXT.  OLIVE GROVE - DAY", "Maximus is galloping up a hill, leading only one horse now.", "The horse he is on is exhausted, spent, foam coats its neck.", "It can't make it.", "The horse collapses and Maximus falls.  He immediately leaps", "onto the remaining horse and continues riding up the hill.", "EXT.  HILLS AROUND VINEYARD - SUNSET", "Maximus is racing over the countryside, galloping in a", "frenzy.  His wound is bleeding profusely, coating the side of", "his horse.", "He rears the horse to a stop for a moment.  Over a hill he", "can see thick black smoke rising.  He spurs the horse and", "gallops over the hill...", "EXT.  VINEYARD - SUNSET", "And his worst nightmares are realized.", "His home and his vineyards have been destroyed.  The earth", "has been scorched and his house is still smoldering.  He", "rides up to the house and practically falls off the horse.", "He pulls himself up and walks past the smoldering debris of", "his house, fearing what he knows he will find.", "He sees the bodies of servants scattered about in the ruins.", "He sees a Praetorian battle flag.", "He continues on, his wound bleeding more with every tortured", "step.  He finally stops.  He stares up.", "His wife and his son have been crucified and burnt.  They are", "nothing more than grotesquely twisted, charred shapes.", "Maximus instantly collapses to his knees -- he howls out his", "torment in a heartrending keen of despair as he coats his", "face in the ashes of his dead world.  He sinks into", "unconsciousness, praying for death.", "EXT.  VINEYARD - DAY", "An unusual jingling sound is heard.  Maximus appears to be", "dead, his gaping wound beginning to fester.", "The source of the jingling becomes clear when we see the feet", "of Bedouin brigands, with delicate anklets, shuffling around", "him.  A hand touches his sandals.  Rich sandals. Another", "touches his tunic.  Good cloth.", "Suddenly Maximus groans.  The hands stop.  He's alive.  A bit", "of quick language in an unknown tongue.", "Then the hands grab Maximus and drag him away.", "EXT.  SLAVE WAGON TRAIN - DAY", "Maximus' eyes slowly open --", "Inches away from his face -- a lion roars --", "He looks around to realize he is in a filthy slave wagon.", "Three other wagons slowly move over the desert landscape.", "Exotic animals are caged in pens or led alongside the wagons:", "lions, panthers, zebras, a giraffe.  A dozen slaves are", "chained together alongside sacks of spices and other cargo.", "Bedouin slave traders jabber in a surreal babel of foreign", "tongues.", "And someone is looking at him.  JUBA, a striking African, is", "gazing at him impassively as he chews something.  Juba is", "also chained.", "Juba spits what he has been chewing into his hands and moves", "to Maximus.", "Maximus looks down -- the bloody wound at his side.", "Juba carefully places his poultice over the wound -- Maximus", "hisses in pain -- Juba massages the poultice into the wound", "gently as:", "Maximus stares at him.  Juba looks down at him with the", "barest hint of a smile.", "EXT.  SLAVE MARKET - DAY", "The heat of Morocco is unlike anything Maximus has ever", "known.  Shimmering heat waves undulate over the sand.", "The provincial market is bustling like the proverbial", "anthill.  Slave traders and dealers and merchants move", "around, all talking very quickly and very emphatically.", "poked and prodded and fondled.  Their BEDOUIN SLAVE TRADER", "sings out their praises to any passers.", "The crowd parts almost magically for the dramatic arrival of", "PROXIMO.  Proximo is a large man of immense appetites. He has", "the ferocious appearance of a true pirate.  Two slaves follow", "behind him and impotently swat at flies with switches.", "Proximo SLAMS a fist into the Slave Trader's face.  The Slave", "Trader sails back.", "The Slave Trader pulls himself up, hugely obsequious.", "Proximo examines the animals.", "Proximo moves to Maximus.  The Slave Trader forces open", "Maximus' mouth.", "Proximo notes the many old battle scars on Maximus' body.", "Maximus doesn't respond.", "Maximus doesn't respond.", "Proximo looks at Maximus, notes the many battle scars again.", "The scars, and something he senses in Maximus' eyes, is", "enough for Proximo to consider it.", "The Slave Trader and his colleagues grab Maximus and bustle", "him across the market, unlocking his chains. Maximus has no", "idea what's going on.", "In the center of the market place, a veritable GIANT of a man", "sits on a small stool, a wooden sword in his hand.  He is", "hunched over and chained to the ground by a ten foot chain", "shackled to his ankle.  A think metal helmet is riveted", "around his entire head, only long turfs of hair emerging.", "His dim eyes stare listlessly through a slot in the helmet.", "The Slave Trader puts a wooden sword in Maximus' hand and", "shoves him toward the Giant.  The Giant stands.  He towers", "over Maximus.", "The Giant suddenly swings his sword -- he moves with", "remarkable quickness -- Maximus makes no attempt to block the", "blow -- it sends him flying to the ground.", "Maximus pulls himself up.", "The Giant moves in and hits him again -- Maximus recoils --", "the Giant hits him again -- Maximus falls.", "Maximus pulls himself up.", "The Giant moves in again -- he slams him a few more times --", "Maximus makes no attempt to protect himself -- he falls.", "Maximus pulls himself up. The Giant is about to attack again -", "-", "His colleagues race into the ring and haul the Giant away", "from Maximus.  The Giant quietly sits back on his stool.", "Slave Trader.", "EXT.  PROXIMO'S SCHOOL - DAY", "Maximus and Juba are crammed into a wagon with about ten", "other slaves, including a very scared and reedy SCRIBE. Other", "wagons are filled with exotic animals, including several", "lions.", "The wagons move through a crowded casbah and are taken", "through an imposing set of gates to...", "EXT.  PROXIMO'S SCHOOL - COMPOUND - DAY", "An open compound in Proximo's school.  On one side of the", "compound is a series of cages filled with wild animals of", "every description -- including Proximo's two hapless", "giraffes.", "Proximo's house slaves begin unloading the newly purchased", "exotic animals into cages as Maximus and the new slaves are", "unloaded.  Heavily armed guards supervise everything.", "But Proximo's slaves are having a bit of a problem with one", "of the new lions -- it growls and resists them.", "Without the slightest hesitation, Proximo thunders to the", "lion and grabs it by the mane -- manhandling it into a cage.", "He kicks the lion in the rear as he shoves it into the cage.", "Proximo's provincial school resembles nothing so much as a", "seedy prison.  The fading grandeur of the decaying", "battlements and the sweeping North African architecture only", "slightly mitigate the brutal feel of the place.", "And if Maximus had any doubts as to Proximo's profession --", "all doubts are washed away when he sees the compound.", "Twenty GLADIATORS are working out in the compound -- hacking", "at practice dummies and sparring.  The many heavily armed", "guards oversee everything.  The gladiators stop working out", "as they see the new slaves enter.  They eye their potential", "new opponents warily.", "One huge, glowering gladiator -- VIBIUS -- watches with", "particular interest.  His eye is quickly drawn to the most", "obvious athlete:  Juba.", "The new slaves are herded to the middle of the compound and", "house slaves immediately begin throwing buckets of water on", "them, cleaning them.", "Meanwhile, Proximo shrugs off his cloak.  A slave brings him", "wine as he give his \"welcoming speech\" to the new slaves:", "Slaves now toss thick handfuls of powdered lime on the new", "slaves -- they cough and clench their eyes shut, the lime", "coats and stings their wet bodies.", "Slaves throw more water on the new slaves -- washing off the", "lime.", "He gazes evenly at his new acquisitions.", "He strides off and the guards shove the new gladiators toward", "their cells.", "INT.  PROXIMO'S SCHOOL - MAXIMUS' CELL - NIGHT", "Maximus and Juba share a small, filthy cell.  The cell door", "faces the open compound.  Across the compound they can see", "the much more comfortable cells of the \"star\" gladiators such", "as Vibius.", "They both sit on the floor, leaning against the wall. Juba is", "eating a bowl of food with a wooden spoon. Maximus' bowl and", "spoon are at his side, he has not touched them.", "Maximus does not respond.", "Maximus does not respond.", "A long beat.", "Maximus does not respond.", "A beat.", "Maximus finally looks at him.", "Maximus does not respond.", "EXT.  PROXIMO'S SCHOOL - COMPOUND - NIGHT", "Maximus and Juba are being observed.  Proximo stands in the", "shadows of the compound and watches intently.", "EXT.  SLAVE WAGON - PROVINCIAL STREETS - DAY", "Blood appears to be flowing across an oxen's back.  But the", "blood is too rich, too red.", "The oxen are pulling an open slave wagon through the crowded", "streets of the town.  Hanging above the street is dyed wool", "drying in the sun.  Vermilion and crimson dyes drip down and", "splash across the oxen -- and splash across the gladiators.", "Maximus, Juba, the formidable Vibius are chained in the back", "of the wagon.  Also the frightened Scribe.", "Proximo and a few of his guards drive the wagon.  Proximo has", "an umbrella over him, colored with years of dripping dyes.", "They pass a banner honoring Vibius, the star of Proximo's", "stable.", "Meanwhile, the terrified Scribe is almost weeping, chattering", "nervously to Vibius, chained next to him:", "He suddenly vomits.", "The Scribe begins to weep.", "The crowds in the street jeer at the passing gladiators.", "Occasionally throwing trash at them.  A pack of children run", "alongside the wagon, chanting:", "Maximus watches the children for a moment and then another", "sight draws his attention.  Over some buildings he can see", "vultures circling in the distance.", "EXT.  PROVINCIAL ARENA - DUGOUT - DAY", "In the cramped holding area of the arena, a dugout beneath", "the stands, Maximus and the other gladiators are waiting.", "Proximo walks before them, giving a final \"pep talk.\"  He", "gazes at them evenly, his eyes going from face to face.", "He stops at Maximus.", "Drums are heard from the arena.  Proximo nods to a waiting", "blacksmith.", "The blacksmith begins slamming shackles on the gladiator's", "wrists -- chaining them together in teams of two by a chain", "about four feet long.", "The blacksmith is about to chain Maximus to the Scribe.", "Proximo nods to Vibius, who, for reasons we shall soon see,", "makes no protest to being chained to the whimpering Scribe.", "Proximo watches the blacksmith shackle Maximus and Juba", "together and then strides off.", "EXT.  PROVINCIAL ARENA - DAY", "Proximo sits in a box with several other GLADIATOR TRAINERS.", "They drink wine and eat constantly.  A perpetual chatter of", "wagers and odds and side bets.", "The arena is only sparsely attended this day.", "In the arena:", "Proximo's chained teams enter the arena, five teams. Maximus", "and Juba are chained together.  Some of the small crowd", "cheers for Vibius.  He acknowledges the cheers.  He is", "chained to the weeping Scribe.", "In the box:", "Trainer #1 laughs.", "In the arena:", "From the opposite end of the arena a dozen armored, very", "scary Andabatae thunder into the arena.  Some of the crowd", "cheers.", "battle is on.", "Vibius spins into action -- dragging the weeping Scribe after", "him as he circles opponents and fights -- the Scribe is", "almost instantly killed -- Vibius immediately hacks through", "the Scribe's wrist and frees himself, as Proximo surely", "intended.  Vibius is now free to fight alone, swinging the", "chain as an additional weapon.", "Juba's eyes dart everywhere as he tries to move with Maximus -", "- Maximus neither helps nor hinders -- allowing Juba to pull", "him along --", "Proximo, now that his star Vibius is safe, watched Maximus", "and Juba closely.", "Juba fights well, with a strange elegance, his body flowing", "like liquid -- but he is inexperienced.  He strikes a few", "blows and then tries to move away -- finally he is in trouble", "-- cornered -- a huge Andabata is slicing at him -- it is a", "desperate battle -- Juba is losing -- his sword is slammed", "away -- the Andabata raises his sword for the kill --", "And Maximus strikes.", "With a sudden roar he EXPLODES into action -- he swings past", "Juba and blocks the blow meant for Juba -- then he slashes", "the Andabata -- killing him -- he pulls Juba after him as he", "fights --", "It is a dazzling display of Maximus' skill -- he moves", "through the Andabatae at amazing speed -- spinning around", "Juba and protecting him -- slashing ruthlessly -- pulling", "Juba after him and commanding the battle -- Juba recovers a", "sword and they fight together.", "In the box:", "Proximo watches, smiles.  A gladiator is born.", "EXT.  ROME - WAGON - DAY", "SENATOR GRACCHUS, an imposing, moral and corpulent man in his", "60's, is riding in a luxurious wagon with Senator Gaius.", "And CAPTAIN MARCELLUS, the handsome Head of the Roman City", "Guard.", "Their wagon slowly maneuvers through the crowded streets of", "Rome.  The cosmopolitan bustle of the great urban center is", "everywhere around them.", "Their wagon stops -- hopelessly stuck in a massive traffic", "jam of chariots, wagons and sedan chairs.", "INT.  PALACE - THRONE ROOM - DAY", "Emperor Commodus is standing before a group of male children", "and their tutors in his throne room.", "The throne room is still very much the province of his", "father.  Manuscripts and astronomical charts and papyrus", "scrolls and wax tablets litter the heavy desk.  A large bust", "of Marcus Aurelius is in one corner.", "Lucilla and Senator Falco are present.  So too Senators", "Gracchus and Gaius and Captain Marcellus.", "A well-rehearsed child presents Commodus with a laurel", "wreath.", "The child smiles and moves back to his fellows.", "Commodus actually bows before them, an unimaginable honor.", "The tutors bow in response and herd the children out.", "Commodus moves to the desk, standing over it and gazing at", "Marcus' scrolls as:", "Commodus slowly begins pushing Marcus' papyrus scrolls off", "the desk to the floor, one by one, as:", "As Commodus speaks he moves to the chair behind the desk,", "tries it, doesn't like it, nods to a slave.  The chair is", "whisked away.", "As Commodus speaks he moves to the bust of Marcus, studies", "it, doesn't like it, nods to a slave and the bust is whisked", "away.  Lucilla watches this closely.", "Commodus stops.  Looks at him.  A lethal moment.", "Startled looks between Gracchus, Gaius and Marcellus.", "A beat.", "Gracchus ignores a warning look from Gaius.", "Commodus spins on him so quickly and with such feral violence", "that everyone is shocked --", "He snarls like a great jungle cat and he stalks away. Senator", "Falco quickly follows.", "A dreadful silence.", "Then:", "She sweeps out.", "A beat.", "A beat.", "INT.  PROVINCIAL ARENA - DUGOUT - TUNNELS - DAY", "Maximus is marching relentlessly through the dugout and", "cramped, serpentine trench-like tunnels that lead to the", "arena.", "We don't really see Maximus well in the dark tunnels.", "Proximo scurries to keep up with him -- they brush past", "gladiators who line the walls.  Some are wounded, some are", "being attended to by surgeons, some are shell-shocked, some", "are nervously waiting to go on, whispering prayers.", "We twist and turn in the tunnels with Proximo and Maximus as:", "The roar of the crowd is growing, they are nearing the", "arena...", "Without a word to Proximo, or a moment's hesitation, Maximus", "strides into the arena.", "EXT.  PROVINCIAL ARENA - DAY", "We continue with Maximus as he strides into the roaring", "arena.", "We finally see him in the blazing sunlight -- he wears", "traditional gladiator armor and now has longer hair and a", "beard --", "A battle is already in progress, fighting and dead and dying", "gladiators crowd the arena --", "We stay with Maximus as he wades through his opponents,", "fighting them heroically, slashing through them without", "stopping --", "The large crowd cheers mightily -- chants of \"Spaniard!", "Spaniard!  Spaniard!\"", "We stay with Maximus as he cuts through the four Celts like a", "scythe through wheat and then we dramatically pull up and", "away --", "Taking in the roaring arena and the hero.", "EXT.  PROXIMO'S SCHOOL - COMPOUND - NIGHT", "A large mess area has been set up.  The tables around the", "compound are crowded with gladiators.  Guards everywhere.", "Maximus and Juba enter.  Move to get food.  All conversation", "gradually drains away as the other gladiators watch them.", "Silence.", "Maximus and Juba note the strange silence as they move to a", "large table. Vibius is at the table with a number of other", "gladiators. There are no places for Maximus and Juba.", "Vibius stands and kicks two other gladiators off their bench.", "Maximus and Juba sit.", "Vibius remains standing.  He begins to pound on the table", "with his fist.  Soon all the gladiators are pounding on their", "tables.  It is a cacophonous din honoring Maximus.", "INT.  PROXIMO'S SCHOOL - PROXIMO'S CHAMBER - NIGHT", "Proximo sits on a terrace overlooking his compound, sipping", "wine.  Various gladiators can be seen working out below.", "A guard brings Maximus.  Proximo nods for the guard to leave.", "The plate is filled with honeyed butterflies, their wings", "still moving slightly.", "Maximus shakes his head.  Proximo pops one into his mouth. He", "chews as he looks at Maximus.", "Maximus shakes his head.", "Maximus shakes his head.", "A beat.", "Maximus shakes his head.", "Maximus shakes his head.", "A beat. Proximo studies him.", "A beat.", "A beat.", "Proximo watches Maximus very closely for the following:", "Maximus' eyes suddenly flash to Proximo.  He is transfixed,", "his eyes burning.", "A beat.", "Maximus shakes his head.", "A beat.  Proximo sees that Maximus' mind is racing.", "A beat.", "INT./ EXT.  SLAVE WAGON - OUTSIDE ROME - EVENING", "Maximus is crouched in the back of an enclosed slave wagon", "with Vibius, Juba and a few other gladiators.", "In the distance, Rome.", "INT.  PALACE - COMMODUS' BEDROOM - NIGHT", "Commodus sits on his bed, rubbing his aching head. Lucilla is", "preparing a drink for him, a medicinal tonic.", "Unseen by him, she adds a little special powder to the drink", "from a vial secreted in her robe.", "She goes to him.", "She takes a sip and then hands it to him.", "She sits on the edge of the bed.  He drinks as:", "A beat.  He is sleepy, he lies back on his bed.", "A beat.", "He is asleep.", "She watches him for a moment and then rises.", "She goes.", "INT.  PALACE - HALLWAY - NIGHT", "Lucilla moves down a long corridor in the palace and blows", "out candles as she goes.", "She finally arrives at her own chamber and enters...", "INT.  PALACE - LUCILLA'S CHAMBERS - NIGHT", "Senators Gracchus and Gaius and Captain Marcellus are", "waiting.", "A beat.  She looks at them.", "A long beat.", "A beat as her words sink in.", "A door opens, a voice...", "An eight-year-old boy stands in a doorway, sleepy.  He is", "LUCIUS, Lucilla's son.", "Lucius suddenly notices Senator Gracchus:", "He leaps onto Gracchus -- Gracchus laughs and pulls something", "from his robe.", "Gracchus gives Lucius a beautifully painted toy of a sea", "serpent.", "Lucius runs to a map and stabs his finger at Achaea.  We", "sense this is an old game between them.", "Lucius goes.  Lucilla shuts the door after him.  A moment.", "She turns to the others, a deep anguish in her eyes.", "Gracchus goes to her, holds her.", "INT./ EXT.  ROMAN STREETS - SLAVE WAGON - NIGHT", "Maximus cranes for a sight of the Eternal City through a hole", "in the wooden slats that cover the slave cart.", "He can see only glimpses of Rome as they pass.  But the", "images are not what he expected.  Alongside the undeniable", "glory of the city, the madness and disease Marcus Aurelius", "spoke of are readily apparent.", "heaped with bodies -- he sees getting and spending and", "commerce everywhere -- he sees fascist Praetorian Guard units", "trooping past -- he sees the magnificent architecture of the", "city -- he sees starving children begging from filthy gutters", "-- he sees rich citizens out for a stroll -- he sees a", "swirling combination of sophistication and depravity, of", "civilization and corruption.", "He sits back in the cart, deep in thought.  Vibius looks at", "him.", "EXT.  PROXIMO'S COMPOUND - NIGHT", "The slave wagon pulls up to Proximo's rather grand Roman", "compound.  Guards unlock imposing gates and the wagon drives", "in...", "EXT.  PROXIMO'S COMPOUND - COURTYARD - NIGHT", "Inside the gates is a large courtyard, much like Proximo's", "Moroccan school but much more impressive.  A fountain with an", "enormous statue of the war god Mars is central in the", "courtyard.", "The gladiators climb from the wagon, stretching after the", "long journey.  Vibius leads Maximus and Juba to the statue.", "He wades through the fountain and kisses the toe of Mars.", "Juba steps up and kisses the toe.", "Maximus kisses the toe as well.", "Guards come and lead them to their cells, which line one side", "of the courtyard.", "INT.  PROXIMO'S COMPOUND - CELL - NIGHT", "Later.  Maximus and Juba again share a cell.  It is more", "comfortable than their cell in Morocco, befitting Maximus'", "new status as one of the \"stars.\"  A high, barred window on", "one wall opens to the city.  Another barred window is", "directly over them, twenty feet above.", "Maximus pulls himself up to the side window, he looks out.", "And sees at last... The Colosseum.", "It is a breathtaking sight.  Monolithic Albert Speer-like", "columns of light shine up from the Colosseum.  It seems to", "illuminate the whole city and the heavens above.", "Maximus drops back to the floor.", "A beat.", "A beat.", "A beat.", "A beat.", "A beat.", "A beat.", "Juba looks at him.", "A long beat.", "Juba leans his head back and quietly begins to sing.  A", "haunting lament in his native tongue.", "EXT.  COLOSSEUM - DAY", "A flurry of images from around the Colosseum, the energy", "mounting.  At this point we see practically nothing of the", "inside of the Colosseum:", "Slaves are balancing high above the empty arena.  They are on", "ropes unrolling huge rolls of muslin; sun tarps that provide", "shade below...", "Merchants open stalls in the curved arcade around outside of", "the Colosseum.  They sell everything from food to magic", "elixirs, from toys to aphrodisiacs.  They immediately start", "declaiming and demonstrating the virtues of their products...", "bizarrely-colored hair and elaborate makeup...", "Citizens begin arriving, pushing past the vendors and the", "pickpockets.  We see whole families with picnic lunches...", "Ferocious animals are brought into the Colosseum in barred", "cages...", "In the busy arcade, barbers and blood-letters practice their", "craft alongside exotic alchemists, fire eaters and", "contortionists...", "Richer citizens arrive in sedan chairs and chariots, they", "feign indifference to the hooting mob...", "Mounted City Guard police units try to retain some order...", "Gamblers crowd betting booths and haggle mercilessly...", "Finally, we see Maximus and the other gladiators in a slave", "cart.  Maximus watches everything as the slave cart", "disappears into the Colosseum...", "INT.  COLOSSEUM - ROUTE TO HOLDING CELLS - DAY", "The interior of the Colosseum is a busy world unto itself.", "Maximus and the others are lead by Proximo's guards down a", "long ramp and past countless animal cages.  Gamblers", "circulate everywhere and observe the warriors, angling for", "the best odds and the best matches.", "Maximus and the others are led even deeper into the bowels of", "the Colosseum to a new whole subterranean realm. Numerous", "cells line the walls.  Racks and racks of weaponry and armor.", "And, most striking, everywhere around them is the heavy", "machinery of the spectacles above.  Huge \"elevator\" platforms", "and ramps and pulleys and counterweights are manned by teams", "of sweating slaves.", "INT.  COLOSSEUM - HOLDING CELLS - DAY", "Finally, Proximo's guards lead the gladiators to their", "holding cells.  These cells are right at the edge of the", "arena.  Barred windows offer a sand-level view of the action.", "Maximus immediately goes to a window and looks out.", "He cannot see much of the entire arena, but what he does see", "transfixes him. A band of Christians are huddled together.", "An eerie silence from the Colosseum but for the prayers of", "the Christians.", "Maximus watches them.", "One little girl peels past her mother's arm.  She sees", "Maximus.  She smiles.", "Suddenly a dozen ferocious lions race up a ramp by Maximus --", "they roar into the arena --", "We do not see the carnage.  We watch Maximus' face as we hear", "the sounds of the slaughter.", "And the sound of the roaring crowd.", "Maximus finally cannot watch.  He drops his head.", "INT.  COLOSSEUM - TRAINER'S LAIR - DAY", "Proximo is with a dozen other gladiator trainers and the", "Colosseum's orator and majordomo, CASSIUS.", "They are haggling in an secluded area not far from the arena", "itself.  Huge chalkboards chart the day's matches and wagers", "and odds.", "Colosseum touts continually erase and mark new figures on the", "chalkboards to keep up with the swiftly changing bouts.", "The roar of the lions and the unnerving screams of the", "Christians can clearly be heard.", "Upset roars from some of the trainers.", "The four trainers explode in a flurry of resistance --", "He strides back to the arena.  The touts instantly begin", "making new marks on the boards to represent the mysterious", "\"Carthage Spectacle\" as some of the trainers hurry out.", "Proximo walks with Trainer #4:", "They disappear down a dark corridor, negotiating all the", "while.", "INT.  COLOSSEUM - HOLDING CELLS - DAY", "Maximus, Juba, Vibius and another of Proximo's gladiators are", "being armed.  They all wear mask-like helmets.", "Proximo hurries to them.", "Trumpets begin sounding from the arena.", "The guards quickly bustle the four toward a gate leading to a", "dark tunnel to the arena.", "Short swords are shoved into their hands and the gate rises.", "They are pushed into the dark tunnel leading to the arena.", "The gate closes behind them.", "The four gladiators stand for a moment and then slowly walk", "down the tunnel to...", "EXT.  COLOSSEUM - ARENA - DAY", "At last we see it.", "The mighty Colosseum Arena.", "Nothing we could have possibly imagined could have prepared", "us for the sight of the thousands and thousands of screaming", "spectators, the row after row of cheering faces.", "It is staggering.", "But for Maximus none of this exists.  His full attention is", "focused on one spot alone.  The Imperial Box.", "He can see Commodus and Lucilla sitting in the box.  The box", "is elevated fifteen feet above the arena floor at the top of", "a sheer black marble wall.  A cohort of fifty imposing", "Praetorian Guard Archers surround the box. Commodus' personal", "Body Guard of six Centurions actually stand in the box", "itself, eyes constantly watching like modern Secret Service", "agents.", "Commodus is untouchable.", "Meanwhile, three teams move from different entrances to the", "arena.", "As Cassius orates to the crowd:", "He gestures to the gladiators in the arena.  The crowd", "laughs, jeering the \"barbarians.\"", "The drummers begin pounding out a more insistent, heroic", "beat.", "The crowd EXPLODES in cheers as the huge doors at one end of", "the arena suddenly burst open and ten chariots thunder in --", "Each chariot has a driver and an archer, both dressed in", "theatrical versions of the familiar Roman Lorica Segmentata.", "A chaos of dust -- and the battle is on --", "The chariots zoom around the arena -- the archers keeping up", "a deadly hail of arrows.", "Maximus immediately dives onto a passing chariot and kills", "the charioteer and archer -- he dramatically leaps from the", "front of the chariot to a lead horse and cuts it free.", "And Maximus takes control, we see the General of the Felix", "Regiment gloriously alive again as he barks out orders and", "leads his gladiators in battle.  They follow him faithfully,", "his stern commands unquestioned.", "His strategies and smart, he makes the gladiators work", "together.", "This kind of slaughter could last for hours...", "We see flashes of the endless battle... Maximus races on his", "horse past another chariot, kills the driver, the chariot", "smashes into a wall... the sun sinks lower, the shadows on", "the sand lengthen... areas of the sand are swamps of blood,", "Juba slips, pulls himself up fighting... Maximus uses Vibius", "to create a diversion, two chariots collide... the crowd", "roars... a gladiator is dragged between a chariot and the", "side wall of the arena... the drummers pound out their", "relentless tattoo...", "Finally...", "Maximus is on his horse across from the final chariot.", "We can see that Juba and Vibius and a few other gladiators", "are still alive.  The rest of the arena is polluted with the", "dead and injured. Maximus spurs his horse and gallops toward", "the final chariot -- the charioteer whips his horses and", "zooms toward Maximus --", "The crowd is breathless -- watching the final battle --", "Maximus and the chariot speed toward each other -- like", "Medieval jousters --", "And collide in a flashing explosion of steel -- Maximus sails", "from his horse -- as the charioteer sails from his chariot --", "Maximus lands hard but quickly pulls himself up, he races to", "the final charioteer.  The charioteer is defeated but not", "dead.", "Maximus glances around, all his opponents are defeated.", "He stands over the final charioteer.  Then he simply tosses", "down his sword.", "The crowd is stunned by this strange act of mercy.  But then", "an enormous roar grows from the crowd -- wave after wave of", "adulation for the hero of the day.", "Maximus looks around, taking it all in. Then he turns to the", "Imperial Box. Maximus slowly walks to before the the Imperial", "Box.  The Praetorian Archers immediately raise their bows,", "pointing down at him.", "Maximus glares up at Commodus through his helmet mask.", "Commodus returns his gaze, curious.", "The crowd is intrigued, growing quiet.  What is going on?", "Then Maximus simply turns and begins walking away.", "The Colosseum is suddenly silent.  The Emperor is speaking to", "a gladiator.", "Maximus keeps walking.", "Maximus keeps walking, his fists clenched now.", "Commodus suddenly grabs a spear from a nearby Praetorian and", "hurls it with perfect aim -- the crowd gasps -- the spear", "sails past Maximus -- actually nicking his shoulder -- it", "slices into the sand ahead of Maximus.", "Maximus stops.", "Maximus can hold it no longer.  He spins to Commodus --", "ripping off his helmet mask -- and THUNDERING:", "Commodus eyes shoot wide -- Lucilla bolts up -- Gracchus", "leans forward -- Proximo is stunned -- the crowd is mystified", "--", "The Praetorian Archers tense their bows -- ready to kill the", "defiant slave --", "But something extraordinary stops them.  Almost as one being", "the crowd roars -- they leaps to their feet and thrust their", "thumbs up!  They cheer and stomp their approval of Maximus.", "Commodus looks around at the people of Rome, amazed.", "He finally plasters on a benevolent smile and thrusts his", "thumb up!  The Praetorians lower their bows.", "And the crowd cheers.  Never in the long, long history of the", "Colosseum have they ever seen such a thing.", "Maximus leads his gladiators out of the arena.", "INT.  PALACE - THRONE ROOM - NIGHT", "To our great surprise, Commodus is not raging.  He sits", "quietly on the polished marble floor in front of a model of", "the Colosseum.  He moves model pieces around in the", "Colosseum, planning his festival.", "Lucilla stands, tense.", "Lucilla watches her brother cautiously, expecting the", "explosion.  He carefully moves some model pieces in the", "arena.", "Lucilla is growing more and more unnerved at Commodus'", "unusual serenity.", "A beat.  Commodus laughs.  A beat.", "A beat as he looks at her.", "She does not answer.", "He picks up a model tiger and puts it in the arena.  He looks", "at the model tiger and smiles.", "INT.  PROXIMO'S COMPOUND - CELL - NIGHT", "Maximus silently awaits Commodus' assassins with Juba. They", "hear footsteps outside the cell.  Maximus stands, preparing", "for death.", "The door swings open and they are surprised to see Proximo", "sweeping in with a cloaked woman.  The woman gives Proximo a", "bag of money.", "He beckons to Juba, they go, shutting the door behind them.", "The woman pulls off her cloak, it is Lucilla.", "Maximus glares at her, his muscles tensing.", "Maximus backs up, fighting the urge to strangle her on the", "spot.  He finally bumps into a wall of the cell.", "A long, tense moment.", "She does not look at him.", "She finally looks up at Maximus.", "A beat.  Despite himself, Maximus is moved.", "A beat.", "A beat.  Maximus is surprised at her direct answer.", "A beat.", "She rivets him intensely with her eyes.", "A beat.", "A long beat.  Maximus' cold eyes give away nothing.", "Lucilla turns and starts to go.  She stops, not looking back.", "She then pulls something from her robes and sets it down, a", "little bundle wrapped in cloth.  She sweeps out.  The sound", "of the door being bolted shut on the other side.", "Maximus stands for a moment and then goes to what she has", "left.  He opens the cloth.  Inside are his six \"ancestor\"", "figures.", "He picks up one of the figures.  He looks at it deeply,", "gently feeling along the contours with a finger.", "EXT.  COLOSSEUM - ARENA - DAY", "The Colosseum is again packed.  Commodus, Lucilla and her son", "Lucius are in the Imperial Box.", "It is late in the day and teams of slaves are cleaning the", "arena after a bout.  They haul off carcasses and toss down", "fresh sand.", "Meanwhile, Cassius is orating to the crowd:", "The crowd erupts in paroxysms of joy as TIGER explodes into", "the arena in an ornate chariot.  Tiger is a fierce man in his", "40's, his brutal, scarred face and hugely muscled body a", "testament to his many years in the arena.", "Tiger speeds around the rim of the arena in his chariot,", "raising an arm in triumph.  The crowd roars.", "INT.  COLOSSEUM - HOLDING CELLS - DAY", "Proximo stands with Maximus, who is busy strapping on armor.", "INT.  COLOSSEUM - ARENA - DAY", "Tiger waits.  He stands in the center of the arena.  He has", "only a traditional short sword.  The crowd is breathless with", "anticipation.  As:", "The crowd cheers.  Maximus appears from his gate.  His fans", "have increased in number considerably.  They eagerly crane", "forward and celebrate him.", "Meanwhile, Maximus looks at Tiger.  Only one man with a", "sword?  Maximus approaches, cautious but confident.", "He stops a few feet from Tiger.  They lock eyes, salute each", "other and then turn to the Imperial Box, raising their", "swords.", "The crowd waits eagerly for the immortal words...", "The crowd cheers and Maximus immediately turns and starts", "slashing -- Tiger easily blocks and strikes back --", "The sword play is very fast -- they block and parry and hack", "like lightning -- constantly attacking -- they are perfectly", "matched --", "As he fights Maximus becomes aware of a strange sound over", "the roar of the crowd -- a low rumbling -- then he feels", "something -- a vibration in the ground --", "Suddenly traps doors swing open and four enormous platforms", "rise into view.  On each platform is a snarling Bengal tiger", "restrained by a chain.  Tiger's teams of \"cornermen\" hold the", "chains through a pulley system.  The cornermen are safely", "inside cages.  The platforms stop at ground level.", "The four feroc ious tigers now mark the four corners of the", "battleground.", "Tiger takes advantage of Maximus' momentary confusion and", "assaults brutally -- forcing him back toward one of the", "tigers -- the tiger claws for Maximus -- Maximus just evades", "it claws -- rolls for a new position -- another tiger snaps", "at him --", "Tiger attacks -- Maximus is on the defensive -- fighting off", "Tiger and evading the four snarling beasts --", "And then all four tigers are suddenly closer.  The teams of", "cornermen are letting the chains play out, bit by bit,", "gradually reducing the size of the battle ground.  The crowd", "roars.", "But the fight is hardly fair. Whenever Tiger is near one of", "the tigers the cornermen pull back the tiger slightly -- when", "Maximus is near a tiger they let it out a bit. Maximus and", "Tiger fight -- swirling action -- finally, Maximus has the", "edge -- he circles so that the sun stabs into Tiger's eyes --", "then Maximus lunges forward under Tiger's swinging sword and", "SLAMS into him -- they fall -- a tiger swats at Maximus' face", "-- he jerks his head back -- he shoots out a leg and kicks", "Tiger's sword toward one of the tigers -- it is out of reach -", "- Maximus leaps up and stands over the winded Tiger, sword to", "his throat.", "Tiger is gasping for breath, crushed.", "Then one of Tiger's corners suddenly cheats -- they", "completely release a tiger -- it leaps for Maximus --", "Maximus barely has time to turn -- the tiger crashes into him", "-- its claws slashing into his back, cutting through his", "leather armor -- Maximus shoves an armored forearm into the", "tiger's jaws and stabs with his sword --", "Tiger takes this chance to pull himself up -- one of his", "corners throws him another sword -- the crowd boos --", "Maximus wrestles with the tiger -- spinning it around with", "superhuman effort so it is always between himself and Tiger --", "so that Tiger can't get at him --", "Maximus finally kills the tiger and leaps for Tiger -- he", "quickly disarms him and tosses him to the ground --", "Maximus stands over him -- ready to administer the coup de", "grace.", "All eyes turn to the Emperor.", "Commodus slowly stands and steps to the edge of the Imperial", "Box.  He raises his arm and gives the fatal thumbs down.", "Maximus looks up at him. And then defiantly tosses the sword", "to the ground, refusing to kill Tiger.", "Commodus is stunned.", "The crowd gasps -- a collective intake of breath -- and then", "an enormous roar building.  It cascades around the Colosseum.", "It is a roaring celebration of the unexpected act of mercy.", "And the delicious act of defiance of the Emperor.", "Commodus slowly sits.", "Maximus walks across the arena -- the people stand and cheer", "for him.  Cries of \"Maximus the Merciful\" can be heard.", "It is the birth of a hero.", "INT.  COLOSSEUM - HOLDING CELLS - DAY", "Maximus is resting in his cell after the battle, head down,", "deep in thought.", "Maximus looks up, Lucius is standing at his cell.  Maximus", "has no idea who the boy is -- just another young fan -- but", "Maximus is immediately struck by Lucius' resemblance to his", "own son.", "A beat.", "These simple words strike something deep in Maximus.", "Lucilla appears from the shadows and puts her hands on", "Lucius' shoulders.", "Lucius runs off to his Male ATTENDANT, who leads him away.", "A long beat as Maximus and Lucilla look at each other.", "Finally:", "A drum beat is heard.  It increases throughout the following", "scenes, building momentum like a Roman gallery accelerating", "to ramming speed.", "The conspiracy scenes are enclosed in a montage of scenes in", "and around the arena showing Maximus' growing popularity with", "the People of Rome...", "EXT.  COLOSSEUM - ARENA - DAY", "Maximus is fighting an opponent.", "The drums continue...", "INT.  THE SENATE - DAY", "Lucilla conspires with Senators Gracchus and Gaius and", "Captain Marcellus in a dark corner of the Senate. Whispers.", "A beat.", "A beat.", "A beat.", "A beat.  She glances at him.", "The drums continue...", "EXT.  COLOSSEUM - ARENA - DAY", "Maximus defeats his opponent.  He stands over him.  He does", "not kill him.", "He tosses his sword down and walks away.  The crowd goes", "crazy, roaring their approval of Maximus.", "Senator Falco, sits in the stands and watches with some", "alarm.  He glances around as the crowd exalts Maximus.  He is", "becoming a hero to the people.", "The drums continue...", "INT.  COLOSSEUM - HOLDING CELLS - DAY", "Maximus returns to the holding cells.  Vibius and Juba are", "waiting.", "Maximus goes.  Vibius thinks about it, listening to the", "adulation of the crowd.", "The drums continue...", "INT./ EXT.  SLAVE WAGON - ROMAN STREETS - DAY", "Maximus and the other gladiators are in a slave cart on the", "way from the arena.  A gang of children run alongside the", "cart, cheering and chanting:", "The drums continue...", "INT.  PROXIMO'S COMPOUND - CELL - NIGHT", "Maximus and Juba are with Lucilla and Gracchus.  Lucilla is", "writing on a piece of parchment.", "A beat.", "A beat.", "A beat.", "A long beat.", "A beat.", "The drums continue...", "EXT.  COLOSSEUM - ARENA - DAY", "Vibius defeats an opponent -- he stands over him.  He looks", "around at the crowd.  Then he tosses down his sword and walks", "off.", "The crowd goes mad with pleasure.  Vibius eats it up, raising", "his arms and soaking up the applause.", "Maximus watches from the holding cells.  He smiles.", "The drums continue...", "EXT.  STREET - NIGHT", "Proximo supervises as a huge banner is unfurled.  It covers", "the side of a tall building.", "It shows a dramatic painting of Maximus.", "Proximo supervises happily as torches and braziers are lit to", "illuminate the mammoth banner.", "The drums continue...", "EXT.  COLOSSEUM - ARENA - DAY", "The ending of a group fight -- Proximo's gladiators", "triumphant.", "The crowd waits for the delicious act of defiance.  We note", "many placard and banners honoring \"MAXIMUS THE MERCIFUL.\"", "Maximus, Vibius, Juba and a few other gladiators toss down", "their weapons and walk off, leaving their opponents alive.", "The crowd roars.  They have completely embraced Maximus and", "his fellow gladiators.", "Gracchus, in the stands, laughs.", "The drums finally conclude.", "INT.  PALACE - LUCILLA'S CHAMBER - DAY", "Lucilla is with her HANDMAIDEN.  They sit before a large", "mirror, the Handmaiden perfecting Lucilla's makeup for the", "day.", "One of Commodus' Centurion Body Guards enters, bows.", "Lucilla quickly glances to her Handmaiden in the mirror and", "then braces herself, stands, and quickly leaves with the", "Centurion.", "INT.  PALACE - HALLWAY - DAY", "Lucilla strides quickly, nervously, down the long corridor to", "Commodus' chambers.  She enters...", "INT.  PALACE - COMMODUS' BEDROOM - DAY", "Commodus is wrapped in a sheet, gazing out a window.", "He turns.  She stops.", "He looks as if he has not slept for days.  If a word could", "now sum up his clouded face it is this:  tormented.", "She goes to him, embraces him.  He holds her tightly.", "He moves away from her, slowly moving around the room.", "A beat.  Commodus' strange philosophical bent is unnerving", "Lucilla.", "A beat.  He stands before a bust of Marcus Aurelius.  He", "touches it.", "A beat.", "A beat.", "Commodus continues to slowly move around the room.", "This odd statement hangs in the air for a moment.  Then:", "He stops.  Looks at her.", "Something in her words has struck a chord in him.", "He looks at her.", "EXT.  COLOSSEUM - ARENA - DAY", "Maximus is fighting a thick GIANT of a man.", "A few quick blows and the Giant falls -- like a mighty tree", "he crashes to the sand.", "The arena cheers their hero. Maximus stands over the beaten", "Giant.  The crowd waits for the famous act.", "Maximus salutes the Giant and tosses down his sword, refusing", "to kill.  He walks away.", "The arena explodes in cheers -- a chant of \"Maximus the", "Merciful\" grows to deafening proportions.", "Suddenly the arena is filled with Praetorians -- they block", "Maximus' exit from the arena -- the crowd boos -- horrified --", "The Praetorians surround Maximus.  He is unarmed, but coils", "for the inevitable battle.", "Then the Praetorians part...", "And Commodus walks through them.  He carries something", "wrapped in a rich cloth.  Maximus glares at him. The", "Praetorians move back and the crowd watches eagerly. The", "Emperor and the Gladiator, at last.", "Maximus and Commodus stare at each other.  The crowd cannot", "hear what is said, but strain to observe this incredible", "confrontation.", "Maximus doesn't answer.", "Commodus unwraps the cloth bundle.  Inside is a small wooden", "sword.  He holds it up so the crowd can see.", "A collective gasp.  The wooden sword, prized by all", "gladiators above all else.  Freedom.", "He holds out the wooden sword.  A beat.", "A beat.", "Commodus visibly flinches at that, but still holds the wooden", "sword out.  The crowd is breathless.", "With that, Maximus does the unimaginable.  He simply turns", "his back on the Emperor and walks away.", "And the crowd goes mad.  They cheer the defiant gladiator,", "their champion.", "And, equally, they deride the Emperor.  They mock him by", "holding out food and trash like Commodus is holding out the", "wooden sword.  They laugh and jeer.", "Commodus glances around at his children, lost.", "Then he turns to the Imperial Box.  He sees Lucilla slipping", "out the back of the box.  He watches her go.", "And the crowd continues to jeer.", "EXT.  STREET THEATER - NIGHT", "The crowd laughs riotously as Roman Actors perform a", "typically ribald comedy in a secluded street:", "An outrageously dressed version of Maximus is parading around", "on an outrageously dressed version of Commodus, riding him", "like a donkey and slapping his rear with a wooden sword.  The", "\"Commodus\" actor mews and brays and wails like an infant.", "Captain Marcellus of the City Guard gallops past them, on his", "way out of Rome.", "EXT.  PROXIMO'S COMPOUND - COURTYARD - DAY", "Maximus stands with Juba and Vibius.  He draws a circle in", "the sand with a stick.  He draws a line to the circle.", "Maximus draws a line to the Imperial Box.", "A beat.", "Maximus points to the huge statue of Mars.", "A beat.  Vibius thinks about it.", "INT.  PALACE - LUCILLA'S CHAMBERS - EVENING", "Commodus sweeps in.  Thinks Lucilla is standing there. The", "woman turns, it is Lucilla's Handmaiden.", "Commodus looks at her for a moment.", "And then he slowly walks right to her.  His face an inch away", "from hers.", "INT.  PROXIMO'S COMPOUND - PROXIMO'S CHAMBER - NIGHT", "Proximo sits, considering Maximus.", "A beat.", "A beat.", "Something flashes across Proximo's eyes, something like", "tragedy.", "A pause.", "A beat.", "Proximo suddenly begins to weep rather histrionically --", "Maximus is a bit taken aback -- Proximo dramatically flicks", "tears from his eyes -- and then can't keep the show up -- he", "bursts into laughter.", "Maximus stares at him.", "Maximus can only laugh as well.", "Maximus shakes his head, smiling, and goes.", "Proximo sits for a moment. Then he rises and goes to a heavy", "chest.  He looks at the chest for a moment and then opens it.", "Inside is his old Lorica Segmentata.  He gazes at his armor,", "considering what he once was.  And what he now is.", "INT.  PROXIMO'S COMPOUND - CELL - NIGHT", "Maximus enters.  Lucilla is waiting, extremely tense.", "A pause.", "A beat.", "She leans against a wall.", "A pause.", "A long beat.", "He steps to her.", "A beat.", "A long, difficult beat.  She fights back tears.", "He puts a gentle finger to her lips.", "He holds her closely, tenderly.", "INT.  PALACE - LUCILLA'S CHAMBERS - NIGHT", "Lucilla enters, deep in thought, still drained from her", "meeting with Maximus.", "She suddenly stops.  Frozen.", "Commodus is sitting across the chamber, Lucius at his knee.", "An open scroll on Commodus' lap.", "Lucilla has not moved.", "Lucilla goes to them, sits.", "Lucilla looks as if she is going to be ill.", "Lucius is busy scanning the scroll.  Commodus gently strokes", "his hair, his cold eyes never leaving Lucilla's.", "The bee told him everything. Lucilla's face is tortured.", "INT.  PROXIMO'S COMPOUND - PROXIMO'S CHAMBER - NIGHT", "Proximo is asleep -- a sound outside wakes him -- the steady", "clip-clop of horses on stone.  A lot of horses.", "He rises and goes to a window overlooking the street outside.", "A stern Praetorian Guard cavalry unit is cantering into", "position at his gates.  Proximo grabs his clothes --", "EXT.  PROXIMO'S COMPOUND - NIGHT", "With cool military precision the Praetorians take up position", "at the gates before Proximo's compound, an unassailable line.", "They quickly prepare their bows.", "Meanwhile, another Praetorian unit has taken up position at", "the other end of Proximo's compound -- sealing that entrance", "as well.", "EXT.  PROXIMO'S COMPOUND - COURTYARD - NIGHT", "Proximo is hurrying across his open courtyard when the first", "flaming arrow arches into the compound -- it is followed by", "hundreds more --", "The Praetorians on either end of his compound keep up a", "ceaseless hail of flaming arrows -- everything begins to burn", "-- the caged gladiators are stirring now -- shouting --", "Proximo races to his panicked guards --", "The guards sprint to the cells -- unlocking the gladiators as", "quickly as they can --", "Not quick enough for many -- Praetorians are now pouring", "pitch through the gutter that runs along the bottom of the", "cells -- igniting it and incinerating all those trapped", "inside --", "The compound is soon a raging inferno --", "Proximo releases Maximus and Juba --", "Proximo hauls Maximus and Juba off as Vibius and the other", "gladiators arm themselves --", "INT.  TUNNELS - NIGHT", "Proximo is leading Maximus and Juba quickly through a", "decaying cramped tunnel.", "Maximus stops as well.", "Maximus nods.", "He leads Maximus down the disintegrating catacomb of tunnels -", "-", "EXT.  PROXIMO'S COMPOUND - NIGHT", "Vibius hoped to die fighting -- he never got the chance.", "It is not a battle, it is a slaughter.", "The Praetorians ruthlessly shoot anyone even approaching the", "gates -- all the walls are covered -- most of the gladiators", "die in the hellish inferno -- the relentless rain of flaming", "arrows continues --", "Vibius coughs in the thick smoke and rages for someone to", "fight -- Praetorian snipers cut him down -- he dies reaching", "for the statue of Mars.", "INT.  COLOSSEUM - SUBTERRANEAN - NIGHT", "Proximo and Maximus emerge deep in the bowels of the", "Colosseum.", "He races back into the tunnel.", "Maximus moves quickly down the corridor.  He can finally", "see...", "INT.  COLOSSEUM - BUTCHERY - NIGHT", "Grisly carcasses of every description hang from hooks. Two", "bored butchers hack them up.  The good bits are tossed into a", "wagon to fed to the Colosseum animals.  The waste and offal", "are shoveled into a large sewer opening.  A butcher", "occasionally lifts a sluice-gate and a gush of water flows", "into the sewer from above, washing down the blood and", "carcasses.", "Maximus crouches and creeps through the nightmare of hanging", "carcasses and flies.", "When the butchers are looking elsewhere, Maximus creeps to", "the sewer opening and climbs in -- he immediately slides down", "for a few yards in the slanting, slippery blood sluice -- out", "of sight --", "Then he thuds to a stop.  He can go no further because the", "remains of an animal carcass blocks his way.  He tries to", "slither past the carcass --", "Finally, one of the butchers above lifts the sluice-gate and", "a torrent of water flows down.", "Maximus is washed down the hideous sewer.", "INT.  TUNNELS - NIGHT", "Proximo and Juba are quickly marching back down the tunnel", "toward the compound -- they are very close now -- the roar of", "flame is heard -- the creak of falling timber -- and the", "screams of burning men.  They run.", "They round a corner and see there is no way past the world of", "flame ahead of them.  The tunnel to the compound has", "collapsed.", "Proximo leads them up a cramped stairway to...", "EXT.  STREET OUTSIDE PROXIMO'S COMPOUND - NIGHT", "They emerge through a sewer entrance -- right into the arms", "of the Praetorian Guard.  Proximo and Juba are bound. Proximo", "sees his compound burning.  Sees the Praetorian archers", "taking out any last survivors.  Hears the screams.", "INT./ EXT.  VARIOUS LOCATIONS - ARREST MONTAGE - NIGHT", "A quick sequence of brutal arrests as Praetorian Guard units", "round up many associated with the plot.  And many that are", "not.", "GAIUS' BEDROOM:  Gaius and his wife are yanked awake and", "hauled out.", "CHRISTIAN HOME:  A congregation of Christians is chained", "together, their secret altar smashed.", "CAFE:  Greek Scholars are hauled away from their scrolls.", "STREET THEATER:  Actors are dragged off in the midst of a", "performance.", "GRACCHUS' STEAM ROOM:  Gracchus is enjoying grapes with his", "handsome catamite.  A unit of Praetorian bursts in. Gracchus", "looks at them.  Sighs.", "INT.  PALACE - THRONE ROOM - NIGHT", "Commodus stands with Lucius on a balcony overlooking the", "city.", "The roaring flames of the fire at Proximo's compound can", "easily be seen.", "He puts his hand on the boy's shoulder.", "Behind them, Lucilla sits slumped in a chair.  Her face is a", "mask of anguish at what she has been forced to do.", "Two Praetorians enter with a bucket.", "Commodus goes to them.  He talks quietly with them for a", "moment and glances at what they are carrying.", "They bring the bucket to Lucilla and set it before her.", "Commodus ignores her and goes back to Lucius on the balcony.", "Captain Marcellus' head is floating in brine.  Lucilla moans.", "All is lost.", "EXT.  TIBER RIVER - NIGHT", "Maximus splashes to the surface of the filthy Tiber, gasping", "for air.", "Animal carcasses float up next to him.  He grabs onto one and", "floats down the gently flowing river.", "EXT.  ITALIAN FRONT - CAMP - DAWN", "The Wolf of Rome sleeps.  Then its ears rise.  Then its head.", "It sniffs the air.  The wolf slowly rises and begins loping", "through the camp.", "It passes slumbering soldiers and tents, smoke lazily", "drifting up from campfires.", "The wolf finally stops and looks up.", "Maximus is on a horse.  He climbs down.  The wolf goes to him", "and licks his hand.", "Maximus begins marching through the camp, the wolf at his", "side.  Soldiers stir, amazed to see their General is alive.", "Gallus leaps up, stunned, and goes to Maximus.  They continue", "to march through the camp, more and more astonished soldiers", "joining them.", "They march toward the large tents at the center of the", "encampment.", "Titus emerges from his tent.  Slams to a stop --", "He goes to Maximus and embraces him.", "Just then Quintus emerges from the largest tent.  He stares", "at Maximus, unbelieving.", "A long beat as they look at each other.", "Quintus knows his destiny.  With quiet dignity he begins", "whispering a prayer.  Maximus moves to him, embracing him:", "He stabs Quintus with a dagger as he embraces him.", "Quintus falls.", "A beat.", "Titus goes to the dead Quintus and pulls the seal of office", "from his uniform.  He hands it to Maximus.", "An enormous roar of celebration from the Felix Regiment.", "INT.  PALACE - COMMODUS' BEDROOM - MORNING", "A castrati choir sings a gentle hymn of celebration. Their", "eerie voices and otherworldly harmonies undulate around", "Commodus' bedroom.", "The Emperor himself is in a chair, wrapped in a robe.  His", "body slaves work over him closely.", "He is staring into a mirror, lost in another world as the", "slaves carefully apply golden eye makeup to him.", "The castrati hymn continues...", "EXT.  OUTSIDE THE COLOSSEUM - DAY", "The hymn is all we hear as we see crowds moving into the", "Colosseum...", "It seems that all of Rome is here for this great day. Huge", "throngs of citizens move like a massive wave toward the", "Colosseum entrances.  Vendors are doing brisk business.", "Praetorian units in full dress uniform canter past.", "We elegantly float up along the outer tiers of the Colosseum", "and then glide over the edge to see the arena stands...", "EXT.  COLOSSEUM - DAY", "The hymn is all we hear as we see...", "The stands are filling.  We see the rich and poor alike. We", "see the orator Cassius.  We see Senator Falco and most of the", "Senate.  We see the cohort of fifty Praetorian taking up", "position around the Imperial Box.", "A golden platform, with stairs down to the arena sand, now", "extends about twenty feet from the Imperial Box to a spot", "over the arena.", "We float down the stairs and then we see the arena itself...", "It is stunning in its simplicity.", "The days victims are tied to posts in the center of the", "arena.  Suspended above them is an enormous cloud.  A thick,", "tumescent bladder painted to look like a threatening rain", "cloud.", "We see Proximo and Juba.  We see Senators Gracchus and Gaius.", "We see Gaius' wife and Gracchus catamite and Christian", "families and scholars and actors.", "Seven stylized hills surround them. The hymn comes to its", "soaring conclusion as we see the damned.", "Later.  By now, the Colosseum is packed.  All fifty-five", "thousand seats are taken.  Another ten thousand stand", "wherever they can.  A feral anticipation buzzes through the", "crowd.", "Outside the Colosseum, the streets are crowded with thousands", "more who couldn't get in.", "Trumpets blare.", "Commodus' six Centurion Body Guards stride into the Imperial", "Box.", "Then Commodus enters.  He is shrouded in a full lion's skin,", "the head of the lion concealing his own.  His head is down,", "he does not look up.", "Lucilla and Lucius enter after him and sit.  Lucilla's face", "is drained, her eyes defeated.  Lucius is wearing a miniature", "set of Lorica Segmentata, complete with ceremonial dagger.", "EXT.  ROMAN STREET - DAY", "A mangy dog is slowly crossing a dusty street on the", "outskirts of Rome.  The street is deserted.  It seems that", "almost everyone is at the Colosseum.", "The dog stops.  Looks up.", "Then a sound is heard.  The steady cadence of horses' hooves.", "The Felix Regiment rounds a corner.  Maximus leads the", "cavalry.  He wears Lorica Segmentata.  His corps of archers", "and soldiers follow.  They troop down the dusty street.", "Maximus and the cavalry canter past the mystified dog.", "The Felix Regiment moves through the streets.  The few", "pedestrians quickly disappear into shops and around corners.", "The roar of the Colosseum can be heard far in the distance...", "Arrows slice into isolated Praetorian sentries.  The Felix", "Regiment continues its stealth invasion...", "Finally, Maximus reins his horse and his troops stop.", "The mounted City Guard are waiting.", "Without a word, the City Guard joins Maximus and the two", "combined forces continue their inexorable march to the", "Colosseum.", "EXT.  COLOSSEUM - DAY", "Commodus, still swathed in the lion skin, his head down,", "slowly walks out on the platform that now extends from the", "Imperial Box.", "The crowd grows hushed.", "Commodus reaches the end of the platform and waits for a", "moment.  Then he dramatically flings off the lion skin.", "The crowd gasps.", "He is almost naked, his entire chiseled body is painted in", "gold.  His eyes are lost in an eerie reverie as he looks", "around at his people.", "He finally speaks:", "The crowd is stunned.  A few scattered laughs.", "Lucilla stares at him, disbelieving.", "EXT.  ROMAN STREETS - DAY", "Maximus continues to lead the combined Felix Regiment and", "City Guard cavalry through the streets.  The roaring is", "closer now.  They are nearing the Colosseum, they can just", "glimpse the edge of the top tier over some building.", "EXT.  COLOSSEUM - DAY", "Commodus continues:", "He raises his arms.  At his cue the Praetorian archers raise", "their bows, ready, aiming at the victims.", "The Praetorians suddenly point their bows higher and fire --", "They shoot the cloud -- the bladder EXPLODES and thick blood", "rains down on the victims -- the blood splashes over them,", "coating them.", "EXT.  OUTSIDE COLOSSEUM - DAY", "The roar from the Colosseum is now deafening as Maximus and", "the City Guard round the final corner -- the Colosseum is", "before them -- the massive Praetorian Guard force is caught", "of guard -- with crisp military efficiency the Felix Regiment", "and the City Guard quickly canter into place, an unbroken", "line of seasoned warriors facing the Praetorians.", "The huge mob outside the Colosseum is confused, intrigued,", "watching the face-off.  The mounted archers of the Felix", "Regiment have drawn their bows.", "Maximus looks down from his horse at a Praetorian Officer.", "A beat.", "The Praetorian Officer glances at the formidable force", "against him.  He drops his sword.  His men follow suit.", "He spurs his horse and the Felix Regiment roars, springing", "into action -- they gallop through the crowd and to the", "Colosseum -- meanwhile the City Guard disarm and guard the", "Praetorian --", "EXT.  COLOSSEUM - DAY", "Commodus continues:", "At his cue, two elevator platforms rumble into view, rising", "from the bowels of the Colosseum to the arena sand.", "On each platform is a cage full of ferocious wolves, they", "snap and growl, straining to be released.", "Suddenly -- the huge wooden doors of the arena burst open and", "Maximus leads the Felix Regiment cavalry thundering into the", "arena.", "The crowd is stunned -- Commodus is stunned -- Lucilla bolts", "up --", "Commodus immediately spins to Lucilla, his eyes burning --", "His Praetorian are momentarily confused --", "At Gallus' command the Felix Regiment archers let fly --", "multiple arrows and bolts cut through most of the Praetorians", "-- some confusing skirmishes as the remaining Praetorians", "fire back --", "Maximus leaps from his horse and begins cutting the prisoners", "free --", "Meanwhile, Commodus strides back down the platform toward", "Lucilla in the Imperial Box, murder in his eyes --", "She suddenly hugs Lucius quickly and kisses him --", "She pulls the ceremonial dagger from his little uniform and", "pushes him to his attendant -- his attendant pulls him away", "as --", "Lucilla spins to Commodus -- he grabs her into an embrace --", "he turns the knife on her -- thrusting deeply as he kisses", "her --", "A long kiss as he holds her tightly to him.  Then he gently", "sits her down on her throne.  Her eyes wide, dying.", "One of Commodus' Body Guards grabs him:", "Commodus' six Centurion Body Guards begin hustling him out of", "the Imperial Box --", "He grabs Lucius from his attendant and drags him off --", "They try to escape out the back of the Imperial Box -- but", "Felix Regiment troops are blocking their way -- racing up", "toward them --", "Below, through the confusion, Maximus sees Commodus escaping", "with Lucius down through a side tunnel.", "Maximus cuts Juba and Proximo free.  Juba immediately", "snatches up a sword.  Maximus quickly offers a sword to", "Proximo.", "Proximo takes the sword.", "They race across the arena and into a tunnel...", "INT.  COLOSSEUM - BOWELS - DAY", "Proximo leads them through a series of catacombs -- damp", "tunnels shoot off in every direction -- everywhere around", "them the heavy machinery of the games rise like mammoth", "creatures to the arena above -- a baroque network of ropes", "and pulleys and counterweights and elevator platforms and air", "shafts and blood sewers -- And they suddenly run directly", "into Commodus, dragging Lucius, and his six Centurions coming", "the other direction.", "The final battle begins with no preamble --", "Maximus launches himself forward -- instantly separating", "Commodus and Lucius -- he slams at Commodus with his sword --", "Commodus slams back --", "Proximo and Juba race into the six Centurions -- a wild free-", "for-all as they prove their worth as warriors -- Juba fights", "with his usual elegant precision -- Proximo fights as a man", "reborn, alive again --", "Proximo takes cagey advantage of his knowledge of this", "subterranean world -- spinning around machinery and leaping", "over blood sewers and swinging heavy counterweights --", "Maximus and Commodus hack at each other with all the fiery", "passion in them -- Commodus is a perfect match for Maximus", "and equally ruthless -- their swords thrust and parry and", "slice at amazing speed -- one false move, one mistake, means", "death --", "Meanwhile, the battle is turning into a victory for Juba and", "Proximo -- they are defeating the Centurions -- Commodus sees", "this -- and sees Lucius crying in a corner --", "He screams to one of his remaining Centurions:", "Maximus whirls to Lucius -- Commodus attacks -- slashing", "Maximus' shoulders -- Maximus sees Proximo racing to try and", "save Lucius as he spins back to battle Commodus --", "A Centurion raises his sword to kill Lucius -- Juba kills his", "final opponent, turns -- Proximo just manages to push Lucius", "out of the way -- the Centurion's sword slices into him --", "Juba flings his sword across the room -- the final Centurion", "falls -- Maximus sees Proximo collapse to a wall -- dying --", "Proximo locks eyes with Maximus as he slides down the wall.", "The old pirate shrugs.  And is dead.", "Juba races to Lucius and holds the boy, turning his face away", "from the slaughter --", "Maximus, his furious passion redoubled at Proximo's death,", "attacks Commodus with every ounce of strength in him --", "Commodus' eyes begin to flash with something we have never", "seen before, fear.", "Maximus strikes mercilessly -- forcing Commodus steadily back", "until they are fighting atop one of the elevator platforms to", "the arena above.", "Maximus strike hard -- Commodus barely blocks the blow --", "He strikes harder -- Commodus is losing --", "He strikes with everything he's got -- slashing Commodus --", "Commodus sails back -- his sword falling --", "Maximus stands over him.  Glaring.  Commodus is panting,", "defeated, glaring up at him.", "A beat.", "Maximus raises his sword high -- Commodus raises an arm --", "Maximus SMASHES the sword down -- and Commodus is dead.", "A moment as Maximus stands over Commodus.  Then he looks at", "the series of counterweight ropes around the elevator", "platform.", "He slices through one of the ropes and the platform begins to", "rise...", "EXT.  COLOSSEUM - ARENA - DAY", "A trap door springs open and the elevator platform rises to", "the sand of the arena.  Maximus stands above the dead", "Emperor.", "The crowd stares in amazement -- and then begins to cheer in", "joy at the return of their hero.  A chant begins... \"Maximus", "the Merciful... Maximus the Merciful... Maximus the", "Merciful...\" which then grows to a refrain of \"Caesar...", "Caesar... Caesar...\"", "Maximus ignores them, his eyes drawn to one sight: Lucilla.", "He goes to the steps of the platform leading to the Imperial", "Box.  He slowly climbs the steps.", "In the Imperial Box, Senator Gracchus is standing.  So too", "Juba and others.", "Lucius is kneeling by his mother, holding her hand, his head", "down.  Lucilla is dead.  Lucius mourns with quiet dignity.", "Maximus looks at Lucilla and kneels.  He takes her other", "hand.  A long moment.  He looks at Lucius.", "Then he slowly bends forward and kisses Lucilla deeply, the", "ritual farewell.", "He stands.", "Senator Gracchus steps to him:", "Maximus looks at him.  And then at the people.  The chant of", "\"Caesar... Caesar... Caesar...\" is like a powerful beating", "heart.", "Maximus moves to the edge of the Imperial Box to address the", "people.  The crowd grows silent.", "Maximus looks around at the blood of the arena.", "A beat.", "With that he slowly turns and walks down the steps to the", "arena sand.  The crowd is absolutely silent.", "He goes to Titus:", "Titus salutes.", "Maximus return the salute and then leaps onto his horse. As", "he canters toward the exit he turns for one final look at", "Lucilla.", "He sees that Lucius is now at the foot of the stairs, on the", "arena sand, gazing at him.", "Maximus stops his horse.", "He canters back to Lucius.  The boy looks up at him.  A", "moment between them.", "Lucius thrusts up his hand.  Maximus grabs his hand and", "swings him onto the horse behind him.", "A look to Juba.  Juba bows his head with respect.", "Farewell.", "Maximus spins the horse around and begins cantering out of", "the Colosseum.", "Juba disappears into the crowd.", "Maximus and Lucius canter across the arena and through the", "huge doors...", "EXT.  COLOSSEUM - DAY", "From high above we see Maximus and Lucius riding out of the", "Colosseum and disappearing into the streets of Rome.", "EXT.  VINEYARD - DAWN", "Maximus stands with Lucius at his old vineyard.", "It is still scorched and dead, weeds overgrowing the", "vineyards, the house ruined.", "Maximus puts a hand on the boy's shoulder, this boy so like", "his own son.", "We leave them, dreaming of the future."]}