{"COMMODUS": [" Do you think he's really dying?", " I think he's really dying this time.", " I've been so informed.", " And the Senators.  He wouldn't have summoned them if --", " The first thing I shall do is honor him with games worthy of his majesty.", " Why have we stopped?", " Where is my father?", " Is the battle won?", " My sister wants a bath, take her to the camp. Take me to my father.", " Have I missed it?", " Father.  Congratulations.  I shall sacrifice a thousand doves to honor your triumph.", " General, Rome salutes you and I embrace you as a brother.", " Your Spaniards seem invincible. May the Gods favor the Felix Regiment now and always... Here, Father, take my arm.", " She's at the camp.  She had no desire to see the gore of the battlefield.", " He's dying.", " Hail, warriors.  My congratulations.", " My old friend, my father tells me you're returning to Spain?", " A pity.  I'll need men like you in my army...", " General Maximus, may I present Senators Gaius and Falco.  Beware of this Gaius, he'll pour a honeyed potion in your ear and you'll wake up one day and all you'll say is \"Republic, Republic, Republic...\"", " You've had my ear since we were children.  You could be a valuable ally in the Senate.", " There -- I warned you.", " Not a word about that sodomite bastard.", " I won't tolerate it.  His incessant criticism exhausts me.  The man can speak for five hours without taking a breath.", " Enough... Maximus, I would like to inspect the Felix Regiment at dawn. Please arrange it.", " Excuse me?", " Of course, how foolish of me.  Some other time...", " I search the faces of the Gods for ways to please you... to make you proud... and I can never do it. One kind word -- one full hug where you pressed me to your chest and held me tight -- would have been like the sun on my heart for a thousand years... What is it in me you hate so much?  My eyes are your eyes.  My hands are your hands. All I have ever wanted was to live up to you. Caesar.  Father.", " Lament with me, brother, our great father is dead.  I want --", " The surgeons say it was his breath that gave out.", " Even as the Gods curse this dark day with clouds, so too does the sun begin to shine forth on a promised tomorrow.  Even as we mourn the passing of our father, so too do we celebrate the coming of a bright, new age for Rome.  At my side, brothers, you shall pull fresh glories from the heavens.  At my side, brothers, you shall know the adoration of the Gods.  Doubly- dark is this day because my friend, your noble commander Maximus Meridas, has been called to Rome to deal with urgent matters of state...", " Caesar is honored to accept your tribute, Citizen Scholar.", " Very well...", " Peace, good Gracchus, peace...", " You see that's the very problem, isn't it, my old, old friend?  My father spent all his time at study.", " I doubt many of the people eat so well as you do, Senator Gracchus...", " No.  But if you interrupt me one more time I assure you that you shall.  I will emulate the immortal Caesars of the past.  I will give the people what they truly want. Starting this day I will draw all of Rome to the Colosseum.  I will give them bread.  And they will want nothing more.", " Not just any games, Senator!  A series of games that will make the Gods envious and leave my children happy!  I will subsidize the arena from this day forth -- and I will culminate this celebration in a great spectacle the likes of which the world has never seen!  A great spectacle to honor my father! Magnificent, unending weeks of festivity all in the name of Marcus Aurelius!", " That is not your concern.", " MY FATHER DESERVES TO BE HONORED AND I WILL HONOR HIM! -- AND THE PEOPLE WILL LOVE ME! -- AND THE SENATE WILL OBEY ME OR EVERY ONE OF YOU WILL BURN!  BURN!  BURN! -- I WILL HAVE ORDER!", " All my desires are splitting my head to pieces -- there's so much I want to do -- but all my efforts to show my children they are loved go unappreciated by those dragons in the Senate --", " All I want is to be a good father to my people.  Why don't they understand that?", " I must take a firmer hand with them. They must know their father can be firm.  As our father was firm with us.", " Yes... yes... you always know the way.  You were always so wise in these matters... You know if I didn't have my duty to Rome I think I should be an artist. I should go away and paint pictures of the sea and leave all the politics to you...", " Still.  Always.", " And after... just sit with me. Keep me safe...", " Slave!  Who are you?", " Why is he still alive?", " He shouldn't be alive.  That vexes me.  I am terribly vexed...", " I do too.  Simple, elegant...", " I'm going to kill him.", " Oh, you're too clever, Sister. Don't tell me part of you won't weep for him.", " No?", " He wounded you deeply, didn't he? Long ago.", " I am sorry to have kept you away... I needed this time to think...", " I limited my world to these four walls so as to let my mind free... again and again my mind settles on but one question... What kind of world are we making when the people of Rome prefer a slave in the arena to their father?", " They are not \"the mob,\" Lucilla, they are the people.  They are my children and all I want to do is love them.", " And what do I do but fight for them?!  I give them games to please them.  I strangle dissent to give them peace.  I empower the Praetorians to give them order. What more can I do?!", " A God is more powerful than a man...", " But I need to know -- why do they love him?", " And for that moment in the arena they are merciful too.  For a moment... they are Gods.  Offering life.", " Brother... we've taken a sad path since we were children at Capri, have we not?", " As the first act of my contrition I offer you the wooden sword of freedom.", " Take it, Maximus.  Let us heal that fatal wound together.", " Will you always mistrust me?", " You think this is power?  I could show you power, slave --", " Where is my sister?", " Where?", " Where is my sister?", " Sister... join us.  I've been reading to dear Lucius.", " Yes, he's a very smart little boy. He'll make a grand Emperor one day.", " And just wait until you hear what happened to some of our other ancestors!  If you're very good, tomorrow night I'll tell you the story of Emperor Claudius.  He was betrayed!  By those closest to him... ... by his own blood... they whispered in dark corners and went out late at night and conspired and conspired...", "", " Why that's a bonfire, Lucius.  I arranged it just for you.", " Oh... that's for my sister.", " Rome... This is the day that was foretold.  This is the day when your father takes away all fear... With these hands I shall destroy your enemies so that you may sleep always and forever in peace.  From this day forth let it be known that I, Lucius Aelius Aurelius Commodus, have surmounted mortality.  That I, Lucius Aelius Aurelius Commodus, assume my destined place... at the side of the Gods.", " This day I reclaim Rome for her people.", " As it was at the beginning so is it now.  The great She-Wolf of Rome will again suckle us, again ravage our enemies -- AND BRING US A WORLD REBORN!", " GET THE BOY!", " KILL THE BOY!"], "LUCILLA": [" He's been dying for ten years.", " How do you know that?", " Maybe he just misses us.", " Peace, Commodus.  After two weeks on the road your incessant scheming is hurting my head.", " The first thing I shall do is have a hot bath.", " Civilization at last.  Gods preserve us.", " Father.", " You're right.", " I would have been what you taught me to be.", " Even over his son.", " Maximus, stop... Let me see your face.", " What does my father intend?", " You're lying.  I could tell when you were lying even when we were children.  You hate it.", " True.  But then you never had to. Maximus, stop... ... Is it really so terrible seeing me again?", " And you are hurt to see my father dying.", " Do you know I still remember you in my prayers...?  Oh yes, I pray... Ever since that day you saved me from drowning off Capri.  Do you remember?", " Commodus was so angry that a mere peasant -- a Spaniard no less -- touched the royal person, do you remember his anger?", " Mark this, Maximus:  that is the man who will be Emperor.", " There was a time when you didn't call me \"Highness.\"", " Very different... I wonder if it was better?", " Hail, Caesar.", " Gentlemen, in the future do not concern my brother with these matters.  Come to me.", " Quiet, brother...", " Shhh.  The tonic will help...", " Our father lost his way.  His mistake was believing the old songs of the \"Republic.\"  We know better. So let the Senate talk.  They have no real power.", " Still afraid of the dark, brother?", " I'll stay with you until you are asleep.", " He's asleep.  Be quick.", " Good.", " Can they be bought?", " And they've started arresting scholars now.  Anyone who dares speak out -- even satirists and chroniclers.", " The future.  The future pays for it...", " He's selling Rome's reserves of grain.  The people will be starving in two years.  I hope they are enjoying the spectacles because soon enough they will be dead because of them.", " And who will tell them?!  You, Marcellus?  You, Senator Gaius? Will you make a speech on the Senate floor denouncing my brother? And then see your family in the Colosseum?  What town-crier would dare?", " No -- cut off the head and the snake cannot strike.", " What about the army?", " So we do nothing?!", " It's all right, darling, you --", " Lucius, you go in now, I'll be in shortly.", " What are you going to do?", " I don't know.", " Mmm.", " What are you going to do?", " Good.", " When he defies my brother the Emperor, he defies me.  But you shouldn't send assassins.", " The people embraced him today. They will be expecting his next match... ... let him die in the arena like the slave he is.  Let the people see what comes of defying Caesar.", " Rich matrons pay well to be pleasured by the bravest champions.", " Maximus, listen to me --", " I knew nothing of that.", " I wept for them.", " Do you know what it is to be the daughter of the Emperor?  I learned on the night my father had my husband killed.  I loved my husband very much.  Very... simply.  He was a man who believed in the Republic. He was a man who thought Marcus should be tending to Rome and not conquering the world.", " So is mine.", " So do I.", " The Senate is with us, and the City Guard.  We have growing power in the streets.  But we need a leader. Someone the people can --", " No.  So that my son will be safe. So that we may leave this charnel house forever and never look back. Look into my eyes, Maximus, and believe what I say to you...", " Lucius Verus.  Like his father.", " Commodus plans to kill you in your next match in the arena.  He's planning something.  I will pray for you.  As I have always done.", " Lucius, run along now.  I need to talk to the General.", " ... Maximus will summon his army from Ostia and he will strike from the inside as his army strikes from the outside.  But he insists that the Senate be present.", " How many are with us?", " I'll arrange it.", " He has withdrawn.  He's not eating. He doesn't go out.  He won't even see me... I don't know what tempests rage within him but...", " Yes.", " And they will march on Rome for you?", " Captain Marcellus will take it. And his City Guard will by with you when you get to Rome.  Is that enough to face the Praetorian Guard?", " Caesar...", " Of course...", " Brother, do not be influenced by the mob.  They are a great, faceless beast --", " They see themselves in him.  They throw in their own sad dreams alongside his.  They think he fights for them.", " And what if he should win?", " Caesar, you let this unduly worry you.  At best he is a passing fancy -- he is a name, an image on a banner, ephemeral -- he will be forgotten as the next fancy appears --", " Mercy.", " Don't even say it.  I know it's dangerous -- but I had to see you. Captain Marcellus has gone to the army with your message as you instructed.", " He says the City Guard will be ready at the south road at noon. They can only wait for an hour so --", " Did I?  All right then.  So everything is prepared.  The Senate will be in attendance and you have your gladiators -- the usual cohort of Praetorians will be inside the arena --", " Tell me honestly... please... do you think it will work?", " Do you think we'll all die?", " Will you swear something to me?", " Will you swear it on the memory of your son?", " By all that you have ever loved... swear that if you survive you will take my son out of Rome.  Swear that you will go far away and never return.", " I will.", " Remember your mother."], "COMMODUS (cont’d)": [" He has to be bled every night now.", " If he weren't really dying he wouldn't have sent for us.", " Have I missed the battle?", " Poor old man.", " There are larger division that might appeal to you.  Even the Praetorian Guard.  You've never been to Rome. Imagine arriving as head of the Praetorians!  They have really splendid uniforms.", " Caesar retires early tonight.", " Why does Maximus deserve what I could never have? -- Why do you love his eyes over mine? -- I would butcher the whole world -- if you would only love me...", " General, the Gods' have taken the great man and left me alone.  My first desire as Emperor is that you take my hand in friendship.  I need you at my side, Maximus, at this moment above all others.  Stand with me.", " Take my hand, Maximus.  I only offer it once.", " Until his promised return I appointed Quintus Domitian to serve in his stead.  I salute you, Legionnaires!", " It is the most sacred duty of the Emperor to oversee the education of the young.  If I could leave no other legacy than the scholarship of all children my life would be blessed.  Tutors, you hold the future of Rome in your hands. Teach them well so that they will bring honor to the Empire.  I salute you.", " Look at them, Senators... my truest gift to Rome.", " My beloved father was a careless shepherd to his flock.  I shall be a good father to my children.  I shall remain in Rome and show them how they are loved.", " He spent his twilight hours reading scrolls from the Senate.  All the while, the people were forgotten.", " I doubt many of the people have such splendid armor, Captain Marcellus. Or such fine mistresses, Senator Gaius.  No... only their true father knows what the people need.  I shall show them they are loved.  I shall hold them to my bosom and embrace them tightly --", " Will you stay with me?", " My dreams would terrify the world. A beat.", " SLAVE!  WHO ARE YOU?", " SLAVE!  WHO ARE YOU?!", " There, that's better.  Do you like the platform here?", " Father would have wanted something more ornate but he's dead now.", " Maximus Meridas haunts me.  I see Father turning away from me and gazing at him.  How many times did I suffer that indignity, I wonder?", " Nonetheless, your political acumen is, as always, unerring.", " It is my responsibility to make the world as it should be.  How is it I have made this world?", " Our father loved Maximus... and I love him still... yet he defies me, he tasks me in front of my children. And they love him for it. Just as Marcus loved him for it. Tell me why, Lucilla.", " Say I should fight him, in the arena.  Let my children see who the Gods truly favor.", " But who can be more merciful than the Emperor of Rome?", " For my own part... I am sorry it came to this.  And to you alone of all men, I acknowledge my errors. And my regret.  I shall live with my sin for all my days.", " Take it, brother.  Stand at my side as a free man worthy of your ancestors.", " Join us, sister.", " We've been reading about the great Julius and his adventures in Egypt.", " But the Emperor Claudius knew that they were up to something dire.  He knew they were busy little bees. And one night he sat down with one of them and he looked at her and he said:  \"Tell me what you have been doing, busy little bee, or I shall strike down those dearest to you.", " And as a righteous God, I shall ever protect you.  I shall cradle the world on my benevolent hands and clasp it to my heart.  So I have spoken!  And let the heavens tremble at my might!", " I will make a new Rome!  Founded as it was at the beginning!  Archers -- GIVE US BLOOD!", " So it was for Romulus and Remus, sons of Mars, so shall it be for us! The great She-Wolf will --"], "PRAETORIAN GUARD MEMBER": [" We're here, sir."], "SOLDIER #1": [" He's at the front, sir.", " Don't know, sir.  They've been gone for eight days."], "TITUS": [" You would do as well to read the mind of a rhinoceros.", " They simply will not surrender.", " It won't be the Felix Regiment without you.", " And you'll be too fat from Vibia's cooking to get on your horse by then.", " Quintus, what is -- ?", " By all the Gods...", " You're returned from Hades!  By all the Gods!"], "QUINTUS": [" These barbarians would rather drown in blood than yield an inch.  If I didn't hate them so much I would admire them.", " General, I don't recommend that. Our cavalry might be caught in the flames.", " Now!", " That means after three or four more babies.", " General -- Maximus --", " The Emperor needs you.  It's urgent.", " I don't know...", " Please don't fight, Maximus --", " I'm sorry, General, Caesar has spoken.", " I have no choice --", " They will greet you in the afterlife.", " Hail, Caesar!", " Don't speak of it.  Never speak of it."], "MAXIMUS": [" A people should know when they are conquered.", " I hope not, because I'm going to be leading them.", " Hold steady... steady...", " Caesar.", " I don't think there's anyone left to fight.", " Should Caesar permit, I'll go home. I've been away too long.  I've forgotten my wife's face and I barely know my son.", " Come, Caesar...", " For the glory of the empire, sire.", " They honor you, Caesar.", " Highness.", " Caesar, you do the lady injustice.", " If you'll excuse me, Highness.", " What, Gallus, losing your other hand?", " And the women of your village will crave your touch even more.", " What's your name, son?", " The name suits you.", " You're dying because you love Rome, as I do.", " Neither have I.  Rome for us lives here... ... it's a thing inside us that came from our ancestors and that we give to our children.", " Yes, it's a glorious place.", " If you want to stay on, I support you.  So do the men.  I'll ask the Emperor to appoint you in my place.", " I'll return after a season at home. Maybe two.", " Should the Gods so bless me.  I would be thankful.", " Yes.", " I'm going home.", " No.", " I'm a soldier, not a politician.", " I can't do that.", " My men have been fighting for five solid days.  They're too busy dying to go on dress parade.", " Caesar.", " I never acquired the art, sir.", " Caesar, I am honored but --", " Sire, you brought the light of the Gods to barbarian darkness.  You brought civilization and justice to the farthest --", " Yes, Caesar.", " You're not dying.", " Caesar, you do me honor -- but your son has pride of place for succession.", " I shall, Caesar.", " You have always been my father.", " That's not true.", " I lost too many men.", " I don't know.", " I never acquired your comfort with it.", " No.  I'm sorry.  I'm tired from the battle.", " I will always serve the ideals of Rome.", " Yes.", " Yes.", " May I be permitted to go, Highness?", " And there was a time when you were just a little girl drowning in the sea.  All that was a different life.", " It was more honest.", " Ancestors, true bloodline, I ask you for your guidance.  Bring me your solace and your wisdom. Blessed Mother, come to me in my dreams with the Gods' desire for my future. Blessed Father, watch over my wife and my son with a ready sword.  Keep them safe until my return.  Whisper to them in their sleep that I live only to hold them again and all else is dust and air. Ancestors, true bloodline, I honor you and will try to live with the dignity you have taught me.", " Quintus -- ?", " What is it?  Is he ill?", " How did he die?", " How will the world speak your name now, old man?", " What -- ?!", " Quintus --", " Quintus, what -- ?", " My family?!", " Have you ever done this before?", " Killed a man with a sword?", " It can be very messy -- you could get blood all over your armor.  You don't want to hack me up now.  You want one clean stroke.", " One good stroke -- you do know where, don't you?", " If you miss the spot there'll be blood everywhere.  Quite a spray.", " Here -- you don't want to hit the vein on the neck --", " Am I in Hades?", " Gladiator.", " Nothing more.", " The Emperor -- will he be there?", " Have you -- how does one meet the Emperor?", " Yes.", " He gives it personally?", " You knew Marcus?", " No.", " Bigger arena.  Same killing.", " No.", " This isn't my home.", " Perhaps one day you'll return.", " Yes, but --", " What -- ?", " I AM MAXIMUS MERIDAS, GENERAL OF THE FELIX REGIMENT OF THE ROMAN ARMY AND SERVANT TO THE EMPEROR MARCUS AURELIUS!", " This isn't your battle.", " I knew your brother would send assassins.  I didn't think he would send his best.", " My family were crucified and burnt while they were still alive.", " Don't lie to me.", " Don't.", " My son was innocent.", " I want your brother dead.", " How do you plan it?", " So the crown passes to your son.", " What is your son's name?", " I weep for him.", " What can you tell me?", " I was a General.", " It doesn't take courage to kill.", " I'm sorry.", " I had a father.  He wasn't really my father but I cared for him very much.", " Where is my army?", " I will not kill another warrior. There is no honor to it.", " Tell him we will enter Rome on the first day of Commodus' festival.", " Yes.  But this letter must go to the lieutenant named Titus, no one else.", " The Felix Regiment will never be defeated.", " I want Commodus dead.", " Because one night an old man whispered to me about a dream.  I will die for that dream.", " He did.", " As will I, Commodus.  As will I.", " I only have ancestors because of you, brother.  You killed everything that ever lived alongside me.", " This is the new home you cursed me to.  And I am safer here from your treachery than I could ever be outside.", " Why don't you ask your father that?", " No, Caesar... I will show you.", " The Felix Regiment will come from here.  We'll face the body of the Praetorians outside -- here.", " Probably.", " Then be worthy of him.  The old Titan who would rather die bravely in a just battle than slink off to grow old and fat.", " Was it Centurion...?  General...?", " A soldier knows a soldier.", " No --", " You said something to me once.  You said in this life, we all die.  All we can choose is how we die.  And how we are remembered.  Do you recall those words?", " Then be remembered proudly.  This is your time, Proximo.  Stand at my side and be what you were.  What you truly are.  One last time.", " You pox-ridden bastard -- !", " A quarter?!", " You know, if you were half so awful as you pretend, you'd be a terrifying man.", " Lucilla --", " Good.", " You've told me this already.", " Lucilla... why are you here?", " No.", " Yes.", " Yes.", " Yes.", " I will.", " Shhh... my heart breaks enough.", " But --", " We were betrayed.", " You're not coming?", " Old friend...", " Where is he?", " Throw down your weapons or we will kill you.", " Captain?", " For my wife!", " Rome... you are better than this. Look inside yourselves.  I challenge you to find your true voice.", " It doesn't look it now... but soon we'll have it growing again... Next year there will be vines, and then there will be grapes... It will be alive."], "MAXIMUS (cont’d)": [" At the first signal release the catapults.  We'll use the cavalry to cut off the retreat.", " Why don't they know they're already dead?", " Steady...", " Brothers -- I salute you!  For Rome!", " I thank you for your prayers.", " How did he die?", " What about my family, Quintus?", " Put the point of your sword here... you want one, good blow right at this spot --", " I AM FATHER TO A MURDERED SON AND HUSBAND TO A MURDERED WIFE AND LANDLORD TO A MURDERED WORLD -- AND I WILL HAVE VENGEANCE!", " I have more power as a slave in the arena than I could ever have as a free man.", " -- a covert assault from within.", " But if we aren't... think of the glory.  Do you remember glory, Gladiator?", " And if I should not survive... swear to me that you will honor my family in your prayers always.", " I forgive you.", " FELIX REGIMENT!  DO HONOR TO YOUR ANCESTORS!  I SALUTE YOU!", " Where are they going?!", " For my son!", " For my father!", " We who are about to die salute you.", " I give you back the dream.", " When everything has calmed down, lead an orderly withdrawal.  Take them home."], "MARCUS": [" Maximus, you prove your valor again. Let us hope for the final time here.", " There are always people left to fight...", " Stop... ... You speak our language?", " No.  Let him speak... ... I am Rome, what would you say to me?", " Now it is Rome.", " No... Release him.  Give him safe passage.  Let him go to his family.", " Yes.  I remember.", " I don't think they're standing for me, Maximus.  They honor you.", " You've missed the war.  We're done here.", " Spare the doves and honor Maximus, he won the battle.", " Where's your sister?", " Lucilla would eat every corpse here if it brought her one step closer to the throne.", " It's a foolish old cobra who doesn't recognize his own off- spring... I think... I should ride now.", " Stand up, Senators.  That unfamiliar posture doesn't suit you.", " All the while conspiring with that fat man in Rome.  How is the old monster?", " Still damning me to the four winds?", " I would have silenced him decades ago -- but I just like him too much.", " If only you had been born a man...", " What a Caesar you would have made.", " I think you would have been strong. I wonder if you would have been just?", " Well, pretend to be my loving daughter tonight and walk with me to my chamber.", " Read this.", " Of course.  No matter.  In this letter I denote my intention to nominate you to stand for the Emperorship after my death.", " For twenty years I have been spilling blood.  For twenty years I have written philosophy and ruminated and conquered.  Since I became Caesar I have only had four years without war.  Four years of peace in twenty.  So perhaps I can be... forgiven.", " I have brought the sword -- nothing more!  Rome is far away and we shouldn't be here.  What matter is it to the Gods if we subdue one more tribe of Parthians or Gauls? What matter is it to Rome if a thousand more barbarians bend to our lash?", " If the dream is ever to live again the people must have a true voice. The voice I took from them.  That all the Caesars took from them, bit by bit, conquest by conquest.  And now that I am dying I am going to give them that voice again.", " I am, Maximus.  It's strange... I find as I near the end I think little of the waning moments around me... instead I think much of the past... and of the future.  How will the world speak my name in years to come?  Will I be known as the philosopher?  The warrior?", " You are the son I should have had... Although I fear in my deepest heart that if you had truly been my son my blood would have polluted you as it did Commodus. We're a cursed bloodline.  We have lived so long in power and depravity that we no longer remember a life without it. We can no longer even imagine a life without it.", " I'll keep this letter to myself.  I hope that with the sunrise you will agree.  And embrace me as a father."], "MARCUS (cont’d)": [" But this night, at least, Germania is at last defeated... What will you do now, my friend?", " Tell me again, Maximus, why are we here?", " So much for the glory of Rome.", " This is a pleasant fiction, isn't it?", " My son is not a moral man.  You have known this since you were young.  He cannot rule.", " While I have been fighting, Rome has grown mad and corpulent and diseased.  I did this.  And now I shall make it right.", " Winter, Maximus.  It's winter now...", " There was a dream that was Rome.  I can only whisper of it now. Anything more than a whisper and the dream vanishes.  It's so... fragile. The true glory of Rome is in a very fragile idea.  Imagine a place devoted to the rights of the citizen.  Where every free man has a voice.  That was the dream... And I fear it will not survive the winter.", " Let's just whisper here, you and I.", " Before I die I will give the people this final gift.  I will give them the Senate reborn.  The voice of the people empowered again, as it was always meant to be.  It is my design that they will elect the next Emperor.  And I would put forward your name with my backing.", " Look at me, son.", " Son... I know that one grove of your vineyard is worth more to you than all the treasures of Rome.  I know one loving word from your wife is worth more than the accolades of an Empire.  But... a fond old man, who loves you more than he can say, begs you to at least think about what he has said tonight."], "GERMAN PRISONER": [" THIS BLOOD MEANS NOTHING, CONQUEROR!", " You have been in my homeland for twelve years.  Of course I speak your language.  So did my son, who you murdered.  So did my daughter, who you raped.", " You are that sun, Rome, and your time is over... You can slit a thousand throats here, and you can put a thousand babies to the sword, but it will always be our home.", " It will never be Rome.  Not as long as one German breathes."], "GALLUS": [" Aye, General, they're going to make a bronze one for it.  Long fingers this time.", " Ah, then you know the women of my village."], "VALERIUS": [" Valerius, General.", " Why am I dying?", " I've never been to Rome.", " It must be glorious, Rome.  I've only seen pictures.  Is it a glorious place?", " It must be."], "FALCO": [" Hail, Marcus Aurelius.", " A war hero with a handsome face and a strong heart could go far.", " Have you never considered Rome?", " He's a damned provocateur."], "GAIUS": [" We live in supplication to your glory.", " Senator Gracchus is hale, sire.", " Still eager for your triumphant return to Rome, Caesar.", " ... And why not apply for entry to the Senate?", " Are you a believer in Republicanism?", " If your heart lies with the people, I would back you for the Senate. I'm sure Gracchus would as well.", " The august Senator Gracchus has been rather a gadfly on the flesh of the imperial family.", " He lives under the antiquated assumption that the Senate should represent the people with vigor.", " He serves Rome best when he serves it with honesty.", " Do you think he'll listen to us?", " It's madness.", " And what pays for it?  These games are costing a fortune and yet we have no new taxes.", " No.", " The Praetorians would only seize control themselves.", " No Roman army has entered the capital in a hundred years.", " We've been ordered to attend.", " And what of the Emperor?", " One question... who is to be the actual Regicide?"], "TITUS AND QUINTUS": [" Highness."], "(MORE)": ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], "MARCUS(cont'd)": [" The tyrant?  Or will there be a more golden sounding to my name? Will I be the Emperor who gave Rome back her freedom?"], "LUCILLA'S VOICE": [" He always favored you..."], "LUCILLA (cont’d)": [" You've been crying.", " He will announce Commodus' succession.  That's why he summoned us.  Will you serve my brother as you served his father?", " Leave the Senate to me.  Don't trouble yourself.", " Yes, just drink this down.", " He's started selling the grain reserves.", " He must die.", " My son will live.  He will survive this cursed bloodline.  Rome will die and the jackals will pick her clean -- but my son will survive. Empires come and go.  Cities crumble to dust.  Only family matters.", " My son will never be safe while he lives.", " By all the Gods, and in the name of my father who loved you, and in the name of the husband I loved... I swear to stand by your side in this now and always.", " He will not kill in the arena.  He is merciful.  As they all wish they were in their own hearts.", " Had I not been the daughter of Rome..."], "QUINTUS (cont’d)": [" Take him as far as the sunrise and then kill him."], "ASSASSIN #1": [" All right, this is far enough."], "ASSASSIN #1 (cont’d)": [" You two take him down there where no one will find him."], "ASSASSIN #3": [" Come on, General...", " What?", " Not like this, exactly... this is good, you can stop.", " Would you kneel, General?"], "ASSASSIN #4": [" Be quiet."], "ASSASSINS #3": [" All right, where?"], "FELIX REGIMENT": [" Hail, Caesar!"], "MAXIMUS' SON": [" MOTHER!  MOTHER!  FATHER'S HOME!"], "JUBA": [" Yes.", " Have you killed a man before? Maximus does not respond.", " Are we going to fight each other?", " Do you think it will be much different?  Here in Rome?", " Are you scared for tomorrow?", " Me too.", " For all Romans... this is home.", " How can I go back?  I am not what I was.  When a man kills for no reason, he has lost himself.", " I will fight with you.", " Better to die for a friend than to die for gold.", " And if we die that day -- we die free men worthy of our ancestors.", " And impotent.", " How did they know?", " I'll stay here.  In case they follow."], "JUBA (cont’d)": [" For your wound... Maximus stares at him.", " For your wound.", " If you die in the wagons they feed you to the lions... The lions are worth more than we are.  I think we are worth more than the zebras though.  So they don't feed us to them.", " I'm not sure about the giraffe.", " You should eat.  You'll need your strength tomorrow.", " I've never killed a man.  But I think you have.", " I almost killed once.  The Romans destroyed my village.  I was with a hunting party and when we returned... I would have killed every Roman in the world.", " If you don't eat you will die.", " In the village I come from there was a man once.  He went fishing one day and his boat was attacked by crocodiles.  One of them ate his leg.  He pulled himself to the shore and a lion attacked him.  It ate one of his arms.  He dragged himself through the desert on the way home and a scorpion stung his eye.  So he only had one eye.  When he reached the village I sat with him.  I said, \"You have lost a leg, an arm and one eye.  You must have a mighty will to live.\"  He said, \"No, Lord, it's just better than the alternative.\"", " Life is a gift from our fathers to us.  Who are you to give it up for lack of lifting a spoon?", " I never though it would be so easy to kill.", " So you're finally home.", " Among my people we honor the soil of our home.  Our ancestors are in that soil.  All their dreams live there. I will never see my home again.  The soil is dead and no one honors them, so the dreams die.", " Go!  Bring us the army!"], "SLAVE TRADER": [" Proximo, my old friend, see what I have for you today -- !", " I will make it up to you, Master. It's bargain day for you!  Look, look, look -- I have two lions and a panther -- hear how they roar for you!  \"Bring me home, Proximo!\"", " For you -- 8,000 sesterces.", " What about this one?  Look at the arms!", " 1,000 sesterces.", " I have to eat, Master!  He's my finest, I couldn't let him go as part of the lot for less than 9,000 total... I tell you this one is prime.  He's a Spaniard and killed fourteen of my men before he could be subdued!", " STOP!  STOP!", " No -- no -- 1,000!", " How could I say no to my old friend Proximo?"], "PROXIMO": [" Those giraffes you sold me won't mate!", " How much for the lot?", " For me -- 6,000 sesterces and I want to see their balls first.  And you throw in those two slaves.", " Good teeth --", " My ass... You throw in this one and we'll make it 7,000 sesterces for the whole lot.", " All right, let's see.", " I'll give you 500 sesterces.", " Come, don't quibble with your old friend.  I'll take the lions, the panther, the Numidian and this one for 7,000.  And I'll buy you the best whore in the town for two nights.  She's an enormous mountain of flesh who craves a stern hand.", " COME ON, YOU FILTHY BEAST!", " Don't worry, noble Vibius, he won't be bothering you for long.", " Some of you say you can't fight, you won't fight... They all say that... But one day you will pick up a sword and thrust it into another man.  And the crowd will cheer you and love you.  And you will love them for it. On that day... you will be a gladiator.", " Make it 600 sesterces for each decapitation.", " Two.", " Done. strokes.", " A Greek Scribe.", " Give me odds, friend.", " I've wagered on you against the Celts -- ignore the others and go for them -- there are two axe-and- net and two long spear.  Now the Celts aren't used to the sun so you have the advantage there...", " Butterfly?", " And nothing more?", " In two days we leave for Rome.", " Oh yes.  He's apparently quite mad about the games.  Spending a fortune, which is, needless to say, good for me again.  But what is good for you, Gladiator?", " As a gladiator?", " One doesn't.", " He did to me... Our great father Marcus Aurelius looked into my eyes and touched me on the shoulder.", " I didn't know him.  He touched me on the shoulder.  Just once.  But that was enough.", " Stop that!  You'll get some monstrous disease and then you'll be worth nothing to me!", " No -- have pity, Cassius -- !", " I won't do it for less than 100,000 sesterces -- !", " I won't throw my Spaniard into a spectacle!  Damn you and damn the rotation!", " I give you 30,000 my Spaniard will kill at least one of your Thracians.", " Then make the wager, you smug bastard!", " All right -- there are three other teams, four men each -- You know what a Thracian looks like?", " Ignore the others -- go for the Thracians.  The sun is to the east - - over the gate -- keep your back to the gate and you won't have the sun.", " Hurry -- !", " Enjoy yourself, Madame...", " Gods!  That old Homicide!  The Emperor must truly hate you.", " He cheats.", " Captain.", " All that was a long time ago.  Too much wine and too many women.  And too much money.", " This is who I am... You see?", " Yes.", " You might have spared yourself the speech, General.  The lady Lucilla bought all my gladiators two hours ago!", " I am the richest trainer in the Empire!", " A third.  And not a hair more.  And you'll have to start in the provinces!  Cleaning up the lion shit!", " Release them!  Release them all! ARM THEM!", " If you want to live -- follow me --", " All the old gladiator schools have tunnels to the Colosseum -- most have long since collapsed --", " Quickly --", " Down that corridor is the butchery - - the blood sloughs lead to the Tiber.  Gods watch over you.", " They are killing my men!", " Gods... they're killing them all.", " This way!"], "PROXIMO(cont'd)": [" All they do is run around not mating!  YOU SOLD ME EUNUCH GIRAFFES!!", " He's dying.", " Fight well and you will live. Fight poorly and you will die.  It is better to live.", " Personally, I'd grab them all and then grab some more because the Gods are fanciful and take us at their whim.  Does the Spaniard have any needs?", " General, perform well and there will be riches for you.", " There was a time I would stand against ten men and never give an inch, spitting into the jaws of Hades all the while.  There was a time my heart swelled to strap on the armor of Rome.  But now...", " And I will let my gladiators do anything you like! Conspire away, General!"], "PROXIMO (cont’d)": [" Where did you get those scars?", " Are you a soldier?", " Do you speak? -- KEEP THOSE DAMN FLIES OFF ME!", " That's enough.", " Slaves.  I am Proximo, trainer of gladiators.  You live and die at my pleasure.", " Here you will be trained in the art of combat.  Here you will be given the tools to survive.  Please my patrons in the arena and all the gifts of the world will be showered upon you.  Imagine riches beyond your paltry dreams of riches! Imagine fame beyond your rude understanding of the word!  All this can belong to the select few who prove their worth in the arena.", " If... on the other hand... you disappoint me... you will be dismembered and fed to my jackals limb by limb.", " And my jackals are always hungry.", " In this life, we all die.  All we can choose is how we die.  And how we are remembered.  Be remembered proudly.", " No... ... give the Spaniard to him.  Give the Scribe to Vibius.", " And keep them moving, their lungs aren't strong, ground the spears as soon as you can and then go for the ax-men.  If you get all four there's an extra bonus so don't be distracted by the Spartans...", " Perhaps you'd like a woman?", " Boy?", " Gold?", " Well, I have nothing left to offer you!  A man who turns down a butterfly, a woman, a boy and gold confuses me.", " You fight like a soldier.  You have wounds like a soldier who has been on long campaigns.  You eye the world around you like an enemy. What is your name, Roman soldier?", " Ah... so it's Rome you want.  Well you shall have her, Gladiator.  The new Emperor has ordered a series of matches to culminate in a grand spectacle.  If you do well I shall become very, very rich.  If you do well enough I shall set you free. Is it freedom you want?", " Not even that.", " Except... If one has proven oneself in battle.  If at the end of the games you are the final man standing -- the Emperor will present you with a small wooden sword.  The sword is your freedom.", " All right, Gladiator.  We shall go to Rome together and have bloody adventures.  The Great Whore will suckle us until we are fat and happy and can't suck another drop. That is Rome.", " Die well and we'll sing songs about you for a generation.", " How did you know?", " Now I am just an entertainer.", " But I tell you -- if you survive this madness I want you to go into business with me.  I'll give you a quarter of my holdings.", " Come --"], "SCRIBE": [" I know nothing of armaments and warfare!  I'm a scribe -- I write down words!  I can write down seven languages --", " I don't -- how do you hold the sword?!  I've never held a sword!", " I can't -- I --"], "VIBIUS": [" Be still.", " You point the sharp end at your opponent and you shove it in his guts.", " Proximo!  You insult me with this carrion!  Chain him to someone else!", " MOVE ASIDE!  THIS IS A TABLE FOR MEN!", " Not what you expected?", " Rome is nothing but a slaughter house.  And we are the meat.", " Tradition.  He watches over us.", " You didn't kill him.", " We'll be killed.", " You didn't know my ancestors.  A rotten bunch.", " If I die, I want a hundred whores at my funeral.", " Go, Spaniard!  We'll show these Roman dogs how gladiators fight!"], "CHILDREN": [" Dead guts!  Dead guts!  Dead guts!"], "TRAINER #1": [" How many strokes?", " For the great Vibius, one stroke.", " Who's he with?", " I'll raise the wager.", " You promised me a bear match, Cassius!"], "GRACCHUS": [" We have plague in the Hebrew Quarter and it is spreading... we have looting at the granaries... we have so much filth in the Tiber that the water is undrinkable... we have Praetorian Guard units that are demanding protection payments from the merchants at the exchange - -", " Rome dies as the Emperor plays at beneficence.  At least Nero gave us music!", " It is his duty to hear the will of the Senate.", " Darling children, to be sure, now if I may proceed?", " Caesar, your presence in Rome is an invaluable opportunity to begin correcting some of the ills that have beset the city since your father went to the wars.  We would like to --", " With respect, sire, the people don't need love -- they need law. The Senate has prepared a series of protocols to begin addressing the corruption in the city -- -- starting with basic sanitation in the Hebrew Quarter.  If Caesar could study this and --", " The Senate is the people.", " Have you ever embraced someone dying of plague, sire?", " You want to hold games?", " If I may, Caesar... how are you going to pay for this?", " Respectfully, sire, taxation and import duties are the exclusive province of the Senate --", " No... it's not...", " We've taking a sounding, the Senate is with us.", " But we are only words.  We are air. We need steel.", " Well, can they at least be rented for a day?", " Lucilla, Gaius is right.  Until the City Guard can neutralize the Praetorians we can accomplish nothing.", " For you prince Lucius... a sea monster!", " Show me on the map.", " You're welcome, Prince Anthill!", " Peace child... One dark night the Gods will light our path.  They will give us the voice we need. Have faith in that.  Have faith.", " About half.  But once the tyrant is dead.  All.", " We should fear for the blackest storm.", " I only have one question for you, General... Why?", " That's not the reason.  Tell me the truth.", " I knew the old man well.  And I loved him very much.  In our youth we would spend hours building that dream together.  After he went to the wars and lost his way... I was very cruel.  I tormented him to remember that dream we spoke of.", " You can have no idea how much that means to me.", " General, the purple is yours if you so desire.  The Senate will support you."], "MARCELLUS": [" My City Guard units have tried to curtail these excesses but no constabulary can police the entire city.  And the Praetorians outnumber us two to one.", " Games?  He wants to hold games?", " The City Guard is faithful to the Republic.  But we don't stand a chance against the Praetorians.", " They are zealots -- totally committed to your brother.", " I doubt it.  He pays them exorbitant salaries and lets them loot and extort as they see fit. The city belongs to them.", " And mathematicians and Christians. All to fill the arena.", " That can't be true...", " Rome must know this.", " And I haven't enough men."], "GRACCHUS (cont’d)": [" Not to mention the damn traffic!", " He knows who Rome is.  Rome is the mob.  He will conjure magic for them and they will be distracted. And he will takes their lives.  And he will take their freedom.  And still they will roar.  The beating heart of Rome isn't the marble of the Senate. It's the sand of the Colosseum.  He will give them death.  And they will love him for it.", " Off the coast of Achaea they grow twenty times this size, with snapping teeth to devour any nasty Praetorians they come across... now, where is Achaea?", " I want to meet him.", " You will lead an army of your brothers on Rome.  Many will die. Why?", " Any man who will die for a whispered dream deserves my respect.  I honor you, General."], "CHILD": [" We honor Caesar with the laurel to show our love and appreciation for his benevolence."], "COMMODUS(cont'd)": [" At books and learning and philosophy...", " You shall watch as I bathe in their blood.\"  And the bee knew he spoke the truth, for the Emperor always speaks the truth.  And what do you think happened then, Lucius?", " I shall give you the rebirth of your Empire!  Reborn and cleansed of her enemies!"], "LUCIUS' VOICE": [" Mother...", " Is it true you're a General...?"], "LUCIUS": [" I heard voices...", " Senator!  What did you bring me?!", " Below Macedonia!", " Thank you, Senator Mountain!", " I saw you fight.  The Carthage battle too.  I've never seen so much courage.", " My father was killed.", " He still comes to me in my dreams. Do you have a father?", " I hope he comes to you in your dreams.  My father and I ride horses in mine.", " I've been reading too.", " She killed herself with a snake!", " I don't know, Uncle.", " What is that fire?"], "VIBIUS (cont’d)": [" Oh go on, it won't kill you."], "CASSIUS": [" ... and the Emperor will have no more animal battles today --", " Talk to the man in the imperial box. Who has the next slot...? -- Lentulus, Gideon, Trebonius and Proximo -- -- Nice to have you back, you piratical bastard -- now listen, the Emperor wants the Carthage spectacle.", " You give us the Carthage match or lose your spot on the rotation -- but don't worry -- gold is flowing from the Emperor's fingers.", " And I want to see this famous Spaniard of yours -- his reputation soars from the provinces.  The people are eager for him --", " You will and the price will be 90,000 sesterces each -- -- which you all know is exorbitant -- AND IF YOU EXTORTING BLOOD- WHORES TRY TO PAWN OFF LESSER FIGHTERS ON ME I WILL SEE YOU DEAD IN THE ARENA TOMORROW!", " Give me your best, brothers.  They die before Caesar.", " This day we reach back to hallowed antiquity to bring you... THE FALL OF MIGHTY CARTHAGE...! ... On the barren armies of the barbarian Hannibal!  Ferocious mercenaries and warriors of all brute nations bent on merciless conquest!  Your Emperor is pleased to give you... THE BARBARIAN HORDE!", " ... in his majestic charity the Emperor has deigned to this day favor the people of Rome with an historical final match.  Returning to the Colosseum today... after five years in retirement... Caesar is pleased to bring you... THE ONLY UNDEFEATED CHAMPION IN ROMAN HISTORY... ... THE LEGENDARY... TIGER OF GAUL!!", " And from the rocky promontories and martial bloodlines of Spain..."], "TRAINER #2": [" I have ten damned gorillas!  You said gorillas yesterday!"], "TRAINER #3": [" My men are too good for -- !", " It'll cost you --"], "TRAINER #4": [" 120,000!  All I have is my best Thracians!", " My Thracians are worth -- !", " 30,000?!  On a Spaniard?!  That provincial sun has curdled your brain!"], "CASSIUS (cont’d)": [" But on that illustrious day the Gods sent against them Rome's greatest warriors...!"], "CASSIUS(cont'd)": [" The very life-image of nobility and glorious valor... who would on this day, and on these same arid Numidian deserts, decide THE FATE OF THE EMPIRE... Your Emperor is pleased to give you... THE LEGIONNAIRES OF SCIPIO AFRICANUS!!", " representing the training lyceum of Proximo Antoninus... I give you... THE WARRIOR MAXIMUS!"], "LUCILLA(cont'd)": [" One night my father had him strangled for conspiring with the Senate.  My father never spoke of it.  I never spoke of it.  That is what it is to be the daughter of Rome."], "MAXIMUS AND TIGER": [" We who are about to die salute you."], "KIDS": [" Maximus the Merciful!  Maximus the Merciful!"], "CENTURION": [" Madame, the Emperor would like to see you."], "MAXIMUS(cont'd)": [" As the Colosseum goes, the people go.  As the people go, the Empire goes.", " Once inside, my archers will take up position to counter opposition inside the Colosseum.  I'll enter and join you -- we'll attack here --", " Help the Senate speak for you. Make them your champion... And dare to think what could be."], "HANDMAIDEN": [" She's out, sir...", " I... don't know, Caesar."], "PRAETORIAN": [" Caesar..."], "CENTURION BODY GUARD": [" Caesar -- we must go -- !", " THIS WAY, CAESAR!"], "THE END": [""]}