{"ALAN TURING": [" Are you paying attention?", " Good. This is going to go very quickly now. If you are not listening carefully, you will miss things. Important things. You’re writing some of this down? That’s good. - someone has given it a pretty thorough once-over.", " I will not pause, I will not repeat myself, and you will not interrupt me. If you ask me a question, I will ignore it. You think that because you’re sitting where you are, and I am sitting where I am, that you are in control of what is about to happen. You’re mistaken. I am in control, because I know things that you do not know.", " What I will need from you now is a commitment. You will listen closely, and you will not judge me.", " When I am finished — when I have told you that I am finished — you are free to think whatever you like. But until then, you will trust that while this story will be hard for you to understand, everything I am saying I am saying for a reason.", " If you cannot commit to this, then please leave the room. That’s right, you’re the one who’s free to go. But if you choose to stay, if you choose to listen, remember this: If things happen that you do not like, you chose to be here.", " What happens from this moment forward is not my responsibility: It’s yours.", " This will go quite fast now. And that is the last time I will repeat myself. Pay attention.", " — I would step back, if I were you.", " Step back, and don’t breathe so much.", " You’re breathing heavily and you’re going to inhale this junk and you’re going to leave your collicky son without a father.", " Sound carries in this house.", " Cyanide. Undiluted. Wouldn’t take more than a thimbleful to kill you.", " Oh. Disappointing.", " I’d hoped for a bit more.", " You lied to your friend here about your son, which is just unseemly. Collick didn’t keep you up all night. Drink did. You’ve bags under your eyes the size of strawberries. Your topcoat reeks of whiskey. You’re short of breath after walking Manchester United had a match yesterday, yes? I could hear the shouting from Simpson’s on my way home.", " Gentlemen, I don’t think you could figure out who broke into my house if he walked up and spat in your face. What I could really use at the moment is not a bobby but a good cleaning lady. So unless one of you has an apron in your car, I’d suggest that you file your reports and leave me alone.", " The girl told me to wait —", " No. She didn’t.", " Was she supposed to?", " Alan Turing.", " Correct.", " You didn’t. It was written on your paper.", " I’m not sure I can evaluate that, Mr...", " 27.", " 24.", " 23.", " Rather depends on how old my peers were when they did comparable work, doesn’t it?", " Newton discovered the binomial theorem at four papers that changed the world at 26. As far as I can tell I’ve barely made par.", " Would you prefer I make a joke?", " It hardly seems fair that that would be a requirement for employment here, Mr...?", " Oh, I don’t, really.", " I’m agnostic about violence.", " Politics is not my area of expertise.", " Mother says that I can be off- putting sometimes. On account of being the best mathematician in the world.", " Oh. Yes.", " No.", " I don’t speak German.", " I don’t. Speak German.", " I’m quite excellent at crossword puzzles.", " The German codes are a puzzle. A game. Just like any other game.", " I’m very good at games. Puzzles. And I think this is the hardest puzzle in the world.", " I’m afraid I can’t make jokes, Commander Denniston.", " Enigma.", " ... That’s what you’re doing here. The top secret program at Bletchley. You’re trying to break the German Enigma machine.", " It’s the greatest encryption device in history, and the Germans use it for all major communications.", " Goody! Let me try and we’ll know for sure.", " It’s beautiful.", " — It’s not that simple, is it? Just having an Enigma machine doesn’t help you decode the messages.", " Five rotors. Six plugboard cables. That’s...", " — Over one hundred and fifty million million million possible settings.", " Are we all to work together then? I prefer to have my own office.", " I don’t have time to explain myself as I go along, and I’m afraid these men will only slow me down.", " I don’t.", " The problem began, of course, with the carrots.", " Carrots are orange. Peas are green. They mustn’t touch.", " Do you know why people like violence? Because it feels good.", " Humans find violence deeply satisfying. But remove the satisfaction, and the act becomes... Hollow.", " I didn’t learn this on my own though. I had help.", " Christopher helped.", " The game was quite a simple one.", " Every single German message. Every surprise attack. Every bombing run. Every imminent U-boat assault. They were all floating through the air, radio signals that any schoolboy with an AM kit could intercept.", " The trick was that they were encrypted.", " One hundred and fifty nine million million million possible Enigma settings. All we had to do was try each one.", " But if we had 10 men checking one setting a minute, for every day and seven days every week, it would take... Well, you tell me. How many days would it take to check each of the settings?", " ... Would you like a hint? It’s not days. It’s years.", " Oh dear, you still haven’t worked it out, have you? Pity you didn’t pay more attention in school. It’s 20 million years.", " To stop a coming attack, we would have to check worth of settings... In", " Yes.", " Yes.", " Yes.", " What is?", " No you didn’t. You told me you were getting lunch.", " Why would you think that?", " When is lunchtime?", " What is?", " I don’t like sandwiches.", " How?", " You have?", " Oh. Even a broken clock is right twice a day. That’s not progress at all, that’s just blind luck. I’m designing a machine that will allow us to break every message, every day, instantly.", " I’m hungry.", " Peter asked if anyone was hungry. I am. May I have some soup, please?", " This is unacceptable.", " Complaint? Hugh Alexander has denied my requisition. Parts and equipment, to build the machine I’ve designed.", " It’s inspired by an old Polish code machine, only infinitely more advanced.", " Fine. My response is, they are all idiots. Fire them and use the savings to fund my machine. I’ll only need about a hundred thousand pounds.", " It’s highly technical. You wouldn’t understand.", " ... Enigma is a machine. A very well-designed machine. Our problem is that we’re trying to beat it with men. What if only a machine can defeat another machine?", " I do not have time for this —", " Who is your commanding officer?", " Mr. Menzies! You’re headed back to London, yes?", " Will you deliver a letter for me?", " — Really? I can give these men orders now?", " Fantastic. Keith and Charles. You’re both fired.", " You’re mediocre linguists and positively poor codebreakers.", " He just said I could.", " We get more staff.", " All sorts, really. A school teacher. An engineer. A handful of students.", " Well, they say they’re good. Now we should probably find out.", " ... You’ll have six minutes to complete the puzzle, at which point—", " May I continue, please?", " May I please get on with this?", " What is going on here?", " — Miss Clarke. I find tardiness unacceptable under any circumstance. Now take a seat, so we may continue.", " Oh for God’s sake — No.", " Miss Clarke. You now have the distinct honor of having wasted more of my time than any other person in this room. Quiet. Gentlemen. And lady. You have six minutes. Begin.", " No. It takes me eight. But this test isn’t about crosswords about how you approach solving an impossible problem. Do you take the whole thing at once? Do you divide it into smaller", " You’ve finished?", "", " We’re going to break an unbreakable Nazi code and win the war.", " Goodnight.", " Careful! Damn it, will you — It’s not a toy.", " ... Where’s Miss Clarke?", " — Well it’s a very important radio factory you see. It’s not really — I mean along the spectrum of radio factories this one is particularly—", " Hello.", " ... Why aren’t you at Bletchley?", " Gather your things and let’s go.", " And why not?", " You earned a double-first in mathematics.", " You belong at Bletchley.", " What in the world does that even —", " ... We have a group of young women who tend to our clerical tasks. Assistants, translators. They live together in town. Would that be a more suitable environment?", " Yes.", " ... Wonderful ladies, they even organize social events at St Martin’s church, down the road. The whole thing is really quite... Decorous.", " You won’t have the proper clearance, so we’ll have to improvise a bit.", " There is only one thing that matters in this entire world, do you understand? Breaking Enigma.", " ... Sometimes it is the very people who no one imagines anything of who do the things that no one can imagine.", " My machine is how we’re going to win.", " Stop.", " No no don’t —", " My machine will work.", " ... It’ll work.", " Sorry.", " These are actual decrypted Enigma messages, direct from Nazi high command.", " It’s the relationship between the encrypted and decrypted messages that interests me. Is there a clue there that we can build into Christopher?", " Oh. He’s my machine.", " Is that a bad name?", " They’re teaching it already?", " Human beings can compute large sums very quickly. Even Hugh can do that. I want Christopher to be... Smarter. To make a calculation, and then to determine what to do next. Like a person does. Think of it: An electrical brain. A digital computer.", " I’ll show you —", " I’m so sorry.", " Right.", " Really?", " Hey! Don’t touch that!", " That’s my desk.", " What are you doing?", " Why?", " ... This is a Beale Cypher. It’s encrypted with a key phrase, from a book or a poem or... Which one of them did this?", " I’m not a double agent.", " I know you don’t like me... But you don’t think I could actually be a spy, do you?", " No.", " I told you not to do that.", " Hello.", " What? No. Of course not.", " I’m not a Soviet spy.", " Hugh. I swear. I’m not a spy.", " What?", " She’s assisting me with some calculations.", " Thank you.", " ... He likes you.", " You got him to like you.", " Why?", " ... How should I get them to like me?", " Apples.", " No, they really are... I... Joan told me it’d be nice to bring you all something.", " ... There are two fellows in the woods. And they run into a bear. The first fellow, he kneels down and starts to pray. But the second one, he begins lacing up his boots. The first one says, what’re you doing? You can’t outrun a bear.” And the second one responds, “I don’t have to. I only have to outrun you.”", " I’ll be with Christopher if anyone needs me.", " No, Sir.", " ... This is actually not an entirely terrible idea.", " That’s my sandwich.", " It should tell us the day’s Enigma settings!!", " No!!!", " I cannot let you in!! I cannot let you interfere!!!", " It does.", " It works... It was just... Still working.", " You will never understand the importance of what I’ve created here.", " ... Thank you.", " Christopher is simply not moving fast enough.", " Even with the diagonal board he’s not eliminating settings as quickly as —", " You just walked in.", " What?", " That’s ridiculous.", " You cannot leave. I won’t let you.", " I don’t care what’s normal.", " No. This is unacceptable. You are not leaving and that is that.", " You have the opportunity here to make some actual use of your life —", " I want you to stay because I like you.", " I like talking to you.", " What if you weren’t living alone... If you had a husband?", " I do.", " I wasn’t referring to Hugh.", " This makes sense.", " It’s the logical thing to do.", " This is your parents.", " Joan Ca... Wait, is your middle name Caroline or Catherine?", " Joan Elizabeth Clarke, will you marry me?", " ... What if I don’t fancy... being with Joan in that way?", " Should I tell Joan? I’ve had affairs. With other men.", " Having children, a family... I want that with her. I do. I just don’t know if I can... Pretend...", " ... I know.", " Thanks, no.", " I’m quite good with those.", " Clearly.", " You’ve read my published work.", " Because I’m sitting in a police station, accused of entreating a young man to touch my penis, and you’re asking me whether machines can think.", " Most people say no.", " The problem is that you’re asking a stupid question.", " Of course machines can’t think human beings do.” A machine is different from a human being; hence, it would think differently. The interesting question is, just because something thinks differently from you, does that mean it’s not thinking? We allow that humans have such divergences from one another. You like strawberries. I hate ice-skating. You cry at sad films. I’m allergic to pollen. What does it mean to have different tastes preferences that our brains work differently? That we think differently from one another? And if we can say that about each another, why can’t we say the same for brains made of copper and steel?", " “The Imitation Game.”", " ... Would you like to play?", " The game. It’s a test, of sorts. For determining whether something is a machine, or a human being.", " There’s a judge, and a subject. The judge asks questions, and based on the subject’s answers, he determines: Who is he speaking with? What is he speaking with? All you have to do is ask me a question.", " I worked in a radio factory.", " ... Are you paying attention?", " It’s searching... It’s just... It doesn’t know what it’s searching for... If only we knew what the messages were going to say...", " Helen? Works with Joan in the WREN’s hut.", " How can you possibly know that?", " Why me?", " No I don’t —", " I’m flattered, but this is not actually", " How do you mean you work alongside a German?", " HELEN!!!", " Why do you think your German counterpart has a girlfriend?", " Tell me.", " That’s impossible. The Germans are instructed to choose five letters at random to start every message.", " — In this case, love just lost the Germans the whole bloody war.", " What if Christopher doesn’t have to search through all the settings? What if he only had to search the ones that produce the words we already know will be in the message?", " Yes! That’s it! They send a weather report at 6AM. Every day. That means there are three words we already know will be in the obviously, and", " Heil bloody Hitler.", " Hugh — the right hand letter-rings. Set them to —", " — Peter, John — Run voltage from those rings through the back scramblers —", " — Yes. Joan, what’s the last 6am message?", " Give me a fresh message. The last one we intercepted.", " Turns out that’s the only German you need to know to break Enigma.", " No.", " No. No.", " NO.", " NO!!!", " No. No. You can’t call Denniston. You can’t tell him about the attack.", " No. Let the U-Boats sink the convoy.", " Do you know why people like violence, Hugh? Because it feels good. It would feel good to blow those U- Boats out of the Atlantic. But sometimes we can’t do what feels good. We have to do what’s logical.", " The hardest time to lie is when the other person is expecting to be lied to.", " If they’re waiting for a lie, you can’t just give them one.", " What will the Germans think if we destroy those U-Boats?", " Suddenly our convoy veers off course and a fleet of RAF bombers magically descends on the location of a pack of U-Boats? What will the Germans think?", " Two years of work. Everything we’ve done here. It’ll all be for nothing.", " Our job wasn’t to save one passenger convoy. It was to win the war.", " Done. Now for the hard part: keeping it a secret. Forever.", " So?", " I’m sorry.", " It’s not my fault.", " I’m so sorry.", " Yes, we do.", " Because no one else can.", " We need your help to keep this from the Admiralty. Army. RAF. No one can know we broke Enigma, not even Denniston.", " While we develop a system for determining how much intelligence to act on. Which attacks to stop, which to let through. Statistical analysis. The minimum number of actions it’ll take to win the war, but the maximum number we’re able to take before the Germans get suspicious.", " Correct.", " We’ll require a believable alternate source for each piece of information we use.", " And the rest of our military.", " They codenamed it", " And it quickly became the largest store of military intelligence in the history of the world.", " It was like having a tap on Himmler’s intercom.", " Secrecy became the primary concern. And for some reason they trusted me.", " Peter, do you have the 9:30 decrypts", " I’ll tell Denniston.", " I need to speak to Menzies", " Joan! Joan! Are you there?", " — Joan?!?", " Joan, are you okay? Where are you?", " Where’s Joan?", " What have you done?", " I gave those to her. A year ago. When she was with the clerks I was—", " I know who the Soviet agent is. It’s not Joan.", " ... I found the bible... The spy is John Cairncross.", " You knew Cairncross was the spy?", " You placed a Soviet agent at Bletchley?", " I’m not a spy. I’m just a mathematician.", " You must promise to get Joan out of prison.", " ... I need you to leave Bletchley.", " Menzies. I don’t trust...", " ... I don’t think it’s safe here.", " You need to leave, and you need to get very far away from me.", " ... We can’t be engaged anymore. Your parents will have to take you back and find you a husband elsewhere.", " ... There’s something I have to tell you. I’m... I’m a homosexual.", " Men, Joan. Not women.", " I just said —", " I don’t.", " Care for you. I never did. I only needed you to break Enigma. And now I’ve done it, so you can leave.", " The war dragged on for another two solitary years.", " Every day we performed our blood- soaked calculus. Every day we decided who lived and who died. And every day we guided the Allied armies to victory without anyone knowing.", " Stalingrad? The Ardennes? Normandy? None of those victories would have been possible without the intelligence we produced.", " People talk about the war as this epic battle between civilizations. Good versus evil, liberty versus tyranny. Armies of millions bleeding into the mud, fleets of ships that weighed down the oceans, packs of airplanes that dropped bombs until they blotted out the sun itself. But it wasn’t.", " The war was really just a half- dozen crossword enthusiasts in a tiny village in the south of England.", " Was I God? No. Because God didn’t win the war. I did.", " This war is over. But there will be more. And we know how to break a code that everyone else thinks is unbreakable.", " That’s the Imitation Game.", " Now, Detective, you get to judge. That’s how the game works. I answered your questions. You know my story. That’s the point of the game. We are all pretending to be something. Imitating something. Someone. And we are no more, and no less, than what we can convince other people that we are. So tell me: What am I? Am I a person? Am I a machine? Am I a war hero? Am I a criminal?", " Well then you’re no help to me at all.", " And what would you have said? That I wasn’t a homosexual?", " Damn it...", " No I’m not.", " ... It’s the medication.", " I have to go in for weekly oestrogen treatments. At the hospital.", " The judge gave me a choice. Prison. Or", " — Chemical castration. Yes. To cure my homosexual predilections. Of course I chose that. I wouldn’t be able to work from prison.", " Well how would I even have got parts in jail? It just makes no sense.", " No.", " — I’m fine.", " I don’t need your help.", " Alone? I’m not alone. I never have been.", " ... Christopher has got so smart. If I stop the treatment, they’ll take him away from me. You can’t let them do that. You can’t. Don’t let them leave me alone.", " ... It’s a much nicer ring than the one I got you.", " ... Perhaps later.", " ... At least it worked out for one of us.", " Is that what you think?", " Well then.", " Any questions?"], "SGT. STAEHL": [" Bit late, don’t you think?", " Turing, Alan. Professor at King’s. Seems there’s been a robbery.", " That’s just it. Nothing’s missing, really.", " Maths. Or, as he put it, “ordinal logic, with a dose of number theory.”", " Something with machines. Project at the NPL, I checked, but he won’t say what it’s on.", " That’s putting it mildly.", " You had a break in last night. Your neighbor, a Mr. Springborn, called to report the noise. Only you say there’s nothing missing. Odd. So how about it — You tell us what happened, and we find the chap who did this.", " I’ll give you a bob if you can name me a more insufferable sod.", " Oh, you’ve a soft spot for the bastard your drink? Which, while we’re on the subject", " Don’t know what you mean.", " I don’t think this is suspicious.", " What’re you suggesting?", " ... So are you going to catch this mysterious thief who hasn’t actually stolen anything?", " “Suspect”? I distinctly recall writing his name next to the word “victim.” (which we don’t) in the reflection of a shop", " Yes?", " What?", " What is wrong with you?", " ... Whose is this?", " ... That man you knocked over! You stole his billfold.", " ... Oh. Bob?", " There’s a photograph of you.", " That man was following you.", " Good God... Your home address, your district, your... Bob, there is a letter here from the Foreign Office.", " Bugger off.", " Why are you being followed? We have to call this in."], "DETECTIVE NOCK": [" The baby. Up all night, hollering and crying. June says it’s collick. What’s all this, then?", " What of?", " No, what’s he a professor of?", " What’s he doing in Manchester?", " He’s a bit squirrely then, our Professor Turing?", " Professor Turing? Professor Turing? My name is Detective Nock. Manchester Police. Sergeant Staehl here tells me you’ve had a robbery last night. Professor Turing?", " Professor", " Pardon me?", " Breathe?", " What is all that?", " Pardon?", " Sergeant Staehl, is it just me, or do you get the sense that we’re being insulted?", " ... We won by four. Would’ve been unseemly not to celebrate.", " ... As you say, Professor Turing. Best of luck with your cyanide.", " Curious, isn’t he?", " — Seemed a bit forced though, didn’t it?", " If you didn’t want a pair of bobbies digging around in your personal affairs, well, that would have been a stellar way to see that they don’t. Tell me you don’t think this is suspicious.", " A mysterious professor who won’t admit he’s had something stolen from his flat?", " I’m suggesting that Alan Turing is hiding something.", " ... What do you mean, ... Yes, I am aware of the literal meaning of the word what I’m asking is why would a maths professor have his military records classified? ... Well then I will come down there and...", " Come with me.", " Alan Turing is a suspect in a robbery but they won’t share a thing with the police?", " Will?", " I’m terribly sorry about this.", " Oww! Would you stop it?", " Here.", " Yes?", " Has been for awhile now.", " I think I might have a better idea.", " Pardon me. I’d like to see some documents, if I may. Service records of a Mr. Turing. Alan.", " Foreign Office sent me.", " Alan Turing’s classified military file.", " Exactly.", " Yes.", " Alan Turing’s war records aren’t just classified. They’re non- existent. That means someone got rid of them. Erased them, burned them.", " What if Turing wasn’t just a math professor?", " Guy Burgess and Donald Maclean.", " The Soviet spies. But first, they were professors, weren’t they? Newspapers say they became radicalized at Cambridge. Then they joined the Communist Party, took positions in the Foreign Office and leaked information to Stalin during the war. Now, can you think of anyone else we know who was at Cambridge, then took up something murky and top secret when the war broke out?", " Something very serious is happening, right here under our noses. Wouldn’t you like to find out what it is?", " He said alright. Let’s do it. Let’s follow Turing. You’ll take the first shift. Turing won’t have a secret left by the time we’re through with him.", " What?", " No.", " No, it’s not.", " No. No. This is bloody rubbish. Turing is up to something important, not getting his jollies in some pub.", " I don’t care if it’s disgusting. This is not the investigation I was conducting.", " Wait. Let me interrogate him.", " Please. I know him. I know he’s hiding something and I know I can get him to talk... Give me half an hour alone and then I swear to you I will spend the next month running errands on as many rubbish cases as you like.", " Cup of tea?", " ... Mr. Turing, may I tell you a secret?", " I’m here to help you.", " ... Can machines think?", " What makes you say that?", " Can they? Could machines ever think as human beings do?", " You’re not most people.", " I am?", " That’s... This big paper you wrote... What’s it called?", " Right. That’s what it’s about?", " Play?", " How do we play?", " ... What did you do during the war?", " What did you really do during the war?", " That’s... Unbelievable.", " I don’t know what to do now.", " I can’t judge you.", " Cyanide. You’ll find a tub of it downstairs. “Turing Machines.” Today, we call them 1990, John Cairncross publicly confessed to having 2013, Turing was granted an official pardon by the"], "—": ["", "", "", "", "", "", ""], "COMMANDER DENNISTON": [" — What are you doing here?", " In my office? She tell you to help yourself to a cup of tea while you were here?", " She didn’t tell you what a joke is then either, I gather.", " For Christ’s sake", " Turing... Let me see... Oh, Turing. The mathematician.", " How ever could I have guessed?", " ... King’s College, Cambridge. Says here you were a bit of a prodigy in the maths department.", " How old are you, Mr. Turing?", " How old were you when you became a fellow at Cambridge?", " And how old were you when you published this paper here, that has a title I can barely understand, which apparently got you this fellowship?", " And you don’t think that qualifies you as a certified prodigy?", " And how old were they?", " You’re serious, aren’t you?", " Not sure you know what those are.", " Commander Denniston, of the Royal Navy. All right, Mr. Turing, I’ll bite. Why do you want to work for His Majesty’s government?", " Are you a bleeding pacifist, Turing?", " But you realize that London there’s this nasty chap named Hitler who’s looking to engulf Europe in tyranny?", " I believe you’ve just set a record for the shortest job interview in British military history.", " You’re the best mathematician in the world?", " ... Do you know how many people I’ve rejected for this program?", " That’s right. Because we’re a top secret program. But I’ll tell you, just because we’re friends, that last week I rejected one of our great nation’s top linguists, knows German better than Bertolt Brecht.", " What?", " How the bloody hell are you supposed to decrypt German communications if you don’t, oh, I don’t know, speak German?", " MARGARET!", " MARGARET! Where are you?!", " MARGARET!?! For the love of... This is a joke, obviously.", " Have a pleasant trip back to Cambridge, Professor.", " What makes you think that?", " Enigma isn’t difficult. It’s impossible. The Americans. The French. The Russians. The Germans. Everyone thinks Enigma is unbreakable.", " Welcome to Enigma.", " The German navy encodes every message they send using the Enigma machine. The details of every surprise attack, of every secret convoy, of every U-Boat in the bloody Atlantic go into that thing, and out comes... Gibberish.", " It’s the crooked hand of death itself.", " Our WRENs intercept thousands of radio messages a day. But to the lovely young ladies of the Women’s Royal Navy, they’re nonsense. It’s only when you feed them back into Enigma that they make sense.", " Yes. Polish intelligence smuggled this out of Berlin.", " Very good, Mr. Turing. To decode a message, you need to know the machine’s settings. The Germans switch settings every day, promptly at midnight. We usually intercept our first message around gives you exactly day to crack the code before it changes, and you start again.", " ... Very good.", " Gentlemen, meet Hugh Alexander. I’ve personally selected him to run this unit.", " Mr. Alexander won Britain’s national chess championship.", " You’re not the only one who’s good at games around here.", " You’re a team, and you’ll work as one.", " This is Stuart Menzies. MI-6.", " Turing. If you’d like to discuss the complaint, I’d suggest making a proper appointment with my office.", " Your fellow codebreakers are refusing to work with you. They’ve filed a formal complaint.", " If you don’t respond to the complaint, I’ll have to take it up with the Home Office.", " A hundred thousand — Why are you building a machine?", " I suggest you make an effort to try.", " ... Hugh Alexander is in charge of your unit and if he’s said no, that’s that.", " — Have you ever won a war before, Turing? I have. Do you know how it’s done? Order. Discipline. Chain of command. You’re not at University any longer. You are a very small cog in a very large system and you’ll do as your commanding officer instructs.", " Winston Churchill. Street, London. You have a problem with my decision you can take it up with him.", " Though I hate to say it... Yes.", " I did no such thing.", " Thank goodness. Be a pity if we were searching the wrong one.", " There’s a spy at Bletchley Park.", " Our boys intercepted this on its way to Moscow. Look familiar?", " Double agents are such bastards. Isolated loners. No attachments to friends or family. Arrogant. Think they’re smart enough to get away with anything. Do you know anyone like that?", " Well then. Next time, you will make a mistake. And then, I don’t even need to bother firing you — I can simply hang you for treason.", " And there’s no result in sight?", " Turing! Open the bloody door!", " Open the door or we will break it down!!", " Turn that thing off.", " Well then. It seems your great big expensive machine doesn’t work.", " Wonderful. So you’ve broken Enigma then?", " This is my associate from the Home Office. A hundred thousand pounds is quite a lot of money. He’s here to see what you have to show for it.", " Have you decrypted any German messages? A single one? Can you point to anything at all that you’ve achieved?", " Your funding is up, and our patience has expired. It is with such great pleasure that I finally get to say this: Alan Turing, you’re fired.", " Please escort Mr. Turing from the premises.", " Pardon?", " What on earth are you saying?", " You must be joking.", " ... One month. And then so help me God you are all gone."], "SECRETARY": [" You called for me?"], "(MORE)": ["", "", "", "", "", ""], "ALAN TURING (CONT'D)": [" If the Allies broke Enigma — well, this would turn into a very short war indeed. Of course you’re working on it. But you also haven’t got anywhere. If you had, you wouldn’t be hiring cryptographers out of University. You need me a lot more than I need you. I’d just as easily go work for the Germans, frankly, but they simply don’t have anything this good to work on. Our mathematicians aren’t as impressive as theirs. With one significant exception. I like solving problems, Commander. And Enigma is the most difficult problem in the world."], "JOHN CAIRNCROSS": [" But we have an Enigma machine.", " So what’s the problem? Just put the intercepted messages back in to Enigma and", " — thousand million", " Didn’t you...?", " John Cairncross.", " The boys... We were going to get some lunch? Alan?", " I said we were going to get some lunch? Alan?", " Can you hear me?", " I said we’re off to get some lunch. This is starting to get a bit repetitive.", " I had asked if you wanted to have lunch with us.", " Have I offended you in some way?", " Would you like to come to lunch with us?", " Nevermind.", " Let it go.", " What?", " This is inhuman. Even for you.", " ... So what do we do now?", " Midnight. All the work we did today is useless. But don’t worry: We’ve a few hours before tomorrow’s messages start pouring in. And we start all over again.", " Don’t go over there.", " — Hugh, don’t —", " ... What’s the use?", " The Navy thinks one of us is a Soviet double-agent, Alan.", " Thanks?", " You nervous?", " If you fire them, you’ll have to fire me too.", " What’s the matter?", " Because you’re a homosexual?", " I suspected. You’re not quite as much of an enigma as you think you are. Or as much as Enigma is.", " You know, in my admittedly limited experience, women tend to be a bit touchy about accidentally marrying homosexuals. I think perhaps not spreading this information around might be in your best interest.", " You can’t tell anyone, Alan. It’s illegal. And Denniston is looking for any excuse he can get to put you away.", " This has to stay a secret, or trust me, they’ll kill you for it.", " We’re soon out of time. Our month...", " If we knew what the messages were going to say, we wouldn’t have to decrypt them at all.", " Half crown says Alan bollockses this up entirely.", " — So we’ll use the loops?", " Not a hugger. Probably could have guessed that.", " There are five people in the world who know the position of every ship in the Atlantic. They are all in this room.", " You’re right. Those U-Boats are only twenty or thirty minutes away.", " And knock out a whole German fleet in the process.", " Should be. If we can get a message to the passenger convoy, she can turn", " We can have air support over the passenger convoy in ten minutes.", " Look, this has been a big day, maybe you’re going through a bit of shock", " Everyone stop. Please. Calm down.", " What’s logical?", " What?", " No. No. You can’t be right.", " There are 500 people in that convoy. Civilians. Women. Children. We’re about to let them die.", " Alan is right. We can’t.", " Peter will come around eventually.", " ... Jack, could you give Alan and I a moment?", " ... The Soviets and us, we’re all on the same side. What I’m doing will help Britain.", " No you won’t. Because if you tell him my secret, I’ll tell him yours.", " Do you know what they do to homosexuals? You’ll never be able to work again. Never be able to teach. Your precious machine doubt you’ll ever see him again.", " Until the history books are ready to call you a hero, sometimes you have to play the villain.", " What’s that?"], "CHARLES RICHARDS": [" Five", " — Million, million", " — Obviously", " There are only five divisions of military intelligence. There is no “MI-6.”", " What?", " Go to hell."], "PETER HILTON": [" — No no it’s — I’ve got it —", " ... I’m famished.", " Who’s hungry? Let’s go.", " — No no no no no no —", " We’re short on staff.", " From scratch.", " Hugh is right, Alan. There are actual soldiers out there trying to win an actual war — my brother, my cousins, all my friends, they are all making a difference, while we wile away our days producing nothing. Because of you.", " I like apples.", " Christ!! What happens now?!", " And me.", " What about you and Joan? Does she do it the French way?", " So that’s it then. We lost.", " You do have a point about the little hats.", " No bet.", " What happened? Did it work?", " The attack is in minutes. We don’t have time to calm down.", " What?!?", " Nothing. They’ll be dead.", " Am I the only one who’s still not getting this?", " Hugh?", " It’s the Carlisle.", " The convoy you’re about to... It’s... The HMS Carlisle is one of the ships.", " We can’t act on every piece of intelligence? Fine. We won’t. Just this one. The Germans won’t find us out if we stop one attack.", " ... My brother. Phillip. He’s on the Carlisle. Gunnery ensign.", " Who the hell do you think you are? This is my brother. My big brother. He was the only one — Look, he was there after my mum — He’s my big brother, alright, and you have a few minutes to call off his murder.", " AND WHY THE BLOODY HELL NOT? I am begging you. Alan. Joan. Hugh. John. Please. I am begging you. Just this once. Just one time. The Germans won’t get suspicious just because we stopped one attack. It’s one time. No one will know. I’m asking you. As your friend. If I mean anything to you. Please.", " You’re not God, Alan. You don’t get to decide who lives and who dies.", " Why? Why?"], "KEITH FURMAN": [" — In the millions, obviously", " — This is a terrible plan —", " Excuse me?"], "HUGH ALEXANDER": [" One hundred fifty nine, if you’d rather be exact about it.", " One five nine with eighteen zeroes behind it. Possibilities. Every single day.", " Twice.", " Alright boys. Let’s play.", " Good God, what is it with women in little hats?", " Christ, Alan, it’s a bleeding sandwich.", " Lunch.", " John was trying to be nice.", " You know to pull off this irascible genius routine, one has to actually be a genius. Yet we’re the ones making progress here, aren’t we?", " We’ve decrypted a number of German messages by analyzing the frequency of letter distribution.", " Bye, Alan.", " You must be joking. Churchill put Alan in charge?!?!?!", " Alan, you can’t just fire Keith and Charles.", " And how are you going to do that?", " Alan! Your new minion has arrived.", " I am sick of this. Sick. He made me waste four hours this morning re- wiring his plugboard matrix. Three hours yesterday on rotor positions.", " No. If our job was not impossible before it bloody well is now.", " — Damn you and damn your useless machine.", " This machine?", " This is the bloody machine you’re talking about?", " ... You could help us. You could make this go faster. But you won’t.", " Because of you...", " .... I’m going to the pub.", " ... Aren’t you glad you joined up just in time?", " Alan. Didn’t even know you drank.", " Tell you a secret, Miss...", " Miss Clarke.", " The foam’s my favorite part too.", " Alan, are you... On a date?", " Mind if I have a crack?", " Do love a proper blonde.", " Oh for God’s sake, Alan, of course you’re not a spy.", " Denniston gave me the Beale Cypher. And guess what? I broke it. “Ask and it shall be given you; seek and ye shall find.” Matthew was the key. Far too simple for you. Pity Denniston disagrees.", " Be still my beating heart. Come join us for a drink.", " Fine, Alan can come too.", " He’s a lost cause, I promise.", " What’re those?", " No.", " My best to Miss Clarke.", " Look at this.", " If you run the wires across the plugboard matrix diagonally, you’ll eliminate rotor positions faster.", " You don’t like sandwiches.", " How long?!?", " No.", " God help me... If you fire Alan, you’ll have to fire me too.", " Trust me, no one wants to say this less than I do, but Alan’s right. His machine can work. At least it’s the best chance we’ve got.", " We’re the best cryptographic minds in Britain. Are you going to fire us all?", " At least give us more time. Six more months, and if the machine doesn’t produce results we’ll go back to doing things the old way.", " This machine better bloody work.", " ... So she’s got it in her hands, right, and she looks up at me and says, “I’m to put it in my mouth?” And I say, “yes, you know. The French way.” So she pops it in, closes her lips around the thing... And then she starts humming the bloody Marseillaise!", " Soon enough, you lucky bastard.", " No no, your fiancé can dance with you anytime he likes. Now it’s my turn.", " Damn it!", " It does not matter how much we improve on it, that machine will never be able to check 159 million million million possibilities in time.", " Who’s that, then?", " She wants me to come over.", " She smiled at me awhile back and hasn’t looked again since.", " And... Brilliant. She’s in. Alan, introduce me.", " Because there is nothing like a friend’s engagement to make a woman want to do something she will later regret with the fiancé’s better- looking chum.", " Alan Turing has a theory.", " He believes that the regulations against men and women working side- by-side are sound, because such proximity will necessarily lead to romance.", " — However, I disagree.", " I think that if I were working beside a woman all day long, I could manage to appreciate her abilities and intellect without needing to take her to bed. Pardon, have we met?", " So who do you agree with? Alan or myself?", " — Rubbish.", " Well who is this man, so I can kick his arse?", " Now I really want to kill him.", " I’ll require another pint to tell you why you’re wrong.", " Love’ll make a man do strange things, I suppose. Anyhow", " Repeated words! Predictable words...", " —", " — I know, I know. “Veter.” “Hitler.”", " “KMS Jaguar... Is auf punkt — is directed north... And auf punkt west...”", " You did it. Bloody hell, you did it. You just defeated Nazism with a crossword puzzle. What does it feel like to do the impossible?", " I don’t think even He has the power that we do right now.", " I’ll call Denniston. Have him radio his Admirals immediately.", " — Commander Denniston’s office", " — This is urgent, top priority", " What the bloody hell?", " Are you mad?", " — There’s no time for this.", " ... The Germans will know we broke Enigma.", " Our job was to break Enigma.", " ... What happens now? Back to the university for us?", " What?", " But the war is over."], "STEWART MENZIES": [" — If you can’t play together, then I’m afraid we can’t let you play at all.", " Exactly. That’s the spirit. Mr. Turing. Do you know how many British servicemen have died because of Enigma?", " Three.", " ... While we’ve been having this conversation. Oh look. There’s another. Rather hope he didn’t have a family. This war that Commander Denniston’s been going on about? We’re not winning it. Break the code and at least we might have a chance. Shall we leave the children alone with their new toy?", " Possibly.", " But Churchill did.", " ... Popular at school, were you?", " Who are they?", " And you think they’re qualified for Bletchley because they’re good at crossword puzzles?", " Six minutes? Is that even possible?", " Seems like some people approach it by simply doing the impossible.", " Congratulations, and my warmest welcome to His Majesty’s service. If you speak a word of anything I’m about to show you, you’ll be executed for High Treason. You will lie to your friends, your family, everyone you meet about what it is you really do.", " ... Why are you telling me this?", " Who is in the process of having you fired.", " You’re going to trust this all to statistics? To maths?", " Maintain a conspiracy of lies through the highest levels of our government? Yes, that sounds right up my alley.", " Alan, I so rarely have cause to say this. But you are exactly the man I always hoped you would be.", " Military prison.", " Decoded Enigma intercepts. A stack of them under her nightstand.", " — Yes yes yes, I’m sure. But Denniston has been looking for a Soviet spy, and he’s been looking for one inside Hut", " ... God, how I wish you’d been the spy. You’re so much better at this than he is.", " Well of course Cairncross was the bloody spy.", " You said yourself he was a piss- poor mathematician.", " It’s quite useful to be able to leak whatever we like to Stalin.", " Churchill is too damned paranoid. He won’t share a shred of intelligence with the Soviets.", " Even information that will help them against the Germans. So much secrecy...", " Cairncross has no idea we know, of course. Really not the brightest bulb.", " That’s why I’ll need your help now to work out what to leak to John. What to feed the Soviets, as well as the British.", " I know a lot of spies, Alan. You’re holding on to more secrets than the best of them.", " She’s at the market. She’ll be back in an hour. I lied. I’d better hold on to these. If anyone finds out about them, prison will be the least of her worries.", " Oh Alan. We’re going to have such a wonderful war together.", " Yes. You’ve only one thing left to do before your service to your government is concluded.", " Burn everything.", " We told you when you started that this was a top secret program. Did you think we were joking?", " Alright. Tear it down, light it up, sweep away the ashes. None of you have ever met before. None of you have ever even heard the word Enigma. Have a safe trip home."], "YOUNG ALAN": [" Carrots are orange! Carrots are orange! Carrots are orange!", " ... It’s not my fault. The carrots got in with the peas. I’m sorry. I won’t let them do it again.", " They only beat me up because I’m smarter than they are.", " Mother says I’m just an odd duck.", " What’s that you’re reading?", " What’s cryptography?", " I’m only fourteen months younger than you. Don’t treat me like a child.", " Like secret messages?", " How is that different from talking?", " When people talk to each other they never say what they mean. They say something else. And you’re supposed to just know what they mean. Only, I never do. So how is that different?", " You wanted to see me, Sir?", " Is something the matter?", " I wouldn’t say that.", " We’re the best students in the class.", " Cryptography. To pass the time. The class is too simple.", " He’s not my friend.", " Who said that?", " Why am I here?", " ... I don’t understand.", " I don’t understand.", " You’re mistaken.", " Yes. Of course. As I said, I didn’t know him well.", " May I leave, Headmaster?", " Yes, Sir?"], "BOY": [" What a bloody weirdo!", " Alan? Alan?", " C’mon don’t be such a kike about it...", " Leave him to bloody rot.", " Well look. Mr. Turing is all alone."], "CHRISTOPHER": [" Christ, I thought they were going to kill you.", " They’re getting worse.", " No. They beat you up because you’re different. So you’ll have to try a little harder to blend in.", " And she’s right.", " But you know, sometimes it is the very people who no one imagines anything of who do the things that no one can imagine.", " It’s about cryptography.", " It’s complicated. You wouldn’t understand.", " Cryptography is the science of codes.", " Not secret. That’s the brilliant part. Messages that anyone can see, but no one knows what they mean, unless you have the key.", " Talking?", " Alan, I have a funny feeling that you’re going to be very good at this.", " Goodnight, Alan."], "FEMALE PEDESTRIAN": [" — Are you two all right?"], "MI-6 AGENT": [" Pardon, Ma’am, this room is restricted.", " You’re not allowed in here, Ma’am.", " No, ma’am, the secretaries are to head upstairs. This room is for the candidates.", " For what position?", " Yes, so, secretaries are to head upstairs.", " Miss, did you really solve this puzzle yourself?", " — Ma’am I’ll have to ask you —"], "JOAN CLARKE": [" Apologies for my tardiness caught a flat tire.", " I’m only a few minutes late. With the bombing there’s ten potholes to each road.", " I am a candidate.", " The letter did not say, precisely.", " It said it was top secret.", " There was a crossword in the paper. I solved it. I got a letter saying I was a candidate for some mysterious job. So here I am. My name is Joan Clarke.", " What makes you think I couldn’t have solved the puzzle myself? I am quite", " Apologies again for being late.", " — Pardon, but before we start, can you tell me a bit about this position I’m qualifying for?", " It’s just that I’ve a pretty decent job at the University, and I’d rather not give it up for something less interesting.", " Yes.", " You said to do it in under 6.", " And what is it that we’re really doing?", " ... Well that does sound more interesting than my university job.", " So kind of you to visit, Mr. Turing. Was your trip pleasant?", " I’m sorry. I am unable to accept your offer.", " As my father told you, it is felt — well we feel — that such a position would hardly be appropriate.", " But sadly was not granted the opportunity to become a Fellow.", " I’m sorry, but for someone in my position to work - to live - amongst all of your men, so far from home... It would be indecorous.", " — One lump or two?", " So I would be working amongst these women?", " Well. I will have to talk this over with my family.", " Why are you helping me?", " Mr. Turing. Why are you helping me?", " Could you have made a bit more noise, Alan? Not sure you woke up my landlady.", " The best I can do. No male visitors after dark.", " What’d you bring me?", " ... Some men try flowers, you know.", " Or chocolates. Girls like chocolate.", " “0600 hours. Weather today is clear. Rain in the evening. Heil Hitler.” Well, clearly that vital information is going to win us the war.", " Who’s", " You named him?", " Nevermind... Are you trying to build your Universal Machine?", " I read your paper at university.", " Oh God no, but I was precocious. You theorized a machine that can solve any problem. It doesn’t just do one thing: It does everything. The machine isn’t only programmable, it’s re-programmable.", " Is that part of the idea behind your Christopher?", " A", " My landlady. You need to leave.", " — No. The window. She’s coming.", " Go.", " I heard about what happened... I have an idea of what might cheer you up.", " ... So because no letter can be encoded as itself, you’ve already a handful of settings that can be rejected at the outset. If you", " Is that your team? Let’s say hello.", " Over here!", " Correct.", " He doesn’t, really, he just sort of sips at the foam.", " ... Clarke.", " Please.", " Well then, I’ll show you a trick. Alex! We’re in need of supplies.", " Did you ever notice that the bubbles in a pint of Guinness travel downwards, as opposed to upwards in any other beer? Ever wonder why? It’s because the pint glass creates drag on the bubbles along the side; but the center bubbles are free to sprint upwards. Then the rising current in the middle pushes down on the side bubbles and... And voila: Guinness. The official beer of mathematicians.", " Hugh was being sarcastic.", " We’ll be there in a moment.", " Yes.", " Yes.", " Because I’m a woman in a man’s job and I don’t have the luxury of being an ass. Alan, it doesn’t matter how smart you are. Enigma is smarter. If you really want to beat it — if you really want to solve your puzzle — you’re going to need all the help you can get. And they are not going to help you if they do not like you.", " That’s Alan for", " Alan?", " We should talk.", " Alan, I’m leaving.", " No. Bletchley.", " It’s my parents... I am twenty-five and I am unmarried and I am living alone... And they want me home.", " That’s my parents.", " “I’ll miss you.” That’s what a normal person might say in this situation.", " “I’ll write.” That’d work too.", " What am I supposed to do, Alan? I will not give up my parents. The world is burning to ash and they are my family and they want me home.", " — And end up like you? No thanks. I’m sorry you’re lonely. I’m sorry no one likes you. But Enigma will not save you. Can you decypher that, you fragile narcissist? Or do you need me to fetch your precious Christopher for help?", " ... I’m sorry.", " I know.", " I like talking to you, too, Alan.", " You have one in mind?", " Hugh is terribly attractive, I’ll give you that, but he’s really not the marrying type.", " Peter? He’s so quiet...", " Oh dear Lord.", " Did you just propose to me?", " This is ridiculous.", " I cannot believe this is happening.", " Elizabeth.", " I know it’s not an ordinary ring...", " ... But who ever loved ordinary?", " Care for a dance?", " Come on, now it’s your turn.", " Hugh? Bit of a cad, actually.", " Here, I’ll introduce you.", " Are you sure?", " Is it odd that when I was single this game felt tedious, but now it seems just dreadfully fun?", " He has many.", " Helen Stewart, Hugh Alexander.", " That’s what flirting looks like. In case you were curious.", " Alan?", " Like this? “0600 hours. Weather today is clear. Rain in the evening. Heil Hitler.”", " Here’s the 6 o’clock message from this morning.", " L - H - W - A - U - Q - X - K...", " Oh my good God.", " There’s going to be an attack on a British passenger convoy. There.", " Civilians. Hundreds of them. We can save their lives.", " Is there enough time to save them?", " Alan, are you all right? What’s going on?", " Alan!", " If you hurt him, you will just barely live to regret it.", " Oh my God.", " Oh my God. Damn it. Alan’s right.", " They’ll put a halt on radio communication by noon.", " What?", " What’s gotten into you, Peter?", " You’ll take care of that.", " And then MI-6 can come up with the lies we’ll tell everyone else.", " A false story that exlains how we got that information, that has nothing to do with Enigma. And then you’ll need to leak those stories to the Germans.", " Can you do that?", " What?", " You think it’s safe somewhere else?", " Alan. What’s happened?", " What is wrong with you?", " Alright.", " So what?", " — So what? I had my suspicions. I always did. But we’re not like other people. We love each other in our own way, and we can still live the life together that we want. You won’t be the perfect husband? I can promise you I harboured no intention of being the perfect wife. I’ll not be fixing your lamb all day awaiting your return from the office, will I? I’ll work.", " What?", " I am not going anywhere. I have spent entirely too much of my life worried about what you think of me, or what my parents think of me, or what the boys in Hut 8 or the girls in Hut 3 think, and you know I am done with it. This work is the most important thing I will ever do in my life. And no one will stop me. Least of all you.", " ... They were right. John. Hugh. Peter. You really are a monster.", " I had to find out from the bloody newspapers.", " ... You never responded to my letters. I would have come. I would have testified.", " I would have said something. This is serious. They could send you to jail —", " Your hands... You’re twitching.", " Alan.", " The medication?", " What are you talking about?", " Oh my god. Oh my god. That’s —", " All right. This is what we’re going to do. I’m going to speak to your doctors. I’m going to speak to your lawyer. We’re going to find a way out of this.", " You are not thinking clearly. There are a million chemicals flowing through your brain. This treatment—", " Please let me help you.", " You do not have to do this all alone.", " Here, it’s alright. It’s alright. Sit down.", " His name is Jock. We work together in Eastcote. He’s gotten me into coin collecting. Can you believe it?", " Do you want to do a crossword? For old times’ sake. It’ll only take five minutes. Or in your case, six.", " But no one normal could have done this. This morning I took a train through a city that would not exist if it wasn’t for you. I bought a ticket from a man who would likely be dead if it wasn’t for you. I read up on my work, a whole field of scientific inquiry that only exists because of you. If you wish you could have been promise you, I do not. The world is an infinitely better place precisely because you weren’t.", " ... I think that sometimes it is the very people who no one imagines anything of who do the things that no one can imagine."], "SUPERINTENDANT SMITH": [" What is this?", " It’s bloody empty.", " It’s an empty manila envelope.", " Well you’ve cracked the case wide open then, haven’t you?", " And that person broke into his house and stole... Nothing?", " You think maybe he also teaches English lit?", " The spies? From the papers?", " You think Alan Turing might be a Soviet agent?", " No. I wouldn’t. I like my job. Now as to yours: Those lads have been causing a ruckus down by Whitworth Park again. Will you give them a talking to? Thank you.", " Can I help you?", " Got who?", " You and I will discuss this later. Sergeant.", " This is good work, Sergeant. Quite good.", " He committed a crime. He broke the law. And with a bloke, Christ, it’s bloody disgusting.", " Clearly. Bring him in.", " You’re asking me for a favour right now?", " ... Fine. Now will someone get a warrant for the arrest of Alan Turing?"], "SERGEANT STAEHL": [" Well? What’d he say?", " Sirs, I think I’ve got him.", " Turing.", " I trailed Turing to a pub last night, where he met a bloke. They exchanged an envelope. So I followed the guy, picked him up, gave him a good shake... Here, I’ll show you.", " He’s a bloody poofter. He confessed.", " The man admitted it. Arnold Murray. Bit of a hustler. Hangs around that pub, men pay him for a go. Turing is one of the men who paid. Only, Mr. Murray got the bright idea to rob Turing’s house after, with a friend. That’s what Turing was hiding: He’s a poof, not a spy.", " What’s the matter? We can charge a university professor with indecency."], "JACK GOOD": [" ... What just happened?"], "MILITARY POLICEMAN": [" Don’t move!", " Nothing out of the ordinary, Sir."], "TEACHER": [" Mr. Turing! Passing notes, are we?", " Only Mr. Turing would pass notes written in gibberish.", " Alright you lot, do not forget your calculus over break. Have a pleasant holiday and we’ll resume your integrals when you return."], "ELECTRICAL ASSISTANT": [" The gears just keep spinning and spinning. It’s endless."], "JOAN’S FRIEND": [" ... It’s... beautiful?"], "HELEN": [" Who’s Alan’s friend?", " So my type then?", " No! Lord, engaged for a fortnight and you’ve already forgotten how to do this? He’ll come over.", " Yes. I smiled at him fifteen minutes ago and haven’t looked at him since.", " And... Got him.", " You do?", " I don’t recall. But let’s assume we haven’t.", " Well, Alan, of course.", " I work beside a man every day, and I can’t help but have developed a bit of a crush on him.", " Oh, it’s been chaste, you’ve no need to worry. We’ve never even met. He’s a German.", " Each of us intercepts messages from a specific German radio tower. So we’ve a counterpart on the other side, who’s tip-tapping out the messages. Everybody types a touch differently; you get to know the rhythm of your counterpart. It’s strangely intimate. I feel as if we know each other. Pity he has a girlfriend... But that’s why I disagree with you. I’m in love with a co-worker, of sorts, even if we’ve never met.", " Let’s.", " Yes, Alan?", " Oh, it’s a stupid joke, don’t worry about it.", " Each one of his messages begins with the same five letters. C-I-L-L- Y. So I suspect Cilly must be the name of his amore.", " Well, this bloke doesn’t."], "JOAN CLARKE (CONT'D)": [" And they’ll have the design of Enigma changed by the weekend.", " You’ll work. We’ll have each other’s company. We’ll have each other’s minds. Sounds like a better marriage than most. Because I care for you. And you care for me. And we understand one another more than anyone else ever has."], "STEWART MENZIES (CONT'D)": [" I’ve known that since before he got to Bletchley. Why do you think I had him placed here?", " Behave, and with a bit of luck none of you will ever see me — or one another"], "HEADMASTER": [" Turing. Sit down.", " You and Christopher Morcom are quite close.", " Your mathematics teacher says you two are positively inseparable.", " He caught you passing notes the other day.", " You and your friend solve maths problems during maths class because maths class is too dull?", " I’ve been told he’s your only friend.", " Something has come up. About Morcom.", " Christopher is dead.", " His mother sent word this morning. The family was on holiday, you see.", " He had bovine tuberculosis, as I’m sure he told you. This mustn’t be a shock, but all the same, I’m sorry.", " Did he not tell you? He’s been sick for a long time. Knew this was coming soon, but he had a stiff upper lip about it. Good lad.", " Are you all right, Turing?", " Ah. Very well then.", " Of course. Oh, but Turing?", " Do pay more attention in maths class, will you?"], "PLAINCLOTHES OFFICER": [" Congratulations, Sir."], "“CAMBRIDGE PROFESSOR SENTENCED FOR": [" —"], "ALAN TURING (CONT’D)": [" You got what you wanted, didn’t you? Work. A husband. A normal life."], "CONSTABLE": [" Suicide, looks like. Half-eaten apple next to the bed. Some sort of white powder all over it."]}