{"TOM": [" Makes a clumsy attempt at snaring Chrissie, cups her from behind. She squirms playfully out of his grasp. We discover he's not especially sober."], "TOM (CONT’D)": [" Hey! Hey hey! I'm with you, right?"], "CHRISSIE": [" C'mon!"], "CHRISSIE (CONT’D)": [" Tommy? Don't dunk me..."], "RADIO ANNOUNCER (V.O.)": [" Hayes Landing reports conditions good, with stripers and jacks. The Coast Guard has no storm warning from Block Island to Cape Hatteras; a light chop with freshening winds, continued clear and mild... (etc.)"], "BRODY": [" How come the sun didn't used to shine in here?", " Right.", " Probably out in the back yard.", " The kids are in the yahd, playing near the cah. How's that sound?", " Give me 30 years, I'll get it.", " Did you burn another kettle? Y'know you're a fire hazard? This is the third one!", " Feed the dogs.", " I used to wear this to the Garden. Garbage strikes. Dog shit. Muggers. Ship it.", " On the swing? I told you not to play near there until I sanded it down. See what your son did?", " Oh, yeah. How do I look? Older, huh?", " Sexy, hm? What was I before?", " I don't want to depend on these things, y'know -‚ sometimes you can weaken your eyes.", " Let's see...", " Brody... yeah, what's up... mmm... Well, what do they usually do, float or wash up? Really?... okay, I'll meet both of you at the beach in ...20 minutes, okay? Okay. First goddamn weekend of the summer.", " The office.", " Here? You gotta be kiddin'.", " Christine what?", " You picked her up on the ferry.", " And nobody else saw her in the water?", " Think she might've run out on you?", " You from around here?", " You here for the summer?", " What d'you pay for a place just for the summer?", " Pretty stiff.", " If this is going to work, you've got to keep current stuff out here, and put 'closed' files in there. The 'Pendings' stay on my desk, okay?", " Jesus, Santos.", " leans forward, staring at what he just wrote. Polly cocks her head and removes the phone from his ear.", " Polly, I want to know what water recreation is on for today.", " Where'd you hide the 'Beach Closed' signs?", " Call me later in the day, okay, Harry?", " Get out of there ‚ take these back to the office and make up some 'Beach Closed' signs, and let Polly do the printing.", " Do I need any more authority?", " Now tell me something I don't know.", " So we should set out a smorgasbord?", " What else could've done that?", " Doctor, you're the one who told me what it was!", " I was only reacting to what I was told.", " I can't work in a vacuum. Why don't you make Hendricks Chief? His family's been here since the Puritans -- half this island are his cousins.", " What?", " How's the water?", " Ow. He's gotta be more careful in the water...", " Michael! Sean! Out of the water. Everybody out of the water! Michael! Get out!", " Look, I've got to talk to her. This isn't a contest we want the whole country entering.", " I'm responsible for public safety around here...", " I'd like to tell you what we're doing so far. These are some of the steps I've taken as Chief of Police...", " I'll get to that in a minute. First, I plan to start our seasonal summer help early, and to use shark spotters on beaches open to the sea. I'd like cooperation from local fishermen, and I've also contacted the Oceanographic Institute over on the mainland.", " Larry and I have also decided to close the beaches for a short time.", " I didn't agree to that!", " his reading glasses reflecting a stack of twelve library books, all on the subject of sharks and shark attacks. The door opens and Ellen enters, quietly, in respect for Brody's mood.", " Love a cup of tea. With lemon.", " Where is he?", " Son! -- Out of the water now!", " I want him out of the ocean.", " Michael! Come inside!", " I told him not to go out until he memorized the handbook and the safety safety regulations, until he was sure of himself...", " That wasn't funny.", " Looks more like the readers of the National Enquirer.", " Hey! You know how many men that's supposed to hold?", " What you got ain't safe. You take some guys off or you don't go out.", " You going out too, Ben?", " Just back up! No, the other way! Cut it to your left! Your other left! The big boat, your front end is out way too far. Little boat, stay still!", " Thanks.", " If that's dynamite, give it here, or don't leave port.", " Hand it over.", " You're tellin' me. I swear, this town has gone crazy.", " Who are you?", " Let's show Mr. Hooper our accident.", " No, it was local jurisdiction.", " No, we just checked the beach...", " You did it! Did Ben Gardner catch this?", " Larry, if you'd see these clowns leave, you'd never believe they'd come back with anything. But they got him!", " Sure he is.", " Matt Hooper, the specialist they send down from the Oceanographic Institute.", " What d'ya mean?", " Why not, Larry? We could get a positive confirmation that way.", " She's right.", " I'm going home.", " C'mere and give Daddy a kiss.", " Because he needs it.", " Swell.", " How come you have to tell them that?", " Let's all have a drink.", " Drowning. Lemme ask you something. Is it true most attacks take place in three feet of water, around 10 feet from the beach?", " Something else. Do most attacks go unreported?", " There's a kind of a lone shark, called, uh...", " Yeah. Rogue. Picks out an area where there's food and hangs out there as long as the food supply lasts?", " And before 1900, when people first starting swimming for recreation, before public bathing and resorts, there were very few shark attacks, cause sharks didn't know what they were missing?", " Why don't we have one more drink, you and I, and then we go down and cut open that old shark and see for sure what's inside him, or not.", " I am Chief of Police. I can do anything I want. You want to come?", " What stinks so bad?", " What's that?", " What? What?!", " How can you tell?", " He ate a car?", " What do we do?", " Chum?", " What is all this stuff?", " Can you tell from that if a big man- eater is around?", " Where'd you get all this?", " You're at the Institute full time? Or do you have a job?", " We gotta get back soon...", " Hey!", " That's Ben Gardner's boat! It's the Flicka! Ben? Ben!", " What happened?", " Don't they have lifejackets or something? An extra boat?", " Why don't we just tow it in?", " Be careful, for chrissake.", " You all right?", " No shark did that to a boat!", " There is a kind of shark called a Great White Shark that every expert in the world agrees is a maneater.", " There's no limits to where he can strike, and we've had three attacks and two deaths in the past few days. It happened like this before, in when a Great White killed five swimmers at Jones Beach, in Long Island.", " A 4th of July beach is like ringing a dinner bell, for Chrissake!", " We towed Ben Gardner's boat in, Larry; he was dead and his boat was all chewed up.", " He lost it on the way up.", " We have got to close the beaches. We have got to get someone to kill the shark, we need non-corrosive mesh netting, we need scientific support... It's gonna cost money just to keep the nuts out and save what we have.", " That means closing the beaches.", " Wait a minute! I need you.", " Larry, we can re-open the beaches in August.", " What is this?", " I signed on the wrong line...", " I want to thank you guys from local agencies for cooperating, and I hope we won't actually be needing your services. But I'm glad to have you here.", " We're all on one channel, so let's keep radio traffic to a minimum, okay?", " I wish it would rain...", " I'm sorry, I just don't have the time.", " Hey Mikey -- !", " Do me this favor just once. Use the ponds.", " Just a favor for your old man.", " Everybody out! Out of the water, please -- leave the water, please --", " No whistles! No whistles!", " He's in shock. Get blankets!", " Here -- Take him home.", " No. Home here.", " There's only one thing you're good for anymore -- signing a damn voucher. Here. It's an authorization to employ a contractor.", " I'm going to hire Quint to kill the fish. I want to see that shark dead.", " Forget it. This summer's had it. Next summer's had it. You're the mayor of Shark City. You wanted to keep the beaches open. What happens when the town finds out about that?", " The best interest in this town would be to see that fish belly-up in the water with a hole in his head. You do the right thing. You authorize me. Right there. Whatever it costs.", " Just sign it, Larry.", " This has got to be one big violation...", " What?", " I'm authorized by the township of Amity to hire you as an independent contractor. We'll meet your price.", " You got it.", " You got it.", " You got it.", " Two cases. And dinner when you land.", " This is Matt Hooper...", " He's from the Oceanographic Institute.", " Hey. Knock it off. I don't want to have to listen to this while we're out there...", " It's my charter. My party.", " You got it.", " Colorful, isn't he?", " Nothing to worry about -- I'll survive this.", " Yo-ho-ho and a bottle of rum.", " Tell 'em I went fishin'!", " Who's driving the boat?", " Why are we way out here, when the shark's back there?", " You got it?", " The wire's showing!", " What's the point with hooks and Lines? --", " How -- if they're gonna keep on breaking?", " What do we do? Get some help? Radio in?", " Why don't we go in? Get another crack at him tomorrow.", " Let's call in -- we can radio and have a big boat here in an hour...", " C'mon. Middle appendix --", " What's that one, there?", " What's that, a ship?", " What the hell?", " Where...?", " The barrel!", " Shark! Starboard!", " That's it! Radio in for help!", " Yeah, Captain, as soon as I make a call.", " Some great idea! Now where are we? Some goddamn skipper you are. You're certifiable, y'know that? You're a real treat! Certifiable! Bananas!", " Did you get him in the head?", " I can't stand here doing nothing!", " What about us?", " Where'd he go?", " Have you ever had one do this?", " There! The barrels have surfaced and we see the monster shadow sliding under the Orca, seemingly endless. Violent scraping sounds.", " He's trying to sink us!", " He's chasing us! I", " You gotta go in the water...", " He's taken him!", " No... You think we can get back with those?", " What day is this?", " Think the tide's with us?", " Y'know, I used to hate the water..."], "ELLEN": [" 'cause when we bought the house it was Autumn. This is summer. Feed the dogs.", " Do you see the kids?", " In Amity, you say 'Yahd.'", " Like you're from N'Yawk.", " You want to go through those? I'm taking them to the Thrift Shop. It's Marcia Vaughn's pet charity. Pick out what you want to keep -- it's mostly your city clothes.", " Don't be silly -‚ You're going to make summer better for them...", " Go upstairs and bring Mommy a band- aid.", " I think they make you look sexy.", " Older, sillier.", " There. What was that?", " Be careful.", " Hey Chief. Bring my cup back.", " What about this kid? What if he were born here. That make him an islander?", " Do you want the boys to come in? Honey, if you're worried...", " You're very tight, y'know? Right there.", " What is it...?", " Can you stand something to eat?", " Mikey loves his birthday present.", " He's sitting in it.", " It's three feet deep, Martin", " It's his birthday present, and you closed the beach, Honey. I told him not to go in the water after what happened yesterday. I don't believe he'll ever do it again.", " You heard your father! Out right now!", " So would I. Come on in.", " My husband tells me you're in sharks.", " You love sharks?", " Excuse me, but what are you talking about? Didn't they catch the shark this afternoon? It was on the Cape station news.", " Thank you.", " You're leaving?", " Is that a boat?", " Like those Cousteau specials on television? I think it's for the kids, but I love them.", " I saw a show with sea otters, and a big turtle... Mikey loved it. Made me promise to get him one. Will you live on the boat?", " Martin hates boats. Hates the water. On the ferry to the mainland, he sits in the car the whole way over. He's got this childhood thing, there's a clinical word for it.", " Can you do that?", " Hey, big guy -- you want anything from home?", " Home... New York?", " Did you take your dramamine? Here.", " Is that him?", " You going to be all right?", " I'll see you back soon. There's an extra pair of glasses in your black socks, and there's some suntan lotion and blistex in your kit.", " What'll I tell the kids?"], "ELLEN (O.S.)": [" I never hear the whistle."], "MICHAEL": [" Cut my hand. Hit by a vampire.", " My boat's neat, dad!", " I'm all checked out for light surf and look at it.", " Dad, the ponds are for old ladies.", " Sure, Dad.", " My cars. And a comic book."], "ELLEN (CONT’D)": [" Don't forget these.", " Honey. He has it tied up to the jetty with a double-knot.", " Would you like something? Some coffee?"], "BRODY (CONT’D)": [" Love ya.", " Maybe that's your girl.", " You too, sweetheart...", " What the hell?", " You're not going to the ocean with that, are you son?", " Got a pen on you?", " How're we gonna handle this?"], "CLOSER ANGLE": [" Deputy Hendricks is searching the shore about one hundred yards down wind. Meanwhile, Brody, in his casual police attire, and Tom Cassidy, still in the clothing we saw him in last night, walk down the beach. Brody fingers the missing girl's shoes, purse and clothes. In the daylight, Cassidy misconducts himself, wavering between inflated maturity and tear- blown adolescence."], "CASSIDY": [" Worthingsly... Worthington -- no one ever died on me before.", " I didn't know her.", " Somebody could've -- I was sort of passed out.", " Oh, no, sir. I've never had a woman do that. I'm sure she drowned.", " No. Cambridge. Harvard. My family's in Tuxedo, New York, though.", " Some friends and me took a house.", " A thousand apiece, something like that. There's five of us. And we each kick in a hundred a week for beer and cleaning, stuff like that.", " You can't make me look -- !"], "POLLY": [" This is in no order of importance, Chief: There's a meeting on the Amity Town Council on Aging this Monday night, Bentoncourt Hall. The Fire Inspector wants you to go over the fireworks site with him before he catches the one o'clock ferry. Mainly, you have a batch of calls about that new Karate school.", " Searle's Rent-a-Bike, the Rainy Ale, Tisberry's Hardware... they say it's those nine-year-olds from the school practicing karate on all those nice picket fences.", " What's the matter?", " Right this minute?"], "POLLY (CONT’D)": [" It's the Coroner. Somebody pass away in the night?"], "HENDRICKS": [" We never had any. What's the problem?", " Polly told me to tell you there's a scout troop in Avril Bay doing the mile swim for their Merit Badges. I couldn't call them in, there's no phone out there.", " What's the matter with my printing?", " We had a shark attack at South Chop this morning, Mayor. Fatal. Gotta batten down the beach.", " I just found out about it -- but there's a bunch of Boy Scouts in the water a coupla miles down the coast from where we found the girl. Avril Bay, thereabouts. Chief went to dry them off.", " I've got all these signs here...", " ...So then Denherder and Charlie sat there trying to catch their breath, and figuring out how to explain to Charlie's wife what happened to her freezer full of meat.", " Mrs. Kintner must've put her ad in Field and Stream.", " Anything? Thought I saw a shadow. Over.", " False alarm. Must be this glare.", " Where -- ?"], "LOCAL MERCHANT": [" Glad I caught you. There's a city truck with New Hampshire plates parked right in front of my..."], "KEISEL": [" Wait-a-minute. Glasses, right?", " Too cold. I'm going in again Labor Day. Hope we get this weather next weekend."], "KEISEL (CONT’D)": [" Look at those fences! Little guys about eight to ten years old. And look at this!", " They did that with their bare hands."], "LYNWOOD": [" Stuff's no good to me in August when the Pilgrims come in June... Go on and help yourself to whatever you need, Chief. Can you work the register?"], "VAUGHN": [" What have you got there, Lenny?", " Who've you told this to, Lenny?", " Take my car, okay? You come with us, Lenny.", " C'mon, it'll give us time to think about what they're going to say.", " Martin! Are you going to shut down the beach on your own authority?", " That's just going by the book. We're just a little anxious that you're rushing into something serious here. This is your first summer.", " All I'm saying is that Amity is a summer town -- we need summer dollars, and if they can't swim here, they'll use the beaches at Cape Cod, or Long Island.", " Boat propeller?", " Some weekend tramp accidentally goes swimming too far, she's a little drunk, a fishing boat comes along --", " I don't think you can appreciate the gut reaction people have to these things.", " It's all psychological, anyway. You yell 'Barracuda' and everyone says 'huh'.", " Martin, we hired the best man we could find.", " Now then. We've got a vandalism problem we ought to talk about...", " Then go out tomorrow and make sure no one gets hurt. Everybody, could I have your attention? Since this affects all of us, I suggest we move into council chambers, where there's more room...", " Well, here we all are; anyone have any special questions?", " That's private business between you brave fishermen and Mrs. Kintner. -- Chief --", " No need to involve outsiders in our business, Martin.", " Only 24 hours!", " Thank you very much, Mr. Quint, the Selectmen will take your offer under advisement", " That's good. That's real good. Ben Meadows getting pictures for the paper.", " Who's that young man?", " I think we all owe a debt of gratitude to these men for catching this monster.", " That's disgusting! This is the largest, meanest, most vicious shark ever landed off Amity Island, and a known maneater!", " Be reasonable, boys -- this isn't the time or the place to do some kind of half-assed autopsy on a fish. Ben... do you have all the pictures you need?", " I am not going to stand here and watch this fish cut open and see some kid fall out on the dock. Besides... We see Mrs. Kintner approaching, dressed in black.", " I'm sorry, Martin. She's in a sick, terrible state.", " Let's all get out of here, this place stinks.", " Is that tooth here? Did anyone see it?", " What kind of a shark did you say it was?", " Well, I'm not going to commit economic suicide on that flimsy evidence. We depend on the summer people for our lives, and if our beaches are closed, then we're all finished.", " I don't thing either of you is familiar with our problems...", " Come here, I want to show you something.", " You'd love to prove that. Getting your name in the National Geographic.", " August! Tomorrow is the 4th of July, and we are going to open for business. It's going to be our best summer in years. If you're so concerned about the beaches, you two, you do whatever you have to to keep them safe, but with you or without you, the beaches stay open this weekend.", " How about them indeed. I'm pleased and happy to repeat the news that we have, in fact, caught and killed a large predator that supposedly injured some bathers here. As you can see, it's a beautiful day, the beaches are open, and the folks here are having a wonderful time. Amity, y'know, means 'Friendship.'", " Why don't you get in the water?", " Nobody's going in!", " Why?", " I don't know if I can do that without a...", " Maybe we can save August...", " I was acting in the town's best interests...", " My kids were on that beach..."], "SCOUTMASTER": [" Let's go, Robbie. You too, Hofner. Boyle, keep your head up. Alberts, keep kicking..."], "MEADOWS": [" Technically, you need the instruction of a civic ordinance, or a special meeting of the town selectmen...", " We're not even sure what it was.", " Remember when Fred Ganz went scalloping in his BVD's? He was going to swim to New Bedford, he said.", " We never had that kind of trouble here.", " You have our complete support.", " I agree. If she's going to advertise, I wouldn't recommend out- of-town papers. Amity people could take care of this.", " What's going on with the beaches, Chief?", " Ginny, get this out on the state wire to AP and UPI in Boston and New York. Have one of them pick it up for the national and call Dave Axelrod in New York and tell him this is from me and he owes me one... let's get a picture.", " Okay, everybody, I want to get a picture for the paper -- could everyone clear out of the way?", " Plenty.", " Beautiful day, Chief!"], "DOCTOR": [" I think, possibly... sure. A boating accident.", " I was wrong. We'll have to amend the report."], "MEADOWS (CONT’D)": [" ...and Bill Mayhew almost caught him in his net...?", " Could you get out of the shot, young man?"], "(MORE)": ["", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], "VAUGHN (CONT'D)": [" You yell 'Shark' and we've got a panic on our hands. I think we all agree we don't need a panic this close to the 4th of July."], "VAUGHN (CONT’D)": [" We need someone who isn't prejudiced by old feuds or family ties, someone who can referee things.", " Chief, I'll take responsibility for this. Boys, cut this ugly sonofabitch down before he stinks up the whole island. Harve, tomorrow you and Carl take him out and dump him right in the drink.", " Sick vandalism! Brody, that's a deliberate mutilation of a public service message! I want those little paint-happy bastards caught and hung up by their baby Buster Browns!"], "SHOPKEEPER": [" Hello, Mr. Quint.", " Yessir, right here. What do those fish do, eat this stuff?", " Bye now."], "QUINT": [" Four spools of Number 12 piano wire, Okay? I ordered them.", " They choke on it.", " You all know me. You know what I do for a living. I'll go out and get this bird for you. He's a bad one and it's not like goin' down the pond chasing blue-gills and tommy- cods. This is a fish that can swallow a man whole. A little shakin', a little tenderizing and down ya' go. You gotta get this fellow and get him quick. If you do, it'll bring a lot of tourist business just to see him and you've got your business back on a paying basis.", " Did you bring a check?", " Cash? Or do we do this on a handshake and a promise?", " And my regular daily rate -- $200, whether we catch him or not.", " And incidental damages, if any...", " And you get the Mayor off my back with this zoning crap. Nobody tells me how to run my property.", " And, uh, a case of apricot brandy and you buy the lunch.", " Try some of this. I made it myself.", " You want to get paid, you go.", " This is the last time I hear from you. I don't want anyone with piss for blood on my vessel. Put that blackfish on board, pump the bilges, and top off the fuel tanks, and finish up in the morning. Then you're on the beach.", " I know who he is...", " Transplants?", " I'm not talking about day sailing or pleasure boating. I'm talking about working for a living. Sharking.", " Are you now. I know about porkers in the water -- Here. Tie me a sheepshank.", " Let me see your hands...", " What do you mean 'We...?'", " All right, Commissioner. But when we're on my ship, I am Master, Mate and Pilot. And I want him... ...along for ballast.", " lengths of 1/2-inch, 20 number straight gaff, flying gaffs, tail rope, eye splice, M-1, 20 clips, pliers, irons...", " Hey, Squirt! You want to stow this gear or you want me to use it for ballast? It ain't good for much but bait.", " Hello, Junior. What are you? Some kind of half-assed astronaut?", " Who's inside, you or the shark?", " Hurry up, Chief, daylight's a wastin'.", " Cast off the bow line! Now your stern!", " Front-Bow, Back-Stern, Port, Starboard. Aloft, Below. It's not a staircase, it's a ladder, it's not a rope, it's a line, and if you don't get it right... I'll throw your ass through that little round window.", " Here's something for you...", " These greedy sons-a-bitches will eat their own guts.", " Go ahead, you cannibals. Tell 'em where you got it!", " Just a little appetizer. I want our porker to know we're serving. I want to put some iron into that big yap...", " Keep that chum line going -- we've got five good miles. Don't break it.", " Nobody. We're drifting with the current.", " Hell, in the old days we went out with good charts, good sounding lead, and a damn good compass. Nowadays, these kids are afraid to go out without depth finders, radar, radio, electric toothbrush, every stupid thing...", " Real fine stuff but it won't mean a thing to Mr. Whitey, of course... he didn't go to schools in electronics. He was born with what he does best. Eat. He's a swimming appetite. 'Course he might eat this stuff, but then I've seen him eat a rocking chair, too. Next time, ask me.", " It ain't a Big Mac. The expert don't approve. What do you thing? You're closer to the situation. Brody shades his eyes from the white sun as Quint baits up.", " ...'cause this is where he lives. You gotta think like they do.", " Now if he weren't around, we'd of hooked something else by now, wouldn't we? But he scared 'em all away. Big lonesome son of a bitch...", " -- he'll gulp it down now... Hooooooo!", " Get behind me, dummy! Reverse her and turn -- he's taking too much line! Wet my reel, quick!", " Neutral! Where the hell is he going?", " Down here, Hooper!", " Look -- you may be a big Yahoo in the lab, but out here you're just supercargo, and you'll do as I say, or you can take your gear and backstroke home. Now get down here!", " Unbuckle me -- fast! Grab the leader. He ain't normal, this one... they never --", " Watch your hands -- Grab onto this!", " Fasten the pole.", " Don't tell me my business! Quarter-mile, that way. Full throttle.", " What I do is trick him to the surface, got that? Then I can jab him, understand? Think I'm gonna haul it in as if he's a catfish, like everyone else does?", " Over there!", " At least you handle the boat all right. Stop. Here... Cut the engine.", " feet. And three tons of him there.", " Orca here.", " Put her on.", " This is Quint, Missus.", " He's busy.", " Just fine, Missus. We'll be back soon. Everything's fine. We haven't seen anything yet. Orca out.", " Here. Rig this to the forward keg up there.", " Come to port. Watch my hand. Steady now...", " Get clear, damn you!", " Jesus H. Christ On a Crutch!", " Now you've done it, you piss-ant. Stop and rig a goddam tinker toy to my gear. Let the bastard fight the keg for a while. He can't stay down with that on.", " We got a barrel on him. We can't lose him. We stay out here until we find him.", " You hired me, remember? It's my $10,000. It's my shark...", " He's up again.", " Wire burn. Trying to stop a backstay from taking my head off.", " Face and head scars come from amateur amusements in the bar room. This love line here... ...that's from some crazy Frenchie come after me with a knife. I caught him with a good right hand right in the snot locker and laid him amongst the sweetpeas.", " Nothing! A pleasure scar. Look here --", " And I'll drink to yours.", " And here's to the ladies. And here's to their sisters; I'd rather one Miss than a shipload of Misters.", " I almost had 'im.", " Tattoo. Had it taken off.", " 'U.S.S Indianapolis.' 1944.", " Yeah. The U.S.S. Indianapolis. June 29th, 1945, three and a half minutes past midnight, two torpedoes from a Japanese submarine slammed into our side. Two or three. We was still under sealed orders after deliverin' the bomb...the Hiroshima bomb...we was goin' back across the Pacific from Tinian to Leyte. Damn near eleven hundred men went over the side. The life boats was lashed down so tight to make the bomb run we couldn't cut a single one adrift. Not one. And there was no rafts. None. That vessel sank in twelve minutes. Yes, that's all she took.", " Show me the way to go home... I'm tired and I want to go to bed. I had a little drink about an hour ago, and it went right to my head. Gradually, Hooper and Brody join in, and the pilothouse becomes a warm cozy place.", " Start the engines.", " The bilge pumps. There --", " Cut the engines!", " Get up forward! Watch for him!", " More left rudder! More! Left hand down now, Chief.", " He's bent the housing. You can hear it.", " It's him.", " Haul in that rope -- it'll foul us! Start the engine!", " Shut up! Just pump her out!", " Duty first and pleasure after --", " Excuse me!", " No -- comin' right at us! Slow ahead, he'll hit us head on -- Slower! Throttle back ---", " Hard to port!", " Try shakin' that out!", " No! No! No! Swing around! After him!", " More gas... go to half! Get me right alongside him --", " Watch it!", " Order in the court!", " Three'll do it! He's havin' trouble with two!", " Get tired! That's the idea! Here's a little reverse for you!", " Damn head is too far away. He's too big.", " He can't go so deep. Not with all those on him.", " Have to pump her steady, s'all.", " No way! He can't!", " He can't stay down with three barrels on him! Where is he?!", " No!", " Follow him!", " Dead astern! Zig-zag!", " Full throttle! To port!", " Throttling back!", " What can that gun of yours do?", " Let go of it!", " He's comin' up -- !"], "MAX TAFT": [" Looks like another big season. Gets worse every year."], "MRS. TAFT": [" And none of them from the Island. Just a lot of bother.", " That official business could take all summer!", " The motel is all I own -- you pull the plug on this town and I go down the drain with it."], "TAFT": [" Present company excepted, but off- islanders are a pain in the butt. Pardon my French.", " Just 'cause a cat has kittens in an oven, it don't make them muffins."], "SEAN": [" I'm not a muffin! I'm a boy!", " Why?"], "MRS. KINTNER": [" Alex! Alex Kintner! Where do you think you're going?", " Let me see your fingers --", " Alex! Alex? Alex...!", " Chief Brody?"], "ALEX": [" Water. Just once more, please?"], "MRS. KINTNER (CONT’D)": [" They're beginning to prune. 10 minutes more.", " My Alex was a beautiful little boy and you killed him. Did you know that?", " You knew there was a shark out there. You knew a girl got killed here last week. I just found that out. But you knew. You knew it was dangerous, but you let people go swimming anyway. You knew all those things, and still my boy is dead now and there's nothing you can do about that. My boy is dead. I wanted you to know that."], "DOG MAN": [" Buster! Hey, Buster! Here boy! He continues to ad lib calling his dog, but there's no answer, no dog in the water."], "THE WATERFRONT": [" A huge splash explodes in the water near the gang, an eruption of foam and spray that stops everyone cold for a moment. They stop to see who was responsible."], "A KID (MATHEW)": [" Hey, no fair splashing in the eyes!"], "TOURIST": [" Something in the water. Right there! Didn't anyone see it?"], "WOMAN": [" There's blood in the water.", " Are you going to close the beaches?", " Is there nobody going in? What a shame. Arthur, should I be going in?", " This is marvelous! Arthur, I want to come back to this very spot. Will you make a note of where we are?"], "DENHERDER": [" Is that $3000 bounty on the shark in cash or check?", " You wanna call it a night after here?", " Yeah, Charlie, I got my second wind three nibbles back.", " We're blowin' half the bounty on bait --", " You do this all the time, right, Charlie?", " I can't believe that people pay money to go fishing.", " Hey! What's this?", " Do I set the goddam hook?", " CHARLIE! JUMP!", " Get the hell out! Charlie! Swim!"], "MR. KEISEL": [" Maybe it's better to close."], "MR. WISEMAN": [" We should make sure there is no danger."], "MR. HASSETT": [" I didn't raise my kids to be some fish's lunch!"], "MR. POSNER": [" Nobody's seen a shark."], "MR. POLK": [" We'll lose business, we lose taxes, we lose our shirts!"], "QUINT (CONT'D)": [" A shark of that size is no pleasure and I value my neck at a hell of a lot more'n 3,000 bucks. I'll find him for three. But I'll kill him for ten.", " Jesus Christ, when I was a kid, every little squirt wanted to be a harpooner or a sword fisherman. What d'ya have there -- a portable shower?", " We didn't see the first shark till we'd been in the water about an hour. A thirteen-footer near enough. A blue. You measure that by judgin' the dorsal to the tail. What we didn't know... of course the Captain knew...I guess some officers knew... was the bomb mission had been so secret, no distress signals was sent. What the men didn't know was that they wouldn't even list us as overdue for a week. Well, I didn't know that -- I wasn't an officer -- just as well perhaps. So some of us were dead already -- in the water -- just hangin' limp in our lifejackets. And several already bleedin'. And the three hundred or so laying on the bottom of the ocean. As the light went, the sharks came crusin'. We formed tight groups -- somewhat like squares in an old battle -- You know what I mean -- so that when one come close, the man nearest would yell and shout and pound the water and sometimes it worked and the fish turned away, but other times that shark would seem to look right at a man -- right into his eyes -- and in spite of all shoutin' and poundin' you'd hear that terrible high screamin' and the ocean would go red, then churn up as they ripped him.  Then we'd reform our little squares. By the first dawn the sharks had taken more than a hundred. Hard for me to count but more than a hundred. I don't know how many sharks. Maybe a thousand. I do know they averaged six men an hour. All kinds -- blues, makos, tigers. All kinds. In the middle of the second day, some of us started to go crazy from the thirst.", " One fella cried out he saw a river, another claimed he saw a waterfall, some started to drink the ocean and choked on it, and some left our little groups -- our little squares -- and swam off alone lookin' for islands and the sharks always took them right away. It was mainly the young fellas that did that -- the older ones stayed where they was. That second day -- my life jacket rubbed me raw and that was more blood in the water. Oh my. On Thursday morning I bumped up against a friend of mine -- Herbie Robinson from Cleveland -- a bosun's mate -- it seemed he was asleep but when I reached over to waken him, he bobbed in the water and I saw his body upend because he'd been bitten in half beneath the waist. Well Chief, so it went on -- bombers high overhead but nobody noticin' us. Yes -- suicides, sharks, and all this goin' crazy and dyin' of thirst. Noon the fifth day, Mr. Hooper, a Lockheed Ventura swung around and came in low. Yes. He did that. Yes, that pilot saw us. And early evenin', a big fat PBY come down out of the sky and began the pickup.  That was when I was most frightened of all -- while I was waitin' for my turn. Just two and a half hours short of five days and five nights when they got to me and took me up. Eleven hundred of us went into that ocean -- three hundred and sixteen got out. Yeah. Nineteen hundred and forty five. June the"], "QUINT (CONT’D)": [" The bastard is costing you more'n that every day. Do you wanna stay alive and annee up the ten or play it cheap and be on welfare next winter. I'm gonna kill this thing... just a matter of whether I do it now -- or at the end of summer.", " Here's to swimmin' with bowlegged women.", " Ha. City hands. You been counting money. If you had a $5000 net and $2000 worth of fish in it, and along comes Mr. White, and makes it look like a kiddy scissors class has gone to work on it and made paper dolls. If you'd ever worked for a living, you'd know what that means.", " You're in the cage? The cage is in the water? The shark is in the water too? You're in the water with the shark.", " Now hear this. You're aboard the fishing vessel 'Orca,' and I'm her Captain, Master, Mate, and Owner. You'll jump when I holler. We're doin' a job here, and Christ, I ain't got time to watch you birds get hooks in your ass and fall overboard. Ship with me, and you'll do all right. Cross me, and I'll slap you upside your heads. Now -- if you boys are ready -- let's go fishin'.", " Get a fresh barrel.", " Starboard, for Chris'sake --", " Hey, you! Farmer! Half-speed there...", " Oh, this ain't foolin' me -- Sure -- try it!", " Makin' believe it's easy now.", " Gettin' ready to run again -- no? No? What's he playin' here? Put the gloves on!", " Let's see who's gonna tease who now!", " A marlin, or a stingray. Huh. Don't ever tell me my business again. Get back up on the bridge.", " I never saw one that big.", " Get up there and steer her. Follow my hand, and hold 'er steady. I've got to get a clean shot at that porker's head.", " Hurry up, rig the line!", " The line, man, the line!", " That's not so bad. Look at this: ...St. Paddy's Day in Knocko Nolans, in Boston, where some sunovabitch winged me upside the head with a spittoon.", " Slammed with a thresher's tail. Look just like somebody caressed me with a nutmeg grater...", " Wait a minute, young fella. Look. Just look. Don't touch...", " ...Mako. Fell out of the tail rope and onto the deck. You don't get bitten by one of those bastards but twice -- your first and your last.", " Look a' that -- Bayonet Iwo Jima.", " He's busting the shaft! Start the pump!", " Keep your eyes open, Mr. Hooper!", " Nobody sleeps! Nobody.", " Show me the way to go home... I'm tired and I want to go to bed.", " Hooper and Brody join in from their respective positions.", " He's under the keg. Careful --", " Easy -- just want to goose him up. The minute he runs, drop it or you'll lose your hands.", " Here -- gimme. I don't see what he's been doin'.", " Easy! It'll tear right out!", " Atta boy!", " Take two, they're small!", " Grab yourselves a couple of poles!", " Get ready! Now snag 'em!", " Pull in the ropes and tie 'em onto the transom -- free ride.", " Haul in -- watch the prop!", " Now! Untie 'em! Quick! He'll tear us to pieces.", " Follow him -- You start pumpin' out here."], "CHARLIE": [" It's only two-thirty. What, are you tired?", " Screw lamb -- let's shoot the sirloin!", " Set?", " Twenty years.", " Look at him take it!", " Let him do it! Go-go-go-go-go!", " Holy Jesus Christ!"], "DENHERDER (CONT’D)": [" Leg of lamb this time?", " One more after this, then I'm going home."], "CHARLIE (CONT’D)": [" Tide's taking it right out."], "DENHERDER (CONT'D)": [" This is really dumb. This isn't even relaxing... it's just boring."], "OUT-OF-TOWNER": [" You're charging me double the usual rent! I didn't come up here all the way from New Rochelle to be gouged by some Yankee Cracker!"], "BOAT RENTAL MAN": [" Prices go up June First every year. You want a nice cheap, leaky boat, you go down to the Hamptons. Right, Chief?"], "MAN IN BOAT (WALTER)": [" Whatever's safe, right?"], "HOOPER": [" Hello.", " Ahoy, sail! You got an oar? Well, scull it out!", " Just cast off in turn and make for the channel, OK?", " Excuse me, I wonder if you could tell me...", " There's a fantail launch out there that won't make it beyond the breakwater.", " Officer, I wonder if you could tell me where I could find Chief Brody?", " Hooper, Matt Hooper. From the Oceanographic Institute.", " Victim One, identified as Christine Watkins, female Caucasian...", " Left arm, head, shoulders, sternum and portions of ribcage intact. Please don't smoke. With minor post- mortem lacerations and abrasions. Bite marks indicate typical non- frenzy feeding pattern of large squali, possibly carchaninus lonimanus, or isurus glaucas. Gross tissue loss and post-mortem erosion of bite surfaces prevent detailed analysis; however, teeth and jaws of the attacking squali must be considered above average for these waters. -- Did you go out in a boat and look around?", " It wasn't an 'accident,' it wasn't a boat propeller, or a coral reef, or Jack the Ripper. It was a shark. It was a shark.", " Well, if one man can catch a fish in days, then I guess 50 of these bozos can catch a fish in one day -- beginner's luck.", " Who, me? Okay... shot.", " I didn't say this wasn't the shark, I just said I wasn't sure this was the one...", " There are hundreds of different kinds of sharks; makos, blues, hammerheads, white-tips... any one of them could've attacked. Look -- shark digestion is slow. We could open this one up, and find whatever he's been eating is still inside.", " Let's just cut him open and see what's inside...", " Wait a minute...", " Look, maybe this is the wrong time to pursue this, but I'm not sure...", " Is anyone having this...?", " Here... one red, one white.", " I wouldn't put it that way. But I love sharks.", " I do. But you've still got a problem here, there's a shark just off the island somewhere.", " They caught a shark, not the shark. Big difference. I could've proved it this afternoon, by cutting that one open and examining his stomach contents. Also, his bite was too small.", " Here's to your husband, the only other rational man on the island. Day after tomorrow, I'll be gone, and he'll be the only one.", " Going out on the 'Aurora.'", " Is it! The best-funded research expedition to ever study the shark... around the world in 18 months.", " Better than Cousteau, or Compagno with computers, telemetry, Defense Department funding...", " Yep.", " Yeah. Like the kid on your beach. I wish I could've examined that shark they caught...", " About half of them. A lot of 'missing swimmers' are really shark victims.", " Rogue?", " It's called Territoriality. It's a theory.", " You could say that.", " I'm flattered you should ask.", " ...And it was Dartmouth Winter weekend, and she was Homecoming Queen, and I was her date; then she got into the fact that her family had more money than my family, and she was right -- her great- grandfather was in mining, and my ancestors were Yankee shipbuilders. So we broke up and I went home with some beatnik from Sarah Lawrence.", " Our friend, the shark.", " Half a flounder. Hmmm... a burlap bag... a paint can... aha!", " Just as I thought. He drifted up here with the Gulf Stream, from southern waters.", " Florida license plate.", " No, but Tiger sharks are the garbage cans of the ocean. They eat anything. But this one didn't eat any people. There's nothing here...", " If you're looking for a shark, you don't look on land. You go out and chum for him.", " Only one sure way to find him -- offer him a little something to eat. Chum -- blood, waste meat, fish, anything. They can sense it miles away. If he's out there, we might be able to get a closer look at him. It's a good time, too. They're night feeders...", " That's the Cape Light -- we're on the stretch where he's feeding, if he's still here.", " Depth-finder, fathometer, sonar, closed-circuit TV -- fore and aft -- RDF, single side band... And two loose nuts behind the wheel.", " Sometimes. Look here -- something big, probably a school of mackerel clumped together. And staying right with us.", " I Bought it.  Both sets of grandparents set up trust funds for me; stocks went up, so I don't have to touch my principal.", " It is a job. I'm not fooling around like some amateur. It's my life!", " I want to check something. Hold my feet.", " They must've hit something.", " He didn't have a dinghy aboard. I'm going down to take a look at his hull.", " We will. There's something I've got to find out.", " A White! A Great White, I found a tooth buried in the hull. He must've attacked... I knew it... Gardner's dead in there. I didn't see the mate...", " Jesus Christ! A Great White! Who'd believe it!", " You're situation here suggests that a Great White has staked out a claim in the waters around Amity Island, and that he will continue to feed here as long as there is food in the water.", " A shark's attack is stimulated by the kind of splashing and activity that occurs whenever humans go swimming -- you can't avoid it!", " I just pulled a shark tooth the size of a shot glass out of the hull of a wrecked boat out there.", " I don't have it.", " Carcaradon carcharias. A Great White.", " I'm familiar with the fact that you are going to ignore this thing until it swims up and bites you on the ass!", " That's it! I'm standing here arguing with a guy who can't wait to be a hot lunch. Goodbye.", " Out there is a Perfect Engine, an Eating Machine that is a miracle of evolution -- it swims and eats and that's all. Look at that! Those proportions are correct. I know sharks.", " I hope we get some more help.", " What I've heard and what I've seen are two different things. I believe there is a large Great White Shark - - Carcharodon Cacharias - in the waters off this very beach, that he has killed and that he will kill again...", " Block the estuary! The estuary!", " This is quite a place.", " You're going to need an extra hand...", " I've been to sea since I was 12. I've crewed three Trans-pacs --", " -- and an America's Cup Trials...", " And I'm not talking about hooking some poor dogfish or sand shark. I'm talking about a Great White.", " I don't need to pass basic seamanship.", " Look, I don't need to hear any of this working class hero crap. Some party boat skipper who's killed a few sharks...", " Powerhead, CO2 darts, hypo, regulator, tanks, depth gauge, camera, extra magazines, cage...", " All of it. And thank Dr. Miro for me. And tell Borack I'll catch up with them in New Zealand.", " An eye for an eye, you know.", " I'll see ya. Tell Dorothy hello.", " Anti-Shark cage.", " Comin' aboard...", " What's that supposed to prove?", " Nothing. Nothing, nothing, nothing.", " Watch it!", " That's pilot whale, isn't it?", " Easy for you -- they got a brain the size of a radish.", " Aye, Aye SIR. Stand by to repel boarders. Poop the mainsail. Argh, Jim Boy.", " Let it go, don't waste your time.", " I don't know what it is, but it's not a shark.", " It's too wild, too erratic. It's a marlin or a stingray. It's a gamefish.", " I'm okay...", " What do you see?", " feet, if it's an inch...", " There's a formula! Girth, about 150 inches, squared, divide by 800 -- son of a bitch, they are not going to believe this! -- divide by 2000... three tons! You're right, you old fart! Three tons!", " Damn it! I need something in the foreground to give it some scale. Martin! Stand here! No, to your left!", " Clear!", " Rig another keg! I'm bringing her around!", " Look here. Steve Kaplan bit me during recess.", " Moray Eel. Bit right through a wet suit.", " Ever see one like this?", " I'll drink to your leg.", " I think I can top that, Mister...", " Don't tell me -- 'Death Before Dishonor.' 'Mother.' 'Semper Fi.' Uhhh... 'Don't Tread on Me.' C'mon - - what?", " You were on the Indianapolis? In '45? Jesus...", " It's a whale out there.", " Rudder bearings?", " Lemme get a better angle on it. Now.", " The shaft is giving.", " Coming right to us!", " We can't rev it up this high --", " Don't shoot him any more! He's crazy on his own blood already!", " He's under!", " Hold her.", " Power head with 20 ccs of strychnine nitrate. If I can hit him. I can kill him. But I gotta be close. Very close.", " Rig the cable to the roof eyebolts.", " Lower away, Chief. Try and keep him off me till I'm under.", " Quint...?", " Wednesday... No, it's Tuesday, I think.", " Just keep kicking.", " I can't imagine why."], "GARDNER": [" Hello, back.", " Might give it a try. That three thousand bounty beats working for a living. We ready?"], "SKIPPER 1 (THE SAILBOAT)": [" Dammit, a vessel under sail has the right of way!"], "SKIPPER 2 (MOTORBOAT)": [" You schmuck, you ain't under sail, you're goddam drifting!"], "SAILBOAT SKIPPER": [" Tell that stinkpotter to belay!"], "MOTORBOAT SKIPPER": [" Tell that ragsetter I'm going to poke him in the snoot!"], "HOOPER (CONT’D)": [" Is that dynamite?", " ...height and weight may only be estimated from partial remains. Torso severed in mid-thorax, eviscerated with no major organs remaining. May I have a drink of water? Right arm severed above the elbow with massive tissue loss from upper musculature. Portions of denuded bone remaining. -- did you notify the coast guard?", " Hi. I'm Matt Hooper. If your husband is here, I'd like to talk to him.", " Dynamite! How was your day...?", " Ummm. Really good.", " I was lucky to find that in town -- it's an estate bottled vintage year...", " We ought to let it breathe... Whatever.", " We always had a summer place on the water -- Newport, the Vineyard, so I figured I'd major in something I knew about. Oceanography, marine biology. It was that, or design racing yachts like my older brother. Hmmm. He we go. Up the old alimentary canal. Hold the light.", " We open the abdominal cavity and check the digestive tract. Simple. From his vantage point, Quint watches, unseen by the two men.", " ...Nothing.", " God damn it! We had him! I'm coming about!", " Bull shark scraped me while I was taking samples...", " Gimme a hand, here. I got something to show you --", " There. Right there. Mary Ellen Moffit broke my heart. Let's drink to Mary Ellen.", " Keep him there! Keep him!", " Take me up."], "MAN": [" Aw, c'mon, it's just fireworks. Sharks like fireworks, it attracts them."], "PRATT": [" Well, get over there! He ain't caught it yet!", " Hand me that pole! Quick!", " How's the family, Harry? Go on and do it!", " Whadya mean, 'Bite Radius?' What's that?"], "HARRY'S BOAT": [" Everyone wants to get into the act. They are attacking the"], "HARRY": [" Beat it! I hooked him!", " Let go my shark!"], "MAN WITH GAFF": [" We split down the middle?"], "HOOPER (CONT'D)": [" The whole town and the Armada fishermen all line up in a classic \"high school\" graduating class shot with the victorious fishermen kneeling in front, and the rest of the Armada and Townspeople arranged behind them. Hendricks hold up the \"Beach Closed\" sign in ironic victory.", " We're not talking about a shark, we're talking about a Shark!", " There are only two ways to solve this thing: you can kill it, or you can cut off its food supply...", " Compressed air -- you screw around with one of those and Boom! Careful, huh?"], "HOOPER (O.S.)": [" It's a tiger shark. Very rare in these waters, and definitely a maneater.", " Martin Brody residence?", " He's heading under -- !"], "GAFFER": [" Teeth are teeth, right?"], "HOOPER'S BOAT": [" Something he has seen moves Hooper.", " Caught on the other end of the line, he is wheeling in a broad, hot-dogger's circle turn, headed back."], "OFFICER": [" Martin Brody? I'll need your signature here... here... and here.", " Authorization for direct payment of flight expenses not directly connected to a normal mission of this command. You pay for the gas.", " Just erase your signature and initial your erasure."], "ENSIGN": [" I want to get our lines and repellent out, so we better shove off."], "AT SEA": [" Hooper is methodically patrolling in his boat. Tactically flanking a three-hundred-yard apron of black repellent are four small watch- boats. A tiny pleasure boat darts around the repellent line. Farther out, crossing back and forth, are patrol boats. To top it all off, a Coast Guard helicopter hovers and patrols three hundred feet above."], "TV DIRECTOR": [" Put 1 on the line. In five. 4. 3. 2. Roll.", " Recue the machines. 2, pan off the Chief and show me some tits and ass. get me some cute kids. 3... see if you got a shot at the water.", " Why did we wrap? Get that! Somebody get that!"], "ANNOUNCER": [" ...and with me is the Mayor of Amity, Lawrence Vaughn. Mr. Vaughn, how about those rumors?", " Also here today is a Marine Biologist and Research Fellow from the Oceanographic Institute, Matthew Hooper. Mr. Hooper, what've you heard?", "", " What else you got?"], "ANNOUNCER (CONT'D)": [" And there you have it -- two different opinions, by men of good will. The holiday crowd here at Amity seems to be making up its own mind..."], "ASSISTANT DIRECTOR": [" Mayor, 43 seconds, Biologist 45 seconds. That's equal time, right?", " Teachers' strike downtown."], "DIRECTOR": [" Right. Jerry, come on in and look at this. Roll 2. In five, 4. 3. 2. 1.", " Close enough for remote.", " Think we ought to stick around?", " That's five minutes, guys. Coffee."], "ANNOUNCER (V.O. MONITOR)": [" Amity Island is famed for its clear air and white sand beaches. But a cloud appeared..."], "ANNOUNCER (LIVE) (CONT’D)": [" Look at that shine on my nose. It's a beacon."], "VAUGHN (V.O.)": [" ...I'm pleased and happy..."], "CAMERAMAN'S VOICE (O.S.)": [" Christenson, this is Al. Union says time for Engineering Five."], "SELECTMAN": [" I don't want to wash off my suntan lotion. I'll get a burn..."], "ARTHUR (THE BUTLER)": [" If you'd like."], "ARTHUR (CONT’D)": [" It's very nice. Not too cold... Quite refreshing... Very pleasant", " No sharks, m'lady."], "BOAT #7": [" Hendricks is on the radio while a Coast Guard spotter works the sonar."], "UNDERWATER": [" As before, 400 pairs of enticing, yummy swimmers' legs, kicking like animated hors d'oeuvres.", " The shark's carcass floating down in a cloud of blood and debris."], "COPTER SPOTTER": [" Nothing from up here, Daisy. Over.", " Copter to Daisy! Red Four, Red Four!", " Went under your -- There!"], "VOICES": [" Who's scared to go in! I was in! Up to your knees, yeah -- So come with me -- I'll go again."], "SONAR OPERATOR": [" Jesus Christ -- Shark!"], "THE BEACH": [" Dozens of bathers halfway out of the water, turn to see. More whistles, and they start toward shore. We hear panicky voices ad- libbing; \"Shark,\" \"Look Out,\" etc. The loudhailers sounding more urgent now, and a contagious dread seizes one person after another. Entire groups of people begin pulling toward shore, some of them obviously trying to control a growing hysteria in others."], "AERIAL VIEW": [" The circle of boats around the little pranksters, the crowds huddled on the beach, Hooper's boat suddenly arrowing towards the estuary, leaving a huge boiling wake."], "THE VICTIM": [" It's no good. I'm dead... A renewed cry of shark!"], "NURSE": [" The doctor said it's okay -- mild shock. He can come home in the morning."], "QUINT'S VOICE": [" Keep your hands off my stuff."], "HERSCHEL": [" Mr. Quint...", " Forget the money. You can't pay me enough. I ain't crazy. I worked some big mean fish with you, but I ain't goin' on this one."], "HERSCHEL (CONT’D)": [" I'm not goin'. No sir."], "ASSISTANT": [" You got everything you asked for?", " This is actually a killing expedition?"], "QUINT (O.S.)": [" 'Here is the body of Mary Lee. For years she kept her virginity. Not a bad record for this vicinity.'", " Beg your pardon --"], "ANOTHER ANGLE": [" Fins closing in on the wounded shark."], "SHARK FRENZY": [" A boil of water and the flash of fins and teeth as the local sharks erupt in a feeding frenzy, jaws snapping, blood spewing, a sudden display of the fury and blind predatory drive of the fearsome species."], "RADIO VOICE (V.O.)": [" Amity Point Light Station to Orca. This is Amity Point Light Station, to Orca...", " I have Mrs. Martin Brody here..."], "ELLEN'S VOICE": [" ...push this? Oh. It's working. Hello, Martin?", " I just wanted to know if you were all right... the Coast Guard let me use their radio. Is Chief Brody there?", " Well... is everything all right?"], "ON DECK": [" Quint appears with the harpoon gun. He throws one end of the line to Hooper."], "THE SEA": [" The barrels have come to a stop. Delicately, they change course and meander toward the lowered cage."], "SURFACE": [" The trailing barrels gong and scratch the keel of the Orca above. Brody and Quint leap back.", " One of the barrel ropes snakes around the cage rope and pulls taut."], "MASTER ANGLE": [" The shark breaks water right beside the Orca, rising with a great whooshing noise. It rises vertically, towering overhead, blocking out the sun. The pectoral fins seem to reach forward."], "MASTER ANGLE (CONT'D)": [" The shark, in all of its monstrous glory, falls onto the stern of the boat with a shattering crash, narrowly missing Quint and Brody. It drives the stern underwater, the ocean pours in over the transom. The jaws snap from side to side. Brody flounders backwards away from it."]}