{"MIA": [" ...and I swear to God, she was wrecked. It was pure insanity.", " Don’t worry, it is. I know sometimes it --", " Shit.", " It’s -- five past...", " Ok.", " I wanted to give you an entrance.", " Eh...", " I don’t know who Jen and Rachel are.", " I don’t know if they were there.", " Can’t. Working.", " Yes?", " It’ll be a bunch of social climbers packed into one of those glass houses.", " I just wanted to say -- I saw your playing, and I --", " No, Jamal. You be trippin’.", " Congratulations. I have to grab a drink...", " “I Ran”.", " “Curt”?", " Ok.", " My God. Did you just call yourself “a serious musician”?", " Can I borrow what you’re wearing?", " Because I have an audition next week. I’m playing a serious fire-fighter.", " Uh... The coffee shop on the Warner Brothers lot. That’s a classic.", " He just told you what to do.", " Mia.", " George Michael!", " Did you just get your keys?", " Can you grab mine?", " The Prius.", " They are...n’t.", " Strange that we keep running into each other.", " I doubt it.", " What?", " Uh-huh.", " Oh my God.", " Agreed. I’ve seen better.", " ...Ok...", " No...", " I have an audition. Remember?", " But you said --", " ...Hi. What are you doing here?", " Uh-huh. How’d you get on the lot?", " I’m off in ten.", " That’s the window Ingrid Bergman and Humphrey Bogart looked out of in Casablanca.", " Yeah. Greg.", " We’ve been seeing each other for a few months.", " Oh yeah?", " A what?", " We need to wait here.", " Into...? Oh -- I -- my aunt was an actress. She was in this traveling theater company... And there was this little library across the street from my house when I was growing up. This was Boulder City, Nevada -- every house looked exactly the same. I was ten and already I needed to get out. And one day, my aunt flew into town, and she showed me the library’s old-movie section. We spent a whole day watching one after the other. Bringing Up Baby. Notorious. Casablanca. I never knew the world was so big.", " I started putting on plays in my garage. I’d write the scripts and print up programs, and she’d give me props to use from wherever she’d just been -- New York, London, Paris. And then she’d jet off again and I wouldn’t hear from her for another year.", " God no -- I didn’t invite anyone. That would have been terrifying.", " Well it doesn’t need more actresses.", " What do you mean, “just an actress”?", " That is not what I said.", " Last thing I wrote was a stand-up routine for an open-mic night. It was horrible.", " Ok, I’ll stop auditioning and make history instead.", " I hate jazz.", " It means when I listen to it I don’t like it.", " I do hate some animals.", " I thought it was just Kenny G.", " I associate it with facials. It’s relaxing.", " Right, but it’s good to talk over. Where I grew up there’s this jazz station they’d play at cocktail parties whenever they served the salami and cheese.", " Your club?", " Hi, I just missed a call...", " That show I told you about.", " Right. It’s -- actually more like Rebel Without a Cause.", " Obviously. No.", " It’s the one I lie about.", " ...Ok.", " Ok. For research.", " Great, actually: I got a call-back on a pilot.", " Well -- it’s not picked up yet.", " First they make the pilot, then if they like the pilot it goes on TV.", " Well, no, I have a call-back.", " It’s another audition.", " ...Well when you put it like that it sounds like a huge accomplishment.", " Oxygen.", " You know what, I have to go. I love you.", " Two options. Follow my rules, or follow my rules. Kapish? You want to bully, you’d best be ready to get bullied --", " I can do it another way --", " Shit. No. Yes. I’ll change...", " I’m sorry.", " It’s a play. I’m going to put it on myself.", " Actually -- it’s a -- it’s a one-woman show...", " I think so.", " Nice meeting you.", " ...You’re just saying that.", " I don’t know... Is the whole thing too nostalgic?", " But do you think people will like it?", " You always say that.", " Fine -- as long as you sit front-row ‘cause I’ll probably throw up on the middle of the stage otherwise.", " I made something for you.", " It could be the name design. On the door.", " That’s what you should name it.", " Sebastian, no one’s going to a club called “Chicken on a Stick”.", " No. Drop the chicken. Drinks and jazz. And it’s time to start looking for other places.", " Make your own history.", " I’m doing that.", " The one who offered you a gig.", " Why was it weird between you two?", " He did offer you a job.", " Are you going to call him?", " Ok...", " Thanks Harry, I’m good.", " I think today’s San Diego. I’m not sure...", " Nothing...", " I guess. I’m adapting.", " He told me.", " Do you think he’s happy?", " I mean with the band, the travel, all of it.", " Hey it’s me... Not sure where you are -- maybe Boston? Or Dallas? Anyway... I haven’t heard from you in a while... I miss you... Ok... Bye...", " Stay.", " I’m nervous.", " Because... What if people show up?", " I’m nervous to be up on a stage and perform in front of people. I’m terrified.", " I can.", " Ugh.", " Boise?", " To Boise?", " Wish I could.", " Come to Boise?", " Because I have to rehearse.", " You mean anywhere you are?", " Well, all my stuff is here and my show’s in a few weeks and -- I don’t know, it doesn’t seem practical...", " I know, but when are you done?", " When are you done with the tour?", " So it’s...the long haul?", " I mean the long haul -- like, you’re going to be in this band for a long time.", " I don’t know, I didn’t think the band would --", " No, that’s not what I meant. What I meant was -- this band -- you’re going to be on the road for -- what, years now?", " Do you like the music you’re playing?", " It matters if you’re going to give up your dream to be on the road for years.", " Yes. I do. I just didn’t think you did.", " And now I hear you’re going to be on the road for years, and I’m --", " What do you mean why am I doing this?", " To be in this band?", " Yes, I wanted you to have a job so you could take care of yourself and start your club.", " Why aren’t you starting your club?", " Change the name!", " I do like jazz now, because of you.", " People will want to go to it! People love what other people are passionate about.", " You had a dream that you were sticking to, that --", " This is not your dream.", " Why do you care so much about being liked -- ?", " Are you kidding?", " Stop --", " It’s over.", " I’m done embarrassing myself.", " No one showed up. I can’t even pay back the theater.", " Not anymore.", " I’m ok.", " I’m good...", " You took down the swing.", " Oh God. Throw those away.", " Why did you come here?", " Ok...", " I know who she is.", " I’m not going.", " I’m -- no... That will kill me.", " Yes.", " I’m happier.", " I told you.", " Because it’s another audition! I’ve been to hundreds of auditions. Do you want to know what happens? Either they interrupt me because someone ordered a sandwich, or they cut me off after two seconds, or I’m crying and they start laughing, or I’m one of a hundred lookalikes in the waiting room who never has a chance, because -- -- because --", " Because I’m probably not good enough.", " No. Maybe I’m not.", " Why what?", " ...Because it hurts a little bit too much.", " How did you find me?", " ...Ok.", " ...About...?", " My aunt lived in Paris for a bit... She used to tell me these stories, when I was growing up, about living abroad... I remember -- she told me she jumped into the Seine once...", " They said the next couple of days... But I’m not expecting to find anything out.", " No, I’m not.", " Where are we?", " I mean -- where are we?", " What do we do?", " If I get this --", " What are you going to do?", " Right.", " You know I’m always going to love you.", " I’ve seen better.", " I’ve never been here during the day.", " Hi... Iced coffee, please.", " No, no, that’s fine.", " Bye, sweetie. You be nice to Chelsea.", " We can just see it back in New York...", " I just wanted to say -- I saw your playing, and I --", " No... We should go."], "MIA (CONT’D)": [" Pure lunacy. Oh God, I know...", " And I swear to God, she was wrecked. It was pure lunacy. Oh God, I know...", " No, no, Turner’s fine. So you -- are you waiting ‘til Denver to tell her...? Oh. I see... No, you’re right. I understand. Ok... I just... Oh...", " No, I’m happy for you... I -- I just --", " No...", " I don’t like the fissure on the GT scan. Did you test for achromatopsia?", " D.O.A. on 23rd, perp laughing his face off at P.D. Damn Miranda Rights.", " This is my classroom. You don’t like it, the door’s to my left.", " The one with the green ribbon.", " Shit...", " Thank you for saving the day back there.", " Eh.", " Hey... Greg...? Can you hear me...? Yeah, I’m just leaving now... K, see you soon...", " Ah. Great... Well... Do you want a ride to your car?", " Night.", " I love this stuff. Makes coming to work easier.", " Honestly, I wish I loved something else. I’ve tried so hard to want other things.", " I left school after two years to come here, my fourth manager just dropped me, and my last audition was for a teen soap pitched as Dangerous Minds meets The O.C. Should’ve been a lawyer.", " Anyway -- I’m getting a feeling there’s something I should tell you...", " I got a call-back!", " Hi, Mom!", " I have an idea.", " So who was that guy at the Lighthouse?", " What time do you leave in the morning?", " I’m gonna go home for a while.", " Maybe I’m one of those people who’s always wanted to do it but never had a chance. It’s a pipe dream. Maybe it’s like you said. Maybe I need to grow up.", " I can go back to school. I can find something else that I’m supposed to do. I left school to give it a shot, and it didn’t work out, and it took six years, and I don’t want to do it anymore.", " Do you want to just skip it...? Turn off here and get dinner?"], "CUSTOMER #1": [" This doesn’t taste like almond milk.", " Can I see the carton?"], "CUSTOMER #1 (CONT’D)": [" I’ll have a black coffee."], "WOMAN": [" Cappuccino, please.", " No, I insist."], "MANAGER": [" On us.", " Where do you think you’re going?", " You’d better be here early tomorrow.", " You’re closing up Friday.", " Do I look like I care? Reschedule it.", " And fix your apron."], "CASTING DIRECTOR": [" One second."], "CASTING DIRECTOR (CONT’D)": [" ...I’ll call her back. Tell her I’m almost done in here.", " You know what? I think we’re good. Thanks for coming in."], "TRACY": [" Holy Mother of God.", " Two minutes, people! Mia you’re coming, right?", " Look, I know things didn’t go well today. There are four things in my inbox that you’re perfect for and I will submit you. But right now -- you’re coming.", " Exactly. Fun.", " Lex! I’m disappointed in you. There’s nothing to make fun of. This party will be humanity at its finest.", " There you are! You need to meet someone! Carlo, this is Mia. Mia, Carlo’s a writer.", " ...Is that gonna happen every time?"], "TRACY (CONT’D)": [" Ever heard of a vent?", " It’ll be fun.", " Is that a script?"], "ALEXIS": [" Mia! How’d it go?", " Same here. Was Jen there? Or Rachel?", " They’re the worst.", " I bet they were.", " Come on, Mia. When else do you get to see every Hollywood cliché crammed into a single home?", " Mia?"], "CAITLIN": [" Why is there a convention in the bathroom?"], "TRACY (O.S.)": [" What? Did she say “working”?", " What’s that?"], "MIA (O.S.)": [" No...", " ...No, Mom, it’s a one-woman show... No, I’m acting in it as well... No, I’m not getting paid, I’m paying to do it... He’s great... He’s going to open his own jazz club. It’s going to be incredible... Well he has to get the money together first, and... He’s figuring it out... Yeah, it’s just been a little tricky lately..."], "SEBASTIAN": [" You gotta stop breaking into my home.", " Please don’t sit on that.", " Yes. Hoagy Carmichael sat on that stool. The Baked Potato was gonna throw it away.", " Don’t need it.", " That’s almost insulting... Did he?", " When I unpack them in my club.", " No.", " Who wants to tapas while they samba?", " I don’t want to meet anyone.", " Uh-huh. Does she like jazz?", " Then what are we gonna talk about?", " Ok. Then I have someone I’d like you to meet. He’s got a face tattoo, but a heart of gold.", " How long’s it been?", " I am serious. I had a very serious plan for my future. It’s not my fault I got Shanghai’ed.", " What’s the difference?", " Why do you say romantic like it’s a dirty word?", " You’re acting like life’s got me on the ropes -- what you don’t understand is, I want to be on the ropes. I’m letting life hit me ‘til it gets tired. Then I’m gonna make my move. It’s a classic rope-a-dope.", " I’m changing the locks.", " I’m a phoenix rising from the ashes!", " Bill. Thanks for having me back.", " Of course. Though I don’t think they care what I play.", " How ‘bout one for you, one for me? Or two for you, one for me? Or all for you, none for me? Ok, that works. Good deal.", " There’s a nice way to say that.", " I’ll stick to the set list, I promise --", " You’re not gonna find a better player. You know that.", " Ok. I remember you.", " Ok I was an asshole. I can admit that.", " But requesting “I Ran” from a serious musician -- it’s too far.", " I don’t think so.", " Why?", " So you’re an actress. That makes sense. Have I seen you in anything?", " Oh, you’re a barista. Well now I see how you can look down on me from all the way up there.", " He doesn’t tell me what to do.", " I let him.", " Mia. Guess I’ll see you in the movies.", " You again.", " ...Yeah.", " ...Which one is it?", " Those look comfortable.", " You didn’t give me much of a choice.", " It is strange. Maybe it means something.", " Yeah I don’t think so either.", " It turns your head into an antenna. Probably gives you cancer, but you find your car more quickly.", " You don’t live as long, but you get things done faster, so it all evens out.", " Not much to look at.", " No, that’s fine... Thanks...", " Meetings. Studio heads.", " Piece of cake.", " Great. I’ll hide in the bathroom.", " What’s your Bogart’s name...? Is it Greg?", " How long have...?", " I know what you mean. I get breakfast five miles out  of the way just to sit outside a jazz club.", " It was called Van Beek. The swing bands played there. Count Basie. Chick Webb. It’s a samba-tapas place now.", " Samba-tapas. It’s... Exactly. The joke’s on history.", " I know. They shoot movies on my street. “C-stands.” “Apple box.” “Don’t forget to sign out.”", " How’d you get into all this?", " Who would you invite to watch? Your parents?", " ...‘Cause the world needs more lawyers.", " You’re not just an actress.", " You said it yourself, you’re a child- prodigy playwright.", " You’re too modest to say it but it’s true. So you could write your own roles. Write something that’s as interesting as you are.", " All I’m saying is -- Louis Armstrong could have played the marching-band charts he was given. What did he do instead? He made history.", " Yeah?", " What does that mean? “I hate jazz”?", " But it’s such a blanket statement. It’s like saying “I hate animals”.", " Do you need to be anywhere right now?", " ...What?", " It’s not relaxing! Sid Bechet got into a gunfight ‘cause somebody told him he played a wrong note!", " Mia. These are things you can’t unsay.", " ...It’s gonna be the old Van Beek. I’m getting the lease back. It’ll be perfect.", " Really? For what?", " Dangerous Minds meets The O.C.?", " That’s amazing! “I got the bulletsssss!”", " What? You’re the movie person.", " Come on. You can’t do this audition and never see Rebel. The theater near me’s playing it. If you want -- I can take you. For research.", " 10pm Monday at the Rialto. Cool?", " Keith?", " This is Mia. Mia, Keith. We used to play together.", " Great. You?", " Good for you.", " I’m good.", " I’m good.", " You bet.", " It’s beautiful.", " No... I’m not.", " That’s the point.", " Fuck ‘em.", " I truly believe it.", " I’ll be front-row.", " What’s that?", " Why does it say “Seb’s”?", " Never.", " You don’t get it. Charlie Parker got the name “Bird” because he loved chicken. So my club’s gonna be old-school jazz and beer and chicken. “Chicken on a Stick”.", " It’s gotta be Van Beek. I can’t let them samba all over its history.", " Your play’s incredible.", " ...Which guy?", " You mean Keith? He’s the worst.", " It’s always weird with him.", " Right...", " No.", " Here’s what we know. It’s definitely Chicken on a Stick -- -- and your play is going to be a triumph.", " Well... Here I am.", " Yeah, that...that... ...sounds good.", " You’re holding onto the past. But jazz is about the future.", " Surprise.", " How’s the play going?", " Why?", " Fuck ‘em!", " They should be so lucky to see it. It’s going to be incredible. I can’t wait.", " 6:45.", " Yep. Boise.", " You should come.", " Yeah, you could knock that off your bucket list.", " Why can’t you?", " Yeah.", " Can’t you rehearse anywhere?", " ...I -- I guess...", " Right... I just -- we’re going to have to do things so we can see each other. We never see each other.", " ...What do you mean?", " But -- as soon as we’re done with the tour we go back and record, and then we go back on tour.", " ...What does that mean?", " What did you think I was going to do?", " You didn’t think we’d be successful.", " Yeah, feasibly -- I could be on the road for years with just this record.", " I don’t know how that matters.", " Do you like the music I’m playing?", " Yeah, well, I --", " What are you doing? Why are you doing this?", " This is what you wanted from me.", " To have a steady job.", " So I’m doing that. So why aren’t we celebrating?", " You said yourself no one wants to go to that club! No one wants to go to a club called Chicken on a Stick --", " -- and no one likes jazz. Not even you.", " What am I supposed to do? Go back to playing “Jingle Bells” so I can save money for some Shangri-La club no one wants to go to?", " Not in my experience.", " This is the dream!", " Guys like me go their whole lives and never do anything that’s liked. I’m finally doing something that people enjoy. What is wrong with that?", " You’re an actress, who are you to talk??", " No.", " ...Tonight?", " I thought that was next Thursday.", " Mia!", " I’m -- I’m sorry I missed it -- and I’m sorry I was a dick and I -- I promise I’ll make it up to you --", " ...What do you mean?", " You didn’t embarrass yourself...", " ...This is home.", " Oh God, I didn’t see them.", " You look beautiful. I hope it was ok. I haven’t played in a while.", " Yes ma’am.", " ...You still think New York?", " What...?", " Wrong number.", " Yeah, well...not anymore.", " I won’t.", " ”Casting”...?", " Because I have good news.", " Amy Brandt. The casting director.", " She was at your play. And she loved it. And she loved it so much that she wants you to come audition for a huge movie she’s got.", " ...Excuse me?", " That’s it?", " So you’re happy here?", " Why won’t you come?", " I don’t buy it.", " Because what?", " Yes you are.", " Why?", " Why don’t you want to do it anymore?", " I told them you’d be there at five-thirty tomorrow. I’ll swing by here before I drive back at eight. Either you’ll be outside or you won’t.", " The house across from the library.", " When do you find out?", " You’re going to get it.", " You are. I know these things.", " Griffith Park.", " I know... I don’t know.", " I don’t think we can do anything. Because when you get this --", " When you get this -- you’ve got to give it everything you’ve got.", " I’ve got to follow my own plan. Stay here. Get my own thing going. You know...", " I guess we’re just going to have to wait and see.", " I’m always going to love you too.", " Agreed.", " Alright, I’m done. Harris did a nice job with it.", " No one touches the instruments. Carson’s coming an hour early to test levels.", " How’d we do last month?", " Not too bad is great. See you tonight.", " Hothouse Eddie -- miss me?", " Yeah? Tell him to tune it, huh?", " Manny Halloran, ladies and gentlemen. I don’t know, I told him to play “Jingle Bells”."], "LAURA": [" You think Mom or Dad would call this a home?", " Are you serious?", " I wonder why. I brought you this. It’s a throw rug.", " Yeah? What if I told you Miles Davis pissed on it?", " When are you going to unpack these boxes?", " Oh my God. It’s like a girl broke up with you and you’re stalking her. You’re not still going by there, are you?", " Seb --", " I have someone I want you to meet.", " You’ll like her.", " Probably not.", " You’ll talk about the weather.", " Sebastian --", " You need to get serious. You live like a hermit. You’re driving without insurance.", " You did not get “Shanghai’ed”, you got ripped off.", " It’s not as romantic as that. And everyone knew that guy was shady except for you.", " Unpaid bills are not romantic. Call her.", " I love you. Unpack your boxes.", " You can’t afford it.", " Look at him -- watch --", " Same here but I think someone’s trying to break into your car.", " You should come over tonight. Harry’s cooking, but don’t let that stop you. What’s the matter?", " You miss him.", " I got used to being alone. Growing up it was just me and Seb. We only had each other.", " I wasn’t looking for anybody. Then I met Harry and -- we just fit... You’ve changed Seb. You know that?", " Is he happy?", " Our dad never got to do what he wanted. We were always treading water, he took a job running a washer-dryer store. But every night at home he’d play his clarinet along to a Benny Goodman record. So I look at Sebastian... Playing music, getting paid for it. I’m happy for him.", " No -- I changed my mind.", " You remember the McKenzies?", " Yeah. They kept going, “oh Sebastian’s so handsome”.", " You were great You’re always great when you play.", " I’m not gonna be hovering anymore.", " I think so. Maybe Boston. I don’t know, it’s exciting..."], "SEBASTIAN (CONT’D)": [" They’ve turned it into a tapas-samba place. You believe that?", " And I’m sorry if I was curt that night.", " What’s your name?", " Put the clicker under your chin.", " Actually it took me four hours and I ended up running. We probably have twenty minutes before the guy finds me. You got a break coming up?", " Anyway, that’s L.A. They worship everything and they value nothing.", " Most people say they hate jazz because they don’t have context. They don’t get where it came from. All these people packed into flophouses in New Orleans, speaking five different languages, and jazz was how they talked to each other.", " It’s not cocktail music -- it’s a high- wire act. These guys are performing and composing and rearranging all at once.", " That’s why you need to be in the space and see what’s at stake. This whole thing -- it’s dying. In twenty minutes they’ll head off to cut commercial sessions or do pit at the Pantages ‘cause they have to -- but when I have my own place -- my club -- they’ll play whatever they want.", " The world tells everyone to move on. Says the music’s had its moment. But I love it too much. I’m not moving on.", " So?", " You’ve seen it, right?", " The whole world from your bedroom? Who’s doing that?", " Where’s the piano?", " And... There’s twenty-five pounds of apples in it. It probably destroyed an ecosystem but it tastes good.", " I have to head back in the morning but I needed to see you.", " Feels so good to be home.", " You’re nervous about what they think?", " We tour so we can make the record, and then we go back on tour to sell the record.", " Anyway -- it’s time to grow up. You know? This is what I’m doing. If you had a problem, I wish you would’ve said something earlier, before I signed on the dotted line.", " Maybe you liked me more when I was a failure because it made you feel better about yourself.", " Wait --", " I’m sorry --", " It’s your dream.", " You’re going to be in Paris. Good jazz there. And you love jazz now.", " Right?", " Look at this view.", " Welcome to Seb’s."], "BOSS": [" Seb.", " Your welcome. Stick to the set list.", " I do, and I don’t want to hear the free jazz.", " ...every goddamned night.", " Too late. You’re done.", " Do you think anyone here gives a shit?"], "WAITRESS": [" Well... Welcome back."], "READER (O.S.)": [" Lady why you be trippin’ like that?"], "CARLO": [" They say I have a knack for world-building.", " ...Goldilocks from the point of view of the bears. Home-invasion thriller. Fox and Warners are going crazy for it."], "SINGER": [" Alright, one more for y’all before we break. Do I hear any requests?", " “I Ran” it is. Wanna start us off, piano-man?", " Sebastian. Second set.", " Never seen you lookin’ so lovely as you did tonight..."], "SINGER (CONT’D)": [" I walked along the avenue..."], "CARLO (CONT’D)": [" ...We’re going after Charlize. For the bear. We’re flipping it. Feels like a franchise. But the thing is it’s grounded."], "CUSTOMER": [" Are these pastries gluten-free?", " What?? I want a refund."], "P.A.": [" Clear the frame!"], "A.D. (O.S.)": [" Quiet on set!"], "DIRECTOR (O.S.)": [" Cut!", " ...We’ll be seeing you very soon."], "MIA’S MOM (O.S.)": [" Hi, sweetie. How are you?", " Oh my God! You’re going to be on TV??", " Not picked up?", " And you’re in the pilot?", " I see... Didn’t you audition for a TV thing last week?", " I see... So you might get a role in a thing that might one day be put on TV...", " No, I don’t mean that, it’s so exciting. What channel? ABC? HBO?", " Oxygen?", " Dad just helped me find Oxygen on the guide! So exciting! So will you be getting health insurance now?"], "ASSISTANT": [" Mia Dolan?"], "DIRECTOR": [" Whenever you’re ready.", " Thanks.", " No, thanks, that was great."], "ALEXIS (CONT’D)": [" Greg’s here..."], "GREG": [" Hey... I’m parked out front. But we should hurry, my brother just landed.", " It’s ok.", " Oh, sure --", " I’ve never heard anyone say that. Was it amazing?", " Mia?"], "GREG (CONT’D)": [" Did you forget?"], "GREG (O.S.) (CONT’D)": [" Josh! Yep, just picking Mia up now. Will be there in twenty."], "JOSH": [" That’s right -- but now we’ve got a surround-sound set-up, so it’s like --", " It’s better than going to a theater, really. You know theaters these days --", " -- they’re so dirty, and they’re either too hot or too cold, and there’s always people talking, which is just -- -- just so annoying, I mean you’re trying to watch a movie -- one second -- Hello?...", " Yeah, I’ll have to call you back. So, yeah, we love it.", " Oh my God. A five-star jungle eco-resort. It was unbelievable."], "FIANCEE": [" It’s like being in a movie theater.", " Probably work."], "JOSH (CONT’D)": [" One word for you. Nicaragua."], "ALEXIS (O.S.)": [" A play? You better give us roles!"], "MIA (O.S.) (CONT’D)": [" It’s one-way!!", " Look -- he’s going to find a way to open it and you’re going to love it. Ok? How’s Dad?"], "KEITH (O.S.)": [" Sebastian?"], "KEITH": [" Holy shit. Come here, man.", " So how’ve you been?", " Keeping busy. Got a new combo.", " ...Looking for keys.", " You sure? It pays.", " Let’s just grab a drink then. Call me. It’s been too long.", " Nice meeting you, Mia.", " Sebastian.", " Here’s the deal. We’ve got distribution with Universal, got our own imprint. We’re about to go on the road. We can cut you in for 1K a week while we tour, plus an equal share of any merchandise or ticket revenue that comes in. Sound good?", " Let’s play, see how it feels.", " I get it. I got it wrong. Last guy wasn’t as good as you. But you’re a pain in the ass, man.", " You good for tonight, right?", " Seven. The photo shoot. Mojo.", " No. It’s tonight."], "KEITH (CONT’D)": [" Didn’t know if I’d see you today.", " Sebastian?", " I know. It’s different.", " But you say you want to save jazz. How are you going to save jazz if no one’s listening? Jazz wouldn’t exist if people hadn’t gotten tired of what they were listening to before. I mean, do you really think a bunch of ninety-year-olds in a basement is the future of the form? Traditionalists whined when Kenny Clarke started dropping bombs. If traditionalists had their way, we’d still be playing Dixieland.", " If it’s not your thing, just let me know. I don’t want you uncomfortable and trying to change this into something it’s not. But if you want it -- the job’s yours.", " Is that ok?"], "LAURA (CONT’D)": [" Now he’s going to check the other window. Yep, it’s closed. Now he’s going to check again. Yep, still closed.", " Don’t stress about the play. Where’s Seb now?", " Dreams change.", " Don’t overthink it. He’ll be home soon.", " I told you not to get me anything!", " Now -- listen to me. I want you to save for a down payment. You understand? You need a home.", " Ah I gotta -- the future in-laws...", " Is my...my hair...?"], "HARRY": [" Hey. I’m grabbing some pastries, you two want anything?", " Oh, right -- I’ll eat it I guess."], "PHOTOGRAPHER": [" Put a light on the drums... I need more fill in this corner..."], "PHOTOGRAPHER (CONT’D)": [" Bass, head up. Piano, look down at the keys.", " Cut the music. Turn the keyboard live. Piano look up, play.", " No -- piano -- actually play something.", " Good, now bite your lip like you’re concentrating on a solo.", " That was good. Don’t stop."], "AUDIENCE MEMBER #1 (O.S.)": [" I swear to God, if I have to hear one more hipster waxing nostalgic I’m gonna slit my wrists.", " She’s not even good. That window thing...?"], "AUDIENCE MEMBER #2 (O.S.)": [" Seriously.", " Christ... Don’t quit your day job..."], "WOMAN #2 (O.S.)": [" Hi, I’m trying to reach Mia Dolan.", " -- She’s not answering her cell and I was told I might find her here.", " Ok. If you do talk to her --", " -- please tell her Jane at Amy Brandt Casting is trying to reach her."], "MIA’S DAD": [" You want some more rice?", " You look hungry.", " It’s fun having you back. Your mom ditches me at ten.", " She made me.", " Never."], "MIA’S DAD (CONT’D)": [" I’ve still got all your old tapes.", " What the hell...?"], "ASSISTANT #2": [" Mia?"], "AMY BRANDT": [" I’m Amy, this is Frank. Glad we found you.", " So why don’t you just tell us a story?", " About anything."], "AMY BRANDT (CONT’D)": [" The movie shoots in Paris. There’s no script.", " Whenever you’re ready."], "FRANK": [" We want to build the character with you. It’s a process. Three-month rehearsal, four-month shoot."], "NEW MANAGER": [" On us."], "EMPLOYEE": [" Took him long enough.", " I got a check for you to sign.", " Not too bad.", " See you tonight."], "DRUMMER": [" King Seb!", " Like the desert misses the rain."], "SAXOPHONIST": [" Seb -- Edgar’s bringing his horn tonight.", " That’s not Edgar."], "CHELSEA": [" Bye, Mrs. Dolan."], "DAVID": [" What if we miss this? What do we tell Natalie?", " Alright...", " Do you want to stay for another?"], "DAVID (CONT’D)": [" This looks fun.", " Come on...", " Mia?"]}