{"scenarios": ["FADE IN...", "A sun-blasted sky. We HEAR radios -- one piece of music after", "another...", "We’re --", "EXT. 101 FREEWAY - DAY", "Cars are at a standstill. It’s a horrific traffic jam.", "Morning rush hour. Sun beating down, asphalt shimmering in the", "heat. The blown-out downtown L.A. skyline hovers in the", "distance.", "We DRIFT past more CARS. Hear one snippet of audio after", "another...", "One driver taps his steering wheel to PROG ROCK. Another", "sings to OPERA. A third raps along to a HIP-HOP track. We", "move from a RADIO INTERVIEW to a FRENCH BALLAD to TECHNO,", "until finally we begin to hear", "...a new, original piece of music... [ANOTHER DAY OF SUN]", "We settle on the CAR from which this new tune is playing.", "The driver is a YOUNG WOMAN. She hums along to the riff on", "her radio -- then starts SINGING.", "Then -- she EXITS her car. Then -- she starts MOVING down the", "lane.", "One by one, more DRIVERS join her -- SINGING and DANCING", "along. Without a single cut, we’ve found ourselves in a FULL-", "FLEDGED MUSICAL NUMBER...", "Drivers leap on car-tops, dance Jerome Robbins-style, making", "use of the road and the hot gleam of the automobiles. Arms", "swaying, feet banging, dancers darting, as the MUSIC blasts.", "We WEAVE and SWIRL and DART between and around the cars,", "taking the magic in...", "Finally -- all the drivers swing back into their vehicles --", "and the song comes to a dramatic stop.", "Flash title card:", "We settle on a new car. A 1983 Dodge Riviera. In it is", "SEBASTIAN, 32, L.A. native. He’s listening to the radio. He’s", "playing a track on his music system -- a tape of Thelonious", "Monk’s “Japanese Folk Song”. But he keeps stopping it, over", "and over and over -- always rewinding to the same exact spot.", "OMIT", "We DRIFT from his car to one further up ahead. A light-green", "2005 Prius. Inside is MIA, 27, Nevada-raised. Six years of", "“no” in L.A. have toughened her, but she’s still a dreamer.", "She seems to be on the phone, speaking into her car’s system.", "Fast, fiery, full of energy --", "Mia stops. Thinks. Mutters to herself: “Insanity”... Then", "leans down and grabs a piece of paper from the passenger", "seat. It’s a SCRIPT.", "Just then -- the traffic around Mia starts to let up. She’s", "too focused on her lines to notice.", "Then -- a long, sustained honk behind her: AHHHHHHHHHHHHHHHT.", "Mia comes to. Jerked back to reality. The honking car behind", "her swerves into the next lane. It’s Sebastian. Mia gives him", "the finger. We then FOLLOW her as she drives...", "OMIT", "OMIT", "INT. COFFEE SHOP - DAY", "Mia works, photos of Hollywood icons on the wall behind her, as --", "Mia hands it over. The Customer looks.", "Mia gets the coffee. Quickly sneaks a look at a script hidden", "underneath her counter. The same one we saw in her car...", "She hands the coffee to the Customer. We follow the Customer", "out through the door -- as a WOMAN walks into the shop. We", "don’t see the Woman’s face, but we see all the eyes in the", "shop turn immediately to her. We see one CUSTOMER whisper to", "another, discreetly pointing as the WOMAN passes by...", "Mia nods. Gets it made. The Manager takes it from her.", "She pays. Then smiles at Mia and drops a bill in the tip jar.", "Mia watches as the Woman walks off, is joined by a STUDIO", "EMPLOYEE on a golf cart outside -- we realize this coffee shop", "is on a STUDIO LOT -- and is driven away...", "Then -- Mia’s phone rings. It reads: “MOM”. Mia presses", "“IGNORE” and the time pops up on the phone’s screen: 4:07.", "Removing her apron and hurrying out, turning back as --", "-- then realizes she doesn’t have her script, runs back to", "grab it, hurries on and then -- CRASHES into a table. Coffee", "and food spill all over her shirt, and all at once we’re --", "INT. AUDITION ROOM - DAY", "Mia’s in a thick winter coat, covering her stained shirt. On", "her cell, loudly laughing while her adrenaline surges --", "Her nerves are practically visible. As she talks, we PULL", "BACK -- to see that she’s auditioning for a CASTING DIRECTOR.", "An ASSISTANT appears through the glass on the door behind", "Mia, waving to the Casting Director: Yoohoo. Can I come in?", "Mia stops. The Casting Director waves the Assistant in. The", "Assistant scurries in, shows her boss a post-it. Mia stands", "there, trying to hold onto the tears, hold onto the emotion, as", "the Casting Director reads the post-it and thinks.", "The Assistant nods. Walks out. Mia waits, trying to maintain...", "Mia looks at her. A beat.", "INT. LOBBY - DAY", "Mia exits. Nerves still on edge. Passes one beautiful redhead", "after the next -- all getting ready to cry.", "Enters the elevator with two other WOMEN -- tall, statuesque.", "Also redheads.", "INT. MIA’S APARTMENT - EARLY EVENING", "Mia enters. Exhausted. Heads to her ROOM.", "Old movie posters hang on the walls, including a big Ingrid", "Bergman one over the bed. There’s also a shelf filled with", "acting books -- Uta Hagen, Stella Adler. Various other", "trinkets: an old globe, an old blue-and-red suitcase. Mia", "takes off her shoe. A blister on her sole.", "WE CUT TO: Mia in the BATHROOM. Just showered, wrapped in a", "towel. She hums to herself.", "The mirror is fogged up. She turns off the vent. The mist on", "the glass thickens. She dabs some of it away. Dims the", "lights. Looks...", "With the fog in place, her reflection looks like one of those", "soft-focus old Hollywood close-ups. She hums as she brushes", "her hair...", "Then -- the door SWINGS open -- and the spell is broken.", "Mia snaps out of it. Turns. Fog is enveloping TRACY, 27.", "As Mia slips away --", "WE PAN TO find Mia poking her head out of her bedroom --", "We follow Mia INSIDE her room. She closes the door. Takes a", "moment. You can tell in her eyes -- work or not, a night on", "the town is the last thing she wants to do now.", "WE CUT to the HALLWAY, to find Tracy POUNDING on Mia’s door.", "With that -- she barges in and beelines to Mia’s closet --", "She pulls out a blue dress. As Alexis hurries in --", "This looks familiar.", "Alexis moves from Mia’s perfume to the dress, lighting up as", "she grabs it --", "Mia rolls her eyes -- and, with that --", "Tracy BREAKS INTO SONG. [SOMEONE IN THE CROWD]", "She play-acts the clichés this party will represent. Alexis", "and Caitlin join in, giddy and playful. Mia can’t help but", "laugh. The roommates sing and dance, hoping to persuade Mia", "to join the night’s revelry...", "Mia remains reluctant. Stays behind in her room as her", "roommates head out the door. But she’s starting to wonder: A", "night at home, feeling sorry for herself -- or a night out", "with her friends...?", "EXT. APARTMENT BUILDING / STREET - NIGHT", "We’re outside now, and BACK with Tracy, Alexis and Caitlin,", "marching across the courtyard and toward the street. They", "sing, dance, half-assuming Mia is a no-go --", "-- until Mia APPEARS, blue-dress-clad. Her roommates look at", "her in surprise -- then delight. The energy swells and the", "four characters dance their way together down the street.", "They dive into a single CAR, and WE DISSOLVE TO...", "OMIT.", "OMIT.", "EXT. CITY - NIGHT", "An old-fashioned MONTAGE of a night on the town: neon signs", "and overflowing champagne glasses. Soon enough, we’re at...", "EXT. MODERN HILLTOP HOUSE - NIGHT", "Valet cars lined up. We FOLLOW Alexis, Tracy, Caitlin and Mia", "to the door...", "INT./EXT. HILLTOP HOUSE - NIGHT", "...and into a big-glass hilltop pad. We FOLLOW Mia as she", "takes in her surroundings.", "A D.J. turning tables. A FAT OLD PRODUCER dancing with a", "TWENTY-SOMETHING. A trio of AGENTS glad-handing each other in", "rhythm by the bar. Yep -- every cliché is here...", "Mia tries talking to a pair of WOMEN -- who promptly ditch", "her.", "Seeing she’s now alone, a YOUNG MAN swoops in to hit on her.", "She makes a hasty exit toward the bar -- but the line’s", "obscenely long.", "She nears the BATHROOM door -- but a COUPLE stands in her way,", "making out.", "She slips in behind them...", "Inside the BATHROOM, Mia takes a moment. The joy of seconds", "ago is gone from her eyes now. She gazes into the mirror --", "-- and SINGS by herself.", "This verse, sung in private, belongs to a new style: less", "brash, and far more vulnerable...", "Once finished, Mia takes a breath, steels herself to once", "again face the world, opens the door -- and rejoins the", "crowd...", "We MOVE with her slowly now -- surrounded by the party, but", "everything set at a snail’s pace, the crazed carousers moving", "in SLOW MOTION. It’s the sadness underneath the revelry, the", "pain underneath the clichés...", "Gradually we RAMP UP. Follow Mia OUTSIDE, where we see the", "splash of blue-green that is the POOL -- and a flurry of FAKE", "SNOW falling from above...", "As we reach FULL-SPEED, a PARTY-GOER races to the edge, jumps --", "-- and we PLUNGE WITH HIM INTO THE POOL.", "This is the climax of the number. Everyone joins in,", "circling the pool -- a swath of color against the black sky.", "Everyone dances, everyone sings -- and the song concludes", "with a blast of fireworks.", "OMIT", "EXT. STREET - NIGHT", "Close on a sign: “NO PARKING ANYTIME: TOW-AWAY ZONE”.", "We see Mia -- all alone, staring at the sign. No car in", "sight. She reaches into her purse, pulls out her cell phone", "to call Tracy. It’s dead.", "OMIT", "OMIT", "OMIT", "OMIT", "OMIT", "OMIT", "EXT. HILL / LOS ANGELES STREETS - NIGHT", "Mia trudges down the steep hill in her unwieldy heels. She’s an", "hour-and-a-half walk from her place. She crosses roads and lots,", "navigates stretches where the sidewalk stops and gives way to", "shrubbery.", "And then -- she hears something... Music. A piano, in the", "distance. And a MELODY -- one we will come to know very well...", "Without being sure why, she FOLLOWS THE SOUND. Passes several", "doors. Then stops. Has found where it’s coming from...", "She reaches out -- and slowly opens a door...", "AND WE CUT RIGHT BACK TO:", "EXT. 101 FREEWAY - EARLIER THAT MORNING", "AHHHHHHHHHHHHHHHHHHHHHHT. The same 101 traffic jam we began", "with. This time we’re on Sebastian -- the honker.", "He passes Mia’s car. She gives him the finger. He drives on,", "shaking his head...", "OMIT", "EXT. RAYO’S - MOMENTS LATER", "Sebastian sips a coffee as he gazes across the street -- at", "a 30’s Deco building. A sign above the door: “VAN BEEK”. A", "newer sub-heading below: “TAPAS & TUNES”.", "The door opens. Two EMPLOYEES step out, setting up a valet", "stand. Sebastian watches them -- and shakes his head. The", "employees notice him. Recognize him. What is it with that", "guy...?", "OMIT", "INT. SEBASTIAN’S APARTMENT - DAY", "Sebastian enters his apartment -- cramped, dingy, bare", "walls, no furniture or decoration, boxes filled with dusty", "black-and-white photographs and unused instruments on the", "floor, a black Steinway upright piano in the center of the", "living room -- and sees a WOMAN rummaging around.", "She looks up. She’s 37 quickly going on 50, and dressed like", "she doesn’t care. This is LAURA, Sebastian’s older sister.", "Seeing that she’s seated on a stained, decrepit stool --", "She shakes her head: Unbelievable. Tosses the rug to the side.", "A beat. Then --", "She heads to the door. He follows her, won’t give it up --", "Laura can’t help but laugh. Stops by the door. Looks at him.", "She’s gone. Sebastian thinks for a beat, then calls out --", "No reply to his triumphant declaration. He shuts the door.", "Looks again at the napkin. Thinks. Tosses it in the trash.", "INT. SEBASTIAN’S APARTMENT - LATER", "Moments later. Sebastian takes a slice of pizza from the", "fridge, pours himself some more coffee, places a Thelonious", "Monk LP onto a record player, and sits down at the piano.", "“Japanese Folk Song” -- the piece we heard in his car --", "plays...", "Sebastian plays along. Stops. Moves the record back a few", "bars. Starts it again. Plays the same passage over. Stops.", "Moves the record back a second time. Plays the passage again.", "Stops. Over and over, just like in his car -- until, finally,", "he gets it right.", "He keeps playing, louder now, and we’re --", "OMIT", "OMIT", "OMIT", "OMIT", "INT. RESTAURANT - NIGHT", "A red-booth bar-and-restaurant. Christmas decorations all over.", "Sebastian steps in. Immediately beelining over --", "Sebastian sits down at the keys. A WAITRESS passes by.", "With that -- he starts playing “Jingle Bells”.", "INT. RESTAURANT - LATER", "The restaurant’s demographic has changed. It’s now younger", "stragglers wandering in. Sebastian looks beyond bored. He", "finishes “We Wish You a Merry Christmas”. Zero applause.", "He begins a new chart: “Deck the Halls”. But something seems", "to come over him now. He’s restless. Slowly, his playing", "drifts off -- his fingers charting their own path...", "And then -- we hear a melody. The one Mia heard outside. The", "one we’ll refer to from now on as Mia and Sebastian’s song...", "The door opens -- and Mia steps in. She sees Sebastian at the", "piano. Is instantly struck by his playing. [MIA AND", "SEBASTIAN’S THEME]", "Gradually -- all sounds but the music drop out. We drift away", "from reality. Even the walls seem to go slightly darker -- as", "though Sebastian and Mia were all alone... He concludes his", "piece with a jumble of chords, his playing almost free jazz", "now, as we pull back to real life", "...and see the Boss looking on in scorn.", "Sebastian finishes. Silence. Mia looks like the wind has been", "knocked out of her. Sebastian looks up for a second -- and", "sees her. They look at one another. Just a moment.", "Then -- the Boss taps Sebastian on the shoulder. WE STAY ON", "Mia as she watches Sebastian rise with the Boss. We just see", "the Boss talking to Sebastian, can’t hear what is said. Then,", "we get closer -- and realize:", "Sebastian is silent. Then, doesn’t want to have to beg but --", "With that, the Boss walks off. We linger on Sebastian. Anger", "giving way -- to hurt. He starts hurrying toward the door.", "BACK TO Mia -- who didn’t hear what was said. She watches", "Sebastian -- takes a breath, so moved that she’s about to lay", "it all out -- swoops in to corner him -- and --", "-- but Sebastian just walks right by -- his shoulder", "bumping against Mia’s for an added measure of disdain.", "He heads out the door. Slams it shut. Mia is left standing on", "her own. She looks like she’s just been slapped.", "SMASH CUT TO BLACK.", "OMIT", "INT. AUDITION ROOMS - DAY", "Mia auditions. Pilot season cattle-call -- a series of soul-", "crushing try-outs. She’s pandering to the hilt. Quick glimpses:", "Then, a second audition --", "And finally, a third audition --", "EXT. PARTY - DAY", "Mia wanders around another party. A BAD 80’s COVER BAND plays.", "Nice to meet you, Mia.", "She slips away. Presses toward the bar. The music gets louder,", "more obnoxious. She peers toward the band to get a look...", "And then she sees him. Sebastian.", "Playing keyboard-guitar for the band. Dressed up like his band-", "mates in a bright polyester outfit. And hating every second.", "The band finishes, and the SINGER addresses the (thin) crowd.", "Sebastian turns. Sees Mia, looking at him with a defiant grin,", "enjoying her power. He thinks -- then recognizes the face.", "Sebastian stays silent. Mortified. Finally, so reluctant, he", "taps his keyboard to count the band in and begins playing.", "On  the keys, it’s a single note, repeated measure after measure.", "Mia knew this. Sebastian looks at her. She smiles right back.", "EXT. PARTY / INT. HOUSE - MOMENTS LATER", "Set break. Sebastian hurries from the keys -- enters the house,", "looks both ways, finally spots Mia and --", "Mia looks at him. One eyebrow raised. Yeah?", "Sebastian looks at Mia. She smirks. Pleased. The Singer walks", "off.", "A beat.", "He heads back to the keys, and the band resumes:", "EXT. PARTY / STREET - NIGHT", "The party’s finished. Sebastian exits, pulling out his keys,", "as we DRIFT and see a long line to the VALET. Standing way in", "the back, waiting, is Mia. She’s stuck once again with CARLO,", "who’s regaling her --", "Mia spots Sebastian, passing by the Valet with his keys.", "Sebastian stops. Looks at her. Surprised.", "Sebastian thinks. Sees the Valet. Playing it off --", "A beat. Sebastian turns to the Valet’s box. Motions to the", "Valet: Sorry. One second. Looks. All the keys are Prius keys.", "Another beat. Sebastian finds it. Grabs it.", "EXT. STREET - NIGHT", "Mia and Sebastian trudge up a hill lined with cars. Mia aims", "her key fob. No beep. Sebastian points his own keys, also", "aiming for a beep. Silence. They’ve been at this for a while.", "A beat. She aims again. No beep.", "On that, Mia aims again. As always -- no beep. Noticing --", "Sebastian demonstrates with his fob. He looks idiotic.", "Just then, they reach a clearing -- AND THE CITY SKYLINE", "APPEARS BELOW. A ribbon of lights, stretching as far as you", "can see. It’s the most romantic sight imaginable. They look", "at each other. A beat. And then --", "They walk on, the lights shimmering behind.", "And on that -- they SING. [A LOVELY NIGHT]", "Mia and Sebastian try to downplay the romanticism of this", "setting, this moment", "together, atop a hill, the city glittering before them. It’s", "“no big deal”, nothing they haven’t seen or felt before --", "because, after all, there’s no chance for romance between", "them...", "Of course, the music, swelling and building, suggests", "otherwise. Mia tires of her heels, finds a bench and fishes", "for flats in her handbag. Sebastian sits beside her as she", "slips the flats on. They look at each other, suspicious...", "He moves his foot. She moves hers. They look at each other", "again. Still suspicious...", "He moves again. She moves again. They seem to be moving in", "sync -- without their even wanting to...", "And -- bit by bit -- before our eyes -- they’ve almost", "slipped into DANCE...", "Sebastian rises. Mia rises as well. The two look at each", "other. Run back to the bench, hop atop it -- the lights", "stretch out like a magic carpet. They share a moment -- share", "a look -- jump off -- AND START REALLY DANCING NOW...", "Mia does a move, Sebastian responds. Sebastian does a move, Mia", "shakes her head: “Nope”. They make the road their own, growing", "more and more energized, as surprised as we are to find --", "...that they can really dance together.", "Just as this starts to look like a blossoming romance, real", "joy peeking through, our two heroes getting closer and closer", "and closer, looking at each other almost giddily", "...a sound cuts through. It’s a CELL PHONE ring.", "Mia and Sebastian turn -- to her handbag, back by the bench.", "Snapped out of it, Mia heads over and pulls out her cell.", "She hangs up. Looks at Sebastian. An awkward silence. Finally --", "she presses her fob again. Puts it under her chin this time. A", "BEEP can be heard. They see her Prius.", "Not sure what else to say, she heads to her vehicle. Waves.", "Sebastian waves back. Mia drives off. Fast. Silence...", "Looking even more disappointed than he thought he’d be,", "Sebastian walks on for a bit -- then retreats back down.", "Comes to a stop across from the party, and we see his Riviera --", "right, it seems, where he knew it was all along. He pulls out", "his keys -- they don’t have a clicker after all.", "OMIT", "INT. COFFEE SHOP - DAY", "CLOSE on --", "Mia’s at work. A typically chaotic day.", "Mia nods, heads to the Manager --", "With that, the Manager walks off. Mia is silent for a moment", "-- wants to talk back but needs this job -- then turns -- and", "sees Sebastian at the counter.", "Mia looks at him. He’s sweating through his shirt. A beat.", "Mia laughs. A moment.", "EXT. COFFEE SHOP / STUDIO LOT - DAY", "Mia exits, apron off. She and Sebastian start walking. She points", "across the street -- to the façade of a Parisian apartment.", "Sebastian nods. They start walking.", "An awkward beat. They pass a wooden SALOON -- where a WESTERN", "is being shot. Extras in COWBOY costumes drink coffee on the", "steps.", "Mia laughs.", "They reach a patch of green. Another shoot. A P.A. yells out:", "Mia laughs. A beat.", "Mia and Sebastian watch the cameras roll. Then, in a whisper --", "Mia and Sebastian resume walking. Now, at full volume --", "CUT TO: The entrance to a giant soundstage.", "She and Sebastian stop. Peer inside the stage.", "They resume walking.", "CUT TO: A row of closed soundstages, sandy-tan against the", "bright blue sky.", "Sebastian laughs.", "Sebastian stops. Turns to her.", "Mia looks at him. We hear DRUMS. A swinging ride pattern. And", "we’re in --", "INT. LIGHTHOUSE CAFE - DAY", "-- an old-school JAZZ CLUB. It’s almost empty, only aged JAZZ", "CATS here -- except for Mia and Sebastian, watching a QUARTET...", "Mia looks at him. Already knows just how to get to him.", "She bursts into laughter. Sebastian points to the band --", "A beat. Mia looks at the band. We DRIFT over the instruments...", "Mia looks at Sebastian. Her laughter has subsided. She can", "see something in him now -- the same passion he’s speaking of...", "He watches the band. Lost in the sound. Then -- sincere --", "The band finishes. The ride cymbal sizzles in the air...", "He looks at Mia. She’s visibly moved.", "Just then -- we hear a BEEP. Mia looks at her phone.", "INT. SIDE CORRIDOR - LIGHTHOUSE CAFE - CONTINUOUS", "INT. LIGHTHOUSE CAFE - MOMENTS LATER", "Mia steps out, dazed. Sebastian’s listening to a new tune. He", "spots Mia, turns to her -- as, shouting over the music --", "Mia laughs. But Sebastian can tell something in her laugh...", "Mia looks at him -- he looks at her -- each of them", "suppressing a newfound giddiness... And on that --", "EXT. LIGHTHOUSE CAFE - EVENING", "Mia and Sebastian exit. Wave “good-bye”. We FOLLOW Sebastian.", "He rounds the corner, nears the Hermosa Beach pier", "...and begins to SING. [CITY OF STARS] Lifted by a strange", "new feeling -- a feeling he wasn’t expecting. The feeling", "that perhaps -- just perhaps -- he’s falling in love...", "He gazes out at the sea, the purple sky. Dances with an OLD", "COUPLE, then continues on his way, as though caught in a", "dream. There’s an uncertainty in his singing -- he’s not sure", "if this dream will sustain. But for now, it’s a beautiful", "feeling...", "The MUSIC simmers down -- and WE FADE OUT.", "EXT. AUDITION BUILDING - DAY", "A Pasadena building. As Mia approaches the door, another cell", "ring. It’s her MOM. This time, Mia is happy to get the call:", "She hangs up. Takes a deep breath. Enters the building.", "INT. WAITING ROOM - MOMENTS LATER", "Mia sits, starts reviewing her script.", "Looks around her -- the room is filled with ACTRESSES silently", "MOUTHING THEIR LINES. It’s a bizarre sight: a dozen women", "moving their mouths, with no sound coming out at all.", "What’s more, they’re all in variations of the same type of", "costume: Michelle Pfeiffer’s leather jacket from Dangerous", "Minds.", "A few stare at Mia, sizing her up. In the corner, another", "one of them GRUNTS while performing stretches. Then -- a", "DOOR to the side opens, and Mia can hear --", "An ACTRESS exits. Absolutely beaming. And then, a bored voice --", "INT. AUDITION ROOM - MOMENTS LATER", "Mia steps in. The pilot’s DIRECTOR is seated at a table,", "looking in his folder at Mia’s head-shot. He looks up at Mia.", "Mia breathes in. Heart pounding. Sweat percolating. Has been", "practicing this for days now.", "Fighting her nerves, she begins --", "Mia is taken aback.", "We linger on Mia for a moment, and then --", "EXT. PARKING LOT / INT. MIA’S CAR - DAY", "Crestfallen, humiliated, Mia hurries to her car. Sees a voice-", "mail on her cell. Plays it --", "Mia switches her phone off and drives. Clenches her jaw.", "Turns left and sees a movie theater. The Rialto. Manages a", "smile.", "Something she can remain upbeat about...", "INT. MIA’S APARTMENT - DAY", "Mia in her room, sorting through outfits. Slips into jeans --", "-- then spins around, startled. Alexis is at the door, eating", "Fritos. Has been crying.", "Mia looks at Alexis -- completely confused. Then -- Greg steps", "out behind Alexis. Waves to her.", "Mia looks at him, still confused. Then remembers.", "Mia closes her door -- turns -- and we see her face. She’s", "crushed. She goes to call Sebastian -- then freezes.", "Remembers something else. She never got his number...", "We linger on her face, as, on his phone outside her door --", "INT. LIGHTHOUSE CAFE - NIGHT", "Sebastian’s playing a jam session. Excited, distracted. 10pm", "can’t come quickly enough.", "INT. JAR - NIGHT", "Mia, in a green dress, with Greg, his brother JOSH, and", "Josh’s FIANCEE. The restaurant is posh, modern. Josh wears a", "Brooks Brothers suit: he seems better-off than his brother.", "His Fiancée smiles, looks at Greg and Mia, proud.", "Awkward silence. Mia hasn’t spoken a word.", "EXT. RIALTO MOVIE THEATER - NIGHT", "Sebastian paces. People shuffle in. He looks. No sign of Mia.", "INT. JAR - NIGHT", "Midway through the meal.", "Mia is bored, restless, uneasy.", "Mia stays quiet, in her own thoughts, the voices around her", "fading away. And then she hears it -- coming from the", "restaurant speakers, peeking out subtly at first: the melody", "we now know so well... Her and Sebastian’s song.", "She FREEZES. The radio music seems to have morphed into the", "melody, and the tune stirs something deep within her...", "A few seconds pass. And then she can’t deny it any longer.", "It’s clear as day to her now. She rises from her seat --", "-- looks at Greg --", "-- and -- as the sounds of a FULL ORCHESTRA swoop in --", "-- RUNS out of the restaurant as fast as she can.", "EXT. JAR - NIGHT", "The MUSIC SWELLS, strings carrying us through and lifting", "Mia’s spirits as she runs down the street in her green dress,", "for once absolutely sure of what she’s doing...", "INT. RIALTO MOVIE THEATER - NIGHT", "Inside the Rialto, Sebastian settling into his seat, the show", "about to begin. He’s visibly disappointed that he’s alone. The", "lights dim. Projector light cuts through the darkness.  And", "then, as the movie’s credits start up, Sebastian spots, out of", "the corner of his eye, a figure in the aisle...", "He looks. The figure turns. Looks at him. It’s Mia.", "And, caught like a freeze-frame in the projector light, her", "green dress incandescent, the giant movie screen behind her", "like a great piece of back-projection, she looks more beautiful", "than ever right now. A true old-fashioned screen siren.", "Sebastian’s eyes go wide. He’s surprised. And thrilled. He", "waves. Mia hurries toward him. Takes the seat next to his,", "as Rebel Without a Cause begins...", "INT. RIALTO MOVIE THEATER - LATER", "Half an hour has passed. The movie plays, lights flickering", "on Mia and Sebastian’s darkened faces.", "He puts his arm on the armrest, she moves hers nervously.", "He scoots to his right, she scoots back.", "She edges her elbow onto the armrest, he moves his arm.", "Inch by inch, their bodies grow closer. Hands approaching,", "breaths quickening, hearts pounding", "...until finally their hands touch...", "And then, suddenly -- just as James Dean and Natalie Wood", "arrive at Griffith Observatory, and Mia and Sebastian seem", "about to kiss --", "-- burn marks streak their way across the image.", "The screen goes blank.", "Silence. The lights go on. Mia and Sebastian turn around.", "AUDIENCE MEMBERS start murmuring. Sebastian can barely", "believe his bad luck.", "But then Mia turns to him. Energized.", "EXT. ROAD - NIGHT", "Sebastian’s car, traveling up a winding road, stars glittering", "above it, the lights of Los Angeles glittering below it. The sky", "is a deep, painted blue. Music plays... [PLANETARIUM]", "The car is bending around the turns, making its way up to...", "...the real Griffith Observatory. There, our MUSIC crests.", "Our two characters get out of the car and wander, searching", "for an open entrance. They find one", "INT. GRIFFITH OBSERVATORY - CONTINUOUS", "They ascend a staircase. Make their way past the exhibits --", "the Tesla coil shooting off electric bolts.", "They reach the pendulum, gaze up at the mural above it, look at", "one another. Circle the pendulum, and then -- so tenderly, so", "nervously...", "...they begin to DANCE.", "This is a dance that fulfills all the promise in their", "earlier duet. They circle the floor, gently and gracefully.", "The music BUILDS, and they drift into...", "...the PLANETARIUM. It’s darkened, empty. Mia removes her", "shoes, feels the soft carpet under her feet. Turns on the", "projector. The screen STARTS TO GLOW. She and Sebastian take", "in the sight -- the STARS and GALAXIES...", "Enchanted, they look at one another, the lights from the", "screen reflected on their faces. They approach, as though", "about to kiss... When --", "-- Mia’s shoes LIFT UP. Float toward the ceiling -- toward the", "star-filled screen. She and Sebastian trade looks. Realize.", "And then they too begin to FLOAT", "...RISING from the floor, nothing stopping them. SOARING", "past the views of comets and moons and nebulae. Eyes wide,", "their emotions seized, as they HOLD EACH OTHER TIGHT...", "And so unspools a gravity-free dance.", "Mia and Sebastian SPIN and TWIRL through the planetarium as", "though they themselves were in outer space, flying through", "the cosmos. The music carries them higher and higher, and", "their spirits likewise soar -- JOYOUS, EXUBERANT -- until,", "finally", "...the music SOFTENS.", "Mia and Sebastian drift back to the floor like feathers. They", "land on a pair of seats.", "There, once again seated like audience members at a movie, they", "turn and look into each other’s eyes. The music picks back up", "for the big finish, as the lovers lean in and -- in true movie-", "movie old-Hollywood big-musical fashion --", "-- LOCK LIPS.", "It’s their first kiss, and it’s a kiss to remember -- full of", "all the hope and yearning and terror and wonder of love’s first", "blush. A swoon-worthy kiss, with the orchestra soaring and the", "camera swooping in to catch the embrace in all its glory.", "On this triumphant moment", "...we IRIS FADE OUT.", "OMIT", "INT. MIA’S APARTMENT - LIVING ROOM - DAY", "Mia’s scribbling in a notebook. It’s dialogue. We see character", "headings, scene headings. Seems to be some kind of a script...", "Mia turns. Tracy has wandered in -- pajamas, eating cereal.", "A beat -- and then --", "AHHHHHHHHHHHHHHHHHHHHHHHHHHHT.", "HONKING outside the nearest window. It’s a honk we recognize:", "OMIT", "EXT. MIA’S APARTMENT BUILDING - DAY", "Mia dashes out -- and LEAPS into Sebastian’s car and into his", "arms. They KISS -- giddy, emotional, as though they’d been", "separated for years. Sebastian drives off -- when --", "The car SCREECHES to a stop in front of a TRUCK going the", "opposite direction. Sebastian goes into REVERSE as Mia cracks", "up laughing. A BURST OF MUSIC as a title card pops on:", "The MUSIC carries us through the following series of GLIMPSES:", "-- Mia and Sebastian ambling past weathered 30’s bungalows in", "BUNKER HILL...", "-- Mia guiding Sebastian down a street peppered with SILENT-", "ERA HOMES, past old gas-lamps and palms...", "-- VAN BEEK. Sebastian gestures to the “TAPAS & TUNES” sign.", "Excitedly tries to deface it. Mia, aghast, pulls him back...", "-- The HUNTINGTON GARDENS, where Mia and Sebastian gaze at", "the tiny forest...", "-- WATTS TOWERS, where the two lovers stroll and kiss...", "OMIT", "-- The GRAND CENTRAL MARKET, where they grab food...", "-- ANGEL’S FLIGHT at night, where they stumble and slip into", "a tipsy, love-soaked dance...", "OMIT", "Interspersed throughout, WE SEE IMAGES OF LOS ANGELES:", "1940’s high-rises, green movie-movie lettering, ochre walls", "shaded by palm fronds, red flowers and Spanish missions, old", "lamps and Art Deco hotels. It’s a gorgeous city, and the music", "only makes it more gorgeous -- building and carrying us to...", "INT. LIGHTHOUSE CAFE - NIGHT", "A Lighthouse JAM SESSION. Sebastian’s at the keys, having a", "blast. The place is again mostly empty, but Mia is dancing her", "heart out. She shoots looks at Sebastian. He laughs, plays out", "for her. The two of them are in their own world -- one of pure,", "unadulterated JOY...", "The song ends. Sebastian rises, joins Mia. They sit down as", "the band strikes up a new tune, and kiss.", "Mia and Sebastian look up, startled. A YOUNG MAN, 35, is", "standing next to them. Tall, fierce eyes. This is KEITH.", "Sebastian gets up. Gives him a hug. But Mia can sense an", "unease in Sebastian’s eyes. It’s a strained hug.", "Hey, Mia.", "Sebastian sits back down. Wants to end the conversation.", "Sebastian looks at Keith. A moment.", "Keith almost smiles. Expected this.", "Keith walks off. Mia and Sebastian look at each other. Then --", "INT. SEBASTIAN’S APARTMENT - NIGHT", "CLOSE ON MIA. She looks anxious. CLOSE ON Sebastian. He looks", "head-over-heels in love.", "We PULL BACK -- and see a script on Mia’s lap. She’s just", "finished reading Sebastian her play.", "Mia looks at him. Smiles. It genuinely means the world to", "her. Then, a glow in her eyes, wants to reciprocate --", "She hops off the bed, fishes through a bag. Pulls out a", "drawing.", "Sebastian looks at her. Appreciates that line. A beat. Then --", "Mia smiles. He approaches her, sits by her side.", "They laugh.", "A beat.", "A moment passes. They lie down, side by side.", "She looks at him. He looks at her. A shared smile.", "And on that --", "INT. SEBASTIAN’S APARTMENT - MORNING", "The next morning. Sebastian is in bed. Hears snatches of Mia’s", "voice -- she’s on her phone in the other room:", "Sebastian listens. Takes it in.", "On Sebastian. He thinks...", "INT. REHEARSAL SPACE - DAY", "Sebastian enters. Keith’s combo is assembled.", "It’s a sign-up practice room in the West Valley. There’s a", "drummer, electric bassist, and trumpeter: COLE, MALCOLM and", "TOM. They’re more polished in their looks than Sebastian.", "Well-groomed beards, tighter jeans.", "Sebastian approaches.", "A moment. Then --", "Keith gestures -- to an electronic keyboard. Sebastian winces.", "We see Sebastian’s face. Taken aback.", "A moment. Keith smiles.", "He pulls out a guitar. Cole starts on drums. Keith joins in.", "Malcolm and Tom follow suit. Sebastian listens. It sounds like", "modern jazz -- electronic in feel, but still jazz...", "Sebastian approaches the keyboard. Joins -- slowly, one step", "at a time. Then begins playing out a bit more, his fingers", "starting to race. Malcolm gives Keith a look: “Damn”. Keith", "gives Malcolm a look back: “I told you so.” Bit by bit,", "Sebastian eases into the groove. This isn’t so bad...", "Then -- Keith moves to a LAPTOP. Introduces a DRUM-MACHINE", "SAMPLE.", "Sebastian, into the music, is caught off-guard. Uneasy now.", "This isn’t him...", "Keith plays a riff on his guitar. Tom echoes it on bass, then", "Malcolm on trumpet. Now it’s Sebastian’s turn. He hesitates.", "And then -- finally -- he plays the riff...", "It doesn’t feel so bad. The guys build on the riff. Sebastian", "keeps up with them, trying to let go of his presuppositions.", "After all -- these guys can play...", "The music builds, the whole thing swelling and finally", "CARRYING US TO --", "LATER: Sebastian and Keith sit across from each other as", "the other players pack up. Sebastian looks pensive. Noticing --", "Sebastian stays silent. Then, leaning in --", "Sebastian considers this. As much as he might make a play of", "resisting -- we can tell the words are getting to him...", "A moment. Then --", "Sebastian nods. Knows he can’t argue with that.", "Another beat.", "Sebastian looks at Keith. A moment. He’s really weighing", "this. And on that -- his look of uncertainty -- we’re --", "OMIT", "OMIT", "OMIT", "OMIT", "INT. SEBASTIAN’S APARTMENT - DUSK", "The door opens. Mia enters. Takes a deep breath. Hears piano.", "Steps forward and sees Sebastian at his piano -- playing a", "melody we’ve heard before. [CITY OF STARS AS DUET]", "She smiles. Sebastian begins to SING. Mia sits down beside", "him and begins to SING as well. They share a duet -- simple,", "unaffected, hopeful -- the music just perhaps suggesting", "their uncertainty about what they might be about to do...", "As the vocals give way to instrumentation, we’re --", "OMIT", "OMIT", "OMIT", "INT. DINER - DAY", "Sebastian and Keith hunched over paperwork. Sebastian signs...", "INT. COFFEE SHOP / STUDIO LOT - DAY", "Mia handing the Manager her apron. She’s done with the job...", "INT. PRACTICE SPACE - DAY", "The band rehearsing in their new PRACTICE SPACE. We see", "Sebastian play, see Keith sing this time...", "INT. CAFE - DAY", "Mia hunched over her script, obsessively fine-tuning it...", "OMIT", "OMIT", "INT. DESIGNER CLOTHING STORE - DAY", "Sebastian gets dressed up in a new suit...", "INT. BLACK-BOX THEATER - DAY", "We follow Mia through a BLACK-BOX THEATER in North Hollywood.", "The space is small, simple -- but perfect. We see her haggle", "with the OWNER -- and then light up. They shake hands...", "INT. GREEN ROOM - EVENING", "Sebastian and the band in a green room, waiting. Sebastian’s", "wearing the new suit. Looking sharper...", "INT. VINTAGE SHOP - DAY", "Mia looking for PROPS. Another wild assortment -- a TOP HAT,", "a CANE, a DIORAMA of London, rolled-up MAPS, an old GLOBE...", "OMIT", "INT. APARTMENT - DAY", "We MOVE IN on a laptop. On it a YOUTUBE video plays -- an", "interview with Sebastian, Keith and the rest of the band...", "EXT. RIALTO - DAY", "Mia drives by the Rialto theater. It’s now CLOSED...", "INT. SEBASTIAN’S APARTMENT - LIVING ROOM - NIGHT", "Mia sits on the floor, penciling out drawings for her play.", "Costume and poster sketches scattered by her feet. She’s", "tired. The clock on the wall reads: 10:54pm.", "INT. SEBASTIAN’S APARTMENT - BEDROOM - NIGHT", "Mia gets into bed. Checks her phone. Turns off the light.", "INT. SEBASTIAN’S APARTMENT - LIVING ROOM - DAWN", "Sebastian enters the apartment. Checks his reflection in the", "mirror -- a new addition. The clock reads: 4:57am.", "INT. SEBASTIAN’S APARTMENT - BEDROOM - DAWN", "Sebastian gets into bed, careful not to wake Mia.", "INT. SEBASTIAN’S APARTMENT - LIVING ROOM - MORNING", "Mia crosses through to the kitchen to get herself breakfast,", "careful not to wake Sebastian. The clock: 7:02am.", "INT. SEBASTIAN’S APARTMENT - BEDROOM - MORNING", "Sebastian in bed, fast asleep. And WE RETURN TO...", "INT. SEBASTIAN’S APARTMENT - DUSK", "...Mia and Sebastian at the piano, before this latest journey", "began, finishing their song. The last lyrics resonating as", "they look into one another’s eyes:", "City of stars...", "On that -- this image of love, Sebastian playing out the", "final chords on his piano -- WE GO DARK.", "All sound fades out. And then, we hear --", "-- a CROWD CHEERING. [START A FIRE]", "We see -- a white spotlight. It reveals Sebastian. We’re --", "INT. THE ECHO - NIGHT", "Sebastian is on-stage. He’s the only musician we can see. The", "floor beyond the stage is FILLED with people.", "Among them, we spot Mia -- beaming with pride. Sebastian sees", "her, smiles to her as he plays a piano intro. Mia grins right", "back, heart swelling...", "A SECOND SPOTLIGHT turns on, illuminating Keith. He SINGS. He", "has a beautiful voice. Mia bobs her head. It’s just Keith and", "Sebastian right now, all acoustic, a simple, catchy tune...", "And then -- suddenly -- a DRUM MACHINE SURGES IN -- and --", "BOOM! The entire CLUB is lit up as the MUSIC EXPLODES. A full-", "fledged dance beat and a thick radio-ready electronic track.", "Mia is taken aback. But she keeps bobbing her head -- as the", "crowd around her GOES CRAZY...", "Keith owns the stage, as Sebastian plays out more -- now", "switched to an electronic keyboard, complete with synth", "sounds. We recognize fragments of melody from when Keith and", "Sebastian first rehearsed -- but the tune has been", "transformed beyond recognition. Not a hint of jazz...", "Keith breaks into the CHORUS -- and a TRIO OF BACKUP SINGERS", "are revealed stage-left. The band surges into the song’s", "bridge -- and BACKUP DANCERS appear stage-right, scantily-", "clad.", "And then -- the lights go NUTS. It’s a full-out LIGHT SHOW", "now, shafts of red, blue, green and orange cutting through", "the dark. The crowd starts CHEERING, pumping their fists...", "Mia looks at Sebastian. He’s not fighting any of this. He", "sees her. She smiles. But something is changing in her", "expression...", "She looks at the lights, the singers, the dancers, Sebastian", "and his bandmates in matching magazine-cover-ready outfits.", "She looks at the crowd around her -- their hollers growing", "more and more frenzied as Sebastian launches into a prolonged", "SOLO...", "Mia looks back at him, takes it all in: Is this really him...?", "As the mass of people swells and moves, Mia finds herself", "PUSHED TO THE SIDE, bit by bit, away from the center...", "She tries to hold her ground, but is edged FURTHER AND", "FURTHER AWAY. Sebastian, deep in his solo, doesn’t notice.", "Mia tugs against the tide of the crowd, but to no avail.", "She’s pushed to the back of the club, away from the lights", "and into shadow...", "The final chorus begins -- floor-shaking, fist-pounding. We", "linger on Mia’s face -- watching as the band feverishly tear", "into their climactic bars, the dancers on-stage and the crowd", "below busting out one last burst of CRAZED CHOREOGRAPHY --", "ending the song just as we SMASH CUT TO A TITLE CARD OVER", "BLACK:", "Silence.", "We take a moment to collect ourselves before --", "OMIT", "EXT. / INT. CHINESE RESTAURANT - LOS ANGELES - DAY", "CLOSE on Mia. She looks tired. A bit weathered. She’s nursing a", "green tea across from Laura. They’ve finished eating.", "Mia glances out the window. A MAN in his early 40’s has just", "parked, is walking around his car, inspecting it.", "Mia smiles. The MAN enters the restaurant -- greets Mia -- and", "kisses Laura. This is HARRY. Her new boyfriend.", "Harry rolls his eyes, heads to the front. Laura looks at Mia.", "A moment passes.", "Laura means it positively -- but Mia seems concerned...", "Laura shrugs.", "She notices Harry through the window, returning. Her thoughts", "drift.", "A beat. She looks back at Mia. Sees her worry.", "Harry rejoins the table. Hands Laura a sponge cake.", "They laugh. Kiss. Tender. Loving. Mia watches...", "INT. DINER - NIGHT", "Mia eats, her laptop next to her meal. She takes a bite, types.", "We see her screen -- an e-mail draft, glimpses of words: “one-", "woman show”, “one night only”, “7pm”, “I would be thrilled...”", "She thinks. Picks up her phone. Dials Sebastian. Waits. No", "answer.", "She hangs up. Resumes typing.", "INT. SEBASTIAN’S APARTMENT COMPLEX / APARTMENT - NIGHT", "Mia walks through the courtyard. Reaches the door. Then hears", "something... Music -- LOUD, FAST JAZZ...", "She enters -- has to jostle the door handle to do so --", "-- and then freezes in place. Sebastian is sashaying around a", "fully-decked table, lighting candles as he moves. He looks", "up, sees her -- and grins.", "She lights up. He lifts up silver serving trays, revealing", "what he’s cooked. Roast chicken. Pasta.", "Mia laughs. Can’t believe it. Sebastian looks at her --", "sincere now.", "Mia’s eyes seem almost on the brink of tears. Beyond moved,", "she runs into Sebastian’s arms. A LONG, HEARTFELT KISS...", "INT. SEBASTIAN’S APARTMENT - EVENING", "CLOSE ON: The record player. An old jazz track. We see Mia and", "Sebastian seated at the table -- eating, drinking, laughing.", "He smiles.", "Laughter. Then --", "A smile. Beat.", "Mia laughs.", "A beat.", "She looks at him.", "Mia looks at him. Doesn’t seem to understand.", "Beat. Mia takes this in.", "Beat.", "A beat. Mia realizes she’s getting nowhere. A moment of", "quiet. Then --", "Silence. We suddenly realize --", "-- the LP has finished. You can hear the needle scratch", "against it now -- back and forth, back and forth. Sebastian", "looks at Mia.", "A moment. Finally --", "Mia looks back at him. Can’t believe he said that. Tears", "starting to well in her eyes. She tries to suppress them.", "They stare at each other.", "Then -- all of a sudden -- the FIRE ALARM blares.", "Sebastian turns and sees smoke billowing from the KITCHEN. A", "dish in the oven has started to burn.", "Sebastian rises, springs toward the kitchen -- then sees Mia", "grabbing her things.", "But she’s out the door. It slams shut, as Sebastian pulls the", "burnt apple pie from the oven.", "And on that -- WE SMASH CUT TO --", "OMIT", "EXT. THEATER - DAY", "A poster, placed on the front of the theater we saw before.", "A title. A name below it: “MIA DOLAN.” And a word: “TONIGHT.”", "We spot Mia, carrying a box of props. She enters the theater.", "And we’re --", "INT. THEATER - DAY", "The empty theater. Dark. Silent. Then -- a light turns on.", "Mia steps in. We stay WIDE. She seems small from this", "vantage point, surrounded by her props and backdrops. She", "takes a moment. Looks at all the empty seats.", "Takes a deep breath. Nervous. And then, nodding to herself --", "you can do this -- she starts setting up...", "INT. PRACTICE SPACE - DAY", "A BLAST of music. The Messengers have just finished a", "rehearsal. Sebastian packs his stuff, heads toward the exit,", "nodding to the others --", "See you tomorrow.", "-- when --", "Sebastian stops. Looks at Keith.", "A beat. Sebastian is confused.", "We linger on Sebastian for a moment...", "EXT. REHEARSAL SPACE - DAY", "Sebastian stands out front. Checks his watch. Thinks...", "OMIT", "INT. THEATER / INT. BACKSTAGE - NIGHT", "People are shuffling into the theater. We DRIFT BACKSTAGE.", "Mia, now in a male suit and tie, watches behind a curtain.", "Checks her phone. 7:04. Breathes in. Nervous, and alone...", "She turns. Nods to the OWNER, off to the side. He heads to a", "switch, and the lights GO DOWN.", "You can hear the murmurs beyond the curtain. The audience,", "expecting. Mia tries to get her nerves under control. She can", "do this... Sets her phone aside -- one last breath --", "-- and walks out.", "OMIT", "OMIT", "INT. PHOTO STUDIO - NIGHT", "LOUD MUSIC. It’s the band’s song, blaring from a speaker.", "They’re pantomiming -- the musicians styled and ready for", "their close-ups. A PHOTOGRAPHER grabs shots.", "We ZERO IN on Sebastian. His hair sticks out at various", "angles. An artfully-undone tie hangs from his neck. He", "fake-plays, as Keith pretends to lay in sampled beats...", "Keith, Tom, Malcolm, Cole -- they all grin, as excited as", "kids. Sebastian looks at them -- then down at his", "elaborate outfit, then back up at the Photographer", "running around, then at his watch...", "Sebastian does as told, but his thoughts are elsewhere. The", "Photographer moves in close, SNAPPING shots of just him --", "The track stops. Sebastian stops as well. The CLICKS of the", "Photographer’s camera loud now.", "Sebastian is still. Then he starts to play a single melody", "on the keys. We recognize it. The first notes of his and", "Mia’s song...", "Beat. Sebastian stops. Silence. He stares ahead.", "We PUSH IN on Sebastian...", "INT. THEATER - NIGHT", "We’re CLOSE on Mia. In ordinary clothes now.", "Behind her is a wallpapered wall, and a small window. By", "her side are the globe we saw in her room, and other little", "trinkets: a pearl necklace, an old suitcase, a roll of", "maps. Outside the window, projection of a starlit Parisian", "night sky. Completely silent, Mia moves to a lamp, turns it", "off.", "We go BLACK.", "Then -- the house lights go on. White, fluorescent. Thin", "applause can be heard. Mia manages a smile, as we finally see --", "-- that the theater is less than a quarter full.", "Mia takes a bow. Peers out. One seat, in the front row, has a", "“RESERVED” sign on it. The seat is empty.", "OMIT", "INT. THEATER - DRESSING ROOM - MOMENTS LATER", "Mia slips inside, holding in her hurt. Starts collecting a", "few outfits -- then overhears two AUDIENCE MEMBERS outside --", "Laughter.", "Mia freezes. The nail in the coffin. The voices fade. She", "slides into a chair.", "EXT. THEATER - NIGHT", "Sebastian SPEEDING. Screeching to a stop. He’s at Mia’s THEATER.", "He dashes out and runs to the door.", "But it’s locked. No one’s in sight. Fuck.", "He spins around, frantic -- when Mia appears from an adjacent", "doorway, alone and carrying her box of props to her car.", "She turns. Sees him. He runs to her. WRAPS his arms around --", "-- and KISSES her. The kind of kiss that might once have", "swept her off her feet. He starts to move with her", "...starts to DANCE -- but --", "She pulls away. Steps back. Sebastian looks at her. Unmoored.", "She doesn’t say the words with any anger. Just acceptance.", "She says this as though just realizing it. Sebastian looks", "at her. A moment passes. He doesn’t know what to say now.", "Sebastian is silent now. A tear in his eye. He clenches his", "jaw. Mia looks at him one more time, steps into her car, and", "drives off.", "Sebastian lingers. Doesn’t move. Silence. Then, music. Soft,", "melancholy, just piano, as...", "OMIT", "OMIT", "OMIT", "EXT. MIA’S CAR - DAY", "Mia drives, boxes stacked in the back.", "She gets on the 405... Heading out of the city...", "EXT. / INT. MIA’S HOUSE - NEVADA - DUSK", "Mia steps inside a modest house. Her MOM is by the door. Hugs", "her. Her DAD stands by the hallway.", "INT. MIA’S HOUSE - BEDROOM - DUSK", "Mia enters her old bedroom. Slides in a suitcase. Moves a couple", "of boxes from the hall. Looks around. Old photos. Old soccer", "trophies. She sits down on the bed. Takes a breath. And,", "finally, we’re...", "EXT. ORANGE GROVE - DAY", "Laura and Harry’s ENGAGEMENT PARTY. We’re outside, in a sun-", "dappled grove. A small gathering.", "Sebastian plays a baby grand piano -- the source, we realize,", "of the music we’ve been hearing...", "As he watches Laura dance with her new fiancé -- this woman he", "has known for so many years as a romantic cynic, now once", "again full of all the youthful innocence of first love -- his", "thoughts seem to drift. The music comes to a close and...", "LATER: Sebastian with Laura, by the orange trees...", "Sebastian smiles. Then --", "Sebastian is silent. Then --", "Sebastian smiles again. Some calls from the distance --", "She lights up. Likes the sound of that.", "Sebastian, without a word, pulls a strand back. Laura smiles,", "kisses him on the cheek. A quiet, tender moment. Then she", "hurries off. Sebastian stands there. Watches...", "WE FADE OUT.", "INT. SEBASTIAN’S APARTMENT - MORNING", "RINGING. Sebastian is awoken. Groaning, he rolls over. Lets", "the phone ring. It keeps going. Endless... Finally, fed up, he", "reaches for it. Answers --", "Sebastian is taken aback. He goes to hang up, saying just --", "Sebastian pauses. Hurt by the mere mention of Mia’s name --", "A beat. Sebastian sits up. Suddenly wide-eyed.", "INT. MIA’S HOUSE - KITCHEN - NIGHT", "Dinner has just finished. Mia’s Mom gives her a kiss --", "Night, sweetie.", "-- and heads off, as Mia and her Dad stay behind. Getting up", "to scrape the dish --", "A moment. Mia’s Dad puts a few more dishes away, then sits", "back down across from her.", "Mia laughs. A moment.", "A smile.", "Just then -- a loud, persistent HONK. Mia’s Dad looks up,", "eyebrow raised. Mia turns, hearing it as well. The HONKING", "is nearby -- just outside...", "Mia’s thoughts suddenly sharpen. Ears perk up. She’s heard the", "honking before:", "AHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHT.", "Disbelief on Mia’s face. It can’t be. She heads to the nearest", "window. There -- at the corner, smack-dab in front of her", "house -- is SEBASTIAN’S CAR.", "A NEIGHBOR angrily yells at him. Sebastian sees Mia. They lock", "eyes. And on that --", "EXT. MIA’S HOME / SEBASTIAN’S CAR - MOMENTS LATER", "Mia and Sebastian stand next to his car.", "He’s brimming over with excitement. But Mia just shakes", "her head.", "A beat.", "She hesitates. Continues --", "Beat. But Sebastian isn’t giving up.", "Mia thinks about this one for a moment.", "Sebastian shakes his head. Nope. Won’t accept this.", "With that, he gets back into his car. Mia is silent. Then --", "Sebastian turns. Points. Matter-of-fact --", "He drives off. Mia looks up. There, sure enough, is the", "LIBRARY, crouched on the corner. The library that once", "helped set her on her path to acting.", "She looks at it. Thinks...", "EXT. MIA’S STREET - NIGHT/DAY", "Wide on the street. All is quiet. Night becomes morning...", "EXT. MIA’S HOME - DAY", "Sebastian’s car pulls over. He sits there. Sips a coffee, a", "second coffee in the holder. The time: 8:02.", "A moment passes. He taps the wheel. Looks at the house. The", "front door remains closed. No Mia. He leans back. Seems", "worried. Closes his eyes, breathes out. We MOVE CLOSE on him.", "He  breathes in and out again...", "He opens his eyes. 8:10. The door’s still closed. Resigned,", "he starts his car up, BEGINS TO PULL AWAY, when --", "-- BAM! A KNOCK on the opposite window. He jumps.", "It’s Mia. She’s just arrived at the car from the other side,", "two just-bought cups of coffee and a bag of pastries in her", "hands. A beat. Sebastian smiles. Then OPENS the door for her.", "OMIT", "EXT. PARAMOUNT STUDIO LOT - DAY", "A cloudy late afternoon. Mia and Sebastian slowly walk", "through the lot together. They pass the New York street, the", "murals and posters of classic Hollywood, the old Art Deco", "ornaments and the big soundstages and backdrops. Neither says", "a word...", "INT. WAITING LOBBY - DAY", "Mia and Sebastian are seated. Waiting. The DOOR opens. An", "ACTRESS exits. A second later --", "Mia gathers her nerves. Gets up. And steps in.", "INT. AUDITION ROOM / INT. LOBBY - DAY", "In the room is AMY BRANDT -- mid-forties. Seated behind her", "is the director, FRANK.", "Hi, Mia.", "Mia nods. Smiles. A moment.", "Mia nods again. A moment.", "Mia thinks. She takes a breath -- then goes silent again. It", "seems she might be unsure what to do, might even be about to", "choke the audition. We fear she may botch this completely...", "WE CUT TO THE LOBBY -- to Sebastian, hearing Mia’s silence. On", "edge... Worried...", "WE RETURN to the AUDITION ROOM... Brandt and Frank waiting...", "She pauses, and then continues -- in SONG. [TRACK: AUDITION]", "Yes, this audition is different than the rest, and the switch", "to song signals just that. Mia’s nerves fade away -- all the", "accents and fakery of earlier auditions a distant memory. This", "is Mia undisguised -- pure and stark and beautiful...", "She uses the story of her aunt jumping into the river to", "paint a portrait of all the dreamers in the world -- all the", "people who are told they’re nuts for pursuing their passion --", "all the so-called “fools” who take the plunge. She sings", "about them and for them. This is why Mia does what she does --", "why she simply has no choice...", "The song ends, and we linger on her for a moment. Then...", "...WE DISSOLVE TO:", "EXT. GRIFFITH PARK - DAY", "Mia and Sebastian sit on a bench, the Observatory perched", "behind them. The clouds have parted, and it’s now a gorgeous", "Los Angeles afternoon, minutes before dusk.", "Sebastian looks at Mia. A moment passes.", "A beat.", "Sebastian looks at her.", "Beat.", "A moment. Mia nods. Sebastian looks at her again.", "Mia smiles.", "Another moment. And then, finally --", "Mia’s eyes well up, just slightly, as she hears this. She", "nods.", "Beat. Sebastian looks up at the Observatory.", "They laugh.", "Then, almost to herself --", "Sebastian smiles. A moment.", "We CUT TO WIDE. Sebastian and Mia sit side by side. We linger", "here, our two characters framed by the white-and-green", "Observatory, the rest of L.A. stretching out beyond.", "And then, ever so slowly", "...we FADE TO:", "A palm tree, a cloudless sky. We PULL BACK -- to reveal it’s", "all painted...", "EXT. STUDIO LOT - DAY", "We’re on a studio lot, looking at one of the old painted", "backdrops, of a palm tree and sky. A new title card:", "We TILT down to the studio’s entryway. A CAR enters.", "A WOMAN steps out. We don’t see her face. We FOLLOW her from", "behind. She walks elegantly, poised. The wind picks up a", "strand of her hair. She makes her way down side-streets we’ve", "seen before, past Parisian-style façades. Then enters a", "COFFEE SHOP we recognize...", "INT. COFFEE SHOP - DAY", "The eyes inside all look the WOMAN’s way. She reaches the", "counter -- and we finally SEE HER FACE:", "MIA looks different. Different haircut, different way of", "handling herself.", "The BARISTA hurries to get Mia’s order. We recognize this as", "the shop where Mia used to work. A man who appears to be the", "NEW MANAGER gives Mia the coffee --", "Mia hands over a few dollar bills. Then drops another bill into", "the tip jar. The Barista smiles.", "EXT. COFFEE SHOP - MOMENTS LATER", "Mia exits the coffee shop...and is met by a CREW MEMBER on a", "GOLF CART. She gets on the cart -- and is driven away...", "CLOSE ON hands on piano keys, fluttering across the ivories.", "We PULL BACK: it’s SEBASTIAN. We’re in...", "INT. JAZZ CLUB - DAY", "...a small jazz club. Simple, tasteful, cool. Stone arches in", "1940’s style. The seats close to the band, the piano in the", "center. The club has the same old-school character as the", "Lighthouse -- but it’s not run-down. It’s polished, inviting.", "The place is empty save for Sebastian and an EMPLOYEE. It’s", "before-hours. Sebastian finishes playing. Feels out the", "lowest keys once more, then the highest. Then turns and --", "Sebastian smiles.", "EXT. CHATEAU MARMONT - DAY", "Mia pulls into the driveway.", "INT. ROOM - CHATEAU MARMONT - DAY", "She steps inside. Flowers and cards. We glimpse cursive", "“CONGRATULATIONS” written on a few of them. A stack of scripts", "on a nearby table. Her name visible. She drops her things,", "spots someone, goes in to kiss him. A long, tender, loving", "embrace, as we pull back", "...and see that it’s not Sebastian.", "It’s a MAN we haven’t seen before: DAVID, mid-thirties. He", "and Mia kiss again. And, running over and grabbing Mia’s leg,", "is a TWO-YEAR-OLD GIRL...", "INT. SEBASTIAN’S APARTMENT - EVENING", "Sebastian steps in. The place is more habitable than his old", "digs. Fully furnished, warm and welcoming. He heads to the", "kitchen, pulls out some pork cutlets he’s been thawing. We see,", "sitting on the counter, a Christmas card with a photo attached:", "Laura, Harry, and a FOUR-YEAR-OLD BOY, all gathered on a couch", "and smiling at the camera.", "INT. SEBASTIAN’S APARTMENT - LATER", "Sebastian eats his meal, in a new shirt and pants. Checks", "his watch.", "EXT. JAZZ CLUB - DAY", "Sebastian pulls up outside the club. New car, same style.", "Gets out and passes by a movie poster as he walks. We", "can’t see the title, but we can catch a glimpse of a face", "on it.", "It’s MIA...", "INT. JAZZ CLUB - NIGHT", "We’re back in the club.", "It’s bustling now -- the BARTENDERS setting up, DOORMEN", "coming in, MUSICIANS sound-checking. Sebastian enters, the", "musicians greet him --", "And then -- we see a SAXOPHONIST we recognize. One of the old", "Lighthouse players.", "Laughs, pats on the back.", "INT. ROOM - CHATEAU MARMONT - NIGHT", "Mia, in a new outfit, crosses the living area and grabs her", "purse and jacket. David is by the door, jacket on as well.", "Mia bends back around a sofa, where the GIRL we saw before is", "seated next to a nineteen-year-old baby-sitter, CHELSEA.", "The Girl nods. Mia kisses her forehead. Heads to the door.", "OMIT", "INT. CAR - NIGHT", "David drives, Mia seated beside him. They’re on the 101.", "Gridlock traffic up ahead.", "David nods. Looks at the time on the car. 8:06.", "INT. CAR - LATER", "Mia and David are seated. Still not moving. Mia looks at the", "clock again: 8:27.", "David looks at her. Smiles.", "EXT. CITY STREET - NIGHT", "Mia and David walk down a street. A few open restaurants and", "bars, a few other closed storefronts. A lot of old, weathered", "buildings: 1930’s stucco, Art Deco signs.", "Then -- David’s ears perk up. He hears something. MUSIC...", "He looks around. Doesn’t see the source. Heads to the end of", "the block, then sees, just up ahead, a few people entering a", "building. Seems to be where the music’s coming from...", "Mia heads over, curious. The music grows louder -- sounds like", "a JAZZ COMBO. Mia peeks toward the door", "...and then FREEZES.", "The sign on the door reads: “SEB’S”. It’s written the way she", "drew it for Sebastian, years ago...", "Coming up to her side, oblivious --", "David edges past Mia. Glimpses the bar inside. Turns to her,", "inviting --", "Mia doesn’t know what to say. She follows David...", "INT. JAZZ CLUB - CONTINUOUS", "Inside, a JAZZ COMBO is tearing through a fast bop chart. The", "seats around the band are almost all occupied. Young fans,", "older couples, passersby trickling in from outside. It’s an", "excited crowd, far more varied than what we saw at the", "Lighthouse -- a real range of ages and styles.", "Mia’s eyes drift as David heads to the bar. She recognizes the", "images on the walls -- all Sebastian’s. Recognizes a stool by", "the bar -- also Sebastian’s, formerly Hoagy Carmichael’s...", "She turns to David. Wavering, unsure what to do, she follows", "him as he manages to find two empty seats close to the", "bandstand...", "The combo finishes. Hearty applause. A young PIANIST rises", "from the keys, waves “thanks”.", "And -- just then -- Sebastian appears. Mia looks at him,", "frozen.", "The crowd laughs. Sebastian smiles, looks at them --", "-- and sees Mia.", "Shock. The two LOCK EYES -- and you can tell it’s the first", "time they’ve seen each other in years.", "A prolonged silence. Sebastian is speechless.", "Then -- forcing himself to keep on a face --", "More applause. Sebastian sits at the piano. Looks at the keys.", "He seems uncertain -- perhaps unsure what to play. He looks at", "Mia. Takes the sight in. Beat. Then looks at his fellow", "musicians. Murmurs to them. Then turns back to the keys --", "-- and finally starts playing.", "A quieter tune, just piano, soft and tender and melancholy. A", "melody we -- and Mia -- instantly recognize...", "It’s Mia and Sebastian’s song.", "Mia looks at Sebastian. He looks at her, then back at his keys.", "This is the most beautiful we’ve ever heard his playing. The", "most tender, and full of emotion, it has ever sounded.", "We MOVE CLOSER on Sebastian. We recognize this image. It", "recalls the visualization of his dream, back at the RESTAURANT", "that night in winter, years ago. Gradually, as Sebastian", "plays, his surroundings seem to grow DARKER. Slowly, subtly at", "first, with just shifts in lighting, then a shift in", "perspective, the interior of the club changes, and soon...", "...we find ourselves back at that same RESTAURANT... Back when", "Mia laid eyes on Sebastian for the first time...", "Within this fantasy-flashback, Sebastian finishes his piece.", "We stick on Mia, watching him as his Boss talks to him. All is", "as before, as we remember it... And sure enough, Mia", "approaches Sebastian as he walks near her, and --", "-- but instead of brushing past her --", "-- Sebastian decks her with a kiss for the ages.", "A BURST OF ORCHESTRAL MUSIC. The DINERS in the restaurant spin", "around to face Mia and Sebastian -- and SNAP their fingers in", "time. Even the Boss starts to DANCE. Mia and Sebastian grin --", "and then strut out together, hand in hand... [EPILOGUE]", "INT. NEW APARTMENT - DAY", "Mia and Sebastian push open a new door -- to their new place.", "It’s a shabby one-bedroom -- but it’s theirs...", "INT. LIGHTHOUSE CAFE - NIGHT", "Next, Keith approaches Sebastian at the Lighthouse -- but", "Sebastian immediately shakes his head “no”.", "INT. THEATER - NIGHT", "Sebastian watches Mia perform -- it’s the night of her play.", "He stands up to applaud -- and behind him, the entire", "theater, utterly packed, rises as well. A huge standing", "ovation. Mia’s ROOMMATES are there, giddy with joy, as are", "LAURA and HARRY...", "INT. STUDIO SOUNDSTAGE - DAY / NIGHT", "Mia and Sebastian walk together outside -- but now that we’re", "outside we realize this isn’t the real L.A. at all..", "This, in fact, is an L.A. that doesn’t exist. A painted-", "backdrop L.A., just like the one we saw Mia pass by when", "parking on the lot...", "The old orange groves and the gabled rooftops and the moss-", "covered bungalows and the ivy-decked lamps, the jacaranda", "trees and the giant hills and Griffith and the Santa Monica", "Pier -- all painted, all props, all figments of a studio-", "backdrop imagination. We’ve entered a fully fantastical", "realm, the realm of the old Hollywood ballets of the 40’s and", "50’s...", "Everyone DANCES -- the pedestrians and the street performers", "and the cops and the guards... AMY BRANDT races up to Mia --", "seems to beckon her to audition... We see the audition", "silhouetted against a wall... We don’t hear Mia sing, but the", "music takes on the melody of her song, carrying us to...", "PARIS... Sebastian travels there with Mia... We chart the", "journey through an OLD GLOBE -- the same one we saw Mia use", "for her play -- a miniature plane and dissolves, the old-", "Hollywood-movie way...", "Finally, we find ourselves looking at a PAINTED BACKDROP of", "Paris -- the same one Mia used for her play. The Sacré-Cœur", "and the Arc de Triomphe and the Eiffel Tower etched in bright", "colors, the ornate lampposts and the cobblestones stretching", "before us... And then a sign -- “CAVEAU DE LA HUCHETTE”...", "We see a jam session at the Caveau -- a crypt-like jazz club.", "Sebastian plays, on cloud nine...", "We see a MOVIE SHOOT, Mia surrounded by lights and cranes,", "decked in movie-movie glow.", "We’re BACK to the Caveau. The lights go out -- except for the", "TRUMPETER, playing out a lovelorn solo, rim-lit. We MOVE in", "close on his horn -- DIVE into the bell --", "-- and emerge into NIGHTTIME PARIS. All painted. Mia and", "Sebastian wander through this wonderland, pedestrians frozen", "around them... Finally, they stop and look at one another...", "And -- as the city lights behind them start to glitter like", "all the stars of the galaxy", "...they DANCE.", "This is the last time we’ll ever see them dance, and they", "seem to recognize that, so graceful and poised are their", "movements... Remember -- this is a romance more perfect than", "a real romance could ever be...", "We DISSOLVE again -- to a projector beam...", "16mm footage plays on a screen, full of scratches and pockets", "of light... Mia and Sebastian sit down to watch together --", "and we see the following moments in brief, vivid GLIMPSES, as", "we move in closer on the imagery:", "The first home... (16mm)", "Mia’s pregnancy... (16mm)", "The newborn child... (16mm)", "The child’s first birthday... (16mm)", "The child’s first day of pre-school, all dressed up... (16mm)", "Everything here glows with the warmth of old home movies...", "These are memories, fluttering by, grabbed at random -- and", "yet all concocted, dreamed up out of nothing... The SCORE", "continuing to sway and taking us right up to...", "Sebastian and Mia, husband and wife, father and mother,", "hiring a babysitter because they've decided to go out for a", "night at the movies... (We’re back to 35mm now.) The look", "here is unaffected, just everyday. The MUSIC quiets slightly,", "everything goes more natural, as this happily married couple", "hit the road...", "...then find themselves blocked by a traffic jam...then take", "a side route, winding up in another part of L.A...", "...then walk down the street, then hear music -- a jazz combo", "playing somewhere...", "...and step into a place that looks just like Sebastian’s", "club... They sit down to listen...", "And then -- and this is how our imagined montage-musical", "number ends -- the combo’s PIANIST, who of course is not", "Sebastian, launches into Mia and Sebastian’s melody", "...and Mia and Sebastian look at each other, recognizing it.", "The music goes full-circle, back to where it started, as Mia", "and Sebastian look into each other’s eyes, lean in and,", "softly, but with all the love in the world", "...KISS.", "WE CUT BACK TO THE PIANO: Sebastian has just finished his", "piece. We’re back to reality. The audience in the club", "applauds.", "Beat. Mia looks at Sebastian. Looks away. A moment passes.", "She’s silent for a second. Then she looks at David.", "He nods. They rise from their seats and head for the exit.", "Just as they reach the door, and as David steps out, Mia turns", "and looks back at Sebastian. He looks at her. Their eyes lock.", "A hint of a tear in both...", "And, ever so subtly, for just a fleeting second, Mia smiles.", "It’s the kind of smile you could miss if you blinked -- but", "it’s enough to signal to Sebastian that she recognized the", "melody he played, and that she still remembers it, and still", "thinks of it to this day...", "Then she walks out the door. Sebastian glances at his fellow", "musicians. Then, he nods, and they launch into a new chart.", "EXT. STREET - NIGHT", "It’s silent outside. You can’t hear the music. Mia and David", "reach their car. They get in. It pulls out.", "Passing by Sebastian’s club, the car continues on. We stay put,", "the jazz club on one side of the frame, the lights of the car", "on the other. Those lights growing smaller and smaller, before", "finally disappearing into the big L.A. night...", "IRIS FADE OUT."]}