{"JO": [" Excuse me.", " No, sir; she has sold to “Olympic” and “Scandal” and got a prize for a tale in the “Blarney Stone Banner.”", " Yes.", " You will?", " You’ve cut - I took care to have a few of my sinners repent.", " What do you - that is, what compensation -", " You can have it. Make the edits.", " Excuse me?", " Oh, yes - none at all if you please.", " Good morning, sir. Good day.", " My Beth would like you very much.", " Good afternoon, Professor.", " Thank you.", " My students need me.", " Money is the end and aim of my mercenary existence.", " Well my sister Amy is in Paris, and until she marries someone obscenely wealthy, it’s up to me to keep the family afloat. Goodbye.", " I’m sorry, I only speak English...", " You know I never dance.", " -- don’t touch me, thanks! I already feel ridiculous I don’t want to look it!", " Don’t want to, won’t do it.", " I’ll keep it all in my head and try to sing it for you when I get home.", " There, now you’ll see a perfect little ringlet.", " Meg, I’m so sorry!", " Meg...", " I won’t disturb you?", " So do I.", " Yes, Mr. Laurence, but I’m not Miss March, I’m only Jo.", " Don’t you dance?", " EUROPE! That’s CAPITAL! I shouldn’t use words like that.", " Meg. She’s my older sister.", " She reminds me to be good so Father will be proud of me when he returns.", " Volunteered for the Union Army. I wanted to go fight with him. I can’t get over my disappointment in being a girl.", " I can’t, because...", " You won’t tell?", " I scorched my dress, see? Meg told me to keep still, so no one would see it. You can laugh if you want to. It’s funny, I know.", " What choice do you have?", " Can I call you Teddy?!", " Those are just stories, of course, but I’m working on a novel.", " It sells.", " My mother wouldn’t like it, it’s too, gory for her.", " I want to help with the money I make and not worry her.", "", " But, I, they’re published in the papers, and, people have always said - I’m considered talented -", " I can’t afford to starve on praise.", " Of course I’m upset! You just told me you didn’t like my work!", " I... do.", " I’ve been rejected plenty of times. FRIEDRICH", " Then why are you acting like it? FRIEDRICH", " I’m no Shakespeare.", " If you know so much about it, why don’t you do it yourself?", " But, I’ll be, but...", " No one will forget Jo March.", " We are not friends, you are not my friend. And I don’t want your opinion because I don’t like you very much so just don’t talk to me anymore, thank you.", " Beth. MEG (O.S.)", " Merry Christmas, world.", " Merry Christmas!", " I got carried away with our delicious revenge play last night. POISON!", " You could be a proper actress on the boards!", " Yes, but it sounds so crass when she says it.", " What about your music, Queen Bess?", " Don’t play mother just because she’s not home.", " I hate affected little chits!", " I wish she could help other people at a time convenient to us.", " I’ve re-written the climax and we need to set it to memory. Amy, get the costumes.", " Not quite. Miss Michelangelo, can you please rehearse the fainting scene?", " Hannah...", " I didn’t even say anything!", " What?", " No, it’s old Aunt March!", " His grandson Laurie put the idea into his head! I know he did. We should make friends with him.", " Don’t I wish I could go...", " What ho! Minion! I need thee!", " Don’t laugh! Act like it’s all right! Just keep going! Beth play!", " Thank you.", " We’re a bunch of ungrateful minxes!", " Beth, after your shopping, I need you to work your way through the new sums and spelling and I’ll check it all when I get home.", " I’m sorry, I’ll continue.", " Thank you, Aunt March, for your employment and many kindnesses, but I intend to make my own way in the world.", " So the only way to be an unmarried woman is to be rich.", " But there are precious few ways for women to make money.", "", " So I can get married.", " Yes, but he was right.", " I don’t think so.", " I’d like that more than anything!", " I could.", " Christopher Columbus, look at that.", " I’m not scared of anyone! He looks stern, but my grandfather was much more handsome.", " Oh, no. You are very handsome. I didn’t mean...", " Thank you, sir.", " Good, that man has always been an idiot.", " ME?! I already teach Beth!", " Starring the greatest actress from here to the Mississippi River, Miss Meg March.", " Mr. President and gentlemen, I wish to propose the admission of a new member. One who highly deserves the honor, would be deeply grateful, and would add immensely to the spirit of the club. I propose Mr. Theodore Laurence!", " Come now, let’s have him.", " Now then, everybody vote, and remember that it’s our Laurie and say “AYE!”", " And, as there is no time like the present!", " Hear hear!", " Daisy and Demi! You’ve gotten so big!", " I’m here now...", " Beth, where is Beth?", " Take this and find her the best doctor you can.", " I’m not going back. I’m using the rest to take her to the sea and get her strong.", " When is Amy coming home?", " Does she not know?", " Amy has always had a talent for getting out of the hard parts of life.", " TAKE MINE!", " You’re not invited.", " Yes, we are, now stop bothering.", " Yes! Hurry up!", " You can’t go Amy, so don’t be a baby and whine about it.", " You will not come.", " Come, Meg, stop petting her!", " Meg you’re a million times better than she was - although she was a terrific fainter!", " Hold on, let me just get this idea down.", " Has anyone taken my novel?", " Amy... you’ve got it.", " That’s a lie!", " You wicked girl! You wicked, wicked girl! I can never write it again! I’ll never forgive you as long as I live!", " She doesn’t deserve my forgiveness. I will hate her! I will hate her forever!", " Amy! It’s AMY!", " Oh god, oh god, dear god please...", " No... no", " My sister, my sister, dear God thank you for my sweet sister.", " If she had died it would’ve been my fault.", " What is wrong with me? I’ve made so many resolutions and written sad notes and cried over my sins but it doesn’t seem to help. When I get in a passion I get so savage, I could hurt anyone and enjoy it.", " But you’re never angry.", " You are?", " I’ll do the same, then.", " I never should’ve left. Do you need anything? Here take some water.", " I want you dancing by the time Amy gets back.", " She writes that Laurie is there... I’m glad he’s with her, he won’t respond to any of my letters.", " I miss everything.", " You take the other carriage and surprise her - make sure she doesn’t fall in love!", " Yes, pretty things should be enjoyed.", " Don’t forget about us.", " Tell me this second!", " Mr. Brooke has it? How do you know?", " Where?", " All this time?", " No, it’s horrid.", " At the idea of anybody coming to take Meg away? No, thank you.", " I’d like to see anyone try it!", " I don’t have any new stories.", " Haven’t written any.", " Uhh. I can’t, I don’t think I can anymore.", " It’s just, no one even cares to hear my stories anyway.", " Will this be enough for the train?", " I didn’t go to Aunt March, couldn’t bear to.", " I only sold what was my own.", " It doesn’t affect the fate of the nation, so don’t wail.", " I was crazy to do something for Father. It’ll be good for my vanity, anyway.", " No... It’s my hair.", " I know you would.", " I wish all the letters were from Mother, and not Mr. Brooke.", " Oh Bethy we barely have enough to feed ourselves. Besides, I have to finish this story.", " We work!", " We’ll go soon.", " Here’s a letter from the old gentleman.", " “Miss Beth March, I have had many pairs of slippers in my life, but I never had any that suited me so well as yours. And they will always remind me of the gentle giver. I like to pay my debts, and hope you will accept this gift. Your grateful friend and humble servant, James Laurence.” OH BETH!", " Meg and I have, but Amy hasn’t!", " Should we send for Mother?", " We’ll nurse her and she’ll get better. You’ll see. She will. She must.", " “The post office in the forest was a capital little institution, and flourished wonderfully, for many things passed through it: poetry and pickles, tragedies, garden seeds and long letters, music and gingerbread, invitations, scoldings, and even puppies.”", " It is.", " It’s just a little story.", " You don’t think it’s too... boring?", " Really?", " Yes ma’am!", " I will.", " No, don’t say that, don’t say it.", " No...", " I’ll stop it. I’ve stopped it before.", " You will get better. Father will get better. And we’ll all be together soon.", " God hasn’t met my will yet. What Jo wills shall be done.", " Meg.", " Hannah!", " What do we do?", " I didn’t know what else to do.", " Don’t go quietly, fight!", " Marmee! Marmee!", " Me neither.", " Nothing.", " We can leave. We can leave right now.", " I can make money: I’ll sell stories, I’ll do anything - cook, clean, work in a factory. I can make a life for us.", " WHY?", " You will be bored of him in two years and we will be interesting forever.", " I just hate that you’re leaving me.", " I’d rather be a free spinster and paddle my own canoe. I can’t believe childhood is over.", " Europe? With you?", " Oh... I, that’s wonderful Amy.", " Meg married, Amy off to Europe, now that you’re a graduate, you’ll be off on a long holiday - I’m not good like Beth so I’m angry and restless.", " Why? Should we run off and join a pirate ship?", " No, Teddy -- please don’t.", " Yes, you are, you’re a great deal too good for me, and I’m so grateful to you and so proud of you, I don’t see why I... I can’t love you as you want me to.", " I can’t change the feeling and it would be a lie to say I do when I don’t. I’m so sorry, Teddy, so desperately sorry, but I can’t help it...", " It would be a disaster if we married, we’d be miserable! We both have such quick tempers --", " I can’t - I’ve tried it and failed.", " I can’t say “Yes” truly so I won’t say it at all.", " You’ll find some lovely accomplished girl, who will adore you, and make a fine mistress for your fine house. I wouldn’t. I’m homely and awkward and odd and you’d be ashamed of me and we would quarrel - we can’t help it even now! - I’d hate elegant society and you’d hate my scribbling and we would be unhappy and wish we hadn’t done it and everything will be horrid.", " Nothing more -- except that... I don’t believe I will ever marry. I’m happy as I am, and love my liberty too well to be in any hurry to give it up.", " Teddy..", " I don’t do that anymore. It didn’t save her.", " I ruined our friendship with my temper, just as I ruin everything.", " I wish that were true. If I were a girl in a book, this would all be so easy, I’d give up the world happily.", " He is?", " That’s good of him.", " Perhaps... perhaps I was too quick in turning him down.", " If he asked me again, I think I would say yes... Do you think he’ll ask me again?", " I know that I care more to be loved. I want to be loved.", " Women have minds and souls as well as hearts, ambition and talent as well as beauty and I’m sick of being told that love is all a woman is fit for. But... I am so lonely.", " Oh Teddy! My Teddy!", " Glad, my blessed boy, is too small! Words can’t express it.", " Yes, of course. Here, come sit.", " How’s Amy?", " Where is she now? Did she not come straight home?", " Your... your what?", " What surprise?", " You and... Amy.", " Are you - in love?", " Yes.", " Oh, Teddy.", " What does Amy call you?", " That’s like her... Well, you look deserving of it.", " Of course, my boy, always.", " Yes.", " Amy, I’m so happy for you. It was meant to be.", " No, no.", " Life is too short to be angry at one’s sisters.", " I know.", " Mr. Laurence?", " I know I am not half so good as my sister, but I’ll be a friend to lean on, if you’ll let me.", " Dear Mr. Dashwood: Enclosed are the first few chapters of a piece I’ve only begun working on. It could suit as a story for young people, but I think it is probably quite boring. However, I’m sending it to you just in case it has something of value, though I doubt it.", " I thought she hated me.", " What about you and John?", " I should sell it, but I’d love to do something that would really make Aunt March turn in her grave.", " I’d like to open a school. We never had a proper school, and now there are women’s colleges opening - there should be a school. For Daisy.", " I’ll open a school for boys and girls, both.", " I started something... but I don’t think it’s very good.", " No, they don’t.", " It’s just about our little life.", " No, writing doesn’t confer importance, it reflects it.", " When did you become so wise?", " Coming! I’m starving!", " But I’m famished.", " I don’t know anyone.", " It’s you!", " Hello. I’m Josephine March. Jo.", " Yes, of course. Please.", " We were at the same boarding house together in New York.", " It was my sister, Beth.", " I don’t know that I will, but thank you.", " Goodbye.", " What?! Why are you all looking at me like that?", " I do not!", " I’m not going!", " He’s moving to California!", " But it’s raining outside.", " Because the neighbor married her sister!", " No one. She doesn’t marry either of them.", " She says the whole book that she doesn’t want to marry.", " It isn’t the right ending.", " I suppose marriage has always been an economic proposition. Even in fiction.", " It’s mercenary.", " Fine.", " Because -- because you are going away.", " I wish you would stay.", " They aren’t empty now.", " Thanks.", " It’s good.", " What about a payment, upfront?", " Yes, but, but it’s my book.", " So I get nothing? If it fails?", " The copyright?", " Might that be worth something?", " I see. It seems like something I would want to own.", " They do, which is why I wanted upfront payment.", " You keep your $500, and I’ll keep the copyright, thank you. Also, I want ten percent of royalties.", " Nine percent.", " If I’m going to sell my heroine into marriage for money, I might as well get some of it.", " Done.", " I’ve decided. I want to own my own book."], "JO (CONT'D)": [" I was looking for the Weekly Volcano office... I wished to see Mr. Dashwood?", " A friend of mine desired me to offer a story, by her, she wrote it - she’d be glad to write more if this suits.", " Should I tell my, my friend that you’ll take another if she had one better than this?", " “What novelty is worth that sweet monotony where everything is known and loved because it is known?” How great is that?!", " Please fight to the end, be LOUD! Don’t just quietly go away!", " Merry Christmas, Beth.", " You’ll see that I’m right, eventually, and you’ll thank me for it.", " Did she bother you all the way from Europe with her preening?"], "MR. DASHWOOD": [" Not a first attempt, I take it?", " A prize?", " Sit.", " With alterations. It’s too long.", " The country just went through a war. People want to be amused, not preached at. Morals don’t sell nowadays. Perhaps mention that to your “friend.”", " We pay twenty-five to thirty for things of this sort. We’ll pay twenty for that.", " We’ll look at it. Tell her to make it short and spicy. And if the main character’s a girl make sure she’s married by the end. Or dead, either way.", " What name would she like put to the story?", " Just as she likes, of course.", " Dear Miss March: I have read the chapters you sent, and I have to agree that they aren’t very promising. But, please send us more stories of the scandalous variety, if you have any.", " That’s a good instinct, you love him.", " I assume she’s still alive.", " And I have no idea why.", " That’s true.", " What have they gotten into now?"], "MR. DASHWOOD (CONT'D)": [" We’ll take this."], "FRIEDRICH (O.S.)": [" Good afternoon, Miss March.", " I am so sorry to intrude."], "FRIEDRICH": [" You’re on fire.", " You’re on fire!", " I have the same habit, you see?", " Always working.", " No one gets ink stains like yours just out of a desire for money.", " Goodbye.", " For the writer in the attic: Because you enjoyed the play so much tonight, I wanted you to have this. It will help you study character and paint it with your pen. I would love to read what you’re writing, if you’ll trust me. I promise honesty and whatever intelligence I can muster. Yours, Friedrich", " And your novel, it will be like this?", " Why don’t you sign your real name?", " Yes?", " I don’t like them.", " Honestly, I think that they’re not good.", " Oh I think you’re talented, which is why I’m being so blunt.", " Are you upset?", " I thought you wanted honesty.", " Has no one ever talked to you like this before?", " No one, and I’m not.", " He was the greatest poet who ever lived. He smuggled his poetry in popular works.", " Thank goodness, we already have him.", " I’m not a writer. I don’t have the gifts you have.", " Yes?", " I can believe it.", " She’s gone? Why?", " But she didn’t say if she was coming back?", " I know...", " Hello.", " Jo, I hope it is all right, I got your address from Mrs. Kirke -", " I’m so sorry to intrude, I was close by and thought I’d, but I’ll be going...", " I don’t want to be a burden.", " I am Friedrich Bhaer.", " No, I’ve been offered a professorship in California - and as I have nothing keeping me here, I thought I might go West. It is new there, and they are less particular about immigrants.", " This is a beautiful instrument. Which one of you plays?", " It is very hard to lose a sister. I’m sorry.", " I do, yes.", " I don’t wish to offend.", " Jo, if you ever come to California, I would love to see you.", " Well, yes... goodbye.", " Jo!", " I would never leave if you wished me to stay.", " But, but I have nothing to give you but my full heart and these empty hands."], "MRS. KIRKE": [" Kitty and Minny are waiting!", " Josephine, this came for you.", " I don’t know. She just left.", " We didn’t have a heart to heart, Professor. What are you doing? Why are you just sitting there? Go dust something. And what about the girls? She was the best teacher they ever had.", " Jo! Is that you?! Come in, come in!", " Your mother says that you’re a writer — how wonderful! I keep a diary, you know. This is Kitty and Minny. SMILE GIRLS. I see you’ve met our professor, he’s a very accomplished man, actually, it’s an interesting group here, lots of intellectuals and Europeans. You know I never thought I’d run a boarding house but here I am! How is that sweet mother of yours? She always had such great height, I never had that, she could reach anything..."], "AUNT MARCH": [" The decadents have ruined Paris, if you ask me. These French women couldn’t lift a hairbrush.", " Don’t humor me, girl. What do they write, your troublemaking family?", " You can do nothing if you go back. The girl is sick, not lonely.", " What? Oh, yes, yes. Of course.", " Il faut GO! Allons-y!", " I know.", " Is there a reason you stopped reading Belsham?", " You mind yourself, dearie, one day you’ll need me and you’ll wish you had behaved better.", " No one makes their own way, not really, least of all a woman. You’ll need to marry well.", " Yes.", " That’s not true. You could run a cat house, or go on the stage. Practically the same thing.", " No, so you can live a better life than your poor mother has.", " It is possible to be right and foolish.", " Well, you’re not paid to think.", " Then read and don’t sneak around. I don’t like sneaks.", " Amy? Come here.", " Come, sit!", " You just keep being a proper young lady and see if it doesn’t. You are your family’s hope now. Beth is sick, Jo is a lost cause, and I hear Meg has had her head turned by a penniless tutor. It’ll be up to you to support them all, and your indigent parents in their old age. So you must marry well and save your family.", " That Laurence boy was just here.", " What a disappointment he’s turned out to be. It must be the Italian in him.", " He’s gone, to London. Why? What do you need to discuss with him?", " Well, I hope you’re happy. Now that you’ve ruined your life, just like your Mother did by marrying your father.", " You are most welcome.", " Oh, oh, I don’t like to be... KISSED!", " You’ll be sorry when you’ve tried love in a cottage and found it a failure!", " I understood your meaning, my dear.", " I don’t miss a THING.", " I may not always be right, but I am NEVER wrong."], "AUNT MARCH (CONT'D)": [" AMY! I said, “These French women couldn’t lift a hairbrush.”", " And you shouldn’t go home until you and Fred Vaughn are properly engaged.", " Other than that, you’re right, precious few ways for women. That’s why you should heed me.", " I know you don’t care much about marriage now. I can’t say I blame you, but I intend to go to Europe one more time, and I need a companion. How would you like to be the person I take?", " If you are very good, one day this ring will belong to you.", " That’s all I wanted to say to you. You can go finish your...little painting.", " Thank goodness, here’s the only sane member of the family. I really can’t take any more of this."], "AMY": [" Oh yes! Very true, Aunt March.", " Mother doesn’t say anything about Beth. I feel I should go back but they all say “stay.”", " Yes, and until I’ve completed all of my painting lessons, of course.", " STOP THE CARRIAGE! LAURIE! LAURIE!", " NO. Where’s your Grandfather?", " Are you chasing some young girl across Europe?", " I’m... I couldn’t believe Jo turned you down. I’m so sorry.", " Oh, Aunt March!", " Come to the New Year’s Party! It’s a ball and everyone will be there, including Fred - Pick me up at the hotel at eight - the Chavain! Dress for festivities! Top hats and silks!", " It’s Laurie!", " Who will you dance with, Jo?", " Why can’t we all go to the party?! It’s not fair!", " My nose will simply not look refined.", " Now, Jo --", " You could be pretty if you tried.", " What a queer smell - it’s like... burnt feathers.", " I’m Amy.", " Laurie.", " I waited an hour for you.", " Do you want to know what I honestly think of you?", " I despise you.", " Selfish people do like to talk about themselves.", " - ah you like that, you old vanity - with all these good things to enjoy, you can find nothing to do but dawdle.", " Aren’t you ashamed of a hand like that?", " It looks like it’s never done a day of work in its life. And that ring is ridiculous.", " I feel sorry for you, I really do. I just wish you’d bear it better.", " No, I’d be respected if I couldn’t be loved.", " Fred, I’m, I’m so sorry.", " I have lots of wishes, but my favorite one is to be an artist and go to Paris and do fine pictures and be the best painter in the world.", " You must not limit yourself.", " Don’t Jo; it’s so boyish.", " Watch my nose! My nose! It’s already no good!", " Dolls don’t get hungry, Beth.", " But I thought he was a mean old man!", " Jenny Snow says that Mr. Laurence disowned his son after he went off with an Italian woman, and now his grandson is an orphan and he spends all of his time in that house locked up with his tutor.", " But doesn’t Laurie just seem so romantic? He’s half Italian.", " Hither I come, from my airy home, afar in the silver moo -- AHHHHH!", " Or New Year’s, wouldn’t that be exciting?", " Well I have to go to school and I don’t have any limes.", " Between that and the drawings I should wipe out my debt.", " No! Father is fighting for him.", " Perhaps we should all be punished.", " I don’t know if I should.", " I’m Amy.", " I know. You brought my sister back from the dance never sprained MY ankle, I have lovely small feet. Best in my family. But I can never go home again, I’m in such trouble. Look.", " Tell the servants that I want this painting purchased for me! IMMEDIATELY!", " Just a drawing and then... Mr. Davis hit me.", " I wish all the girls would leave his horrible school and that he would die.", " He’s a real boy!", " Where are you going?", " You are going somewhere with Laurie, I know it!", " You’re going to the theatre with Laurie. Meg, please, can I come?", " I’ve been shut up in here and I never get to go anywhere. Beth has her piano but I’m so lonely!", " I’ll pay for myself!", " You’ll be sorry for this Jo March! You will! You’ll regret this!", " No I haven’t.", " It isn’t! I haven’t got it - I don’t know where it is and I don’t care.", " I BURNT IT UP! I BURNT UP YOUR BOOK! I TOLD YOU I’D MAKE YOU PAY AND I DID!", " I’m sorry, Jo.", " It’s just that the only thing you care about is your writing so it’s not as if I could hurt you by ruining one of your dresses. And I really did want to hurt you.", " Is she going to be like this forever?!", " Wait for me! Please!", " Hello! Wait for me!", " HURRY UP YOU TWO! MEG IS GOING TO BE GONE FOR A WEEK!", " I wish I could go to the debutante ball.", " I don’t want to see you.", " Someone has to do it.", " Never.", " I’m a failure. Jo is in New York, being a writer, and I am a failure.", " Rome took all the vanity out of me. And Paris made me realize I’d never be a genius. I’m giving up all my foolish artistic hopes.", " Talent isn’t genius, and no amount of energy can make it so. I want to be great, or nothing. I won’t be a common-place dauber, so I don’t intend to try anymore.", " The Brontes?", " I think so.", " Well, men, I suppose.", " That’s a very complicated argument to make me feel better.", " I do think that male or female, I’m a middling talent.", " All right.", " Polish up my other talents and be an ornament to society.", " No...", " Most likely, yes.", " He’s rich, richer than you, even.", " I’ve always known that I would marry rich. Why should I be ashamed of that?", " Well, I believe we have some power over who we love, it isn’t something that just happens to a person.", " Well. I’m not a poet, I’m just a woman. And as a woman I have no way to make money, not enough to earn a living and support my family.", " That will be Fred now. How do I look? Do I look all right?", " Oh, how elegant.", " No, I haven’t seen her.", " Oh, Jo. Is it Father?", " I would feel the same way.", " Laurie, when are you going back to your grandfather?", " You’ve said that a dozen times in the past month.", " He expects you, so why don’t you do it?", " Natural indolence, you mean.", " What are you doing?", " No, I mean what do you intend. To do.", " Yes.", " Go back and work for your grandfather and make something of yourself.", " Here.", " It was the day at the beach, when I met Fred for the first time.", " A week or two... he has business in London.", " What?", " Why?", " No, Laurie, that’s mean, it’s just mean of you...", " I have been second to Jo my whole life in everything and I will not be the person you settle for just because you cannot have her. I won’t do it, not when, not when I’ve spent my entire life loving you.", " I’m making a mold of my foot for Laurie to remind him I have nice feet.", " Quite. And the design is very cunning.", " MY FOOT IS STUCK! I CAN’T GET IT OUT!", " Beth look what they got you --", " What’s “scarlet fever?”", " I don’t want to be sent away!", " Yes?", " Really?", " Hello Aunt March!", " He was?", " When will he be back?", " I’ve just told Fred Vaughn that I wouldn’t marry him.", " No, she... she wanted me to come. As her companion.", " She wants me to work on my art, and my French, of course.", " Oh, Laurie, I don’t despise you.", " I’m not marrying Fred Vaughn.", " It was not for you it was for myself. You are under no obligation to say anything or do anything, it was because I didn’t love him as I should.", " You don’t have to say anything, we never need to talk about it, we don’t have to talk about --", " Laurie told you?", " Oh, I’m so relieved - I couldn’t write because it all happened so quickly and then, really, I was worried you’d be angry.", " So you aren’t? Angry?", " I really miss her...", " She could still hate you and leave you the house!", " And what will Demi do?", " What about writing?", " Everyone likes what you write.", " Maybe we don’t see those things as important because people don’t write about them.", " I’m not sure. Perhaps writing will make them more important.", " I always have been, you were just too busy noticing my faults.", " - Please stay! We have more than enough room.", " We all play a little.", " Oh Father, he wasn’t here for you!", " Jo! You love him!", " You do too! I may be half as smart as you are but I can see it so plainly, you love him. I have never seen you happier. What else is love? Doesn’t she love him Mr. Laurence?", " Go get him. Laurie prepare the horses. We can catch him before he gets to the train.", " That’s a fiction. He was practically begging for a reason to stay.", " It doesn’t matter! Put on a better dress. Follow me.", " LAURIE. STOP STANDING THERE AND GO GET THE HORSES READY.", " GO! Find him!"], "LAURIE": [" I thought you liked that sort of thing!", " Don’t tell your mother!", " No.", " Don’t be, Amy. I’m not.", " I will! I’ll wear my best silk!", " Not at all; I don’t know many people, and felt rather strange at first, you know.", " Miss March, isn’t it?", " And I’m not Mr. Laurence, I’m only Laurie.", " I don’t know how you do things here yet - you see, I’ve spent most of my life in Europe.", " Says who?", " Where is he?", " Jo ... would you like to dance? With me?", " Because what?", " Never!", " Never mind that; I’ll tell you how we can manage.", " Well, let me take you. It’s right next door.", " You must take mine. Please!", " I always leave early - I do, truly.", " Laurie, please.", " Yes!", " Hello.", " No, thank you, ma’am.", " Amy.", " I feel caught.", " Amy, please!", " What do you honestly think of me?", " Why do you despise me?", " Am I selfish?", " I’ll be good for you, Saint Amy, I’ll be good!", " No, I’m not.", " Jo gave me this ring.", " You don’t have to feel sorry for me, Amy. You’ll feel the same way one day.", " And what work have you done lately, oh great “artiste” - or have you been too busy imagining how you’ll spend Fred Vaughn’s fortune? FRED VAUGHN, ladies and gentlemen!", " What are they doing?", " There’s a girl out there.", " YES! Mr. Brooke, there is a girl!", " Hello there! Are you hurt?", " Hello Amy, I’m Laurie!", " A fellow can’t live on books alone.", " That’s my grandfather. Are you scared of him?", " So do I!", " And Jo, borrow any book you’d like!", " Ladies, please - this is my stratagem, I deserve the blame: Jo only gave into it after lots of teasing.", " I merely wish to say, that as a slight token of my gratitude and as a means of promoting friendly relations between adjoining nations, I propose this set of keys for a little post office I’ve made in the forest by the pond.", " Good morning ladies! It’s brisk and brilliant and I think the last day for the river - get your ice skates!", " Stay near the edge, it’s not safe in the middle!", " Ready?", " Jo! Get a branch!", " Grab on!", " Coming!", " It was supposed to be a surprise.", " Why are they calling you “Daisy”?", " What would Jo say?", " You’ll have a terrible headache tomorrow.", " No I don’t.", " Please forgive me and come dance.", " I don’t like your dress, but I think you are just... splendid.", " Hello Amy!", " Oh, Amy I’m so sorry for how I behaved. Please? Forgive me?", " So when do you begin your great work of art, Raphaella?", " What - why?", " That’s quite a statement to make at twenty.", " Why should you? You have so much talent and energy.", " What women are allowed into the club of geniuses anyway?", " That’s it?", " And who always declares genius?", " They’re cutting down the competition.", " Do you though? Feel better?", " Middling talent? Then may I ask your last portrait be of me?", " Now that you’ve given up all your foolish artistic hopes, what are you going to do with your life?", " Here is where Fred Vaughn comes in, I suppose.", " You are not engaged, I hope?", " But you will be, if he goes down properly on one knee?", " I understand queens of society can’t get on without money. But it does sound odd coming from one of your mother’s girls.", " There is nothing to be ashamed of, as long as you love him.", " I think the poets might disagree.", " You look beautiful. You are... beautiful.", " This is Fred Vaughn, and his sister Kate, and of course you know Mr. Brooke - and this is Meg, Amy, Beth and Jo.", " I know something you don’t know.", " Has Meg perhaps mislaid a glove?", " Saw it.", " Pocket.", " Yes, isn’t it romantic?", " I thought you’d be pleased.", " You’ll feel better about it when somebody comes to take you away.", " So would I!", " What can I do?", " Very soon.", " Short answers save trouble.", " Natural depravity, I suppose.", " I’ll only plague him if I go, so I might as well stay and plague you a little longer.", " Looking at you.", " Oh you mean with life?", " What would you have me do?", " When did you do this one?", " When is he coming back?", " Don’t marry him.", " Don’t marry him.", " You know why", " Why?", " And here’s another Christmas gift for the March family!", " You don’t have to stay here.", " It’s no use Jo; we’ve got to have it out..", " You can’t?", " I can’t love any one else.", " -- If you loved me Jo, I would be a perfect saint!", " Everyone expects it -- Grandpa and your family, Jo say you will and let’s be happy!", " I’ll be hanged if I do!", " Anything more?", " You will care for somebody, and you’ll love him tremendously, and live and die for him. I know you will, it’s your way, and you will and I’ll watch.", " I couldn’t let you travel alone with Aunt March being so sick - even if you despise me.", " I heard... Amy...", " Jo? Wake up!", " Dear Jo, are you glad to see me then?", " Oh thank heaven, I was worried, well, anyway, I wanted a moment with you alone.", " Yes, but I love it.", " Your mother’s got her down at Meg’s, we stopped there by the way, and there was no getting my wife out of their clutches.", " Now I’ve done it! It was meant to be a surprise.", " Well, we were engaged, and we were going to wait... that is to say, now we are man and wife.", " It all happened very fast.", " Yes. Jo, I want to say one thing, and then we’ll put it away forever. I have always loved you; but the love I feel for Amy is different - you were right - we would have killed each other.", " I think it was meant this way.", " No one ever calls me that but you.", " My Lord.", " Can we - can we still be friends?", " Who are you? Who is he?", " Can someone tell me who he is!?", " I’m Laurie. And who are you?", " I never thought I’d prepare a carriage to help Jo March go after a man, but I like it.", " Yes, my love."], "AUNT MARCH (O.S.)": [" AMY! AMY MARCH! YOU COME BACK HERE RIGHT THIS INSTANT!"], "SALLIE": [" Twenty yards of the blue silk as well as the pink. Someone will be by for it later.", " -- and his wife needs a new dress.", " He’ll be so pleased with how you look that he’ll forget all about the expense.", " Meg March! You look so pretty!", " That one? Can’t you send home for another?", " Only the one? Oh, that’s so /funny."], "SALLIE (CONT'D)": [" Oh Meg! That would look so lovely on you. I know just the dressmaker to send you to. You’ll be the prettiest wife in Concord."], "MEG": [" Oh no, John needs a new coat for winter and Daisy and Demi need new clothes and --", " I can’t... it’s, I just can’t.", " I don’t suppose it’s such an extravagance.", " Yes. Thank you.", " Fifty dollars, what was I thinking?", " I know just who I’ll dance with!", " Don’t stare, don’t put your hands behind your back, don’t say Christopher Columbus, don’t say Capital, don’t shake hands, don’t whistle --", " My foot- I’ve hurt my ankle.", " How will I get home?!", " No, thank you, we cannot accept.", " No, it’s so early -- you can’t mean to leave yet.", " I wish I had heaps of money and plenty of servants, so I’d never need to work again.", " Mother proposed not having any presents this Christmas because our men are suffering in the army. We can’t do much, but we should make our little sacrifices and do it gladly.", " What is it?", " The Laurence boy’s grandfather? Why?", " Born of roses, fed on dew, What charms and potions canst thou brew?", " I know what it is to want little things and feel less than other girls.", " Hurry! I’ll be late!", " You’re a good teacher.", " Only because the schools for women are so poor.", " That’s our Beth.", " A NEW PLAY, written by Miss Jo March, will appear at the Barnville Theatre, in the course of the next few weeks, which will surpass anything ever seen before on the American stage.", " WEEKLY REPORT Meg— Good. Jo— Bad. Beth— Very Good. Amy— Middling.", " We don't want any boys. This is a club for ladies.", " I wish you were here to teach them...", " Beth insisted we not tell her because she didn’t want to ruin Amy’s trip.", " Do you have the tickets?", " I’m sorry, dear, but you weren’t invited.", " I like him, he’s kind.", " I’m sorry, my sweet, but Jo is right. Next time.", " I thought he was very well- mannered.", " Beth what’s your favorite eye color?", " Mr. Brooke has blue eyes and an old soul which is much more important than money.", " Go after her. Don't say anything till Jo has got good-natured with Laurie, then take a quiet minute and just kiss her, or do some kind thing, and I'm sure she'll be friends again.", " Oh mother! Thank you!", " I won’t Jo, it’s only a week!", " Thank you again for the carriage, Mr. Laurence. I don’t know how to repay you.", " Anything!", " I will wear this one.", " I haven’t got another.", " If it’s alright.", " I can’t keep your dress!", " Laurie! I didn’t know you were going to come!", " And what a lovely surprise it is.", " It’s just like playing a part, to be Daisy for a little while.", " I might.", " It’s a good thing that it’s still tonight, then. Do you like the way I look?", " You...you are the rudest boy I ever saw!", " I’m afraid it would be too disagreeable for you.", " I know it’s silly, but please don’t tell Jo. Let me have my fun tonight. I’ll be desperately good for the rest of my life.", " I’m sorry, John. The silk was the first real expense.", " Well, it’s not exactly even a dress yet... It’s just the fabric.", " I know you are angry, John. I don't mean to waste your money, but I can't resist when I see Sallie buying all she wants, and pitying me because I don't. I try to be contented, but it is hard, and, and... I'm tired of being poor.", " Oh, John, my dear, kind, hard- working boy. I didn't mean it! It was so wicked, so untrue and ungrateful, how could I say it!", " No! Not a bit! We’ll figure out a way to get you your coat as well, and then won’t we be grand, the two of us?", " John, but --", " Oh - I’m, I’m sorry.", " Thank you.", " Mr. Brooke writes that Father is still very weak, but improving. Mr. Brooke also says Mother is the best nurse a man could have...", " I’m grateful for any letters.", " I’ll go into town for groceries - Jo, can you go look into getting more firewood?", " Don’t worry sweet girl, we’ll find a time.", " No, we shouldn’t worry her. I’ve never wished for money more than now.", " John.", " No, John, I really can’t. I sold the fabric to Sallie.", " Yes.", " I couldn’t be, John Brooke is my husband and I am his wife.", " It’s mostly been Jo, she’s hardly slept.", " Who is with Father?", " I can’t believe today is my wedding day!", " What’s wrong?", " Jo...", " What?", " I want to get married.", " I love him.", " Just because my dreams are not the same as yours doesn’t mean they’re unimportant.", " Oh, Jo, I’m not leaving you. Besides, one day it will be your turn.", " It was going to end one way or another. And what a happy end.", " Thank you Aunt March.", " Oh, I’m sorry.", " It can’t be worse than some people find in big houses.", " No, I don’t need a grand estate.", " I wouldn’t mind that.", " What will you do?", " I do.", " Which weren’t there, of course.", " It’s no burden at all.", " But none so well as her...", " I’m coming too.", " You are. Amy is right."], "SALES CLERK": [" Will twenty yards do?"], "DAISY AND DEMI": [" Mommy -- mommy!"], "MARMEE (O.S.)": [" Beth! Beth?", " Jo! Come down!"], "OLIVIA": [" ...That you do think you are not what you are."], "VIOLA": [" Then think you right, I am not what I am!"], "YOUNG MAN": [" Come dance!"], "BETH": [" I can’t dance.", " I like your nose.", " I don’t want to go but I wish I could hear all the music.", " That’s what you want too, isn’t it Jo? To be a famous writer?", " My wish is to have us all to be together with Father and Mother in this house - that’s what I want.", " I only do that for us, I don’t need anyone else to hear it.", " Joanna and I are very hungry.", " Is this where you say that Father would want us to?", " Boys scare me. And that big old house scares me.", " His daughter died? That’s so sad.", " When will he come home?", " I’m just glad that mother doesn’t make me go to that school with all those girls...", " I think we should to do it, even if we are afraid. I say yes. It’s Laurie!", " I can teach you chords.", " Purple.", " Jo.", " It’s so good to see your face.", " Good. Is there any news? What does she say?", " Do you miss him?", " I know.", " Oh sir, they do care, very very much!", " I love it dearly, and I'll come, if you are quite sure nobody will hear me, and be disturbed.", " I love to listen to you read, Jo, but I love it even better when you read the stories you’ve written.", " Why not?", " You have pencil and paper. Sit here and write me something.", " Why?", " Write something for me. You’re a writer. Even before anyone knew or paid you. I’m very sick and you must do what I say.", " Your hair!", " I think the deep purple is very fitting for Mr. Laurence, do you agree Amy?", " I had to thank him somehow for allowing me to play the piano at his house all the time.", " You all haven’t been to see the Hummel’s. We should go.", " But I always go by myself and you haven’t been keeping up with your tasks...", " But it’s been weeks.", " Fine, I’ll go myself.", " Jo... read it, I cannot.", " Sir, I wanted to thank you...", " The Hummel’s are very sick.", " It’s all about us!", " I love it.", " It’s nothing like what you usually write.", " No, it is my favorite one yet.", " Write me another.", " And keep writing them.", " Even when I’m not here.", " I’ve had a very long time to think about this, and I’m not afraid.", " It’s like the tide going out. It goes out slowly, but it can’t be stopped.", " We can’t stop God’s will."], "MARMEE": [" Goodness gracious, what have you done!", " Oh Meg - You’ll kill yourself for fashion one of these days. Hannah! We need ice!", " Come in come in! Apologies for the chaos: I enjoy baking in the middle of the night! Don’t mind the clutter, Mr. Laurence, we don’t.", " You must be part of the girls’ theatricals!", " They could use an extra player, although you’ll have to fight Jo for the male roles or play a girl. Here, have a scone.", " Laurie, how are your ankles? Do you need ice?", " Oh, just call me Mother, or Marmee. Everyone does.", " Dear Jo, Our Beth has taken a turn for the worse. Please, come home as soon as you can.", " Merry Christmas, girls!", " Jo, you look tired - were you up again all night writing? Amy, come kiss me! How are my girls?", " Not far from here lives a poor young woman, Mrs. Hummel. Her five children are in one bed to keep from freezing, and there is nothing to eat. My girls, will you give them your breakfast as a Christmas present?", " Yes.", " I’m back! We brought food and blankets and sweaters. And we brought some medicine. These are my girls!", " That’s so generous of him.", " He is a very kind man who lost his little girl when she was only a child, and now his son as well.", " I am not responsible for this feast, but I have got a surprise.", " He will stay and do his work faithfully as long as he can, and we won’t ask for him back a minute sooner than he can be spared. “Give them all my dear love and a kiss. Tell them I think of them by day, pray for them by night and find my best comfort in their affection at all times.", " Brava! Brava!", " Jo! We do not compare grandfathers!", " You are not to attend that school any more.", " Jo will teach you.", " You did wrong, Amy, and there will be consequences. Thank you so much for taking care of Amy. My girls do have a way of getting into mischief.", " Then you should run over and we’ll take care of you.", " We must be going. Girls?", " She’s upstairs. Oh, my Jo. We all thought she was better but the fever had weakened her heart.", " No, you need this money to live in New York.", " We didn’t want to worry her.", " Jo, don’t be angry with your sister...", " Amy...", " Don’t let the sun go down on your anger. Forgive her. Help each other, and you begin again tomorrow.", " She’s asleep.", " She will be fine, the doctor said he didn’t even think she’d catch cold.", " You remind me of myself.", " I’m angry nearly every day of my life.", " I’m not patient by nature, but with nearly forty years of effort I have learned to not let it get the better of me.", " I hope you’ll do a great deal better than me. There are some natures too noble to curb, too lofty to bend.", " Just be who you are, my sweet Meg. It was mine when I was your age.", " I’ve never understood saving jewelry until marriage - pretty things should be enjoyed.", " Girls have to go into the world and make up their own minds about things.", " If you’re walking to Vermont, there is Mrs. Sewell in Keene New Hampshire who will give you room and board.", " I need to be here. I've spent my whole life ashamed of my country.", " I know, I am.", " Can I help you sir?", " Have you sons in the Army?", " You have done a great deal for your country sir.", " Yes?", " Is Jo back yet from Aunt March?", " I can’t miss the last train...", " Thank you, for everything.", " While I’m gone, Hannah is in charge - and please remember to check on the Hummel’s, it will be a difficult winter for everyone...", " Twenty five dollars! That isn’t like Aunt March to be so generous.", " Where did you get the money?", " I am so proud that you are my daughter.", " My girls: I love you more than words can say. Be good to each other. Pray for Father’s recovery. I will come back as soon as I can.", " You were right to send for me, my girls - but you’ve been very good nurses indeed.", " Hannah, go make a clear broth and Jo get ice - we need to cool her.", " John is staying with him.", " We need to change the linens.", " Thank god, thank god you’re home. Now I can be angry with you in person.", " You are not entirely wrong.", " I hope I’m not disturbing your writing...", " You are much too lonely here, Jo. Wouldn’t you like to go back to New York? What about your friend - Friedrich, was that his name?", " I doubt a sincere friend would be deterred.", " Laurie is returning, you know.", " There was a letter from Amy, she’s coming home: She was devastated about Beth and Aunt March is very ill - but Laurie will be accompanying them on the journey home.", " What is it?", " Do you love him?", " But do you love him?", " That is not the same as loving.", " Jo, you might want to wait..", " Jo, dear, you have a guest.", " You aren’t an immigrant, so perhaps you should stay home.", " It would make us so happy if you played now, she wouldn’t want the piano to sit silent."], "BETH (O.S.)": [" They’re beautiful!"], "HANNAH": [" I know you don’t care what I think, but you don’t want your mother to find you like this, do you? MEG BETH", " Goodness only knows. Some poor creature came a-beggin', and your ma went straight off to see what was needed.", " I’m not acting.", " I knew what you were going to say and I’m not acting.", " Mr. Laurence sent it.", " He saw you giving your Christmas breakfast away and wanted you to enjoy the day.", " It’s so good to have you home! I think the loneliness got to Beth, though she ain’t said anything.", " She needs to have some decent shoes.", " What is it?", " It’s for your own good, child.", " We should send for your mother.", " Oh JO, he’s VERY handsome."], "MARMEE (CONT'D)": [" I’m so glad to see you so happy."], "MR. BROOKE": [" Thank you. And thank you, Mr. Laurence, for including me.", " Sit down. Sit down, Laurie. Latin is a privilege. Please, you have to learn this. I can’t afford to lose this position. Just return to Cicero.", " No, there is not.", " Yes, women being taught at home is much more proper, I believe.", " Indeed, quite right.", " Oh, Miss Meg! You forgot your glove!", " Do you think this is a good idea, her going away like this?", " I came to offer myself as escort to your mother. Mr. Laurence has commissions for me in Washington, and it will give me real satisfaction to be of service to her there."], "MR. LAURENCE": [" You’re welcome. Perhaps you could tutor my grandson in manners as well as mathematics.", " You think he’s more handsome, hey?", " I knew your mother’s father. You’ve got his spirit.", " Is she the quiet one?", " Tell the little girl to use our piano.", " Well, back to work, back to work.", " Nonsense! Although, there is one thing -", " It occurred to me today that my daughter’s piano suffers from want of use.", " Wouldn't one of your girls like to run over, and practice on it now and then, just to keep it in tune? If they don't care to come, why, never mind.", " Are you the musical girl?", " Not a soul, my dear. Drive on, and keep her safe!", " If I may be of any more assistance, please tell me. I will look in on the girls every day, without fail.", " I have always admired your husband, and I pray for a quick recovery.", " You remind me so much of my little girl. The piano is yours, I should have given it to you long ago.", " How is she? Is there anything I can do?", " Jo!", " I couldn’t bring myself to... The house doesn’t seem right without her and I couldn’t go in knowing she wouldn’t be there."], "MRS. HUMMEL": [" Ach, mein Gott! It is good angels come to us!"], "MEG/JO/BETH/AMY": [" A letter! / from Father! / Is he coming home? / Three cheers!"], "MARMEE (V.O.)": [" ...A year seems a very long time to wait before I see them but remind them that while we wait we may all work, so that these hard days need not be wasted", " ...I know they will be loving children to you, do their duty faithfully, fight their enemies bravely...", " ...and conquer themselves so beautifully...", " ....that when I come back to them I may be fonder and prouder than ever of my little women.”"], "RAILROAD PORTER": [" Your stop, ma’am."], "SCHOOL GIRL #1": [" President Lincoln.", " The Marches love a cause.", " I’ll wipe out your debt and give you five more limes besides."], "SCHOOL GIRL #2": [" Everyone benefited from the system, including you Marches - why should only the south be punished?"], "SCHOOL GIRL #3": [" Fine, just do Mr. Davis."], "AMY (CONT'D)": [" Mr. Davis hit me.", " I am the most sorry for it now. I’m so sorry.", " Even if I had my own money, which I don’t, it would belong to my husband the minute we were married. If we had children they would belong to him not me. They would be his property. So don’t sit there and tell me that marriage isn’t an economic proposition, because it is. It may not be for you but it most certainly is for me.", " Remember the name “Amy March.” I’m going to come find you one day in London.", " Beth was the best of us."], "SERVANT": [" She’s in here..."], "JO/AMY/MEG": [" Thank you/ Please come over/Many thanks/Our apologies."], "LAURIE (CONT'D)": [" Allow me to present four copies of the key, and with many thanks for your favor, take my seat as part of the club.", " You wouldn’t actually marry one of these men, would you?", " You can bear it. In fact, I think it agrees with you."], "MEG (O.S.)": [" Jo! Jo, where are you? I can’t find my other glove!", " Jo we’re going to be late!"], "AMY (O.S.)": [" HELP! HELP!"], "ANNIE": [" Now what dress will you wear tonight, Meg?", " /Not at all. There’s no need of sending home, Daisy - I’m going to call you Daisy now - I’ve got a sweet pink dress laid away, and you will wear it to please me, won’t you, Daisy?", " Of course!", " Everyone is in love with you, Daisy! You have to keep my dress.", " Have fun, little Daisy."], "JOHN": [" Fifty dollars, while a lot, is not, I suppose, too much for a dress, with all the notions that are needed to finish it these days.", " Oh, I see.", " I was afraid of this. I do my best, Meg.", " Perhaps you meant it.", " I can’t afford it, my dear.", " I need to go to bed.", " And there’s another thing - you should send your fabric to the dressmaker as soon as possible.", " You did?", " I don’t want you to be unhappy."], "JOHN (CONT'D)": [" And I really am very sorry that you have had to do without so many beautiful things. And that you’re married to someone who can’t give them to you."], "FRED": [" So pleased to meet you.", " Oh, I certainly will!"], "JO (V.O.)": [" “We could never have loved the earth so well if we had had no childhood in it, if it were not the earth where the same flowers come up again every spring that we used to gather with our tiny fingers.”", " My dear Teddy, I miss you more than I can express.", " ...I used to think the worst fate was to be a wife, I was young and stupid. Now I have changed. The worst fate is to live my life without you in it. I was wrong to turn you down and to run away to New York."], "BETH (CONT'D)": [" Do what Marmee taught us to do. Do it for someone else."], "SUSAN ROBBINS": [" You should go home to the girls, I can take care of this.", " No offense meant but you should still be ashamed."], "ASA MELVIN": [" Hello Ma'am.", " Yes, ma'am; I had four, but two were killed; one is a prisoner, and I'm going to the other, who is very sick in a Washington hospital.", " Not a mite more than I ought, ma'am. I'd go myself, if I was any use; as I ain't, I give my boys."], "SOLDIER": [" Mrs. March?", " Telegram from Washington Ma'am."], "JO (O.S.)": [" Here she comes!"], "MR. LAURENCE (CONT'D)": [" My child, you’re burning."], "DOCTOR": [" She’s resting.", " It’s scarlet fever.", " I visited the Hummel’s, the baby has died.", " She’ll have to be sent away."], "DOCTOR (CONT'D)": [" Have you all had it before?"], "FATHER": [" My little women. How you’ve grown, and how proud I am of you. Each of you. Merry Christmas, my dears.", " Dear Sister, you are too kind. And thank you for today’s festivities.", " And you intend to stay in New York?", " Perhaps I should go West...", " Oh, I’m going.", " Do you play?", " Not in the least.", " What a wonderful man. I hope he comes again, he would be a terrific friend for me.", " No?"], "MEG (CONT'D)": [" I want a family and a home and I’m not scared of working and struggling, but I want to do it with John."], "MR.MARCH": [" What excessive promises, giving yourself away to get the other. What a thing, what a gift, always given before it is known the cost or the reward."], "LAURIE (O.S.)": [" JO... JO... JO..."], "MR. DASHWOOD (V.O.)": [" Or, shall I say, your friend can. My apologies for the joke, I couldn’t help it."], "MRS. DASHWOOD": [" You never ask about my mother even when you know I’ve seen her.", " But I ask after your mother.", " You’re willfully missing the point.", " I have no idea."], "DASHWOOD GIRL #3": [" Tell me you have the rest of the book!"], "DASHWOOD": [" Frankly, I don’t see why she didn’t marry the neighbor.", " Right, of course. So, who does she marry?", " No. No, no, no, that won’t work at all.", " WHO CARES! Girls want to see women MARRIED. Not CONSISTENT.", " The right ending is the one that sells.", " It’s romance!", " Just end it that way, will you?", " We can call the chapter “Under the Umbrella.”", " Perfect! Now there is the question of the contract... I’m prepared to give you 5% of the royalties.", " 5% of the net profits. After I re- coup.", " I’m taking the risk in printing this book.", " If it works, then we’ll both make money. If not, then I won’t go under.", " No, I’ll give you $500 dollars right now to buy out the copyright.", " It’s the right for re-printing, that sort of thing, sequels, the characters for other stories.", " Well, again, only if it’s a success.", " Doesn’t your family need the money more immediately?", " I’ll only pay for the copyright.", " Five point five percent and that is very generous.", " Six percent -- and that’s it.", " Six point six percent.", " And you don’t need to decide about the copyright now."], "DASHWOOD (CONT'D)": [" If you end your delightful book with your heroine a spinster, no one will buy it. It won’t be worth printing."], "FRIEDRICH (CONT'D)": [" Jo, why are you crying?"], "DASHWOOD (O.S.)": [" I love it. It’s so romantic. “Your hands aren’t empty now.” It makes me emotional."], "JON": [" So I get 5% of the profit?"]}