{"scenarios": ["INT. NEW YORK. PUBLISHING OFFICE. 1868.", "JO MARCH, our heroine, hesitates.", "In the half-light of a dim hallway, she exhales and prepares,", "her head bowed like a boxer about to go into the ring. She", "puts her hand on the doorknob. A pause, and then, she opens", "it onto a disorderly room.", "It is full of men. Some sit with their feet up on the desks,", "higher than their hats, which they do not remove for her.", "They smoke and read, hardly noticing that she has walked in.", "Jo walks through the desks, looking for one in particular.", "MR. DASHWOOD (the oldest, smokiest gentleman) looks at her.", "Mr. Dashwood stares silently.", "He stands and extends his rough, large hand. She gives him", "the manuscript.", "He now takes in Jo’s appearance and her mended clothes.", "Jo sits, hands folded, trying to cover the ink stains. Mr.", "Dashwood reads her story with a pen in hand, gleefully", "crossing out and making notes, changes. Every time his pen", "scratches, Jo feels her heart breaking. She’s on the verge of", "tears when:", "She nods and he hands it back to her, page after page with", "her work crossed out. She examines it.", "Jo looks again at her completely altered story.", "Jo hands over the story, Mr. Dashwood hands over the money,", "business done.", "But he’s on to the next bit of business.", "He considers her.", "EXT. NEW YORK CITY. DAY. CONTINUOUS. 1868.", "The streets of New York. After the Civil War and at the brink", "of The Industrial Revolution. It is a city in the middle of", "becoming, the 20th century on the horizon. Horses, trolleys,", "young, old, black, white, immigrants, returning soldiers,", "factory workers, wealthy industrialists, fashionable women", "and poor mothers all crowd the streets.", "We find Jo (also becoming) sprinting down the street with", "utter joy. She has pulled up her skirts and is running full", "steam. Not lady-running, flat-out RUNNING. For the joy of it.", "EXT./INT. BOARDING HOUSE. NYC. DAY. 1868.", "Jo reading and walking at the same time, bounding two-at-a-", "time up the steps of a large brownstone boarding house. She", "stoops to pick up a cat who suns herself on the steps.", "As Jo walks through the house, into the drawing room, she", "lets the cat down, and goes straight to the fireplace. She", "stands with her back to it, to warm herself, and produces a", "small notebook and begins to write.", "She is so engrossed with her writing that she doesn’t hear", "the boisterous group of college students and professors, men", "and a few women, when they descend upon the room. She just", "keeps writing, until:", "Jo looks up from her notebook to see FRIEDRICH BHAER looking", "down at her. He speaks with a French accent, and, like all", "Europeans, seems to know something that we Americans don’t:", "Jo suddenly notices that the back of her dress has caught on", "fire. In a panic, another woman of the group helps her and", "the dress is put out.", "Disaster is avoided, although not humiliation.", "He shows her scorch marks on his jacket. Jo is about to laugh", "when, MRS. KIRKE, the landlady, bustles into the room:", "Jo looks up the stairs to see the two little girls prancing.", "Jo feels the intense pleasure and pain of being seen by", "someone, of knowing that they know you.", "EXT. FRANCE. PARIS. DAY. 1868.", "AMY MARCH, an angelic 20-year-old with golden curls, is", "painting a staged scene, along with a few other young", "artists. It is a classic scene of two young men and a young", "woman at a picnic, and Amy is rendering it realistically,", "imitating the 18th & 19th century painters she loved.", "She looks at the painting of the young man next to her. He is", "doing something radically different - the paint is obvious,", "the colors are bright and un-life-like, space is flattened.", "It is not meant to be realistic: it is the beginning of", "modernism.", "She looks back at her own piece and realizes that she might", "have missed the moment that she came here to master.", "Perhaps she’s already passed before her time. She continues", "working, troubled.", "EXT. PARIS PROMENADE. DAY. 1868.", "Amy rides in an open air carriage with AUNT MARCH, reading a", "letter from home. Everyone in Paris is out. Aunt March is", "only happy when she’s complaining, and she’s in excellent", "form this morning. It is the place to see and be seen and Amy", "March is doing both excellently.", "No response from Amy.", "Amy gives her a hard look.", "Amy blushes and puts the letter away.", "Aunt March looks at her, momentarily confused.", "Amy looks at all the passers-by. She sees a somber young man,", "tall and dark and looking down as he walks. Suddenly!", "Abandoning her primness, she launches out of the carriage and", "runs, nearly knocking people over. This is Theodore Laurence,", "LAURIE, a 26-year-old without a sense of direction, like most", "26-year-olds. They hug joyously and un-self-consciously:", "AMY! You’re so /grown up!", "I looked for you and couldn’t", "find /you anywhere!", "Maybe I just didn’t recognize", "you, you’ve become so", "beaut/iful.", "Still in Germany. I’m on my", "own, traveling and /having", "fun.", "Laurie gallops over, and jumps into the carriage, kissing", "her:", "Aren’t we fine, /Ma’am.", "He kisses her again, grinning.", "Aunt March attempts to get the carriage to leave, and Laurie", "is thrown off while Amy is thrown in.", "Laurie turns and continues his heartbroken stroll, as Amy", "looks at him. She turns back to Aunt March.", "Amy turns around to get one last look at Laurie. She loves", "him, as she’s always loved him.", "INT. TAILOR SHOP. AFTERNOON. 1868.", "MEG MARCH, beautiful but with the melancholy of yearning", "emanating from her, is browsing the silks with Sallie Moffat,", "a rich young woman who possesses an air of casual boredom", "that comes from never having to work for what you have.", "She looks over at Meg, who touches a beautiful grey silk:", "And Meg watches, delighted but fighting guilt, as the", "beautiful fabric is cut.", "EXT. MEG MARCH’S HOUSE. DAY. 1868.", "From inside a modest rural cottage, Meg emerges, wiping her", "hands and muttering to herself.", "She sees her two 3-year-olds, a boy and a girl, DAISY and", "DEMI, playing in the yard. She sits down to watch them,", "feeling both grateful and trapped. They run up to her.", "They fall into her arms, she accepts them and then sends them", "off to play again. We hear sounds a beautiful Bach piano", "sonata being played...", "EXT. / INT. MARCH HOUSE. 1868.", "... the music grows louder as we see empty rooms of the", "childhood home -- the attic, the dining room, the stairs.", "Finally we find BETH MARCH, alone at the piano. She stops", "playing suddenly, as if in pain. Then she takes a deep", "breath, feels the sunlight on her hand, and stretches it out.", "She doesn’t respond.", "INT. NEW YORK THEATRE. EVENING. 1868.", "Shakespeare’s Twelfth Night unfolds on stage. Jo is in the", "back, the cheap standing-room. She’s so wrapped up that she", "moves in until she’s practically leaning over the railing.", "It’s the scene where Viola (dressed as a man) seduces Olivia.", "Friedrich watches the play from his own, proper, seat. At a", "certain point, he sees Jo, and then watches her watching the", "play, her delight making him smile.", "INT. NEW YORK THEATRE LOBBY. NIGHT. 1868.", "The audience flows out of the theatre into the lobby. Jo,", "still in her theatrical reverie, spots Friedrich. She", "freezes, not moving, not wanting to be seen.", "She then follows behind the band of friends, drawn to them in", "spite of herself.", "INT. GERMAN BEER HALL. NIGHT. 1868.", "It is a rowdy and raucous crowd, drinking and dancing. Jo", "walks through the crowd, taking it in, watching Friedrich. He", "knows everyone and can speak half a dozen languages. Another", "man young, speaking a language Jo doesn’t know, offers his", "hand for the dance.", "He pulls her into the dance, and she does her best to follow", "along. It’s whirling and loud and wild. Before long, she", "finds herself paired with Friedrich and all self-", "consciousness leaves her. She is part of the night and the", "room and the music and she throws herself into movement, and", "we are taken back to", "THE PAST. INT. CONCORD. MARCH HOUSE. JO & MEG’S ROOM. 1861.", "...the sisters, all together again in the past, in the snow-", "globe of girlhood and memory that is ever present but forever", "gone, are in a flurry of getting ready for a holiday party.", "Meg’s hair is covered in papers, and Jo manipulates a pair of", "hot tongs. Meg struggles to get on a pair of slippers.", "Just wear your regular", "/shoes.", "Amy puts on jewels and rouge and tries to shape her nose.", "Jo goes back to working on Meg’s hair. Beth watches Jo handle", "the tongs, amazed and slightly worried:", "Ought they to smoke /like", "that?", "Jo removes the tongs, and a burnt clump of hair follows. Jo", "screams and Meg screams because Jo screams.", "You’re /ruined!", "What have you done?! /Marmee", "I’m spoilt! I can’t go! My", "hair!", "INT. GARDINER'S NEW YEAR’S PARTY. HALLWAY. NIGHT. 1861.", "Meg and Jo walk down the hallway at the Gardiner’s very fancy", "party, the party already in full swing. Meg is chastising Jo:", "Meg is immediately pulled away.", "Sallie Moffat, at that moment Sallie Gardiner, pulls Meg away", "from Jo, who is left standing awkwardly.", "Meg seems to put on another face and attitude, more grown up", "and elegant. Jo fades away into the back of the party.", "INT. GARDINER’S NEW YEAR’S PARTY. CONCORD. NIGHT. 1861.", "Jo, 16, miserable, glumly watches the dancers. She pulls at a", "string on her dress. She catches Meg’s eyes, 17, laughing", "with her dance partner, and pleads with her to leave. Meg", "aggressively shakes her head, and Jo sighs, resigned.", "A very large red-headed boy makes a beeline for Jo - in her", "terror, she looks for an escape.", "She slips behind a curtain, and walking backwards, she nearly", "sits on Theodore Laurence (!), Laurie, a very serious looking", "17-year-old boy.", "Dear me, I didn’t know any", "one /was here!", "They stand there, unsure of what to do, both shy.", "Their first burst of conversation has run it’s course, and", "they smile at each other, standing in the not-unpleasant", "awkwardness of meeting.", "They peek through the curtain and watch Meg dance.", "That’s her, see? The girl", "in the violet /dress?", "Laurie doesn’t look disappointed that she’s a girl at all:", "Laurie does not laugh, but looks quite tender.", "EXT. GARDINER’S NEW YEAR’S PARTY. PORCH. NIGHT. 1861.", "Laurie bows, Jo awkwardly curtsies and then they go dancing", "wildly up and down a wrap-around porch. It’s actually very", "romantic in its exuberance. Sometimes Jo is the woman and", "sometimes the man - same with Laurie. They are mid-spin when", "they see Meg wildly gesture at them from inside: She’s hurt.", "INT. GARDINER’S NEW YEAR’S PARTY. HALLWAY. NIGHT. 1861.", "Meg limps, Jo supports her and Laurie trails behind.", "I don’t see what you can do", "except get a carriage or stay", "/here all night.", "INT./EXT. MARCH HOUSE. NIGHT. 1861.", "A laughing Marmee, holding a book and covered in flour, opens", "the door on Laurie and Jo, supporting Meg.", "Marmee has none of the pretensions of the other mothers, no", "artifice. She’s a hippie before they existed.", "The little girls, Amy and Beth come rushing down the stairs", "and attack the older girls.", "Here, make room, /Meg is a", "wounded soldier!", "Tell us about it!/", "What’s he like?", "Laurie stands apart, not wanting to be a disruption, but", "loving the March household, this slightly medieval utopia of", "artists and thinkers.", "Marmee hands him the scone, as Hannah enters with ice for", "Meg’s ankle. Amy keeps sneaking looks at Laurie.", "Instantly, she sees his loneliness, his lack of a mother.", "He doesn’t say anything, but looks as if he’s about to cry.", "He doesn’t have a mother, and hasn’t had one for a long time.", "It really seems like being a", "fine young lady to come home", "from my party in a carriage", "and have maids to /wait on", "me!", "The girls laugh and prance and gossip around the warm fire.", "He stands apart, loving them all, the whole family...", "EXT. MARCH HOUSE. NIGHT. CONTINUOUS.", "...but most especially Jo. As Laurie retreats back to his", "big, lonely house, he looks across the field to Jo, writing", "alone in the attic, absorbed with her work.", "THE PRESENT. EXT./INT. NEW YORK BOARDING HOUSE. NIGHT. 1868.", "Jo works with her writing costume on: an antique military", "jacket. Her writing is like an attack, moving into enemy", "territory and occupying space. Her hand starts to cramp, she", "shakes it, stretches it, and then switches hands.", "Suddenly she stops - she’s heard something. She opens the", "door, but the hallway is empty. She looks down and sees a", "book, a very beautiful copy of The Complete Works of William", "Shakespeare. She opens the cover - inside there is a note:", "Jo opens the book and almost greedily she begins to read,", "reciting the words to herself.", "INT. PARIS. BALLROOM. 1868.", "A gorgeous Paris ball, and Amy is lively and everyone’s", "favorite at the party. She dances with Fred Vaughn most", "often, gossips with his sister and her friends, and is", "charming to everyone.", "Suddenly, Amy sees something that makes her look sour, and we", "follow her gaze to see Laurie entering: He is loud, drunk,", "has two girls with him. They all fall into a sofa, laughing", "and loud.", "Amy frowns and approaches. She stands before him, annoyed:", "Laurie clumsily makes a space for her while the other ladies", "depart. Amy does not, and walks away, forcing him to follow:", "Because with every chance for", "being good, useful and happy,", "you are faulty, lazy and", "/miserable.", "Yes, very selfish. With your", "money, talent, beauty and", "/health --", "He drunkenly puts his hand over hers. He wears a ring on his", "pinky finger, which he never takes off:", "Amy considers him seriously.", "Amy smarts, his comment cut her to the core. Laurie takes his", "very messy leave and she looks to Fred --", "INT. BOARDING HOUSE DRAWING ROOM. NYC. DAY. 1868.", "Friedrich holds a few newspaper clippings and handwritten", "pages. Jo paces and watches him read, nervous. He laughs, she", "smiles at his laughter.", "He finishes reading, puts down the work, and looks at her. Jo", "instantly feels that she needs to explain.", "Yes... so far /anyway.", "He considers, then speaks:", "Jo, deeply offended, starts to gather up her work.", "But do you have anyone to", "take you seriously, to talk", "about your/work?", "Your reaction indicates that", "you must think there is some", "truth /in it.", "She does what she does when she’s hurt, which is that she", "gets incredibly mean instantaneously, without meaning to, and", "without being able to take it back.", "No, you don’t, and you’ll", "always be a critic, never an", "author, and the world will", "forget that you ever even", "lived /but no one..", "An energy between them and then she kills it definitively.", "She turns to leave, hiding all the emotions.", "EXT. NEW YORK CITY. TWILIGHT INTO NIGHT. 1868.", "Jo, in fury and confusion, walks the streets, letting her", "feelings burn out. She strides through the entire night that", "way, like Charles Dickens’ Night Walks.", "INT. BOARDING HOUSE. DAY. 1869.", "After her walk -- Mrs. Kirke hands Jo a telegram:", "Jo tears it open and quickly reads.", "INT. TRAIN. DAY. 1869.", "Jo drifts off to sleep, lulled by the movement. The country", "speeds past her. As she goes forward towards her childhood", "home that is now no longer her home, and to the past that she", "can no longer find...", "THE PAST. INT. ATTIC OF THE MARCH HOUSE. MORNING. 1861.", "Jo March is sleeping in her large, cozy writing chair, a", "blanket wrapped around her. Her fingers are stained with ink", "and pages are strewn about her. Sounds of the day start to", "drift upstairs to her perch. Her eyes flutter open at the", "distant sound of...", "Jo! Jo! Where /are you?", "Jo yawns and stretches and looks through the attic window out", "onto the snow-covered New England world:", "She wraps the blanket around her and quietly opens the attic", "door and sneaks down, watching her sisters, her heart’s joy,", "fussing over the decorations Amy has made.", "They all look up, delighted:", "Jo! We’ve been up /for hours!", "Jo clomps down the stairs, pages of the play in her hand.", "No, no poison it’s", "/Christmas.", "It’s so dreadful to be /poor.", "At least we have father and", "mother and /each other.", "I can’t be an /actress.", "Why be ashamed of what you", "/want?", "Beth is /perfect.", "Jo throws a pillow at Meg, it hits her squarely in the face.", "That’s why I /do it.", "Jo tackles Amy and Beth and pulls in Meg. They commence play-", "fighting. In the tussle, Amy shouts out:", "The girls untangle and run to Hannah. She’s a good-natured", "woman old enough to be their grandmother.", "Of course we care what /you", "think.", "Don’t, /Jo.", "I’ve made a DIVINE hat, and", "painted those old shoes blue", "/so she truly looks like a", "princess.", "Beth goes to the piano and Jo hands out the new pages:", "Meg, wait until you see this", "/new speech!", "You’re as stiff as a poker", "/in that.", "Amy falls into a chair, and Jo turns to Hannah:", "EXT./INT. CONCORD. MARCH HOUSE. CONTINUOUS. 1861.", "Marmee approaches her modest home, and sees her girls", "laughing and rehearsing, joyfully playing make-believe. She", "fights tears and sadness, about what, we don’t entirely know.", "We just know that what she does as a mother isn’t free. Of", "course it’s not, nothing is ever free, even a joy a mother", "can make.", "Just before she flings open the door, she puts a smile on her", "face. Like so many mothers, she creates magic where there is", "none, and enables her girls to be brave.", "All the girls shriek and crowd around her.", "Mother! Are you freezing,", "/come have some tea.", "We finished the /sewing!", "They clearly worship their mother. As she’s talking, they", "follow her into the kitchen.", "I’m so /hungry!", "Stop it, /Jo!", "Marmee sees the expectant faces and wrestles with herself:", "They are very quiet, because they really don’t want to do it.", "INT. LAURENCE HOUSE. FORMAL DINING ROOM. DAY. 1861.", "Mr. Laurence sits with his grandson, Laurie, his grandson’s", "tutor, Mr. Brooke. It is quiet and proper, the opposite of", "the merry mayhem of the March household.", "They both look at Laurie, who watches the March women walk", "across the snow-covered field with their breakfast. Jo hits", "Amy with a snowball, and there is a general tussle.", "EXT. CONCORD. CHURCH. CHRISTMAS DAY. 1861.", "All of the “proper” people of Concord are entering the local", "church, serving God in the traditional manner.", "The March family walks by, actually doing the Christ-like", "thing, instead of performing their faith.", "EXT. WOODS AROUND THE HUMMELL HOUSE. DAY. 1861.", "The girls make their way through the woods and finally find", "themselves outside of a shack that is so dilapidated that it", "is hardly standing. This is the Hummel house.", "INT. HUMMEL HOUSE. DAY. 1861.", "The girls enter, tentative at first around such wretched", "poverty. Mrs. Hummel is barely older than they are, and", "frighteningly thin. Marmee shows no hesitation, immediately", "taking the infant into her arms.", "They all set about making the room less wretched, more home-", "like. Marmee comforts the baby, Meg takes two children into", "her lap, Amy cleans and straightens, Beth covers the other", "children with blankets, Jo sets up the food.", "INT. MARCH DINING ROOM. LATE AFTERNOON. 1861.", "Freezing but happy, the women return, and immediately see", "Hannah has arranged an unimaginable feast, with candy and ice", "cream and cakes. Hannah pulls Mrs. March aside while the", "girls marvel:", "Is it /fairies?", "They all run to the window to look.", "What do you know? You’ve", "never spoken /to him!", "They gather around Marmee, sitting her into her easy chair,", "and making her comfortable. This is clearly their tradition:", "Poor Jo - we can’t give up", "our only /brother.", "Jo takes her position behind the chair.", "Jo stands in the back so we", "can’t see her /cry.", "As the letter is being read, we see the sisters put on the", "play they had been rehearsing. With Marmee and Hannah", "cheering them on, they perform for the neighborhood children.", "The children are entranced as Jo, dressed as Hugo, with a", "black beard, a mysterious cloak, boots and a sword, calls", "out:", "Meg enters as Hagar, the horrible old witch. A smoke effect", "and a well done homemade costume make the audience gasp:", "Jo mouths the words along with her - she’s written every one.", "Amy, as the Sprite, appears on top of a poorly constructed", "“tree,” to give the illusion of “flying”:", "In mid-speech and gesture, Amy falls with a loud crash:", "Beth is revealed playing and trying to keep a straight face,", "while the sisters scramble to keep the performance going.", "Princess Zara (Amy) and Roderigo (Meg) kneel before Don Pedro", "(Jo), as he pronounces them man and wife. Beth plays the", "final triumphant chords.", "The audience claps as the sisters bow - Jo gentlemanly, Meg", "demurely, Amy the diva, and Beth’s small quiet curtsy. One", "woman rises to her feet with her applause and shouts:", "THE PRESENT. INT. TRAIN. DAY. 1869.", "The whistle blows, Jo is being gently shaken awake.", "INT. BOARDING HOUSE. KITCHEN/LAUNDRY. NEW YORK. DAY. 1869.", "Mrs. Kirke hangs laundry as Friedrich questions her:", "Friedrich looks troubled and serious.", "EXT. CONCORD TOWN ROAD. DAY. 1869.", "Jo, with her luggage, walks home on the familiar roads she", "knows so well. She breathes in the air and trudges onward.", "THE PAST. EXT. CONCORD TOWN ROAD. MORNING. JANUARY, 1862.", "The four girls are walking, bundled against the cold. The", "streets are more bustling, the atmosphere cozier. It is how", "childhood always is in memory -- brighter and better. They", "are back to the daily task of making a living.", "It’s so hard to go back to", "work after such /good times.", "Don’t use such dreadful", "/expressions!", "Limes?", "Will that /do?", "What /drawings?", "Beth shudders.", "Meg looks at the sun, and speeds up.", "They break apart from each other at the fork in the road,", "Beth and Meg going one direction and Amy and Jo in another.", "EXT. AUNT MARCH'S HOUSE. THE SAME DAY. 1862.", "Jo hops over a fence and runs toward Aunt March’s house.", "INT. AUNT MARCH’S HOUSE. CONTINUOUS. 1862.", "Aunt March dozes, poodle in her lap, while Jo stands by the", "bookcase and surreptitiously reads her own book.", "She turns the page, trying to be as quiet as possible, but", "Aunt March wakes up.", "JOSY-/PHINE!", "You are not married, Aunt", "/March.", "Marmee loves her /life.", "INT. SCHOOL. THE SAME DAY. 1862.", "During a break, one of the school girls whispers to Amy:", "My father says the war is a", "waste, we should just let", "them keep /their labor.", "Amy is seduced, and instantly starts drawing the (very good", "and accurate) caricature. The girls giggle. Amy gets carried", "away, drawing a conversation bubble with words “My eye is", "upon you, young ladies.” More laughter. Suddenly, a shadow", "falls over them, and all the girls look up, scared, and move", "away. Amy, however, is too wrapped up in her drawing to", "notice. When she does, Mr. Davis looks down sternly at her.", "INT./EXT. MR. LAURENCE’S HOUSE. DAY. 1862.", "Laurie tries very hard to study with his tutor, Mr. Brooke,", "but it is hopeless, Laurie keeps jumping up and distracting", "himself with something in the room. His most recent position", "is standing like a statue, perched on a chair.", "But Laurie is staring out the window.", "He throws open the window and yells out:", "She holds up her hand, which is red and bleeding a little.", "INT. LAURENCE HOUSE. LIBRARY. DAY. 1862.", "Amy, her hand now bandaged, sits looking at an art book,", "pretending to be a very fine lady.", "Laurie laughs at this confident girl. Amy likes making him", "laugh. Mr. Brooke shakes his head, frustrated. A servant", "enters, followed by Jo and Meg.", "Meg goes instantly to Amy, while Jo gets distracted by all", "the books. Laurie stands when Jo enters:", "Jo!", "Meg is tending to Amy, and Mr. Brooke can’t help but stare at", "Meg, completely flummoxed by her beauty and goodness:", "What happened /little lamb?", "Amy starts crying again, holds up her hand. Meg has taken off", "her gloves and put them on a side table while she examines", "her sister’s outstretched hand. Mr. Brooke eyes the gloves,", "he’s drawn to the items so recently worn by Meg.", "Jo, who has been roaming the room, stops in front of a", "portrait of Mr. Laurence. Laurie follows her gaze.", "Unfortunately, during this speech, Mr. Laurence has entered", "with Mrs. March, unseen by Jo.", "Jo spins around and sees Mr. Laurence and her mother.", "Marmee tends to Amy.", "And please come here,", "whenever you’d like. And tell", "Beth to come /too.", "And may I come look /at the", "paintings?", "The women leave and Mr. Brooke notices Meg has left her glove", "behind.", "The men are left standing in the silence of their absence.", "Mr. Laurence breaks the spell:", "THE PRESENT. EXT. MARCH HOUSE. DAY. 1869.", "Jo looks towards the Laurence’s house, which is dark,", "shutters closed. It doesn’t seem right without Laurie in it.", "She looks in the forest by the pond to find an old mailbox.", "She produces a key with a red ribbon and holds it in her", "hand, and we and she are transported back to", "THE PAST. INT. MARCH ATTIC. DAY. 1862.", "Meg, Beth, Jo and Amy are all dressed as men, with hats and", "spectacles and pipes - Meg reading from the homemade", "newspaper in her lovely sonorous voice.", "Excellent.", "No!", "Aye.", "Jo throws open the doors of the closet, and Laurie is there,", "already dressed for the occasion of the meeting.", "You /traitor!", "Laurie bows deeply.", "He lays the four keys (with different colored ribbons) before", "them and bows again and they all cheer.", "THE PRESENT. EXT. MARCH HOUSE. DAY. 1869.", "Jo holds the very same key and opens the post office box -", "nothing, of course. She shuts it back up and trudges across", "the field to her childhood home.", "INT. MARCH HOUSE. KITCHEN. DAY. 1869.", "Jo walks in the kitchen, and is immediately surrounded by", "Hannah, Meg, Marmee, and Demi and Daisy. They unload her bags", "and sit her in a chair and pepper her with questions.", "Hello!", "Oh Jo I’ve missed you!", "Jo turns to Marmee, who shows the truth in her eyes.", "Jo produces an envelope full of money.", "She hugs all the women again.", "Marmee and Meg exchange glances.", "THE PAST. INT. MARCH HOUSE. EVENING. 1862.", "Jo, in her and Meg’s room, places a pretty cover page on top", "of the novel she has written. She lovingly writes “For", "Father,” and hears:", "Jo puts her novel carefully in a drawer that is filled with", "her finished writing, and closes it.", "I don’t want chords, I want", "to go to the /theatre!", "INT. THEATRE. NIGHT. 1862.", "Jo and Meg watch the play, which is a campy vaudeville kind", "of thing. They are completely engaged in the proceedings. The", "men are watching them: Laurie looks at Jo while Mr. Brooke", "looks at Meg.", "INT. JO AND MEG’S ROOM. EVENING. 1862.", "Amy sneaks into Jo and Meg’s room, searching every drawer and", "hiding place for the novel that she knows is there. She", "finally finds it in the bureau. She pulls out the novel that", "Jo has just lovingly placed there.", "EXT. THEATRE. NIGHT. 1862.", "As they leave the theatre, Mr. Brooke offers Meg his arm, and", "she takes it. Jo notices and doesn’t like it at all.", "Laurie sees Jo’s expression and offers his own arm in mock", "chivalry. She punches him in the shoulder, and then races up,", "taking her sister’s other arm, pulling her away from Mr.", "Brooke.", "INT. KITCHEN. EVENING. 1862.", "Amy places page after page into the fire, watching it burn,", "and feeling nothing but terrific about it.", "INT. MARCH LIVING ROOM. NIGHT. 1862. CONTINUOUS", "Meg and Jo waltz in. Beth is playing with her dolls and Amy", "is sitting and reading, suspiciously quiet. Jo sprints", "upstairs.", "I wonder how she managed to", "turn white /as she did?", "Jo re-appears, walking slowly.", "No.", "Amy starts reading even more intently than before.", "Tell me or /I’ll make you!", "They are fighting, full-out fighting, during these last", "lines, as their sisters and Marmee attempt to stop it.", "INT. JO’S ROOM. EVENING. 1862.", "Jo is weeping, Beth cradling her head, Meg holds her hand.", "Marmee enters with Amy, who looks penitent. Marmee nods at", "her, as if to say “go ahead”:", "Nothing from Jo.", "Marmee approaches the bed.", "INT. MARCH HOUSE. KITCHEN. MORNING. 1862.", "A very tense breakfast: Jo’s eyes are red and puffy and a", "remorseful Amy tries to sit beside her and make peace, but Jo", "changes seats away from her. Amy looks pleadingly at Meg.", "Laurie bursts open the back door, unaware of all the trouble.", "Jo springs up, thrilled to have something to do.", "One second! Go down, and I’ll", "/be right there!", "Jo, not acknowledging her, grabs her skates and races out.", "It was a very hard loss /for", "her.", "Heartened, Amy grabs her skates.", "EXT. RIVER. DAY. 1862.", "Amy runs out of the house, calling:", "Jo pretends not to hear, skating near the edge while Laurie", "tests the ice. Amy is just getting to the riverbank, waving", "and calling.", "Jo hesitates for a moment, and looks at Amy, who struggles", "with her skates - it’s not clear whether or not she heard", "Laurie. Jo opens her mouth to say something, but changes her", "mind. The anger in her heart has made her small and mean.", "Jo takes off down the ice, jumping the gun, Laurie racing", "after her.", "Meanwhile, Amy tentatively steps onto the ice. She begins", "gliding, arms out, a younger and less experienced skater.", "Farther along the river, Laurie and Jo are trying tricks and", "spins, when Jo suddenly feels a pang of guilt, but shoves her", "feelings down and races to catch Laurie.", "She plows into Laurie, toppling him. They are both laughing", "when just at that moment - CRRAACCCKKK. The sound of ice", "splitting. And a high pitched scream:", "Laurie and Jo freeze and look at each other, and in the same", "instant they scramble up, Jo screaming.", "They race back, Jo sending up a breathless prayer, an", "incantation, a pleading with the universe:", "They find Amy surfacing and screaming and then going back", "under. Jo is almost paralyzed with terror...", "... but Laurie has leapt to action.", "Jo obeys quickly, blindly, using the incredible strength that", "is available to people in times of crises - Jo drags a large", "branch over to Laurie, who stretches it over to Amy:", "She does, and Laurie and Jo both lie flat on their stomachs", "so as not to disturb the ice, as they pull together. Jo is", "terrified but keeping herself together to get Amy to safety.", "The effort makes her own hands bleed. She and Laurie give one", "last pull and Amy is back on firm ground.", "Tears are streaming down Jo’s face as she strips off all her", "warm clothes and bundles them around Amy.", "INT. MARCH HOUSE. AMY AND BETH’S ROOM. EVENING. 1862.", "Amy is asleep, covered in blankets. Jo is slumped down on the", "floor beside her, not even feeling herself worthy of a chair.", "Marmee adjusts Amy’s blanket, and then looking at Jo, decides", "to take a seat beside her, on the floor:", "Marmee touches her daughters face.", "The two women sit beside each other as Amy sleeps. Jo puts", "her head on Marmee’s shoulder.", "THE PRESENT. INT. BETH’S ROOM. DAY. 1869.", "Jo, sitting by the bed, watches over Beth as she did for Amy.", "She attempts to write while Beth sleeps. She keeps starting,", "crossing things out. She is divinely dissatisfied.", "She gives up and picks up one of Amy’s letters. As she’s", "reading, Beth opens her eyes and sees Jo sitting there.", "Oh, Beth! My /love!", "We’re going to the sea to get", "you strong and /well.", "She’s not cutting her trip", "short, /is she?", "Jo bows her head on Beth’s bed.", "THE PAST. EXT. LAURENCE HOUSE. SPRING DAY. 1862.", "Meg is saying goodbye to everyone as she sets off for her", "adventure to visit Annie Moffat. Mr. Brooke is carrying her", "baggage, Hannah and the sisters and Marmee are helping with", "odds and ends, Laurie is “boxing” with Jo, and Mr. Laurence", "is there in his proper, “over-seeing-things” kind of way.", "Yes, Captain /Jo!", "Jo places the ring in Laurie’s hand.", "For a second, Mr. Laurence’s eyes flick to Beth - but then he", "directs his comments to Marmee.", "Does /it?", "Meg is pulled away by a carriage, and waves goodbye to", "everyone, they run down the road after her.", "EXT. ANNIE MOFFAT’S HOUSE. BOSTON. DAY. 1862.", "Meg arrives at a very grand, beautiful house, and suddenly", "feels quite self-conscious in her clothes.", "INT/EXT. LAURENCE HOUSE. DAY. 1862.", "Mr. Laurence watches from an upper window as a very timid", "Beth tries to walk bravely across the lawn. She stops, and", "turns back and walks towards her house, and then turns around", "again, finally making it all the way into the Laurence house.", "INT. ANNIE MOFFAT’S HOUSE. DAY. 1862.", "All the other girls are in their fabulous dresses, parading", "up the grand staircase. Meg trails in her plain dress.", "INT. LAURENCE HOUSE. DAY. 1862.", "Beth enters the big house and makes her way to the", "conservatory, looking at the piano with love.", "INT. ANNIE MOFFAT’S HOUSE. STAIRS. DAY. 1862.", "All the young men in their tuxedos wait for the young women", "to descend down the grand staircase - their parents watch", "proudly. The young ladies walk down the stairs like fancy", "Easter Eggs, Meg the most beautiful of all. She’s a triumph.", "INT. ANNIE MOFFAT’S HOUSE. DAY. 1862.", "Meg is done up nearly beyond recognition. She’s powdered and", "corseted and drinking and flirting. In fact, she’s kind of", "great at it.", "Suddenly, Laurie is standing in front of her. Meg starts.", "And Annie retreats with her friends, giggling again.", "It’s their pet name /for me.", "Meg says nothing but looks concerned.", "Why /not?", "Meg, in her anger and hurt, inelegantly hands him her", "champagne and accepts a dance with the boy standing nearest.", "INT. LAURENCE HOUSE. DAY. 1862.", "A very nervous Beth sits down and sees the sheet music in", "front of her. At first she is tentative, trying to play", "quietly, but soon she plays with abandon. She is on fire. Mr.", "Laurence, sitting on the stairs, is deeply moved by Beth’s", "music. Tears stream down his face.", "INT. MOFFAT BALLROOM. NIGHT. 1862.", "Meg feels faint from the corset and the champagne, and leans", "her head against a cool windowpane, hot and ashamed. Laurie", "comes and sits beside her.", "Meg smiles, and Laurie smiles at her.", "INT. MOFFATT BALLROOM. NIGHT. 1862", "The two of them are now dancing, looking young and sincere", "and terrific. They whirl and spin and laugh and the music", "plays on as the picture changes to...", "THE PRESENT. INT. MEG’S HOUSE. KITCHEN. NIGHT. 1869.", "Meg sits scared and ashamed, and John - Mr. Brooke,", "intelligent and kind and handsome - examines the two ledger", "books.  He struggles to understand.", "John takes off his glasses, overwhelmed.", "John bows his head, wounded.", "Instantly regretful, Meg begs forgiveness:", "John gets up from the table.", "He leaves, and she is terrified that she’s broken the man she", "loves so much.", "INT. PARIS. ARTIST’S STUDIO. DAY. 1869.", "Amy is looking through her own paintings and sketches and has", "a disturbed expression on her face. Laurie enters. His lot in", "life is always to be apologizing to one March sister or", "another, and he looks truly contrite.", "Have you been drinking", "/again?", "He sees her face, the ashen worry traced on it.", "Laurie watches her and then says conspiratorially:", "Amy laughs.", "Don’t make /fun!", "The sound of a carriage approaching, and Amy gives a little", "start:", "Laurie looks at her, really looks at her for the first time.", "She suddenly blushes, but smiles in thanks. And then runs off", "to greet Fred. From the top of the staircase, Laurie looks at", "her and Fred embrace, not sure of what he’s feeling.", "THE PAST. EXT. BEACH. DAY. 1862.", "On a perfect spring day, Laurie, playing the host, makes the", "introductions of the British family to the March women. And", "he introduces Fred Vaughn, who, of course, we already know as", "Amy’s potential husband.", "Jo tips her oversized hat.", "EXT. BEACH. DAY. 1862.", "KITES! BADMINTON! OCEAN!", "- A badminton game between Fred and Amy on one team and Jo", "and Laurie on the other while Beth cheers on both sides.", "- Sallie tries to impress Kate and flirt with Fred.", "- Fred tries to flirt with Jo, who kicks him.", "- Everyone flies kites.", "- Jo and Laurie run into the ocean.", "- Amy settles with a sketchpad, drawing Laurie - this is the", "picture we will see later (earlier).", "- Mr. Brooke and Meg are talking and flirting and skipping", "stones and generally being adorable and have that look of", "intimacy.", "- Jo, trying to practice her badminton skills, keeps looking", "over at Meg, who gazes at Mr. Brooke adoringly. This annoys", "Jo. Laurie sees her and comes and whispers in her ear.", "Jo whips around to look at Laurie.", "More scenes of childhood on the beach play out over the sound", "of Jo’s voice reading The Mill on the Floss by George Eliot:", "THE PRESENT. EXT. SEASHORE. DAY. 1869.", "Beth is wrapped up and looking at the sea and Jo reads George", "Eliot’s “The Mill On the Floss.” The beach is emptier,", "darker, colder -- the beach of their adulthood, without the", "gloss of memory.", "Jo smiles and then lays back.", "Jo is quiet. Sometimes it’s hard when someone knows you.", "THE PAST. EXT./INT. UNION ARMY SOLDIER’S FUND. DAY. 1862.", "Men, and a handful of women, are busily working in a", "converted warehouse with soldiers, veterans and volunteers.", "And older man, worn with age and grief, approaches her table.", "He is almost too shy to talk to her. She sees him, and puts", "him at ease.", "Marmee fights her tears, busying herself with arranging a", "charity bundle for him. She notices that he doesn't have a", "good scarf, so gives him her own, careful that he doesn't see", "this kindness. As she's doing this, a soldier walks up:", "He holds a telegram, the thing Marmee dreads.", "INT. MARCH FAMILY HOME. EVENING. 1862.", "Everything is topsy-turvy in the March house, anxious and", "worried. Hannah and Meg run about getting everything ready,", "Beth cries but tries not to, Amy packs her mother’s trunk.", "Mr. Laurence and Laurie enter.", "Meg is nearly running in the hallway when she bumps straight", "into Mr. Brooke.", "Meg spontaneously kisses him on the cheek. Instead of being", "embarrassed, Meg looks at him with pure gratitude and says:", "Meg runs back into the living room, followed by a stunned Mr.", "Brooke.", "At just that moment, the door swings open, and Jo rushes in", "and places money in her mother’s hand.", "Jo removes her hat, and beneath, all of her beautiful long", "hair is gone - now it’s just a short, blunt crop. Gasps from", "everyone and exclamations of “What?/How?/Why did you do", "it?/Jo!”", "Oh Jo, how could /you?", "Now your hair is /off.", "Jo runs to Laurie, hugging him. They now look like twin boys,", "and they both ruffle each other’s hair.", "The men watch solemnly, more determined than ever to help", "these women that they care for so deeply.", "INT. MARCH HOUSE. UPSTAIRS HALLWAY. NIGHT. 1862.", "Jo sits alone in the hallway, quietly weeping to herself. She", "tries to make as little noise as possible, but a door opens", "and Amy walks out - she stoops down to comfort her sister.", "And she sobs and sobs into Amy’s arms.", "The two sisters, so different, sit and comfort each other.", "THE PRESENT. EXT. PARIS. GARDEN. DAY. 1869.", "Laurie lazily lolls on the grass of the beautiful estate,", "while Amy sketches him. A peace has settled over them,", "they’re friends again. Amy gives him a hard time, playfully:", "He jumps up and play fights with her, making her laugh. He", "captures her, and holds her.", "Amy disentangles herself. She goes back to drawing:", "I’ve been writing an opera,", "I’d be the central /figure...", "She watches him and he watches her.", "Laurie comes around to look at the sketch - and sees another", "sketch beside it from years ago, young and full of happiness.", "The mention of Fred changes the air.", "Laurie gets very intense all of the sudden, words rush out:", "He takes her hand, and she pulls it away.", "THE PAST. INT. MARCH HOUSE. EARLY MORNING. 1862.", "Amy has her foot in a bucket of plaster, working on making a", "mold. Meg is reading a letter, smiling to herself. Jo writes", "a story. Beth finishes a pair of slippers for Mr. Laurence.", "The room is messy - they’ve let things slide since their", "mother has been gone. It was never a neat house, but now it", "definitely isn’t. The inmates are running the asylum.", "Meg, with careful attention, places the letter away and", "starts working on an errands list.", "Amy returns to her task.", "Marmee said /that we", "Jo laughs and tries to help her pull her foot out, while", "Beth’s little face turns stubborn. She doesn’t like this...", "EXT. LAURENCE HOUSE. MORNING. 1862.", "Beth gives her slippers, wrapped up, to a servant.", "EXT. WOODS./HUMMEL HOUSE. AFTERNOON. 1862.", "Beth, all alone, with a basket of supplies, makes her way", "towards the Hummel’s. A baby is crying, a panicked, sick cry.", "EXT/INT. MARCH HOUSE. LATE AFTERNOON. 1862.", "Beth returns to her home, walking slowly, and feeling", "strange. Her sisters’ heads bob up and down in the window:", "Beth walks in, and a letter is placed in her hand:", "But Jo clamps a hand over Amy’s mouth - Meg takes Beth’s arm", "and leads her to where the old piano used to stand, and in", "its place, a beautiful little piano forte.", "Look!", "“Humble servant” /how lovely!", "They are so absorbed in the piano, that they almost don’t", "notice that Beth has gotten up and walked straight over to", "the Laurence’s house.", "EXT./INT. LAURENCE HOUSE. MR. LAURENCE’S OFFICE. DAY. 1862.", "Timid Beth walks straight up to the house and then to Mr.", "Laurence’s office and tries to speak:", "But words are lost, and she throws her arms around him. He", "accepts the hug like he’s been waiting for it his whole life.", "While he’s hugging her, he notices that she’s hot and", "flushed.", "INT. OUTSIDE BETH’S ROOM. DAY. 1862.", "Beth, in her bed, is delirious with fever. A doctor looks her", "over, then consults with the girls and Hannah.", "I’ll see if Aunt March can", "/take her.", "THE PRESENT. EXT. SEASHORE. DAY. 1869.", "Jo reads a story for Beth that she’s written herself, for", "Beth, finishing the last lines.", "She puts down the story, looking shyly at Beth, who beams:", "It is said quickly, almost casually, but it lands like it was", "meant to.", "I have to tell /you.", "THE PAST. INT. BETH’S ROOM. LATE AT NIGHT. 1862.", "Jo, sitting vigil, puts cold towels on Beth’s hot forehead.", "INT. AUNT MARCH’S HOUSE. DAY.", "Amy is working very diligently on her French and her painting", "- Aunt March notices the quiet little girl, and admires her:", "Amy sits down next to Aunt March.", "Amy looks serious -- Aunt March releases her.", "Amy stands up and walks out of the one room in the past, to", "another room in the present...", "THE PRESENT. INT. FRANCE. RENTED APARTMENTS. DAY. 1869.", "...Amy rushes in, excited, to Aunt March taking her tea:", "Amy sits down without intending to.", "We briefly flash to...", "A country scene in the Paris exurbs. From a distance, we see", "Fred and Amy walking. Suddenly, Fred drops to one knee,", "offers Amy his hand, and she drops it", "...Back to Aunt March.", "INT. MARCH HOUSE. BETH’S ROOM. DAY. 1869.", "Meg is watching over Beth, who is getting weaker by the day.", "Jo comes up with a bowl of soup, and touches Meg on the", "shoulder, relieving her.", "Jo cocks her head towards the window, John is standing", "outside.", "EXT. MARCH HOUSE. GARDEN. DAY. 1869.", "Meg and John are talking, tentative after their quarrel.", "I’ll come home to help with", "the children, I’m sorry, I’m", "just so worried /for Beth.", "But I /can’t --", "But /John, it’s --", "Meg kisses him, spontaneously, just like years earlier.", "INT. MARCH HOUSE. BETH’S ROOM. DAY. 1869.", "From the window, Jo watches the loving scene - feeling happy", "for her sister and also a pang of loneliness.", "Suddenly, a crash - the soup bowl clatters to the floor.", "Beth’s fever is high and she knocked everything off the bed -", "Jo flies to her side, feeling her forehead, calling.", "THE PAST. INT. BETH’S ROOM. DAY. 1862.", "Just as in the present, Beth has gotten worse.", "THE PRESENT. INT. BETH’S ROOM. EVENING. 1869.", "Jo lays in bed with Beth.", "THE PAST. INT. BETH’S ROOM. EVENING. 1862.", "Marmee enters with Laurie and goes straight to Beth. She’s", "gone from a sick husband to a sick daughter, but she brings", "cheerful efficiency to a terrifying situation.", "Meg smiles to herself, which her Mother notices.", "Marmee attends to Beth while the girls help her.", "THE PRESENT. INT. BETH’S ROOM. NIGHT. 1869.", "Meg and Jo and Marmee take turns in shifts, making sure that", "Beth is as comfortable as she can be. When it is Jo’s turn,", "Beth is very weak, barely able to hold her head up.", "Jo is sitting watch, and drops off to sleep, her head on the", "bed, her hand grasping Beth’s. Beth opens her eyes and looks", "down at Jo and smiles. She closes her eyes again and drifts", "away.", "THE PAST. INT. BETH’S ROOM. EVENING. 1862.", "Jo jerks suddenly awake - she doesn’t see Beth in the bed.", "She rises, and with growing panic - screams.", "She rushes downstairs to find Beth sitting up with her Mother", "and Hannah eating. She cries with joy, and kisses Beth’s", "head.", "INT. MARCH HOUSE. LIVING ROOM. AFTEROON. 1862.", "It is Christmas time again. Amy, standing on a chair,", "supervises all the decorations. Mr. Laurence and Marmee sit", "by the fire, and Beth on the couch with her doll. Jo runs", "around with Hannah setting the table for their feast.", "At just that moment, Laurie pops his head in and with wild", "excitement in his eyes, announces:", "The door swings open, and it’s Father, supported by Mr.", "Brooke. Mayhem breaks out - Beth starts crying, Amy falls off", "a chair, Marmee gasps, Jo drops a dish, and Meg (again)", "spontaneously kisses Mr. Brooke. All the girls run to him,", "surrounding him in a hug.", "He looks over them to Marmee - who is gazing back at him with", "love. She wasn’t sure that this moment would come for her,", "and she can hardly believe she has her family together. He", "steps out of his daughters’ hug to embrace his wife.", "He laughs, and brushes her tears away. It is romance, but the", "real kind.", "LATER: It is Christmas dinner, with everyone, including the", "Laurences and Mr. Brooke, gathered around the table - it is", "the finest day any one of them has ever had, and the joy", "radiates across the chilly Christmas night.", "THE PRESENT. INT. BETH’S ROOM. MORNING. 1869.", "Jo jerks awake to find Beth gone - she goes downstairs and", "sees Marmee there. Jo looks at Marmee, and her mother, for", "the first time in Jo’s life, breaks. Jo becomes the parent at", "that moment, comforting her mother, who is trapped in the", "unimaginable pain of losing a child.", "EXT. GRAVEYARD. DAY. 1869.", "The March family: Mother and Father and Jo, Meg and John with", "their arms around each other, and Hannah. They have all", "gathered to lay their Beth to rest on an impossibly beautiful", "day.", "The party walks away, each with their own pain. Jo stays,", "unable to leave Beth’s side, even in death.", "Meg makes to go approach her - but John pulls Meg closer.", "Meg nods - and she is grateful to him, grateful that she", "married this man who can be there for her.", "Jo cries, alone. She cannot comprehend how the world keeps", "spinning when her Beth is gone. We go from the emptiness of", "the grief to...", "THE PAST. EXT./INT. MARCH HOUSE. MEG & JO’S ROOM. SPRING.", "DAY. 1865.", "...a beautiful day, full of flowers and sunlight. Outside,", "Beth and Amy are arranging decorations and laughing.", "Inside, Meg prepares for her wedding with Jo helping her,", "placing flowers in her sister’s hair.", "Jo suddenly kneels before her, wild and desperate:", "But, Jo..", "Jo sits back, heartbroken.", "EXT. MARCH HOUSE. GARDEN. DAY. 1865.", "Meg and Mr. Brooke are married, with Mr. March officiating.", "During the simple and emotional ceremony, Amy and Jo catch", "each others eye - they simultaneously realize that they are", "the only two left standing.", "Later, during the picnic reception:", "- Marmee and Hannah deliver cakes and pastries and food", "galore.", "- Laurie dances with Beth, whirling her around, and making", "her laugh. Jo watches adoringly: the two halves of her heart.", "- Meg, both bride and host, makes sure everyone is cared for.", "- Laurie and Jo taste the alcohol and decide it’s terrible.", "- Meg dances with John, Marmee dances with Mr. Laurence, Jo", "tries to play the fiddle - then Marmee dances with Father, Jo", "and Meg dance, John and Amy dance, Hannah dances with Father.", "The point is, everyone dances with everyone and...", "- Mr. Laurence offers to dance with Aunt March, but she turns", "him down. Then Laurie also approaches her. Aunt March feigns", "even MORE hatred, to cover her epic delight.", "- There is more eating and dancing until the sun starts to", "set. As Aunt March moves to make her departure, she speaks to", "Meg, who stands with John, Marmee and Father March.", "Despite her meanness, the March family is so happy, that they", "burst out laughing at Aunt March’s rudeness.", "Meg and John retreat and laugh and kiss. Nothing can pierce", "their happiness.", "Amy takes over from Marmee, Aunt March gratefully accepting", "her hand.", "Amy leads her away, and Marmee lets them go. Amy gets Aunt", "March into a carriage and then lets out a cry of joy. She", "runs to Marmee, who is now standing with Jo:", "Marmee! Marmee! Aunt March is", "going to Europe /and", "Jo throws her arms around Amy, delighted.", "Marmee takes Jo’s hand, knowing how this hurt her. Jo smiles", "through her pain for Meg’s day, but it is a true blow.", "INT. MEG’S HOUSE. DAY. 1865.", "John and Meg enter their small but lovely newlywed home. He", "embraces her and kisses her - she’s never been happier.", "EXT. WOODS. DAY. CONTINUOUS. 1866.", "Laurie and Jo walk through the woods together, as they’ve", "done for years.", "He looks at her, and inhales, about to talk. Jo sees his face", "and immediately knows what is about to happen.", "No, no, /we don’t...", "I wanted to save you from", "this, I thought /you’d", "understand.", "Laurie backs away from her like she hit him.", "He straightens up and walks away. Jo cries and cries. Her", "heart is breaking, even though she is the one who broke it.", "THE PRESENT. INT. MARCH HOUSE. ATTIC. DAY. 1869.", "Jo is putting away Beth’s things, and arranging her little", "dolls and toys. Everyone is gone. Meg left by marriage, Amy", "left by a voyage to Europe, Laurie left because she rejected", "him and Beth was taken from this life. She places sheet music", "of Beth’s into a trunk, the hurt in her heart almost", "unbearable.", "They sit beside each other, both missing Beth.", "Jo stands and paces, anxiously.", "EXT. PARIS. FRANCE. DAY. 1869.", "Amy, dressed in black, is waiting with all her luggage - she", "is in mourning. A carriage approaches and Laurie gets out. He", "tentatively walks to Amy.", "She embraces him, weeping.", "Laurie is quiet, letting her cry. She pulls back.", "Laurie studies her face, and we know that he sees her and", "loves her.", "Laurie catches her face with his hands, and kisses her. She", "looks at him and kisses him back. They embrace with both", "their joy and their grief. This is the way it was meant. It", "is done.", "INT. MARCH HOUSE ATTIC. DAY. 1869.", "Jo infused with a new kind of energy, writes to Laurie. We", "hear snippets of the letter.", "EXT. MARCH HOUSE. DAY. 1869.", "In the forest, Jo finds the mailbox.", "She opens it and places the letter inside, she looks at it,", "satisfied. She closes the mailbox back up again.", "THE PAST. EXT. STREETS OF NEW YORK CITY. DAY. 1867.", "Jo tries to find her way through the unfamiliar city - she", "isn’t an expert at it quite yet. She walks too slowly, stares", "too long, and gets hopelessly lost - but a spark of happiness", "is growing, she’s figuring out how to be what Aunt March said", "was impossible - a woman making her own way in the world.", "She walks up the stairs to the boarding house and as she", "ascends the stairs and the doors open, we hear:", "THE PRESENT. INT./EXT. MARCH HOUSE. LIVING ROOM. DAY. 1869.", "Jo, asleep on the couch, is gently shaken awake. She sees:", "Jo embraces him and looks at him and holds him for too long.", "Laurie breaks their embrace.", "They take a moment, not sure what to do. They aren’t in their", "youth any longer, they aren’t sure how to relate to each", "other.", "?!?!?!", "Jo sits. She’s hit hard.", "Though it takes a supreme effort, she says:", "At that moment, everyone comes bursting through the door.", "Mother and Father and Amy and John and Meg and Daisy and Demi", "- Amy goes straight to Jo. Jo fixes her face and decides she", "will be the person she wishes she was:", "Amy looks at her expectantly. Jo has a moment of wanting to", "strike her, the way she did when they were children, but", "checks herself, and tries to be what Beth would want:", "Amy sighs, her anxiety lifts:", "They embrace. Over her shoulder she catches her mother’s eye,", "who gives her a look of infinite empathy.", "Then Laurie calls for his wife. Jo straightens up and sees", "these couples - Mother & Father, John & Meg, Laurie & Amy.", "It all hits her with a heat and a mass that she was", "unprepared for. She hastily excuses herself and goes outside.", "EXT. MARCH HOUSE. DAY. 1869.", "Weeping, but also in a panic, Jo removes the letter from the", "mailbox and walks into the woods.", "EXT. WOODS. DAY. 1869.", "She tears through the woods and finally stands by the river,", "breathing heavily. For one moment, we believe that she might", "end her suffering in the most tragic way - she leans towards", "the river", "...and throws the letter into it, letting it drift away,", "along with her childhood love. It is over.", "EXT. MARCH HOUSE. DAY. 1869.", "Jo trudges back, and is surprised to find Mr. Laurence", "standing alone, looking at the March’s house.", "They embrace - and then Mr. Laurence tries to explain:", "He begins crying. Jo takes his arm tenderly.", "He gratefully accepts her help and they approach the house", "together, an odd, sweet pair of friends.", "INT. MARCH HOUSE. JO & MEG’S ROOM/ATTIC. NIGHT/DAY. 1869.", "Jo starts awake - she looks around the room: she’s all alone,", "everyone is truly gone. She lights a candle. She goes to the", "drawer where she keeps her writing, and pulls out the stack.", "She feeds a published story into the fire. Then she burns", "more stories, printed, unpublished, half-finished, she burns", "them all. It is a potlatch, a total burning down of", "everything she has made up until this point.", "She finds one last piece, and is about to give it over to the", "fire, when she reads on top: “For Beth.” She stops.", "Jo makes her way up to the attic, and sits in her old writing", "chair, looking at the story. She takes a fresh sheet of paper", "and starts writing.", "She writes all night, and into the next day, piling up page", "after page. She spreads them out in the attic, like a quilt,", "building outwards. Candles are lit and re-lit, the sun rises", "and sets.", "Marmee brings her some food and then leaves her alone.", "Jo nods off for a second then keeps writing. She revises, she", "scratches out, she changes orders. She falls asleep on her", "blanket of papers.", "She’s re-connected with her childhood, and out of the depths", "of despair has found hope and inspiration.", "Jo finishes and carefully ties up the first few chapters of", "this experiment and writes a letter to Mr. Dashwood:", "INT. AUNT MARCH’S HOUSE. DAY. 1869.", "The empty rooms of Aunt March’s house -- nothing is left of", "the deliciously cranky old lady. Furniture is covered over,", "and the loss is felt in the grand rooms. Amy, Jo and Meg walk", "around the big empty mansion.", "Jo laughs.", "Meg looks satisfied, and we know that she is, deeply.", "Suddenly, Jo lets out a WHOOP and runs through the house.", "For heaven’s /sake!", "/Girls!", "Jo thinks for half a second, but she already knows:", "Amy takes her sister’s arm on one side, while Meg is on the", "other side. They walk and talk confidentially.", "What /about it?", "So?", "They lean their heads together and stroll through the house.", "INT. NEW YORK PUBLISHING OFFICE. DAY. 1869.", "Mr. Dashwood sits, reading the pages that Jo gave him. He", "finishes and then writes to her.", "INT. MARCH HOUSE. ATTIC./DINING ROOM. EARLY EVENING. 1869.", "Jo reads the note Mr. Dashwood sent:", "And she crumples it up. Just then, Marmee breaks her reverie.", "Jo stashes her writing and clomps down the stairs and heads", "straight for the table, not even looking around her. She sits", "down and grabs a piece of bread and takes a big bite.", "Jo hears his voice and bolts up.", "THE PAST. EXT. BOARDING HOUSE. NEW YORK. DAY. 1867.", "Jo, with all of her luggage, finds the address and rings the", "doorbell. Friedrich opens it, he smiles down at this young", "woman, with his handsome face and merry eyes -- she comes", "undone before even knowing it.", "Just then, Mrs. Kirke pushes past him, with her two children.", "She leads Jo up through the stairs and Jo takes a quick", "glance backwards at Friedrich, as if to confirm that the man", "she saw was real and not an apparition. She finds Friedrich", "looking back up at her. She turns away again.", "BACK TO THE PRESENT. 1869.", "Later:", "Everyone is talking. Father and Friedrich especially talk", "philosophy and religion and politics. Father obviously very", "much likes him. Jo is glowing with happiness.", "Amy looks from Friedrich to Jo and from Jo to Friedrich. She", "can see that there is love between them.", "Jo has an unconscious sharp intake of breath. No one notices", "but Amy. Father continues oblivious:", "Everyone bursts out laughing. Father laughs at himself good-", "naturedly.", "INT. MARCH HOUSE. LIVING ROOM. DAY. 1869.", "Everyone relaxes after dinner, and Friedrich eyes the piano:", "They all fall quiet.", "He sits down and plays Bach - it is beautiful and elegant. Jo", "watches him, moved and deeply happy.", "The sound of his music plays over Friedrich saying his", "goodbyes and telling Jo, as he stands at the door:", "It has started to rain, and he puts up his umbrella and", "trudges into the evening.", "The door closes. Jo turns back around to find everyone", "staring at her.", "Amy has started ascending the stairs.", "INT. NEW YORK APARTMENT. NIGHT. 1869.", "It is also raining in New York. Mr. Dashwood is in his cozy", "apartment, eating dinner with his wife. She tries to start a", "fight.", "He hears his daughter’s laughter and talking in the next", "room.", "The girls tumble into the room, speaking over each other.", "Father are you publishing/", "this?", "Close on Mr. Dashwood as he realizes what he has, what this", "story could be, this story that he, and the author, both", "thought was boring...", "INT/EXT. CARRIAGE./TRAIN STATION. NIGHT. 1869.", "Meg, Amy, and Jo are all in the carriage, making top speed", "through the rain. They arrive at the train station.", "Jo runs in the rain towards the beautifully lit station and", "the music swells and the thunder claps and we CUT TO:", "INT. PUBLISHING HOUSE. NEW YORK CITY. DAY. 1870.", "Jo sits where she originally sat across from Dashwood, but", "now she is more grown up, more together, more herself -", "Jo thinks. Dashwood pounces.", "Jo shifts. She considers.", "THE PRESENT IS NOW THE PAST. OR MAYBE FICTION. EXT. TRAIN.", "EVENING. 1869.", "Jo runs from the carriage, out into the rain and into the", "crowd in front of the train station, looking for Friedrich.", "He’s not there, every face isn’t his. Couple after couple", "stands under umbrellas. She runs into the station, and then", "turns around to go back out -- has she missed him?", "Just then:", "Jo sees Friedrich, also standing under an umbrella, but", "alone. She runs towards him. She feels her emotions rising,", "she starts to cry, despite herself.", "They kiss one of those epic perfect kisses. The train", "arrives, and he doesn’t get on it. BAM.", "THE PRESENT. INT. PUBLISHING HOUSE. NEW YORK CITY. DAY. 1870.", "Back to negotiations.", "He gets a little teary.", "An intense moment between them. Her book hangs in the", "balance. She leans forward, resolute.", "We fade down on this scene, and fade up on:", "FICTION(?) INT./EXT. PLUMFIELD ACADEMY. DAY. 1871.", "Jo is supervising a great number of rambunctious girls and", "boys of all races and ages. They are finishing lessons for", "the day, and everyone runs outside at full speed.", "Jo makes her way down the stairs and is handed a homemade", "cake by one of the children. She kisses him on the head and", "continues through what she’s built. Every inch of the school", "is covered with the students’ work, all of the former", "stuffiness is gone. She’s in her heaven.", "INT. PRINTING HOUSE. DAY. 1871.", "Jo, captivated, watches type being set, each letter put into", "place, and one page after another pressed with her novel.", "FICTION(?) INT./EXT. PLUMFIELD ACADEMY. DAY. 1871.", "Jo walks past Friedrich’s classroom, all the students with", "their violins learning from him how to play. They smile at", "each other and she continues out.", "INT. PRINTING HOUSE. DAY. 1871.", "Each page is stacked one on top of the other and the massive", "industrial sewing machine stitches the pages together as Jo", "observes.", "FICTION(?) EXT. PLUMFIELD ACADEMY. DAY. 1871.", "Jo walks past Laurie giving a fencing lesson (while also", "holding his baby), Amy conducting a painting lesson, Meg", "supervising children in a play rehearsal, John Brooke (his", "own children next to him) leading a botany lesson... they all", "join Jo as she troupes down the lawn.", "INT. PRINTING HOUSE. DAY. 1871.", "The excesses of each page are sliced off, making a satisfying", "sound, and making Jo jump and laugh at her jumpiness.", "FICTION(?) EXT. PLUMFIELD ACADEMY. DAY. 1871.", "Leading a procession of children and family behind her, and", "holding the cake, Jo and the group arrive upon Father,", "teaching the very young children the alphabet by having their", "bodies form the letters, and also Marmee, who is having each", "child read aloud in their best dramatic reading voice.", "INT. PUBLISHING HOUSE. DAY. 1871.", "The hard cover of the book is placed over the pages, the glue", "to hold it in place is so strong-smelling as to make Jo", "dizzy.", "FICTION(?) EXT. PLUMFIELD ACADEMY. DAY. 1871.", "Jo presents her mother with the cake, and all of them, Amy,", "Meg, Jo, Laurie, John, Friedrich, Father, and the children,", "wish her a happy birthday. Jo looks around at the group, so", "happy she was able to be alive with them, so amazed.", "INT. PUBLISHING HOUSE. DAY. 1871.", "A man finishes the book, and unceremoniously hands it to Jo", "and gets to work on the next one.", "THE PAST, OR MAYBE FICTION, OR MAYBE BOTH. 1850S.", "Beth, Meg, Amy and Jo are very young girls,  playing in their", "attic, together again, if only in memory, or in the book.", "INT. PUBLISHING HOUSE. DAY. 1871.", "Jo turns it over in her hands, touching it like the holy", "object it is, her inchoate desire made manifest.", "Jo looks up ...", "and sees the future -", "CUT TO BLACK.", "Credits."]}