{"scenarios": ["EXT. STREET - DAY", "Mix through to William, 35, relaxed, pleasant, informal.", "We follow him as he walks down Portobello Road, carrying a", "load of bread.  It is spring.", "EXT. PORTOBELLO ROAD - DAY", "It's a full fruit market day.", "EXT. PORTOBELLO ROAD - DAY", "A man in denims exits the tattoo studio.", "EXT. PORTOBELLO ROAD - DAY", "Sure enough, a girl exits with a huge threaded blue", "bouffant.", "EXT. PORTOBELLO ROAD - SATURDAY", "A frantic crowded Portobello market.", "The camera finally settles on a stall selling beautiful", "stained glass windows of various sizes, some featuring", "biblical scenes and saints.", "EXT. GOLBORNE ROAD - DAY", "Shot of Tony proudly setting out a board outside his", "restaurant, the sign still being painted.  He receives and", "approves a huge fresh salmon.", "EXT. PORTOBELLO ROAD - DAY", "We arrive outside his blue-doored house just off Portobello.", "INT. WILLIAM'S HOUSE - DAY", "The house has far too many things in it.  Definitely two-", "bachelor flat.", "Spike appears.  An unusual looking fellow.  He has unusual", "hairs, unusual facial hair and an unusual Welsh accent:", "very white, as though his flesh has never seen the sun.  He", "wears only shorts.", "The t-shirt is white with a horrible looking plastic alien", "coming out of it, jaws open, blood everywhere.  It says 'I", "Love Blood.'", "He heads back up the stairs... talks as he changes...", "And he re-enters in a white t-shirt, with a large arrow,", "pointing down to his flies, saying, \"Get It Here.'", "He comes down wearing it.  Lots of hearts, saying, 'You're", "the most beautiful woman in the world.'", "Spike turns and walks upstairs.  Revealing that on the back", "of the t-shirt, also printed in big letters, is written", "'Fancy a fuck?'", "EXT. PORTOBELLO ROAD - DAY", "A small unpretentious store... named 'The Travel Book Co.'", "William enters.", "INT. THE BOOKSHOP - DAY", "It is a small shop, slightly chaotic, bookshelves", "everywhere, with little secret bits round corners with even", "more books. Martin, William's sole employee, is waiting", "enthusiastically. He is keen, an uncrushable optimist.", "Perhaps without cause. A few seconds later, William stands", "gloomily behind the desk.", "He salutes and bolts out of the door -- as he does, a woman", "walks in. We only just glimpse her.", "Cut to William working.  He looks up casually.  And sees", "something.  His reaction is hard to read.  After a pause...", "It is Anna Scott, the biggest movie star in the world --", "here --in his shop.  The most divine, subtle, beautiful", "woman on earth. When she speaks she is very self-assured", "and self-contained.", "She wanders over to a shelf as he watches her -- and picks", "out a quite smart coffee table book.", "He picks up a book on the counter.", "William suddenly spies something odd on the small TV", "monitor behind him.", "Her eyes follow him as he moves toward the back of the shop", "and approaches a man in slightly ill-fitting clothes.", "He returns to his desk.  In the monitor we just glimpse, as", "does William, the book coming out of the trousers and put", "back on the shelves.  The thief drifts out toward the door.", "Anna, who has observed all this, is looking at a blue book", "on the counter.", "She smiles.  Suddenly the thief is there.", "She signs his scruffy piece of paper.  He tries to read it.", "Thief leaves.", "She hands William a note and the book he said was rubbish.", "He talks as he handles the transaction.", "He drops in one of the signed books.", "She looks at him with a slight smile.", "And leaves.  She's out of his life forever.  William is a", "little dazed.  Seconds later Martin comes back in.", "But William's innate natural English discretion takes over.", "They set about drinking their coffee.", "Martin shakes his head.  William drinks his cappuccino.", "EXT. PORTOBELLO ROAD - DAY", "William sets off.", "INT. COFFEE SHOP - DAY", "William collects his juice in a coffee shop on Wesbourne", "Park Road.", "EXT. PORTOBELLO ROAD - DAY", "William swings out of the little shop -- he turns the", "corner of Portobello Road and bumps straight into Anna.", "The orange juice, in its foam cup, flies.  It soaks Anna.", "He grabs some paper napkins and starts to clean it off --", "getting far too near her breasts in the panic of it...", "He jumps back.", "In his diffident ways, he is confident, despite her being", "genuinely annoyed.  She turns and looks at him.", "He doesn't lie -- it is eighteen yards away.  She looks", "down. She looks up at him.", "INT. WILLIAM'S HOUSE - CORRIDOR - DAY", "They enter.  She carries a few stylish bags.", "William runs in further -- it's a mess.  He kicks some old", "shoes under the stairs, bins an unfinished pizza and hides", "a plate of breakfast in a cupboard.  She enters the kitchen.", "And he guides her up the stairs, after taking the bag of", "books from her...", "She heads upstairs.", "INT. KITCHEN - DAY", "William is tidying up frantically.  Then he hears Anna's", "feet on the stairs.  She walks down, wearing a short,", "sparkling black top beneath her leather jacket.  With her", "trainers still on.  He is dazzled by the sight of her.", "He moves to his very empty fridge -- and offers its only", "contents.", "Pause.  She looks at him deep.", "It has taken a lot to get this out loud.  He is not a", "smooth-talking man.", "She smiles.  She's cool.", "He guides her toward the door.", "In a slightly awkward moment, he shows her out the door.", "He closes the door and shakes his head in wonder.  Then...", "... He shakes his head again in horror and wanders back", "along the corridor in silence.  There's a knock on the", "door.  He moves back, casually...", "He opens the door.  It's her.", "He shoots into the kitchen and picks up the forgotten", "shopping bag.  Then returns and hands it to her.", "They stand in that corridor -- in that small space.  Second", "time saying goodbye.  A strange feeling of intimacy.  She", "leans forward and she kisses him.  Total silence.  A real", "sense of the strangers of those lips, those famous lips on", "his.  They part.", "Suddenly there is a clicking of a key in the lock.", "Spike walks in.", "Spike walks past unsuspiciously and heads into the kitchen.", "And leaves them in the corridor.", "And she leaves, with just a touch of William's hand.  Spike", "comes out of the kitchen, eating something white out of a", "styrofoam container with a spoon.", "INT. WILLIAM'S LIVING ROOM - NIGHT", "The lights are off.  William and Spike on the couch, just", "the light from the TV playing on their faces.  Cut to the", "TV full screen.  There is Anna.  She is in a stylish Woody", "Allen type modern romantic comedy, \"Gramercy Park,\" in", "black and white.", "INT. MANHATTAN ART GALLERY - DAY", "Anna's character -- Woody Anna -- is walking around the", "gallery with her famous co-star, Michael.  They should be", "the perfect couple, but there is tension.  Anna is not", "happy.", "And after a couple of seconds -- wow -- she smiles.", "INT. WILLIAM'S LIVING ROOM - NIGHT", "INT. BOOKSTORE - DAY", "The next day.  William and Martin quietly co-existing.  An", "annoying customer enters.  Mr. Smith.", "Pause.", "William looks up.  At that moment the entire window is", "suddenly taken up by the huge side of a bus, obscuring the", "light -- and entirely covered with a portrait of Anna --", "from her new film, \"Helix.\"", "INT. WILLIAM'S HOUSE - CONDOR/LIVING ROOM - DAY", "William heads upstairs and pauses.  Spike coming down,", "wearing full body scuba diving gear.", "INT. WILLIAM'S KITCHEN - DAY", "The two of them fixing a cup of tea in the kitchen.", "EXT. WILLIAM'S TERRACE - DAY", "The two of them on the rooftop terrace, passing the day.", "William is reading 'The bookseller.'  The terrace is small", "and the plants aren't great -- but it overlooks London in", "a rather wonderful way.  Spike still in scuba gear, goggles", "on.", "William closes his eyes in exasperation.", "Spike looks back and relaxes.", "William freezes -- then looks at Spike.", "INT. WILLIAM'S LIVING ROOM - DAY", "William on the phone.  We hear the formal man at the other", "end of the phone.  And then intercut with him.", "INT. RITZ RECEPTION - DAY", "INT. WILLIAM'S LIVING ROOM", "Spike happens to be in the foreground of this shot.  He's", "reading a newspaper.", "Flinstone is indeed the magic word.", "He practices how to sound.", "We hear her voice -- don't see her.", "EXT. RITZ - DAY", "William jumps off a bus and walks toward the Ritz.  He", "carries a small bunch of roses.", "INT. RITZ HOTEL - DAY", "He approaches the lifts.  At the lift, he pushes the button", "and the doors open.  As he is getting in, William is", "jointed by a young man.  His name is Tarquin.", "William pushes the button.  They wait for the doors to", "close.", "INT. RITZ CORRIDOR - DAY", "The lift lands.  William gets out.  So does Tarquin.  Rooms", "30-35 are to the left.", "right. So does Tarquin.", "William is puzzled.  He slows down as he approaches room", "38.  So does Tarquin.  William spots, so does Tarquin.", "William points at the number.", "He knocks.  A bright, well-tailored American girl opens the", "door.", "She hands them a very slick, expensively produced press", "kits, with the poster picture of Anna, for the film 'Helix.'", "INT. THE TRAFALGAR SUITE ANTE-ROOM - DAY", "A few seconds later -- they enter the main waiting room.", "There are a number of journalists waiting for their", "audience.", "They both turn to William for his opinion.", "They sit down as Karen goes off.", "William goes for the cover-up.", "Pause.  He's in trouble.", "Saved by the bell.", "INT. TRAFALGAR SUIT CORRIDOR - DAY", "He is shown in through big golden doors.  Karen stays", "outside.", "INT. THE TRAFALGAR SUITE SITTING ROOM - DAY", "There Anna is, framed in the window.  Glorious.", "There are lots of other flowers in the room.", "A fair amount of tension.  These two people hardly know", "each other -- and the first and last time they met, they", "kissed.", "At which moment Jeremy, Karen's boss, comes in.  A fairly", "grave, authoritative fifty-year-old PR man consulting a", "list.", "William nods.", "William shrugs his shoulders.  Jeremy settles at a little", "desk in the corner and makes notes.  A pause.  William", "feels he has to act the part.  They sit in chairs opposite", "each other.", "Anna nods.", "Jeremy leaves.", "William puts his head in his hands.  He was panic.", "Re-enter Jeremy.", "Jeremy exits.", "It's a challenge.", "Pause.  Then they move towards each other when... Jeremy", "enters.", "Jeremy goes out -- it's their last seconds.", "They look at each other.  Jeremy enters, with another", "journalists in row.  Anna and William stand and shake hands", "formally.", "INT. TRAFALGAR SUITE CORRIDOR - DAY", "William exits fairly despondent and heads for the door.", "Tarquin is in the corridor calling on his mobile phone.", "William can't think his way out of this.", "He turns to go, but is accosted by Karen.", "INT. RITZ INTERVIEW ROOM - DAY", "A forty-year-old actor with great presence warmly shakes", "William's hand.", "INT. RITZ INTERVIEW ROOM - DAY", "Same room same seat, minutes later, with a monolingual", "foreign actor and an interpreter.", "INT. RITZ INTERVIEW ROOM - DAY", "And now William is sitting opposite an eleven-year-old", "American girl.", "INT. RITZ CORRIDOR - DAY", "William emerges traumatized into the corridor.  It is full", "of camera crews.  And there is Karen.", "INT. ANNA'S SUITE SITTING ROOM - DAY", "They knock on her door.", "William enters.  A certain nervousness.  They are alone", "again.", "INT. MAX AND BELLA'S KITCHEN/LIVING ROOM - NIGHT", "Bella and Max are in the kitchen.", "The oven seems to be smoking a little.  Then the bell rings.", "It's hard timing.  Max shoots out of the kitchen.", "INT. MAX AND BELLA'S CORRIDOR - NIGHT", "Max heads for the door impatiently.  He opens it and turns", "back without looking at William and Anna standing there.", "William and Anna move along the corridor to the kitchen.", "INT. MAX AND BELLA'S KITCHEN/LIVING ROOM - NIGHT", "Bella is there.", "He rises from his stove position.", "Door bell goes.", "INT. MAX AND BELLA'S CORRIDOR - NIGHT", "Max opens the door -- it is Honey.", "She does a little pose, having worn a real party dress.", "They head back along the corridor.", "INT. MAX AND BELLA'S KITCHEN/LIVING ROOM - NIGHT", "They enter the kitchen.", "She hands her a present.", "The front door bell goes.", "He heads out into the corridor to the front door.", "INT. MAX AND BELLA'S CORRIDOR - NIGHT", "Max opens the door.", "INT. MAX AND BELLA'S KITCHEN/LIVING ROOM - NIGHT", "They enter the room.", "Doesn't recognize her -- turns to Honey.", "INT. MAX AND BELLA'S KITCHEN/LIVING ROOM - NIGHT", "A minute or two later -- they are standing, drinking wine", "before dinner.  Bernie with Anna on their own -- William", "helping Max in the kitchen.", "Then on to Bernie's conversation.", "They all move towards the kitchen.", "A moment's silence as they leave -- then in a split second", "the others all turn to William.", "The horror of his remembered conversation slowly unfolds.", "Honey re-enters.", "INT. MAX AND BELLA'S CONSERVATORY - NIGHT", "A little later.  They are sat at dinner.  Bella next to", "Anna.", "INT. MAX AND BELLA'S CONSERVATORY - NIGHT", "Moving through the evening -- they are very relaxed, as", "they eat dinner.  A few seconds watching the evening going", "well -- Anna is taking this in -- real friends --", "relaxed -- easy, teasing. And there's a cake.  Honey wears", "Bernie's unsuitable hat.  Anna watches William laughing at", "something and then putting his head in his hands with mock", "shame.", "INT. MAX AND BELLA'S CONSERVATORY - NIGHT", "Coffee time.", "A little pause.  Then William turns to Bernie.", "Dead silence.", "Bella shrugs her shoulders.  Bernie is totally grief-struck.", "William reaches for her hand.  Max breaks the sombre mood.", "They all laugh.  Anna smiles across at William.", "While she says this, quiet settles around the table.  The", "thing is -- she sort of means it and is opening up to them.", "Silence... they all look at her... then.", "The mood is instantly broken.  They all laugh.", "INT. MAX AND BELLA'S KITCHEN/LIVING ROOM/CORRIDOR - NIGHT", "Anna and William are leaving.", "He holds out his hand to shake.  She kisses him on the", "cheek. He stumbles back with joy.", "Max loves this.", "And Honey gives her a huge hug.", "Anna and William head out... Bernie tries to save some", "dignity.", "They move to the door and wave goodbye.", "EXT. MAX AND BELLA'S HOUSE - NIGHT", "William and Anna step outside.  From inside they hear a", "massive and hysterical scream of the friends letting out", "their true feelings.  William is a little embarrassed.", "The house is in Lansdowne Road, on the edge of Notting", "Hill. They walk for a moment.  A bit of silence.", "They walk in silence for a moment.  Then...", "She smiles and shakes her head.", "EXT. NOTTING HILL GARDEN - NIGHT", "A little later in the walk.", "They are now walking by a five foot railing, with foliage", "behind it.", "Her look makes it clear that she is waiting with interest", "on the answer to this.", "He rattles the gate, then starts his climb -- but doesn't", "quite make it, and falls back onto the pavement...", "Tiny pause.", "He fails, and unfortunately spontaneously...", "They look at each other.", "She starts to climb.", "But she's already almost over.", "A few seconds later.  Anna jumps down into the garden.", "William clambers over with terrible difficulty, dusts", "himself off, and heads towards where she stands.", "She leans forward -- and, for the first time since the", "first time -- she kisses him.  This time a proper kiss.  A", "tiny pause.", "EXT. MAGIC GARDEN - NIGHT", "They walk around the garden.  It's a moonlit dream.  We see", "the lights of the houses that surround the garden.  They", "come across a single, simple wooden bench.", "We cut in and see an inscription carved into the wood.  She", "doesn't read the dates, carved below -- \"June Wetherby,", "1917 - 1992.\"  She is slightly chocked by it.", "He nods.  They are standing on either side of the bench,", "looking at each other.  The camera glides away from them,", "up into the night sky, leaving them alone in the garden.", "Music plays.", "INT. WILLIAM'S LIVING ROOM - EVENING", "William in a towel rushes downstairs, having just had a", "shower. He shoots past Spike.", "INT. WILLIAM'S LIVING ROOM/CORRIDOR - EVENING", "He sprints downstairs, now fully dressed.", "INT. CINEMA - NIGHT", "Mid-film.  We move across the audience.  And there is in", "the middle of it, we see Anna, watching the screen, and", "next to her, William, watching the film keenly, through his", "scuba-diving goggles.", "INT. RESTAURANT - NIGHT", "A very smart Japanese restaurant.  We see Anna and William", "sitting, near the end of their meal.", "We've been aware of the conversation at a nearby table --", "now we can hear it.  Two slightly rowdy men.", "William and Anna look at each other.", "Again -- Anna reacts.", "Anna mouths \"Meg Ryan.\"", "William and Anna smile -- they're enjoying it.", "Anna's twinkle fades.", "This is horrible.", "He gets up and goes round the cover to the men.  There are", "in fact four of them, the two meeker men, Gavin and Harry,", "hanging on the other guys' witty words.", "He's not a very convincing or frightening figure.", "Anna suddenly appears at his side and whips him away", "without being recognized.", "They walk on and then...", "And she walks straight back to their table.", "And she walks away.  Gerald turns to Lawrence.", "EXT. RITZ ARCADE - NIGHT", "They are walking.", "They have arrived at the end of the arcade.", "His look says yes.", "He watches her go -- and stands in the street.  Music plays.", "INT. RITZ CORRIDOR/ANNA'S SUITE - NIGHT", "William coming along the hotel corridor.  He knocks on the", "door.", "There's something slightly angry.  He doesn't notice.", "He kisses her gently on the cheek.", "He is duly shocked.  She's trying to be calm.", "Jeff drifts into view behind.  He is a very famous film", "star and looks the part -- well built, very handsome.", "Unshaved, he has magic charm, whatever he says.  Over a t-", "shirt, he wears a shirt, which he unbuttons as he talks.", "And he does just that.  Scoops up the two used plates and", "heads to the bin.", "Jeff slips him a fiver.", "He kisses her.", "He wanders off taking off his t-shirt.", "Anna just nods.", "INT. RITZ CORRIDOR - NIGHT", "William walks away.", "EXT. RITZ - NIGHT", "William walks down the arcade outside the hotel.  He is", "stunned.", "EXT. LONDON BUS - NIGHT", "William sits alone on a bus.  We see him through the side", "window.  As it drives away, we see that the whole back of", "the bus is taken up with a huge picture of Anna.", "INT. WILLIAM'S BEDROOM - NIGHT", "He gets into his room and sits on the bed.", "INT. SPACESHIP - NIGHT", "Space Anna, in the very hi-tech environment and a serious", "moods, fastens the last claps on her uniform.  She takes a", "helmet type thing, and places it on her head.", "INT. CONNECT CINEMA - NIGHT", "Cut round to the Coronet cinema where this film is showing.", "It's not full.  The camera moves and finds, sitting on his", "own...William.  Just watching.  We see a momentous flash of", "light from the screen explode, reflected in his eye.", "INT. WILLIAM'S LIVING ROOM - EVENING", "William is looking out the window, lost in thought.  Spike", "enters.", "Spike settles on the arm of a chair.  William decides to", "open up a bit...", "Spike nods thoughtfully.", "He roars with laughter.  William smiles.", "INT. TONY'S RESTAURANT - NIGHT", "Only two tables are being used.  William and his friends", "are on their first course.  Bernie reads an \"Evening", "Standard,\" with a picture of Anna and left at Heathrow", "Airport.", "Their looks make it obvious that everyone did.", "They all look to him for wise words.", "INT. MAX AND BELLA'S KITCHEN/LIVING ROOM - NIGHT", "The kitchen.  William is looking uneasy.  A doorbell rings.", "William nods.  Max heads off to the door.  We stay with", "William -- and just hear the door open and a voice come", "down the corridor.", "They reach the kitchen.  Tessa is a lush girl with a huge", "hair.", "She turns to take the wine and William has a split second", "to send a message of panic to Bella.  She agrees -- it's", "bad.", "INT. MAX AND BELLA'S KITCHEN/CONSERVATORY - NIGHT", "Max walks over to the table.  Honey, Bella, William and", "another girl.", "It is left to William, who has been set up here, to fill", "the pause.", "INT. MAX AND BELLA'S CONSERVATORY - NIGHT", "Time for coffee and chocolates.  Beside William sits the", "final, perfect girl.  She is Rosie, quite young, smartly", "dressed, open-hearted.  It is just Max and William and", "Bella and her.", "They all laugh.  It's going very well.", "INT. MAX AND BELLA'S CORRIDOR - NIGHT", "William is with Rosie by the door -- just about to say", "goodbye.", "She kisses him gently on the cheek.  He opens the door --", "she walks out.  He shuts the door quietly and heads back", "into the living room...", "INT. MAX AND BELLA'S LIVING ROOM - NIGHT", "Max and Bella wait excitedly.", "William makes a gentle, exasperated gesture, then...", "They all roar with laughter.", "Music starts to play to take us through these silent scenes.", "INT. MAX AND BELLA'S LIVING ROOM - NIGHT", "Max lifts Bella off her couch and carries her upstairs.", "Mix through -- William sits on the couch downstairs -- eyes", "wide open -- thinking.", "INT. MAX AND BELLA'S KITCHEN/LIVING ROOM - DAY", "Morning.  Max, all in his suit for the city... Bella kisses", "him goodbye.  William sees this from the kitchen.  She is", "also dressed for work -- and moves back into the kitchen to", "pack her briefcase with law books from the kitchen table.", "EXT. MAX AND BELLA'S HOUSE - DAY", "William emerges from the house, a little ruffled from a", "night away from home, a heads off.", "EXT. NEWSAGENT - DAY", "William walks past the newsagent, heading for home.  We", "see, though he doesn't, a rack of tabloid papers, all of", "which seem to have very grainy, grabbed pictures of Annie", "on their front page.  Headlines --'Annie Stunned'-- 'It's", "Definitely Her!' and 'Scott of Pantartica.'", "INT. WILLIAM'S BATHROOM - DAY", "William is shaving.  The bell goes.  He heads out to answer", "it.", "EXT./INT. WILLIAM'S HOUSE -DAY", "William arrives at the door and opens it.  There stands a", "dark-glassed Anna.", "She moves inside.  Her hair is a mess -- her eyes are", "tired. Nothing idealized.", "INT. LIVING ROOM - DAY", "The two of them.", "William shakes his head.", "She's very shaken.", "INT. WILLIAM'S CORRIDOR - DAY", "Spike enters through the front door.  William doesn't hear", "him. Spike is reading newspapers with the Anna pictures in", "it.", "He heads up the stairs.  Opens the bathroom door, walks in.", "INT. WILLIAM'S BATHROOM - DAY", "Spike heads for the toilet -- undoes his zip...", "She's in the bath.  Spike turns in shock -- and sidles out", "of the bathroom.", "INT. WILLIAM'S CORRIDOR - DAY", "Spike calms himself down.  He then opens the bathroom door", "again -- and looks in.", "INT. WILLIAM'S BATHROOM - DAY", "Anna is still lying low in the bath.", "INT. CORRIDOR - DAY", "Spike comes back out into the corridor.  Looks to heaven.", "INT. WILLIAM'S KITCHEN - DAY", "William and Anna at the kitchen table, eating toast.", "He doesn't think she has to talk about this.", "EXT. TERRACE - DAY", "A little later.  They're in the thick of the script.", "Annie smiles her biggest smile of the day.  He is helping.", "INT. WILLIAM'S DINING ROOM", "Anna and William.  Sat down at table.  There's a picture", "hanging on the wall behind.", "It is a picture of a Chagall painting of a floating wedding", "couple, with a goat as company.", "Spike enters with three pizzas.", "INT. WILLIAM'S LIVING ROOM - NIGHT", "Later in the evening.  William and Anna on their own.", "They're sipping coffee.  A few seconds of just co-existing.", "Anna looks up.", "He laughs.", "INT. WILLIAM'S LIVING ROOM - NIGHT", "A few hours later -- eating ice-cream out of the tub.", "INT. WILLIAM'S UPSTAIRS CORRIDOR - NIGHT", "They are walking up the stairs -- and stop at the top.", "Pause.  She leans forward, kisses him gently, then steps", "into the bedroom and closes the door.", "INT. WILLIAM'S LIVING ROOM - NIGHT", "William downstairs -- on a sofa -- under a duvet.  Eyes", "open. Thinking.  Pause and pause.", "He waits and waits -- the ultimate 'yearn.'  But nothing", "happens.  William gets off the sofa decisively.  Sits on", "the side of it.  Then gets back in again.", "Pause, pause, then... in the darkness, a stair creaks.", "There's someone there.", "He drifts round the corner, half-naked.", "Back to William thinking again.  Dreamy atmosphere.  And", "then... more footsteps on the stairs.", "The darkness of the living room.  We see Anna in the shadow.", "INT. WILLIAM'S LIVING ROOM - NIGHT", "A few moments later.  William and Anna stand in the middle", "of the room.  He kisses her neck.  Then her shoulder.  What", "a miracle it is just to be able to touch this girl's skin.", "Then he looks at her face.  That face.  He is suddenly", "struck by who it is.", "And kisses her.", "INT. WILLIAM'S BEDROOM - NIGHT", "The middle of the night.  They are both sleep -- a yard", "apart. In sleep, her arm reaches out, touches his shoulder", "and then she wriggles across and re-settles herself,", "tenderly, right next to him.  He is not asleep and knows", "how extraordinary this all is.", "INT. WILLIAM'S BEDROOM - DAY", "The morning.", "He looks under the sheet at her breasts.", "She laughs...", "She looks at him carefully.  Then leaps out of bed.", "INT. WILLIAM'S BEDROOM - MORNING", "William on the bed.  The door opens.  It is Anna with a", "tray of toast and tea.", "She bends across.  She smiles and sits on the bed.", "The doorbell goes.", "INT./EXT. WILLIAM'S CORRIDOR - DAY", "William heads down the corridor and opens the door.", "Outside are hundreds of paparazzi -- an explosion of", "cameras and questions, of noise and light.  The press seem", "to fill the entire street.", "He comes back inside, snapping the door behind him.  Anna", "is in the kitchen.", "She heads back the corridor, with no suspicion.", "She thinks he's fooling around.  She opens the door, the", "same explosion.  In a split second she's inside.", "INT. WILLIAM'S KITCHEN - DAY", "Anna is on the phone.  Spike is blithely heading downstairs", "to the kitchen in just his underpants.", "He does a thumb up to William -- very excited about what he", "knows was a 'result.'", "She heads upstairs.", "The moment William goes upstairs, Spike heads for the front", "door.", "EXT. WILLIAM'S HOUSE - DAY", "From outside -- we see this scrawny bloke in the frame of", "the doorway, in his gay underpants.  A thousand photos.", "Spike poses athletically.", "INT. WILLIAM'S CORRIDOR - DAY", "Spike closes the door and wanders along to a mirror in the", "hall-way, muttering.", "Inspects himself.", "INT. WILLIAM'S BEDROOM - DAY", "William enters.  He's unhappy for her.  She's almost", "dressed.", "She's pacing.", "It's a difficult moment -- defining where they stand.", "She heads out.", "INT. STAIRS/LIVING ROOM - DAY", "The doorbell goes.", "Spike leans merrily out of the window.", "INT. WILLIAM'S KITCHEN/CORRIDOR - DAY", "They move from the kitchen into the corridor.", "He takes this in.  That's the end.", "She looks at him.  The doorbell goes again.  She opens the", "door. Massive noise and photos.  Outside are her people,", "including Karen, a chauffeur, two bodyguards.  And then the", "door is shut and they're all gone.  Silence.", "INT. WILLIAM'S KITCHEN/CORRIDOR - DAY", "Spike and William sitting there.  Pause.", "He puts his head in his hands.  It's over now.", "EXT. LONDON - DAY", "As full, sad music plays -- William begins to walk through", "Notting Hill.", "This walk takes six months... as he walks, the seasons", "actually and magically change, from summer, through autumn", "and winter, back into spring...", "First it is summer -- summer fruits and flowers -- a six-", "month pregnant woman -- Honey with another leather-jacket", "boyfriend.", "As he walks on the rain starts to fall -- he turns up his", "coat collar -- umbrellas appear.  Followed by winter", "coats --chestnuts roasting -- Christmas trees on side and", "the first hint of snow.", "Then he comes to Blenheim Crescent, which is startling", "snowscape, for the hundred yard, right across Ladbroke", "Grove.", "By the time he reaches the purple cafe, the snow is melting", "and in a few yards, it is spring again.  He passes Honey", "again --arguing with her boyfriend, walking away tearful.", "Then turns past 'the pregnant woman' -- now holding her", "three-month baby. The camera holds on her.", "INT. BOOKSHOP - DAY", "A grey day in the bookshop.  Martin and William.  As ever.", "A feeling that things in there ever change.", "Ten seconds pass.  Honey rushes in.  Spike, still feeling", "in disgrace, comes with her but lingers in the doorway.", "And she rushes out.  William looks at the piece of paper,", "folds it and then places it gently in the garbage bin.", "INT. TONY'S RESTAURANT - NIGHT", "Bella bangs a spoon on a wine bottle.  All the friends are", "gathered in the restaurant.", "Tony's brave face breaks.  The dream is over.", "They're all rather stunned.", "They toast him.", "Total bewilderment from the others.", "Special cut to Bernie -- the shot shows he had special", "feelings for Honey.", "As she sits down, Honey leans toward Spike and whispers.", "INT. TONY'S RESTAURANT - NIGHT", "Two hours later.  They've had a very good time.  There's", "been a chocolate cake.  Lots of alcohol.  Tony is playing", "'Blue Moon' on the piano, and Bernie joins him, singing.", "At one table Bella and Honey sit -- beer and wine on the", "table.", "Elsewhere, Max an William are relaxed together.", "He puts down a copy of the 'Evening Standard' with a", "picture of Anna on its cover.", "EXT. HAMPSTEAD HEATH - DAY", "Cut to the wide sweep of Hampstead Heath.  William entirely", "alone.  He marches up a hill... goes over the crest of", "it -- and sees a huge film crew and hundreds of extras in", "front of the radiant white of Kenwood House, with its lawn", "and its lake.", "EXT. KENWOOD HOUSE - DAY", "Now closer to the house, William approaches a barrier --", "where he is himself approached.", "At that moment -- thirty yards away, William sees trailer", "door open.  Out of it comes Anna -- looking", "extraordinary -- in a velvet dress; full, beautiful make-", "up; rich, extravagant hair. She has a necessary cluster of", "people about her.  Hair, make-up, costume and the third", "assistant who has collected her.", "She walks a few yards, and then casually turns her head.", "And sees him.  Her face registers not jut surprise,", "certainly not a simple smile.  His being there is a", "complicated thing. Cut back to him.  He does a small wave.", "She pauses as the whole paraphernalia of the upcoming scene", "passes between them.  The movie divides them.  But then she", "begins to walk through it, and followed by her cluster, she", "makes her way towards him.  When she reaches him, the", "security guard stands back a pace, and her people hold", "back.  She doesn't really know what to say...", "The third assistant is under pressure.", "She looks around.  The poor third is nervous -- and the", "first is approaching.", "She is swept away, four people touching her hair and", "costume.", "EXT. KENWOOD PARK - DAY", "As they make towards the set...", "EXT. KENWOOD HOUSE - DAY", "A complicated shot is about to happen -- with waves of", "extras --and a huge moving crane.  They end up next to the", "sound desk.", "Harry the sound man is a pleasant, fifty-year-old balding", "fellow.  He hands him the headphones.", "William, the headphones on, surveys the scene -- the", "cluster is full 100 yards from the action, to allow a", "gracious sweeping wide-shot.  He watches Anna.  She is with", "her co-star in the Henry James film -- let's call him James.", "He studies an actress a few yards to the left.", "Back by the desk, William is listening and laughs.  That's", "his girl.  Anna prepares.", "EXT. HAMPSTEAD HEATH - DAY", "Cut back to William -- he has heard.", "He takes off the headphones and puts them gently down.", "William walks away.  The moment of hope is gone.  He", "couldn't have had a clear reminder.", "INT. WILLIAM'S LIVING ROOM - EVENING", "William is emptying Anna Scott videos into a box.", "INT. BACKROOM OF THE BOOKSHOP - DAY", "The next day.  William is hard at work, doing the accounts", "in a dark small room with files in it.  Martin pops his", "head in.", "They head out, Martin behind him, incomprehensively rubbing", "his hands -- he's in a very good mood.", "INT. BOOKSHOP - DAY", "William enters -- and there stands Anna -- in a simple blue", "skirt and top.", "It's quite a big wrapped parcel, flat -- 3 foot by 4 foot,", "leaning against a bookshelf.", "Then the door pings.  In walks the annoying customer, Mr.", "Smith.", "Mr. Smith is taken aback and therefore completely obedient.", "And he leaves.", "Pause as William takes this in.", "Martin edges up.", "Martin is left with Anna.", "She's kind in here, not sarcastic.", "William returns a little uneasy.", "Martin leaves them.", "She's awaiting an answer.", "He can't really express what he feels.", "He feels he must explain.", "Pause.", "Pause.  She kisses him on the cheek.", "Then turns and leaves.  Leaving him.", "INT. TONY'S RESTAURANT - DAY", "The restaurant is in the middle of being deconstructed.", "The pictures are gone off the walls -- a kettle on a long", "extension lead is on the bare table behind.  They're all", "sitting there.", "Spike enters.", "Bella is casually looking at the painting that sits beside", "William.  It is the original of the Chagall, the poster of", "which was on his wall.", "They take in the line.  It totally reverses their attitudes.", "They look at him.  Spike does a big nod.", "EXT. TONY'S RESTAURANT - DAY", "Max's car arrives in the street outside.  They pile into", "the car.", "He shoots out of his door, rushes round and grabs Bella out", "of the chair.", "EXT./INT. CAR. STANLEY CRESCENT/NOTTING HILL GATE - DAY", "Max's car is shooting up Stanley Crescent.  We are inside", "and outside the car.", "Suddenly the car slams to a halt.", "EXT. PICCADILLY - DAY", "The car turns illegally right across Piccadilly the wrong", "way down a one-way street and ends up outside the Ritz.", "William sprints into the hotel.  Bernie follows.", "IT. RITZ LOBBY - DAY", "It is the same man.", "Man shakes his head.", "He turns despondent and takes two steps when the Ritz Man", "stops him in his tracks.", "A Japanese guest assumes this is the way to behave and the", "Ritz Man gets kissed a third time.", "EXT. LONDON STREET - DAY", "The car speeds through London.  It gets totally stuck at a", "junction where no one will let them in.", "He gets out of the car and boldly stops the traffic coming", "in the opposite direction.  Our car shoots past him.", "They leave him behind.  Honey leans out the window and", "shouts...", "Spike waves wildly -- he loses concentration and is very", "nearly hit by a car.", "EXT. THE SAVOY - DAY", "They pull to a stop.  William leaps out.", "INT. THE SAVOY - DAY", "William rushes up to the main desk.", "He flashes a card.", "Honey shows into shot, pushing Bella's chair.", "INT. SAVOR ROOM - DAY", "William runs, searching.  At last finds the room, and", "enters.", "INT. LANCASTER ROOM - DAY", "Huge room -- full of press.  Row after row of journalists,", "cameras at the front, TV cameras at the back.  Anna clearly", "gives press conferences very rarely, because this one is", "positively presidential.  She sits at a table at the end of", "the room, beside Karen: on her other side os Jeremy, the PR", "boss, firmly marshalling the questions.", "She's in a slightly melancholic and therefore honest mood.", "He points at a journalist he knows.", "They love that answer, and all scribble in their note", "books. Next question comes from someone straight right next", "to William.", "He is pointing straight at William, who has his hand up.", "Anna sees who it is asking.", "We cut to Max, Bella, Bernie and Honey, all watching.  Then", "back to Anna.", "Anna whispers something to Jeremy.", "Pause.  Anna looks up at William.  He nods.", "They both smile -- suddenly the press gets what's going", "on --music -- noise -- they all turn and flash, flash,", "flash photos of William.  Max and Bella kiss.  Bernie", "kisses a total stranger. Spike finally makes it -- he's", "bright red from running.", "Honey hugs him.  It's a new experience for Spike.", "Cut to William's face -- flash after flash -- still looking", "at Anna.  They are both smiling.", "INT./EXT. THE HEMPEL ZEN GARDEN WITH MARQUEEN - DAY", "Anna and William at their wedding -- they kiss and walk", "into the crowd.", "Honey, a bridesmaid in peach satin -- she is surrounded by", "at least four other bridesmaids, all under five.", "Nearby, Tony standing, glowing, beside his fabulous,", "pyramidical wedding cake.", "William's mother is not quite happy with how he's looking.", "She tries to brush his hair.", "Max, dressed in the most devastating Bond-like white tuxedo", "is dancing with Anna -- thrilled.  He does a rather flashy", "little move.  Cut to Bella who is watching and laughing.", "Martin, in an awkward tweed suit, is jiggling to the beat", "of a song, entirely happy in the corner.", "EXT. LEICESTER SQUARE - NIGHT", "A huge premier -- screaming crowds -- Anna and William get", "out of the car, she holding his hand --  looking ultimately", "gorgeous -- he in a black suit that doesn't quite fit.", "He's startled.", "EXT. GARDEN - DAY", "A pretty green communal garden.  Children are playing,", "watched by mothers, one of whom holds a new baby in a", "papoose.  A very old couple wander along slowly.", "A small tai chi group moves mysteriously.  And as the", "camera glides, it passes a couple sitting on a single,", "simple wooden bench overlooking the garden.  He is reading,", "she is just looking out, totally relaxed, holding his hand,", "pregnant.  It is William and Anna."]}