{"WILLIAM (V.O.)": [" Of course, I've seen her films and always thought she was, well, fabulous -- but, you know, million miles from the world I live in. Which is here -- Notting Hill -- not a bad place to be...", " There's the market on weekdays, selling every fruit and vegetable known to man...", " The tattoo parlor -- with a guy outside who got drunk and now can't remember why he chose 'I Love Ken'...", " The racial hair-dressers where everyone comes out looking like the Cookie Monster, whether they like it or not...", " Then suddenly it's the weekend, and from break of day, hundreds of stalls appears out of nowhere, filling Portobello Road right up to Notting Hill Gate...", " ... and thousands of people buy millions of antiques, some genuine...", " ... and some not so genuine.", " And what's great is that lots of friends have ended up in this part of London -- that's Tony, architect turned chef, who recently invested all the money he ever earned in a new restaurant...", " So this is where I spend my days and years -- in this small village in the middle of a city -- in a house with a blue door that my wife and I bought together... before she left me for a man who looked like Harrison Ford, only even handsomer...", " ... and where I now lead a strange half-life with a lodger called...", " And so it was just another hopeless Wednesday, as I set off through the market to work, little suspecting that this was the day which would change my life forever.  This is work, by the way, my little travel book shop...", " ... which, well, sells travel books -- and, to be frank with you, doesn't always sell many of those."], "WILLIAM": [" Spike!", " This is important in comparison to, let's say, whether they should cancel third world debt?", " What are the choices?", " Yes -- might make it hard to strike a really romantic note.", " Yes -- she might think you don't have true love on your mind.", " Well, yes, that's perfect. Well done.", " Good luck.", " Classic.  Absolutely classic. Profit from major sales push -- minus 347 pound.", " Yes, better get me a half.  All I can afford.", " Can I help you?", " Fine.", " That book's really not good -- just in case, you know, browsing turned to buying.  You'd be wasting your money.", " Yes.  This one though is... very good.", " I think the man who wrote it has actually been to Turkey, which helps. There's also a very amusing incident with a kebab.", " If you could just give me a second.", " Excuse me.", " Bad news.", " We've got a security camera in this bit of the shop.", " So, I saw you put that book down your trousers.", " The one down your trousers.", " Right -- well, then we have something of an impasse.  I tell you what --I'll call the police -- and, what can I say?  If I'm wrong about the whole book-down-the-trousers scenario, I really apologize.", " Well, ideally, when I went back to the desk, you'd remove the Cadogan guide to Bali from your trousers, and either wipe it and put it back, or buy it.  See you in a sec.", " Sorry about that...", " Yes, we couldn't stop him.  If you can find an unsigned copy.  It's worth an absolute fortune.", " Oh -- right -- on second thoughts maybe it wasn't that bad. Actually -- it's a sort of masterpiece really. None of those childish kebab stories you get in so many travel books these days.  And I'll throw in one of these for free.", " Very useful for fighting fires, wrapping fish, that sort of things.", " Thanks.  I don't think you'll believe who was just in here.", " No. No-one -- no-one.", " Topol.", " But Ringo Starr doesn't look anything like Topol.", " So it would have been neither of them?", " Right.  It's not a classic anecdotes, is it?", " Right -- want another one?", " Here, let me help.", " Nothing, nothing... Look, I live just over the street -- you could get cleaned up.", " I also have a phone.  I'm confident that in five minutes we can have you spick and span and back on the street again... in the non- prostitute sense obviously.", " Eighteen yards.  That's my house there.", " Come on in.  I'll just...", " It's not that tidy, I fear.", " The bathroom is right at the top of the stairs and there's a phone on the desk up there.", " Would you like a cup of tea before you go?", " Coffee?", " Orange juice -- probably not.", " Something else cold -- coke, water, some disgusting sugary drink pretending to have something to do with fruits of the forest?", " Would you like something to nibble --apricots, soaked in honey -- quite why, no one knows -- because it stops them tasting of apricots, and makes them taste like honey, and if you wanted honey, you'd just buy honey, instead of apricots, but nevertheless -- there we go -- yours if you want them.", " Do you always say 'no' to everything?", " You're welcome and, may I also say... heavenly.", " Take my one chance to say it.  After you've read that terrible book, you're certainly not going to be coming back to the shop.", " Yes.  Well.  My pleasure.", " Nice to meet you.  Surreal but nice.", " 'Surreal but nice.'  What was I thinking?", " Coming.", " Oh hi.  Forgot something?", " Oh right.", " Here we go.", " I apologize for the 'surreal but nice' comment.  Disaster...", " Oh my God.  My flatmate.  I'm sorry --there's no excuse for him.", " Hi.", " Right.  No one.  I mean, I'll tell myself sometimes but... don't worry -- I won't believe it.", " It's not yogurt -- it's mayonnaise.", " Yes, she is fairly fabulous.", " No, we're a travel bookshop.  We only sell travel books.", " No, that's a novel too.", " Martin -- your customer.", " Hi...", " Just incidentally -- why are you wearing that?", " There never will be, you know, unless you actually clean your clothes.", " No, they were prescription, so I could see all the fishes properly.", " So -- any messages?", " Two?  That's it?", " Who were the ones you didn't write down from?", " Right.  No one else?", " What did she say?", " Which one?", " Hello.", " Ahm, look this is a very odd situation.  I'm a friend of Anna Scott's -- and she rang me at home the day before yesterday -- and left a message saying she's staying with you...", " No, that's right -- I know that. She said she's using another name -- but the problem is she left the message with my flatmate, which was a serious mistake.", " Imagine if you will the stupidest person you've ever met -- are you doing that...?", " And then double it -- and that is the -- what can I say -- git I'm living with and he cannot remember...", " What?", " Does 'Flinstone' mean anything to you?", " Oh my God.", " Hello.  Hi.  Hi.", " Oh hi.  It's William Thacker.  We, ahm I work in a bookshop.", " No, I've never played anything cool in my entire life.  Spike, who I'll stab to death later, never gave me the message.", " Perhaps I could drop round for tea or something?", " Right.  Great. Classic.  Classic.", " Which floor?", " Are you sure you...?", " Oh.  Right.", " I agree.", " 'Horse and Hound.'  The name's William Whacker.  I think she might be expecting me.", " No -- they're... for my grandmother. She's in a hospital nearby.  Thought I'd kill two birds with one stone.", " Do you mind me not saying -- it's a rather distressing disease and the name of the hospital rather gives it away.", " Hi.", " I brought these, but clearly...", " Sorry about not ringing back.  The whole two-names concept was totally too much for my flatman's pea-sized intellect.", " So I'll just fire away, shall I?", " Right.  Ahm... the film's great... and I just wondered -- whether you ever thought of having more... horses in it?", " Obviously.  Very difficult.", " I'm sorry -- I arrived outside -- they thrust this thing into my hand -- I don't know what to do.", " Absolutely fine about it.", " Oh yes -- excellent.  Ahm -- any horses in that one?  Or hounds, of course.  Our readers are equally intrigued by both species.", " Yes.  Right... But if there were horses, would you be riding them yourself or would you be getting a stunt horse person double sort of thing?", " I'm just a complete moron.  Sorry. This is the sort of thing that happens in dreams -- not in real life.  Good dreams, obviously -- it's a dream to see you.", " Well, I suppose in the dream scenario. I just... ahm, change my personality, because you can do that in dreams, and walk across and kiss the girl but you know it'll never happen.", " Very neatly.", " Right.", " Are you busy tonight?", " Thank you.  You are 'Horse and Hound's' favorite actress.  You and Black Beauty.  Tied.", " Fabulous.", " Yes.  That's right.  Bitch.", " The others?", " Ah... yes, enormously.", " Right, right.  Ahm -- did you enjoy making the film?", " Any bit in particular?", " Ahm right, right, I liked the bit in space very much.  Did you enjoy making that bit?", " Did you identify with the character you were playing?", " Ah.  Why not?", " Classic.", " Is this your first film?", " Of course it is.  Any favorite among the 22?", " Da Vinci?", " Of course.  And is he your favorite Italian film director?", " Yes?", " Oh well, great.  Perfect.  Oh no -- shittity brickitty -- it's my sister's birthday -- shit -- we're meant to be having dinner.", " But no, I'm sure I can get out of it.", " You'll be my date at my little sister's birthday party.", " I'm sure it's all right.  My friend Max is cooking and he's acknowledged to be the worst cook in the world, but you know, you could hide the food in your handbag or something.", " Okay.", " He's cooking guinea fowl?", " Bella -- this is Anna.", " Max.  This is Anna.", " Hun -- this is Anna.  Anna -- this is Honey -- she's my baby sitter.", " That is a cheap question and the answer is, of course, no comment.", " No, it doesn't.", " Definitely no comment.", " Bernie.", " Bella.", " So I get the brownie?", " You'll have to prove it.  This is a great brownie and I'm going to fight for it.  State your claim.", " Pathetic effort to hog the brownie.", " Sorry -- they always do that when I leave the house.", " It's the hair!  It's to do with the hair.", " It was an accident -- about eighteen months ago.", " You know, I'm not sure.  I don't think they'd tried for kids before, as fate would have it.", " Would you like to come... my house is just...?", " That's fine.", " I thought you were leaving.", " Gardens.  All these streets round here have these mysterious communal gardens in the middle of them. They're like little village.", " Ah no -- that's the point -- they're private villages -- only the people who live round the edges are allowed in.", " Ahm...", " Heck no -- other people do -- but not me -- I just do what I want.", " Whoopsidaisies.", " Nothing.", " No, I didn't.", " I don't think so.  No one has said \"whoopsidaisies,\" do they -- I mean unless they're...", " Exactly.  Here we go again.", " Whoopsidaisies.", " It's a disease I've got -- it's a clinical thing, I'm taking pills and having injections -- it won't last long.", " Actually be careful Anna -- it's harder than it looks...", " Oh no it's not -- it's easy.", " Now seriously -- what in the world in this garden could make that ordeal worthwhile?", " Nice garden.", " Bollocks, bollocks, bollocks.  Have you seen my glasses?", " Bollocks. This happens every time I go to the cinema.  Average day, my glasses are everywhere -- everywhere I look, glasses.  But the moment I need them they disappear.  It's one of life's real cruelties.", " Oh shit, is that the time?  I have to go.", " Thanks for your help on the glasses thing.", " Sort of.", " She left me.", " She saw through me.", " Right, that's it.", " I'm sorry to disturb you guys but --", " Well, yes, I wish I hadn't overheard your conversation -- but I did and I just think, you know...", " ...the person you're talking about is a real person and I think she probably deserves a little bit more consideration, rather than having jerks like you drooling over her...", " I'm sorry.", " No, you were brilliant", " I don't know, I'm afraid.", " There seem to be lots of reasons why I shouldn't.", " Hi.", " To be able to do that is such a wonderful thing.", " Why?", " Your boyfriend?", " Ahm... room service.", " Well, yes -- usually -- I'd just changed to go home -- but I thought I'd just deal with this final call.", " I'll see what I can do.", " Absolutely.  Ice cold still water.", " No, I'm sure it'll be fine.", " Right.", " Ah -- no.  It's fine.", " Ahm... Bernie.", " I better leave.", " -- this is a fairly strange reality to be faced with.  To be honest, I don't realize...", " I think good bye is traditional.", " Well, okay.  There's this girl...", " She's someone I just can't -- and it's as if I've taken love-heroin -- and now I can't even have it again. I've opened Pandora's box.  And there's trouble inside.", " Thanks.  Yes -- very helpful.", " No -- did you?", " Bloody hell, I can't believe it --my whole life ruined because I don't read \"Hello\" magazine.", " Buggered?", " Really?", " Has he?", " And ahm -- what's a fruitarian exactly?", " Right.  Right.  Interesting stuff. So these carrots...", " Murdered?  Poor carrots.  How beastly.", " Interesting means inedible.", " Yes.  That would be...great.", " She's perfect, perfect.", " I think you have forgotten... ...what an unusual situation you have here -- to find someone you actually love, who'll love you -- the chances are... always minuscule. Look at me -- not counting the American -- I've only loved two girls in my whole life, both total disasters.", " No really, one of them marries me and then leaves me quicker than you can say Indiana Jones -- and the other, who seriously ought to have known better, casually marries my best friend.", " In a depressingly asexual way.", " Oh no -- this is just getting worse. I am going to find myself, 30 years from now, still on this couch.", " Why not -- all that awaits me at home is a masturbating Welshman.", " Come in.", " This is the place.", " Don't think about it.  We'll sort it out.  Now what would you like -- tea ... bath...?", " No, that's fine.  It's not often one has the opportunity to adios the plates of a major Hollywood star. It was a thrill for me. How is he?", " Well, there's a question -- without an interesting answer.", " Oh no no -- no.", " I appreciate that absolutely. Is that the film you're doing?", " Would you like me to take you through your lines?", " Hand it over.  Basic plot?", " Well done you.", " 'Message from command.  Would you like them to send in the HKs?'", " 'Very well, captain -- I'll pass that on straightaway.'", " Eleven.", " Cartwright.", " 'Certainly.  And little Johnny?'", " Yup.", " Brilliant. Word perfect I'd say.", " Gripping.  It's not Jane Austen, it's Not Henry James, but it's gripping.", " I'm sure you'd be great in Henry James. But, you know -- this writer's pretty damn good too.", " And I think the book is the poorer for it.", " You like Chagall?", " With a goat playing a violin.", " I don't mention that Anna's a vegetarian, did I?", " Yes.  Always have had.", " No.  What's that?", " You actually have clauses in your contact about nudity.", " You have a stunt bottom?", " Would you be tempted to go for a slightly better bottom than your own?", " It's one hell of a job.  What do you put on your passport?  Profession -- Mel Gibson's bottom.", " The ice cream or Mel Gibson's bottom?", " Well, thank you. Anytime -- time for bed.  Or... sofa- bed.", " Oh my God... Hello.", " Spike.", " Maybe.", " Yes.", " Yes.", " Spike.  For God's sake -- she's in trouble -- get a grip.", " Spike!", " I'll talk you in the morning.", " Oh please sod off.", " No! No.  Wait.  I... thought you were someone else.  I thought you were Spike. I'm delighted you're not.", " Wow.", " Nothing.", " It still strikes me as, well, surreal, that I'm allowed to see you naked.", " Oh God yes -- I'm sorry.", " Well...", " More than that actually, when you think about it.  You know, Meatloaf has a very nice pair...", " Actually, I can't think really -- let me just have a quick look...", " No, beats me.", " Who was Gilda?", " You're lovelier this morning than you have ever been.", " Stay forever.", " Jesus Christ.", " Don't ask.", " Undressed like this, yes.", " I wouldn't go outside.", " Just take my work for it.", " How are you doing?", " I don't know what happened.", " That's not true.", " Get out, Spike. I'm so sorry.", " You do?", " I know, I know -- but... just -- let's stay calm...", " That's spectacularly unfair.", " Now stop.  Stop.  I beg you -- calm down. Have a cup of tea.", " Spike, check who that is... and for God's sake put some clothes on.", " That's not true.  And wait a minute... this is crazy behavior. Can't we just laugh about this? Seriously -- in the huge sweep of things, this stuff doesn't matter.", " Well, there are.  And we don't need to go anywhere near that far. My best friend slipped -- she slipped down-stairs, cracked her back and she's in a wheelchair for the rest of her life. All I'm asking for is a normal amount of perspective.", " I mean -- today's newspapers will be lining tomorrow's waste paper bins.", " Well, you know -- it's just one day. Today's papers will all have been thrown away tomorrow.", " Right.  Fine!  I will do the opposite, if it's all right by you -- and always be glad you came. But you're right -- you probably better go.", " Was it you?", " Right.", " Blimey.  What's that?", " Well, thanks, that's great.", " Wait a minute -- I'm your brother and I don't know anything about this.", " Yes -- I feel I must apologize to everyone for my behavior for the last six months.  I have, as you know, been slightly down in the mouth.", " But I wish to make it clear I've turned a corner and henceforward intend to be impressively happy.", " I believe I have.", " No, don't think I do.", " Oh God no.", " Yes -- I was looking for Anna Scott...", " No, no.  She doesn't.", " Oh right.  I mean, I am a friend -- I'm not a lunatic but -- no, you basically...", " I only found out you were here yesterday.", " Absolutely -- you're clearly very busy.", " Okay.", " This is Henry James film?", " That's great.", " Of course.", " Thank you.", " I'm going to throw out these old videos.", " Right -- let's talk about rent...", " Martin, can't you just deal with this yourself?", " Okay.  Tell me, would I have to pay a wet rag as much as I pay you?", " Hello.", " Yes -- I'm sorry -- I had to leave... I didn't want to disturb you.", " Fine.  Everything much the same. When they change the law Spike and I will marry immediately.  Whereas you... I've watched in wonder. Awards, glory...", " Thank you.  Shall I...", " Okay -- well, thank you.  I don't know what it's for.  But thank you anyway.", " What's the thing?", " Don't even think about it.  Go away immediately.", " You were saying...", " But yesterday... that actor asked you who I was... and you just dismissed me out of hand... I heard -- you had a microphone... I had headphones.", " Can you tell me I'll ring her back.", " Okay -- perfect timing as ever -- hold the fort for a second will you, Martin?", " Sorry about that.", " Anna.  Look -- I'm a fairly level- headed bloke.  Not often in and out of love.  But...", " ... can I just say 'no' to your kind request and leave it at that?", " The truth is...", " ... with you, I'm in real danger. It took like a perfect situation, apart from that foul temper of yours -- but my relatively inexperienced heart would, I fear, not recover if I was once again ... cast aside, which I would absolutely expect to be.  There are too many pictures of you everywhere, too many films.  You'd go and I'd be... well, buggered, basically.", " I live in Notting Hill.  You live in Beverly Hills.  Everyone in the world knows who you are.  My mother has trouble remembering my name.", " What do you think?  Good move?", " Tony -- what do you think?", " Brilliant.  Max?", " Great.  Excellent.  Thanks.", " Yes, I think that one may be.", " Yes -- sort of...", " What?", " It was sort of sweet actually -- I mean, I know she's an actress and all that, so she can deliver a line -- but she said that she might be as famous as can be --but also... that she was just a girl, standing in front of a boy, asking him to love her.", " Oh sod a dog.  I've made the wrong decision, haven't I?", " Max, how fast is your car?", " No!", " Is Miss Scott staying here?", " How about Miss Flintstone?", " Or Bambi... or, I don't know, Beavis or Butthead?", " Right.  Right.  Fair enough.  Thanks.", " Excuse me, where's the press conference?", " Yes...", " That's right... I work for their in- house magazine. 'Movies are our business.'", " Yes -- Miss Scott -- are there any circumstances in which you two might be more than just friends?", " And what would you say...", " Yes, I just wondered whether if it turned out that this... person...", " Thanks.  I just wondered if Mr. Thacker realized he'd been a draft prick and got down on his knees and begged you to reconsider, whether you would... reconsider.", " That's very good news.  The readers of 'Horse and Hound' will be absolutely delighted."], "SPIKE": [" Even he.  Hey, you couldn't help me with an incredibly important decision, could you?", " That's right -- I'm at last going out on a date with great Janine and I just want to be sure I've picked the right t-shirt.", " Well... wait for it... First there's this one...", " Point taken.", " I suspect you'll prefer the next one.", " Wouldn't want that... -- just one more.", " Thanks.  Great.  Wish me luck.", " Hi.", " I'm just going to go into the kitchen to get some food -- and then I'm going to tell you a story that will make your balls shrink to the size of raisins.", " There's something wrong with this yogurt.", " Well, there you go. On for a video fest tonight?  I've got some absolute classic.", " Imagine -- somewhere in the world there's a man who's allowed to kiss her.", " Hey.", " Ahm -- combination of factors really. No clean clothes...", " Right.  Vicious circle.  And then I was like rooting around in your things, and found this, and I thought -- cool. Kind of spacey.", " There's something wrong with the goggles though...", " Groovy.  You should do more of this stuff.", " Yeh, I wrote a couple down.", " You want me to write down all your messages?", " Ahm let's see -- ahm.  No.  Gone completely.  Oh no, wait.  There was --one from your mum: she said don't forget lunch and her leg's hurting again.", " Absolutely not.", " Though if we're going for this obsessive writing-down-all-messages thing -- some American girl called Anna called a few days ago.", " Well, it was genuinely bizarre... she said, hi -- it's Anna -- and then she said, call me at the Ritz -- and then gave herself a completely different name.", " Absolutely no idea.  Remembering one name's bad enough...", " Try 'Flinstone.'", " I think she said her name was 'Flinstone.'", " No, 'fraid not.", " That's compared to, like, earthquakes in the Far East or testicular cancer?", " You're welcome.  Did you find them?", " Come on -- open up -- this is me -- Spikey -- I'm in contact with some quite important spiritual vibrators. What's wrong?", " Aha!  I'd been getting a female vibe. Good.  Speak on, dear friend.", " Yeh.  Yeh...tricky...tricky...I knew a girl at school called Pandora ... never got to see her box though.", " Christ alive... brilliant... fantastic", " Just checking.", " Thank you, God.", " Voila.  Carnival Calypso, for the Queen of Notting Hill -- pepperoni, pineapple and a little more pepperoni.", " I have some parsnip stew from last week. If I just peel the skin off, it'll be perfect.", " Hello.  I wonder if I could have a little word.", " I don't want to interfere, or anything ... but she's split up from her boy-friend, that's right isn't it?", " And she's in your house.", " And you get on very well.", " Well, isn't this perhaps a good opportunity to... slip her one?", " Right.  Right.  You think it's the wrong moment.  Fair enough. Do you mind if I have a go?", " No -- you're right.", " Okay -- okay.  Might be too late, but okay.", " Morning, daring ones.", " Why not?", " How did I look?", " Not bad.  No bad at all.  Well- chosen briefs, I'd say.  Chick love grey. Mmmmm.  Nice firm buttocks.", " I went out in my goddamn underwear too.", " Looks like a chauffeur to me.", " What he's going to say next is -- there are people starving in the Sudan.", " I suppose I might have told one or two people down the pub.", " Me?", " Well, yes.  Groovy.", " What's going on?", " No.  You can't bin these.  They're classics.  I'm not allowing this.", " Let me help.  We don't want all this shit cluttering up our lives.", " I was called and I came.  What's up?", " You draft prick!", " Bugger this for a bunch of bananas.", " Go!", " What happened?"], "MARTIN": [" Shall I go get a cappuccino?  Ease the pain.", " Cappuccino as ordered.", " Who?  Someone famous?", " Would be exciting if someone famous did come into the shop though, wouldn't it?  Do you know -- this is pretty incredible actually -- I once saw Ringo Starr.  Or at least I think it was Ringo.  It might have been that broke from 'Fiddler On The Roof,' Toppy.", " That's right -- Topol.", " No, well... he was quite a long way away.", " I suppose so.", " Not classic, no.", " Yes.  No, wait -- let's go crazy -- I'll have an orange juice.", " Can I help you?", " I have to disturb you when you're cooking the books, but there's a delivery.", " But it's not for the shop.  It's for you.", " Excuse me -- it's your mother on the phone.", " I actually tried that tack -- but she said you said that before and it's been twenty-four hours, and her foot that was purple is now a sort of blackish color...", " Can I just say, I thought 'Ghost' was a wonderful film.", " Yes... I've always wondered what Patrick Swayze is like in real life.", " Oh dear.  He wasn't friendly during the filming?", " Oh right.  Right.  Sorry.  Always been a bit of an ass.", " Anyway... it's lovely to meet you. I'm a great fan of yours.  And Demi's, of course."], "MARIN": [" I get you logic.  Demi-capu coming up."], "ANNA": [" No, thanks.  I'll just look around.", " Really?", " Thanks.  I'll think about it.", " No, that's fine.  I was going to steal one myself but now I've changed my mind.  Signed by the author, I see.", " Yes.", " What's your name?", " Well, that's the signature -- and above, it says 'Dear Rufus -- you belong in jail.'", " Tempting but... no, thank you.", " I think I will try this one.", " Thanks.", " Oh Jesus.", " What are you doing?", " No thank you.  I need to get my car back.", " Okay.  So what does 'just over the street' mean -- give it to me in yards.", " No thanks.", " No.", " Really, no.", " No.", " No. I better be going.  Thanks for your help.", " Thank you.", " I forgot my bag.", " Thanks.  Well...", " Don't worry about it.  I thought the apricot and honey business was the real lowpoint.", " Hi.", " Probably best not tell anyone about this.", " Bye.", " No.", " I've got nothing to smile about.", " Hello.", " Oh no, ho -- these are great.", " No, it's a stupid privacy thing.  I always choose a cartoon character -- last time out, I was Mrs. Bambi.", " Yes, thanks.", " Is that so?", " Ahm -- well -- we would have liked to -- but it was difficult, obviously, being set in space.", " No, it's my fault, I thought this would all be over by now.  I just wanted to sort of apologize for the kissing thing.  I seriously don't know what got in to me.  I just wanted to make sure you were fine about it.", " It takes place on a submarine.", " And what happens next in the dream?", " Yes.", " Well, it was nice to meet you. Surreal but nice.", " Ahm.  That thing I was doing tonight -- I'm not doing it any more.  I told them I had to spend the evening with Britain's premier equestrian journalist.", " Okay -- fine.", " No, I mean, if it's fine with you, I'll, you know, be your date.", " If that's all right.", " Okay.", " Hi.", " Thank you.", " Hiya.", " Ahm... I think that sounds -- you know -- lucky me.  Happy Birthday.", " I'll think about it.", " I'm an actress.", " Well, they can be.", " Films mainly.", " Fifteen million dollars.", " I wonder if you could tell me where the...?", " I'm a vegetarian.", " Wait a minute.  What about me?", " Well... a shot at it.", " Well, I've been on a diet since I was nineteen, which means basically I've been hungry for a decade.", " Really -- and one day, not long from now...", " ... my looks will go, they'll find out I can't act and I'll become a sad middle-aged woman who looks a bit like someone who was famous for a while.", " That was such a great evening.", " And may I say that's a gorgeous tie.", " You're right.  I told you I was bad at acting.", " Lovely to meet you.", " Night, night, Honey.", " You too -- from now on you are my style guru.", " Floppy, huh?", " Why is she in a wheelchair?", " And the pregnancy thing -- is that to do with the accident?", " Too complicated.", " Busy tomorrow?", " I was.", " What's in there?", " Let's go in.", " You abide by rules like that?", " What did you say?", " Yes, you did.", " You said \"whoopsidaisies.\"", " There's no \"unless.\"  No one has said \"whoopsidaisies\" for fifty years and even then it was only little girls with blonde ringlets.", " Step aside.", " Come on, Flops.", " \"For June, who loved this garden -- from Joseph who always sat beside her.\"", " Some people do spend their whole lives together.", " So who left who?", " Why?", " Uh-oh.  That's not good.", " No, that's fine.  I love that you tried... time was I'd have done the same.", " In fact -- give me a second.", " Hi.", " I'm sorry about my friend -- he's very sensitive.", " Please, please -- let's just leave it there.  I'm sure you meant no harm, and I'm sure it was just friendly banter and I'm sure you dicks are all the size of peanuts. A perfect match for the size of your brains. Enjoy your meal.  The tuna's really good.", " I shouldn't have done that.  I shouldn't have done that.", " I'm rash and I'm stupid and what am I doing with you?", " I don't know either.", " Here we are. Do you want to come up?", " There are lots of reasons.  Do you want to come up?", " Give me five minutes.", " Hiya.", " You've got to go.", " Because my boyfriend, who I thought was in America, is in fact in the next room.", " Yes...", " Really -- don't do that -- I'm sure this is not his job.", " Nice surprise.", " I haven't decided.", " I'm sorry... I don't know what to say.", " Hi.  Can I come in?", " They were taken years ago -- I know it was...", " I don't know where to go.  The hotel is surrounded.", " Thank you.  I'm just in London for two days -- but, with your papers, it's the worse place to be.", " These are such horrible pictures. They're so grainy... they make me look like...", " A bath would be great.", " You must be Spike.", " Hi.", " I'm really sorry about last time. He just flew in -- I had no idea -- in fact, I had no idea if he'd ever fly in again.", " I don't know.  It got to the point where I couldn't remember any of the reasons I loved him.  And you... and love?", " I have thought about you.", " Just anytime I've tried to keep things normal with anyone normal -- it's been a disaster.", " Yes -- start in L.A. on Tuesday.", " Would you?  It's all talk, talk, talk.", " I'm a difficult but brilliant junior officer who in about twenty minutes will save the world from nuclear disaster.", " 'No, turn over 4 TRS's and tell them we need radar feedback before the KFT's return at 19 hundred -- then inform the Pentagon that we'll be needing black star cover from ten hundred through 12.15' -- and don't you dare say one word about how many mistakes I made in that speech or I'll pelt you with olives.", " 'Thank you.'  How many mistake did I make?", " Damn.  'And Wainwright...'", " 'Cartwright, Wainwright, whatever your name is, I promised little Jimmy I'd be home for his birthday -- could you get a message through that I may be a little late.'", " My son's name is Johnny?", " Well, get a message through to him too.", " What do you think?", " You think I should do Henry James instead?", " Yes -- I mean -- you never get anyone in 'Wings of a Dove' having the nerve to say 'inform the Pentagon that we need black star over.'", " I can't believe you have that picture on your wall.", " I do.  It feels like how being in love should be.  Floating through a dark blue sky.", " Yes -- happiness wouldn't be happiness without a violin-playing goat.", " Fantastic.", " You've got big feet.", " You know what they say about men with big feet?", " Big feet -- large shoes.", " The thing that's so irritating is that now I'm so totally fierce when it comes to nudity clauses.", " Definitely.  'You may show the dent at the top of the artist's buttocks -- but neither cheek, in the event of a stunt person being used, the artist must have full consultation.'", " I could have a stunt bottom, yes.", " Definitely.  Ths is important stuff.", " Actually, Mel does his own ass work. Why wouldn't he?", " Both.", " Today has been a good day.  Which under the circumstances is... unexpected.", " Right.", " Okay.", " What?", " You and every person in this country.", " What is it about men and nudity? Particularly breasts -- how can you be so interested in them?", " No seriously.  I mean, they're just breasts.  Every second person in the world has got them...", " But... they're odd-looking.  They're for milk.  Your mum's got them.  You must have seen a thousand of them -- what's the fuss about?", " Rita Hayworth used to say -- 'they go to bed with Gilda -- they wake up with me.' Do you feel that?", " Her most famous part -- men went to bed with the dream -- and they didn't like it when they woke up with the reality --do you feel that way with me?", " Oh.", " I'll be back.", " Breakfast in bed.  Or lunch, or brunch.", " Can I stay a bit longer?", " Damn, I forgot the jam.", " You get the door, I'll get the jam.", " What?", " You're up to something...", " Oh my God.  And they got a photo of you dressed like that?", " Jesus.", " It's Anna.  The press are here.  No, there are hundreds of them.  My brilliant plan was not so brilliant at all.  Yeh, I know, I know.  Just get me out then. Damnit.", " How do you think I'm doing?", " I do.  Your furry friend thought he'd make a buck or two telling the papers where I was.", " Really?  The entire British press just woke up this morning and thought 'Hey --I know where Anna Scott is.  She's in that house with the blue door in Notting Hill.'  And then go out in your goddamn underwear.", " This is such a mess.  I come to you to protect myself against more crappy gossip and now I'm landed in it all over again.  For God's sake, I've got a boyfriend.", " As far as they're concerned I do. And now tomorrow there'll be pictures of you in every newspapers from here to Timbuktu.", " You can stay calm -- it's the perfect situation for you -- minimum input, maximum publicity.  Everyone, you ever bump into will know.  'Well done you --you slept with that actress -- we've seen the pictures.'", " Who knows, it may even help business. Buy a boring book about Egypt from the guy who screwed Anna Scott.", " I don't want a goddamn cup of tea. I want to go home.", " And remember -- Spike owes you an expensive dinner.  Or holiday -- depending if he's got the brains to get the going rate on betrayal.", " You're right: of course, you're right. It's just that I've dealt with this garbage for ten years now -- you've had it for ten minutes.  Our perspective are different.", " Excuse me?", " You really don't get it.  This story gets filed.  Every time anyone writes anything about me -- they'll dig up these photos.  Newspapers last forever. I'll regret this forever.", " This is certainly... ah...", " I was going to ring... but... I didn't think you'd want to...", " It's not going very well -- and it's our last day.", " But... wait... there are things to say.", " Drink tea -- there's lots of tea.", " We have to.  I've got to be in New York on Thursday.", " I'm not listening.", " I said I'm not listening -- and I think, looking at something that firm, you and your droopy little excuse for an 'arse' would be well- advised to keep quiet.", " So I ask you when you're going to tell everyone, and you say...?", " And then I... right.", " Oh... no one... no one.  Just some... guy from the past.  I don't know what he's doing here.  But of an awkward situation.", " Hi.", " You disappeared.", " Well... how have you been?", " Oh no.  It's all nonsense, believe me. I had no idea how much nonsense it all was -- but nonsense it all is...", " I thought I'd give it to you.", " No, don't open it yet -- I'll be embarrassed.", " I actually had it in my apartment in New York and just thought you'd... but, when it came to it, I didn't know how to call you... having behaved so... badly, twice.  So it's been just sitting in the hotel.  But then... you came, so I figured... the thing is... the thing is...", " Yes.  The thing is... I have to go away today but I wondered, if I didn't, whether you might let me see you a bit... or, a lot maybe... see if you could... like me again.", " You expect me to tell the truth about my life to the most indiscreet man in England?", " Is that right?", " I can't say I know Patrick all that well.", " Well, no -- I'm sure he was friendly -- to Demi Moore -- who acted with him in 'Ghost.'", " That's fine.  There's always a pause when the jury goes out to consider its verdict.", " ... Yes, that's fine.  Of course. I... you know... of course... I'll just... be getting along then... nice to see you.", " I see. That reality is a real 'no,' isn't it?", " Okay.  Fine.  Fine.  Good decision.", " The fame thing isn't really real, you know.  Don't forget -- I'm also just a girl.  Standing in front of a boy. Asking him to love her.", " Bye.", " No time at all.  I fly out tonight.", " Absolutely not.", " It's really not my business any more. Though I will say, from my experience, that rumours about Jeff... do tend to be true.", " He was just a friend -- I think we're still friends.", " I hoped there might be -- but no, I'm assured there aren't.", " No, let him... ask away.  You were saying?", " Yes, I'm pretty sure I would.", " Indefinitely."], "THIEF": [" Yes.", " What?", " So?", " What book?", " I haven't got a book down my trousers.", " Okay -- what if I did have a book down my trousers?", " Excuse me.", " Can I have your autograph?", " Rufus.", " What does it say?", " Nice one.  Would you like my phone number?"], "MICHAEL": [" Smile.", " Smile.", " Okay in about 7 seconds, I'm going to ask you to marry me."], "MR. SMITH": [" Do you have any books by Dickens?", " On right.  How about that new John Grisham thriller?", " Oh right.  Have you got a copy of 'Winnie the Pooh'?", " Right.  Sorry."], "RITZ MAN (V.O.)": [" May I help you, sir?"], "RITZ MAN": [" I'm sorry, we don't have anyone of that name here, sir.", " Yes, sir.  I have him in my mind.", " I'll put you right through, sir.", " No, sir.", " No, sir.", " No, sir.", " There was a Miss Pocahontas in room 126 -- but she checked out an hour ago.  I believe she's holding a press conference at The Savoy before flying to America."], "ANNA (V.O.)": [" Hi.", " You played it pretty cool here, waiting for three days to call.", " Oh -- Okay.", " Yeh -- unfortunately, things are going to be pretty busy, but... okay, let's give it a try.  Four o'clock could be good.", " Come in."], "TARQUIN": [" Three.", " Yes.", " Marvellous.  'Close Encounters' meets 'Jean De Forette.'  Oscar- winning stuff.", " 'Time Out.'", " You've brought her flowers?", " I'm sorry.  Which hospital?", " Oh sure.  Of course.", " How was she?", " Wait a minute -- she took your grandmother's flowers?"], "KAREN": [" Hello, I'm Karen.  Sorry -- things are running a bit late.  Here's the thing...", " What did you think of the film?", " I'm sorry I didn't get down what magazines you're from.", " Great.  And you...", " Okay -- take a seat.  I'll check.", " Mr. Thacker.", " You've got five minutes.", " If you'd like to come with me we can rush you through the others.", " Mr. Thacker's from 'Horse and Hound.'", " Mr. Thacker?", " Have you got a moment?", " Come and have a look...", " Are you a fan of Henry James?", " This is Harry -- he'll give you a pair of headphones so you can hear the dialogue."], "JEREMY": [" Everything okay?", " And you are from 'Horse and Hound' magazine?", " Do remember that Miss Scott is also keen to talk about her next project, which is shooting later in the summer.", " Time's up, I'm afraid.  Sorry it was so short.  Did you get what you wanted?", " Maybe time for one last question?", " Yes... You -- Dominic.", " Which is why we have to round it up now. Final questions.", " Yes, the gentleman in the pink shirt.", " No, it's just one question per person.", " Dominic -- if you'd like to ask your question again?"], "MALE LEAD": [" Please to meet you.  Did you like the film?", " Well, fire away.", " I did.", " Well, you tell me which bit you liked most -- and I'll tell you if I enjoyed making it."], "INTERPRETER": [" Te identicaste con el personaje que interpretabas?", " No.", " Por que no?", " Because he is playing a psychopathic flesh-eating robot."], "FOREIGN ACTOR": [" No.", " Porque es un robot carnivore psicopata."], "GIRL": [" No -- it's my 22nd.", " Working with Leonardo.", " Di Caprio."], "MAX": [" He's bringing a girl?", " Does the girl have a name?", " Christ, what is going on in there?", " Oh God.", " Come on in.  Vague food crisis.", " Okay.  Crisis over.", " Hello, Anna ahm... Scott -- have some wine.", " Hi.", " Yes, Happy Birthday.", " Look, your brother has brought this girl, and ahm...", " That'll be Bernie.", " Hello, Bernie.", " Bernie -- this is Anna.", " You haven't slept with her, have you?", " 'No comment' means 'yes.'", " Do you ever masturbate?", " You see -- it means 'yes.'", " Right -- I think we're ready.", " Having you here, Anna, firmly establishes what I've long suspected, that we really are the most desperate hot of under- achievers.", " I'm not saying it's a bad thing, in fact, I think it's something we should take pride in.  I'm going to give the last brownie as a prize to the saddest act here.", " You see -- and unless I'm much mistaken, your job still pays you rather a lot of money, while Honey here, she earns nothing flogging her guts out at London's seediest record store.", " You see -- incredibly sad.", " Well, I don't know.  Look at William.  Very unsuccessful professionally.  Divorced.  Used to be handsome, now kind of squidgy around the edges -- and absolutely certain never to hear from Anna again after she's heard that his nickname at school was Floppy.", " I think you do, yes.", " I'm sorry?  You think you deserve the brownie?", " Nah!!!  Nice try, gorgeous -- but you don't fool anyone.", " I'm delighted.", " Now you're lying.", " No!", " You didn't know she had a boyfriend?", " Let's face facts.  This was always a no-go situation.  Anna's a goddess and you know what happens to morals who get involved with the gods.", " Every time.  But don't despair -- I think I have the solution to your problems.", " Her name is Tessa and she works in the contracts department.  The hair, I admit, is unfashionable frizzy -- but she's as bright as a button and kisses like a nymphomaniac on death row.  Apparently.", " Now -- try.", " Tessa -- this is Bella my wife.", " And this is William.", " Keziah -- some woodcock?", " I don't realize that.", " Thank you.  I'm sorry about the lamb.", " Well?", " That's not fair.", " Is it someone we know?", " Any more announcements?", " There's an understatement.  There are dead people on better form.", " So -- you've laid the ghost.", " Don't give a damn about the famous girl.", " Which means you won't be distracted by the fact that she's back in London, grasping her Oscar, and to be found filming most days on Hampstead Heath.", " So not over her, in fact.", " Absolutely.  Never trust a vegetarian.", " If anyone gets in our way -- we have small nuclear devices.", " Where's Bella?", " Sod that.  Bernie -- in the back!", " Come on, babe.", " Down Kensington Church Street, then Knightsbridge, then Hyde Park Center.", " Stop right there!  I will decide the route.  All right?", " James Bond never has to put up with this sort of shit.", " Go!"], "BELLA": [" Miracles do happen.", " He wouldn't say.", " Hiya -- sorry -- the guinea fowl is proving more complicated than expected.", " Don't even ask.", " Hi.  Good Lord -- you're the spitting image of...", " Right.", " Oh, it's just down the corridor on the right.", " Quickly, quickly -- talk very quickly what are you doing here with Anna Scott?", " Yes.", " Yup.", " What do you think of the guinea fowl?", " Oh God.", " On the other hand, her best friend is Anna Scott.", " And most of her limbs work.  Whereas I'm stuck in its thing day and night, in a house full of ramps. And to add insult to serious injury -- I've totally given up smoking, my favorite thing, and the truth is... we can't have a baby.", " C'est la vie... We're lucky in lots of ways, but... Surely it's worth a brownie.", " And you.  I'll wait till you've gone before I tell him you're a vegetarian.", " That's right.", " And?", " Still loves you though.", " I never fancied you much actually...", " I mean I loved you -- you were terribly funny.  But all that kissing my ears...", " Do you want to stay?", " I have a little speech to make -- I won't stand up because I can't... be bothered. Exactly a year ago today, this man here started the finest restaurant in London.", " Unfortunately -- no one ever came to eat here.", " And so much face the fact that from next week, we have to find somewhere near to eat.", " I just want to say to Tony -- don't take it personally.  The more I think about things, the more I see no rhyme or reason in life -- no one knows why some things work out, and some things don't -- why some of us get lucky -- and some of us...", " No!", " I'm really horribly drunk.", " Good decision.  All actresses are mad as snakes.", " This painting isn't the original, is it?", " Where are you going?", " Crazy.  Go along Bayswater...", " He's with me.", " Writing an article about how London hotels treat people in wheelchairs."], "HONEY": [" Hi guys. Oh holy fuck.", " Oh God this is one of those key moments in life, when it's possible you can be really, genuinely cool -- and totally and utterly adore you and I think you're the most beautiful woman in the world and more importantly I genuinely believe and have believed for some time now that we can be best friends. What do you think?", " Oh my God.  You gave me a present. We're best friends already.  Marry Will -- he's a really nice guy and then we can be sisters.", " I'll show you.", " I don't believe it.  I walked into the loo with her.  I was still talking when she started unbuttoning her jeans... She had to ask me to leave.", " Nonsense.  I fancy you.  Or I did before you got so far.", " Yes.  And I don't have hair -- I've got feathers, and I've got funny goggly eyes, and I'm attracted to cruel men and ... no one'll ever marry me because my boosies have actually started shrinking.", " That's true, I can't deny it.  She needs me, what can I say?", " Really?", " I'm so sorry about the loo thing. I meant to leave but I just... look, ring me if you need someone to go shopping with.  I know lots of nice, cheap places... not that money necessarily... Nice to meet you.", " Have we got something for you. Something which will make you love me so much you'll want to hug me every single day for the rest of my life.", " The phone number of Anna Scott's agent in London and her agent in New York. You can ring her.  You think about her all the time -- now you can ring her!", " It is great, isn't it.  See you tonight. Hey, Marty-- sexy cardy.", " Since it's an evening of announcements ... I've also got one, Ahm... I've got engaged.", " I've found myself a nice, slightly odd looking bloke who I know is going to make me happy for the rest of my life.", " Yes.  I will keep you informed.", " By the way -- it's you.", " Yes.  What do you think?", " Good move: when all is sad and done, she's nothing special.  I saw her taking her pants off and I definitely glimpsed some cellulite down there.", " William has just turned down Anna Scott.", " She's not coming.", " That's right -- then Park Lane.", " You're my hero.", " Run!", " It was good."], "BERNIE": [" I'm sorry I'm so late.  Bollocksed up at work again, I fear.  Millions down the drain.", " Hello, Anna.  Delighted to meet you.", " Honey Bunny -- happy birthday to you. It's a hat.  You don't have to wear it or anything.", " So tell me Anna -- what do you do?", " Splendid.  I'm actually in the stockmarket, so not really similar fields, though I have done some amateur stuff -- P.G. Wodehouse, you know -- farce, all that.  'Ooh -- careful there, vicar.'  Always imagined it's a pretty tough job, though, acting. I mean the wages are a scandal, aren't they?", " I see friends from university -- clever chaps -- been in the business longer than you -- they're scraping by on seven, eight thousand a year. It's no life.  What sort of acting do you do?", " Oh splendid.  Well done.  How's the pay in movies?  I mean, last film you did, what did you get paid?", " Right.  Right.  So that's... fairly good.  On the high side... have you tried the nuts?", " Anna Scott?", " The movie star?", " Oh God.  Oh God.  Oh Goddy God.", " Shame!", " Well, obviously it's me, isn't it -- I work in the City in a job I don't understand and everyone keeps getting promoted above me.  I haven't had a girlfriends since... puberty and, well, the long and short of it is, nobody fancies me, and if these cheeks get any chubbier, they never will.", " No.  Not true...", " Love your work.", " ... get fired.", " Yes, they're shifting the whole outfit much more towards the trading side --and of course... I was total crap.", " But she said she wanted to go out with you?", " That's nice.", " Well, you know, anybody saying they want to go out with you is... pretty great... isn't it...", " And we intend to use them!", " Or you could go right down to Cromwell Road, and left.", " Bloody hell, this is fun.", " We have lift off!!"], "(more)": ["", "", ""], "ANNA (cont'd)": [" I've had a sequence of not nice boyfriends -- one of whom hit me: an every time my heart gets broken it gets splashed across the newspapers as entertainment. Meantime, it cost millions to get me looking like this...", " ...well, I was poor and it happens a lot -- that's not an excuse -- but to make things worse, it now appears someone was filming me as well.  So what was a stupid photo-shoot now looks like a porno film. And well... the pictures have been solid and they're everywhere.", " Well, yesterday was our last day filming and so I'm just off -- but I brought you this from home, and..."], "LAWRENCE": [" No - No- No!  Give me Anna Scott any day.", " Don't really care what the film are like.  Any film with her in it -- fine by me.", " Meg Ryan.", " Whatever, she's so clearly up for it.", " You know -- some girls, they're all \"stay away chum\" but Anna, she's absolutely gagging for it.  Do you know that in over fifty percent of languages the word for \"actress\" is the same as the word for \"prostitute.\"", " And Anna is your definitive actress -- someone really filthy you can just flip over...", " Can I help you?", " Oh sod off, mate.  What are you, her dad?", " Oh my God...", " No, look, I'm sorry..."], "GERALD": [" I didn't like that last film of hers. Fast asleep from the moment the lights went down.", " No -- not my type at all really.  I prefer that other one -- blonde -- sweet looking -- has an orgasm every time you take her out for a cup of coffee.", " Drug-induced, I hear -- I believe she's actually in rehab as we speak.", " You prick."], "JEFF (V.O.)": [" Who is this?"], "JEFF": [" How you doing?  I thought you guys all wore those penguin coats.", " Oh great.  Could you do me a favor and try to get us some really cold water up here.", " Still, not sparkling.", " Unless it's illegal in the UK to serve liquids below room temperature: I don't want you going to jail just to satisfy my whims...", " And maybe you could just adios the dishes and empty the trash.", " I'm sorry.  Is this a problem?", " What's your name?", " Thank you, Bernie. Hey -- nice surprise, or nasty surprise?", " Liar. She hates surprises.  What are you ordering?", " Well, don't over-do it.  I don't want people saying.  \"There goes that famous actor with the big, fat girlfriend.\""], "TESSA (V.O.)": [" I got completely lost -- it's real difficult, isn't it?  Everything's got the word 'Kensington' in it -- Kensington Park Road, Kensington Gardens, Kensington bloody Park Gardens..."], "TESSA": [" Oh hello, you're in a wheelchair.", " Hello William.  Max has told me everything about you.", " Oh yes please.  Come on, Willie, let's get sloshed."], "KEZIAH": [" No, thank you", " We believe that fruits and vegetables have feels so we think cooking is cruel.  We only eat things that have actually fallen from the tree or bush -- that are, in fact, dead already.", " Have been murdered, yes."], "ROSIE": [" Delicious coffee.", " No -- I thought it was really, you know, interesting.", " Really inedible -- yes that's right.", " Maybe we'll meet again some time."], ".... magnificent...": [""], "TONY": [" Thank you very much.", " A tiny hiccough.", " So we go down together!  A toast to Bernie -- the worst stockbroker in the whole world!", " Never met her, never want to."], "SECURITY": [" Can I help you?", " Does she know you're coming?", " I'm afraid I can't really let you through then, sir.", " ... can't let you through."], "THIRD": [" Anna."], "HARRY": [" Here we go.  The volume control is on the side.", " Anytime."], "JAMES": [" We are living in cloudcuckooland -- we'll never get this done today.", " Oh, stop showing off.", " God, that's an enormous arse.", " No, but seriously -- it's not fair -- so many tragic young teenagers with anorexia -- and that girl has an arse she could perfectly well share round with at least ten other women -- and still be beg- bottomed.", " 'Tomorrow will be soon enough.'", " Who was that rather difficult chap you were talking to on the way up?"], "ALL": [" All right."], "MAN AT SAVOY": [" Are you an accredited member of the press?", " That's a Blockbuster video membership card, sir.", " I'm sorry, sir...", " And you are?", " Of course, madam.  It's in the Lancaster Room.  I'm afraid you're very late."], "QUESTIONER 1": [" How much longer are you staying in the UK then?", " Yes -- Anna -- how long are you intending to stay here in Britain?"], "QUESTIONER": [" Is your decision to take a year off anything to do with the rumours about Jeff and his present leading lady?"], "QUESTIONER 2": [" Do you believe the rumours?"], "QUESTIONER 3": [" Last time you were here, there were some fairly graphic photographs of you and a young English guy -- so what happened there?"], "OTHER JOURNALIST": [" His name is Thacker."]}