{"scenarios": ["FADE IN:", "EXT. HOLLYWOOD BLVD. - NIGHT", "It is after twelve on a cold spring night.", "An old yellow Mustang pulls along side the curb of a rundown", "section of Hollywood Blvd.  The passenger door opens and VIVIAN", "steps out.  She quickly shuts the door and walks away from the", "car as if it wasn't there.  The Mustang drives off.", "Vivian lights up a cigarette and takes a drag.  Blond, in a skin", "tight mini-skirt, she moves gracefully on spiked heels across", "the sidewalk.  Her eyes scan passing cars for any indication of", "interest in her.  At first glance she is just another Hollywood", "street hooker.", "But as we look closer we see that she is young, twenty two years", "old, and too pretty and healthy to have been on the street for", "long.  Heavy make-up gives her face an older, harder look, but", "her bright eyes indicate that she is not quite as tough and", "confident as her street swagger makes her appear.", "She passes by a vagrant, huddled in a building doorway.  Across", "the street a BLACK PROSTITUE strolls by, rubbing her shoulders", "against the cold.  At a fast food stand several DRUG DEALERS are", "talking and eating.  In the distance we hear the sound of police", "helicopters.", "She nears a bright yellow all night coffee shop.  Half a dozen", "people sit at the dirty white tables inside.  She spots someone", "through the plate glass window and tosses her cigarette away,", "annoyed.  She goes inside.", "INT. COFFEESHOP — NIGHT", "Behind the counter two young CHINESE MEN fry food, listening to", "Chinese disco music on a large ghetto blaster resting on the", "counter.  They wave to Vivian as she comes in and she waves", "back.", "She crosses over to a table where KATE sits, wolfing down", "chicken fried steak and mashed potatoes.", "Kate is at least two years younger than Vivian but many more", "years on the street have made her look older and tougher.", "Dressed in a tight skirt with obviously bleached blond hair,", "Kate is almost like a Dorian Gray painting of Vivian——of what", "she might become in a few years.", "Kate continues chewing, unconcerned.  She reaches into her bra", "and draws out a small wad of twenty dollar bills.  She lets", "Vivian glance at them and then discreetly tucks them away.", "Kate picks up another forkful of food.", "EXT. HOLLYWOOD BLVD. — LATER", "Vivian and Kate stroll down the street together.", "A car approaches slowly and Vivian eyes it questioningly.  It", "passes without stopping.  She turns back to Kate.", "They continue down the sidewalk and cross in front of a dark", "alley.  Inside the alley are TWO MEN in the midst of some kind", "of skuffle.  Suddenly one strikes the other across the face with", "such a loud crunch that we wonder if the other has had his neck", "broken.  He falls limp.", "Vivian stares wide eyed, but Kate quickly drags her off.", "They pick up their pace down the street.  Vivian wraps her arms", "around her shoulders, suddenly cold.", "EXT. FAST FOOD STAND - NIGHT", "Vivian stands off to the side as Kate finishes talking to a", "Latino DRUG DEALER.  She joins Vivian.", "They head down the street toward home.", "Vivian hears a car coming up behind them.  She glances over her", "shoulder and sees a sleek black Mercedes slowing.", "The Mercedes pulls up past them and stops.  It backs up a bit", "and the window electronically rolls down.  Vivian is about to", "head for it when Kate stops her.", "Kate isn't happy about the delay, but she waits as Vivian", "approaches the car.", "Vivian leans over the passenger window.  In the driver's seat is", "EDWARD HARRIS, a good—looking, well—groomed man in his early", "forties.  He is wearing an expensive suit and tie.", "Vivian looks back at Edward, giving him one last chance.  She", "puts her hand on her hip, opening her jacket and making it clear", "she isn't wearing a bra under her thin tee-shirt.", "Vivian sighs, disappointed by what she hoped would be an", "expensive trick.", "He reaches into his jacket and pulls out a clip of money.", "Vivian eyes it, very interested.  He peels off a twenty and", "holds it out to her.", "Vivian snatches it.", "Her persistence causes Edward to falter a bit.  She's a", "beautifully tempting woman.", "She shows him a health clinic card and Edward looks at it and", "then back at her.  He admires her for a moment, considering.", "Vivian walks over to Kate's side.", "Vivian pats Kate affectionately on the shoulder.", "Vivian gets inside the Mercedes.  Kate watches as it drives off.", "INT. MERCEDES — NIGHT", "Vivian sits comfortably in the warm leather seat.  She finds the", "ashtray on the dash and lights a cigarette with the car lighter.", "She looks at Edward curiously as he drives.  Edward occasionally", "glances at Vivian, still debating as to the wisdom of this", "encounter.", "Vivian, squelched, takes a drag from her cigarette.", "EXT. BEVERLY HILLS — NIGHT", "The Mercedes glides through the streets of Beverly Hills.", "INT. MERCEDES — NIGHT", "Edward gestures toward the back seat.", "EXT. BEVERLY/WILSHIRE HOTEL PARKING LOT — NIGHT", "Thousands of tiny white lights sparkle along the walls of the", "Beverly Wilshire Hotel.  Bright flags are illuminated by", "carefully placed spotlights.", "The Mercedes has stopped in a valet parking lane.  A VALET opens", "the passenger door and Vivian, bundled up in Edward's overcoat,", "steps out.  Edward hands the keys to ANOTHER VALET.", "A DOORMAN opens the huge glass door for Vivian and Edward.  They", "go inside.", "EXT. LOBBY OF THE BEVERLY/WILSHIRE HOTEL — NIGHT", "The lobby is bright and spacious, filled with thick carved wood", "paneling.  Even at this hour there is a great deal of activity.", "Men in business suits and women in furs and jewels are passing", "by.", "Vivian's face tries to conceal the awe that she feels at the", "sight of all this luxury.  Edward is perfectly at home.  He", "places one hand on Vivian's elbow and guides her through the", "lobby as gracefully as he drives his Mercedes.", "They reach the elevators and go inside.", "INT. ELEVATOR — NIGHT", "The young NIGHT ELEVATOR OPERATOR is dressed in a clean red", "uniform that seems just a bit too tight.  As the elevator doors", "close he nods toward Edward.", "The tone of the Night Operator's voice indicates that Edward", "will not have to tell him again.  He will remember Edward.", "There is only one penthouse.", "INT. HALLWAY — NIGHT", "Edward and Vivian come out of the elevator into a hallway", "leading to a single doorway with two heavy wood doors.  Edward", "pulls out his key and unlocks the door.  With a gentle push the", "doors open in unison.", "Edward gestures to Vivian to go inside.  She does.  Edward", "closes the doors behind them.", "INT. PENTHOUSE — NIGHT", "As Vivian steps into the room she has the sensation of falling", "off the top of the building.  In front of her is a sunken living", "room with massive windows revealing the sparkling lights of the", "city below.  She is speechless.", "Edward is quite at home.  He walks past her down the steps to", "the living room.  The living room is filled with museum quality", "art deco furniture, all rose and gray and lavender.  On one of", "the walls is a relief of stylized Egyptian figures.  He picks up", "a phone.", "Vivian still stands motionless by the front door.  Edward looks", "up at her, a trademark half smile drifting to his face.", "Vivian says nothing.  She makes her way down the steps to the", "living room, her legs a little weak.", "Vivian looks at Edward, her awe giving way to a cynical sneer.", "Edward laughs.  He sits down in a comfortable chair and leans", "back.", "Vivian paces through the room, still hypnotized by the view, but", "recovering quickly.", "Edward loosens his tie.", "A chime goes off to indicate there's someone at the front door.", "He starts to get up.  Vivian motions for him to stay put.", "Edward sits back down.  Vivian waltzes up the steps and opens", "the front door.  A WAITER comes into the room with a silver", "cart; on it is a bottle of champagne in ice and a covered bowl.", "The Waiter carries it down the steps and sets it in the middle", "of the living room.", "The Waiter heads back up the stairs and pauses near Vivian.", "Vivian stares back at him.", "The Waiter glances away uncomfortably and exits.  Vivian closes", "the door behind him.  Vivian marches back down the stairs.", "Edward stands up and crosses to the silver stand.  He lifts the", "lid on the bowl to reveal a dozen enormous strawberries.  He", "eats one.  He twirls the champagne bottle in the ice bucket and", "then gracefully lifts it out.", "Edward deftly pops the cork on the bottle without losing a drop", "of champagne.", "Edward pours the champagne into a single long—stemmed glass and", "hands it to Vivian.", "Edward drops the champagne bottle back in the bucket.  Vivian", "holds the glass awkwardly.", "Vivian takes a sip from the glass.", "Vivian eats a strawberry and then washes it down with the", "champagne.", "Edward's face sours.", "Vivian takes another sip and smiles wickedly.", "Edward isn't sure if he finds that funny.  Vivian senses that", "she's touched a nerve.", "Vivian downs the last of her glass.", "INT. BEDROOM — NIGHT", "Edward turns on a light, revealing that the bedroom has been", "decorated in keeping with the art deco theme of the penthouse.", "Another large relief, this one of prancing unicorns, is mounted", "over the bed.  The bed itself is enormous and covered with gray", "satin sheets and a rose comforter.", "Edward walks over to the bed and picks up a mint lying on the", "pillow.  He tosses it to Vivian.", "Vivian catches it, unwraps it and pops it in her mouth.", "He reaches into his jacket and pulls out a money clip.  He takes", "five fifties from it and hands them to her.  It doesn't appear", "to diminish the size of the clip.", "Vivian stuffs the money into a tiny pocket in her skirt.", "She gives him a kiss on the cheek.  Edward attempts to kiss her", "on the lips but she pulls back.", "She steps back and quickly takes off her jacket.  She slips out", "of her shoes.", "She removes her skirt and shirt.  Naked but for a pair of black", "panties, she sits down on the floor and carefully lays her", "clothes out on the carpet, smoothing them down so they won't get", "wrinkled.", "Edward sits on the bed and watches her, fascinated.", "She stands and walks to Edward, giving him a quick peck on the", "cheek.  She undoes his tie and pulls it from his shirt.  Edward", "grabs her wrists, firmly, but gently.", "Guiding her by the wrists, Edward slowly pushes her back onto", "the bed.  He releases her and settles in beside her.  He runs a", "finger across her thighs.", "Vivian lies back on the bed, bored.  Edward's fingers pet her", "stomach.  Vivian winces.", "Edward smiles and touches her stomach again.  Vivian sits up", "quickly.", "Vivian pushes Edward back onto the bed.  She unbuttons his", "shirt.", "Edward laughs uneasily.  Vivian undoes his pants.", "Vivian slips off the bed and walks to the light switch.  She", "turns it off.", "In the faint light that leaks through the cracks in the door, we", "see her return to Edward.  She lies on top of him and kisses him", "on the cheek.  Edward wraps his arms around her.", "They make love.", "INT. BATHROOM SHOWER — NIGHT", "A spray of water comes down upon Vivian as she washes her face", "carefully, trying to keep the water from her hair.  She picks up", "some soap and scrubs herself clean.", "She turns off the shower, picks up a towel, and quickly dries", "herself.  She feels better.", "INT. BEDROOM — NIGHT", "Vivian is sitting on the floor picking up her clothes.  Edward", "slides over on the bed to see her.", "Vivian sighs.", "Vivian stares at Edward for a moment.  She is tired.  She walks", "over to the bed, unhappily.", "EXT. BEVERLY WILSHIRE HOTEL — MORNING", "The sun is coming up as a HOTEL EMPLOYEE hoses down the sidewalk", "in front of the hotel.", "INT. HOTEL LOBBY — MORNING", "A WOMAN EMPLOYEE is vacuuming the lobby.  She sees something and", "pauses.  She pulls a dead leaf from one of the potted plants.", "INT. HALLWAY — MORNING", "The elevator doors open and A WAITER rolls a cart out into the", "hallway.  He takes it to the doors of the penthouse.  He rings", "the bell.", "INT. PENTHOUSE LIVING ROOM — MORNING", "The Waiter carries in a tray of food, a bottle of champagne, and", "orange juice.  Edward, dressed in silk pajamas and a black", "velvet robe, stands in the living room talking into a cordless", "phone.", "Edward points the Waiter to the dining table.", "The Waiter sets down the tray and returns.  Edward picks up his", "wallet from an end table and hands the Waiter a five dollar", "bill.  The Waiter nods and exits.", "Edward walks over to the dining table and lifts one of the tray", "covers.  Inside is a gourmet breakfast.", "She's hung up on him.  Edward slams the phone down on the table.", "He takes a deep breath to calm himself.  He pours a glass of", "orange juice and takes a sip.  Still agitated, he crosses", "through the living room to the bedroom door.", "INT. BEDROOM — MORNING", "Vivian is asleep in the bed.  She is not a light sleeper.  Her", "body is in an awkward position and her mouth is frozen half open", "on her tranquil face.  She looks young and childlike.", "Edward stares down at her for a moment.  He sips his orange", "juice.  He is thinking again.  Making a decision.", "Vivian stirs roughly.", "Vivian's eyes open painfully and she squints at Edward.  She", "shakes her head, trying to wake up.", "Edward picks up his shirt from the night before and tosses it to", "her.", "INT. DINING TABLE IN LIVING ROOM — MORNING", "Vivian wears Edward's shirt as they sit at the dining table.", "Edward dishes out some food and sets it in front of her.", "Edward pulls the champagne bottle from its bucket.", "He deftly pops the cork.", "Edward fills a third of the glass and tops it off with orange", "juice.", "Vivian reluctantly takes the glass.", "Vivian swallows some orange juice.", "She picks up a fork and starts examining the food on her plate.", "Edward begins to eat.", "She eats a forkful.", "She takes another sip.", "Vivian is wolfing down her food hungrily.", "She finishes off her glass and refills it, favoring the", "champagne.", "Edward pours himself some more orange juice.", "The thought of all that money is starting to warm Vivian's", "voice.", "Edward smiles.", "Vivian smiles awkwardly.", "Vivian silences herself.  She could really use the money.  She", "looks at Edward levelly.", "Edward studies her for a moment.", "INT. BATHROOM — MORNING", "Vivian is stretched out in a hot bubble bath.  Her face shows", "almost orgasmic pleasure.  She starts to laugh.", "Gloating, she lies back and sinks down into the warm bubbly", "water and disappears.", "She pops back up, shakes out her hair and laughs again.", "Edward comes into the bathroom and stands by the door, watching", "her laugh.  He has just finished dressing and is doing his tie.", "Edward reaches into his wallet and pulls out his American", "Express Gold Card.  He sets it down on the sink.", "Edward walks over and kisses her on the cheek.", "Edward smiles and exits.  Vivian relaxes back in her tub.", "INT. LIVING ROOM — DAY", "Vivian is back in her street clothes, lounging about on an art", "deco couch, talking on the cordless phone.", "We hear Kate's voice on the other end of the phone.", "Vivian presses a button to hang up and sets the phone down on", "the table.  She leans back in the couch, happy and comfortable.", "She pulls the American Express card from her pocket and admires", "it.", "INT. HALLWAY - DAY", "Vivian is dressed in her street clothes, without the black", "stockings, white coat or heavy makeup.  She doesn't look quite", "so much like a hooker, but she's not all together respectable", "either.", "She is waiting for the elevator.  When the doors open she", "saunters inside.", "INT. ELEVATOR - DAY", "The DAY ELEVATOR OPERATOR, a blond haired Aryan youth in his", "late twenties, is standing by the controls as Vivian comes in.", "He notices her out of place attire with displeasure.", "The elevator starts down.", "The Operator eyes her distastefully.", "Vivian smiles awkwardly at him.  He doesn't return it.  Her", "smile fades.  The elevator reaches the bottom floor and the", "doors open.", "Vivian hesitantly steps out into the lobby and glances back at", "the operator, wondering why he is acting so cold.", "INT. LOBBY - DAY", "Vivian gets strange looks from the hotel employees and customers", "as she walks through the lobby.", "She begins to feel very uncomfortable as she finally makes it to", "the front door.  She hurries outside.", "EXT. HOTEL - DAY", "Vivian comes out on to Wilshire Blvd. and looks around.  She is", "much less confident and excited then she was before.  She's", "feeling a little lost in this strange place.", "She crosses the street and heads for the shops on Rodeo Drive.", "EXT. RODEO DRIVE - DAY", "Vivian passes by the windows, looking at all the expensive", "things inside.  Something about it all makes her jittery.", "She comes to a posh women's boutique.  She hesitates for a", "moment and then slowly enters.", "INT. BOUTIQUE — DAY", "Vivian is no sooner in the door than she is subject to the", "disapproving stare of a SALESWOMAN standing behind the counter.", "Vivian tiptoes through the shop as if it was filled with", "delicate glass objects.  She cautiously examines a dress.", "The Saleswoman, unhappy with Vivian's clothes, appearance, and", "voice, quickly comes around the counter and approaches her.", "Vivian eyes the Saleswoman suspiciously.  She's beginning to get", "the drift.  She points at a dress.", "Vivian's body tenses as she stares at the Saleswoman, violence", "in her eyes.", "Vivian is so angry and frustrated she is speechless.", "Vivian turns and stomps toward the door.  She stops and spins", "around staring at the Saleswoman incredulously.", "The Saleswoman says nothing.  Vivian flips her off.  She throws", "the door open and storms outside.", "The Saleswoman calmly strolls back to her counter and returns to", "her place.", "EXT. RODEO DRIVE — DAY", "Vivian comes out onto the street and stands, lost.  A MAN", "passes, eyeing Vivian as if she were a freak.  Vivian's face is", "red.  Her eyes water up to cry.  She takes a deep breath, trying", "to control herself.", "She looks up and down for another shop.  On the street, women in", "elegant designer outfits stroll by.  Vivian suddenly feels", "naked.", "She heads back toward the hotel.", "INT. HOTEL — DAY", "Vivian enters the lobby, nervous and paranoid.  She heads toward", "the elevators.  She feels an emptiness in her stomach at the", "sight of all the luxury around her.  Only this time she doesn't", "have Edward to guide her.", "MR. THOMAS, the prim, middle—aged hotel manager, spots her.  He", "crosses the room and deftly cuts her off from the elevator.", "Vivian stops, practically shaking with terror.", "Vivian's face is filled with terror.  She doesn't know his name.", "Her hands are trembling.", "The elevator doors open behind them.  She spots the operator.", "Mr. Thomas turns and eyes the Operator curiously.  The Operator", "looks back at them evenly.  With a smooth gesture Mr. Thomas", "waves the Operator over.", "The Operator looks at Vivian distastefully.", "The Manager's tone toward Vivian changes dramatically.  He waves", "the Operator away.", "He takes her arm firmly and leads her off.", "INT. HOTEL OFFICE — DAY", "In a richly furnished office, Mr. Thomas places Vivian in a", "comfortable chair and then leans against the edge of his desk.", "As he addresses her his voice is firm, but warm.  Fatherly.", "Vivian says nothing.", "Vivian finds herself nodding.", "Vivian nods.", "Vivian quickly pulls out her American Express card and hands it", "to him as if it somehow validates her actions.", "She can't go on.  Mr. Thomas politely glances at the American", "Express card and hands it back to her.  He sighs wearily.  The", "things he must do to keep his \"friends\" happy.", "He walks around his desk and picks up the phone.  He dials a", "number.", "He sets the phone down and smiles patronizingly at Vivian.", "INT. SAKS / SECOND FLOOR — DAY", "The elevator opens and Vivian walks out and surveys the room", "nervously.  She wanders toward the women's clothing section.", "BRIDGET, a large friendly woman, spots her.", "Vivian nods.", "Bridget leads Vivian into the racks of clothes.", "Vivian is silent for a while.", "Bridget holds up a brown designer dress.", "INT. SAKS — DAY", "Vivian is dressed in a beautiful pink pastel dress with fine", "white beading around the neck and shoulders and a tiny lace", "collar.  She stands in front of a mirror, studying it unhappily.", "The dress is very pretty, but somehow it doesn't quite work on", "her.", "Bridget approaches with a pair of matching shoes.", "Vivian kicks off her red spiked heels and steps into the shoes.", "She looks at herself in the mirror again, better but….", "Vivian holds up her hands in the mirror.  Her fingernails are", "painted a hideous shade of red that clashes with the pink.  Her", "big mane of blond hair seems out of keeping with the dress.", "INT. SAKS BEAUTY SALON — DAY", "Vivian, wearing the pink dress and shoes, carries her old", "clothes in a paper bag as she tip toes tentatively into the", "salon.  She is immediately greeted by THANE, a cheerful man with", "impeccable hair.", "Thane takes Vivian by the arm and leads her into the salon.", "They are met by YULE, a young man of about twenty with his long", "hair back in a pony tail.", "Thane and Yule exchange amused glances.  Thane takes Vivian to a", "salon chair and sits her down.  Yule immediately begins work on", "her hands.", "Thane firmly grabs Vivian by the chin and tilts her head one way", "and then the other, eyeing her professionally.  He then stares", "at her seriously.", "INT. SAKS BEAUTY SALON- LATER", "Vivian's hair is beautifully styled as she sits at a vanity", "mirror applying blush.  Thane approaches with some lipstick and", "sits next to her.", "He takes the blush from her hand and demonstrates in the mirror", "on his own cheek.", "Vivian takes the blush and under Thane's watchful eye she does", "her make-up.", "INT. SAKS COSMETIC COUNTER - DAY", "Vivian, in her new dress, shoes, hairstyle and make-up, stands", "in front of the cosmetic counter.  A COSMETICS SALESWOMAN stands", "in front of her as she reads from a small piece of paper.", "Vivian hands her the list.  The saleswoman looks at her,", "impressed.", "The remark catches Vivian off guard, but she likes the sound of", "it.  She smiles.", "EXT. WILSHIRE BLVD. — DAY", "Vivian walks down Wilshire, completely changed.  A pretty white", "hat is the final touch.  She looks lovely, perfect.", "She carries a bag containing her working clothes.  She stops at", "a trash can and throws the offending items away, hoping no one", "notices.", "She approaches the hotel and pauses.  Her eyes are drawn to the", "other side of the street: Rodeo Drive.  It seems ominous to her.", "She sucks in a breath and crosses the street.", "EXT. RODEO DRIVE — DAY", "Vivian walks up Rodeo Drive again.  Her manner is uneasy, but", "determined, as if forced to stroll down a dangerous street on a", "dare.  She is better armed this time, in a suit of impenetrable", "pink armor.", "She darts by the boutique that kicked her out, trying not to be", "seen by the saleswoman on the other side of the window.", "She continues on to another shop.  She takes a breath and", "enters.", "INT. ANOTHER BOUTIQUE — DAY", "Vivian strolls though the store, poker—faced but weak at the", "knees.  She stops at a dress and fingers it.", "ANOTHER SALESWOMAN comes up alongside her.", "Vivian turns at looks at the Saleswoman for a moment.  Blood", "flows back to her skin.  As if transformed into a new, confident", "woman, Vivian flashes a trademark Beverly Hills bitch sneer.", "EXT. RODEO DRIVE — DAY", "Vivian strolls up the street, carrying a clothing box.  Her step", "is lively, and her face has a trace of a snotty smile.  She is", "the object of admiring gazes by several businessmen.", "A well—dressed man passes by, smiling politely.  Vivian's nose", "lifts as she happily ignores him.  She heads for another shop.", "INT. BOUTIQUE #3 — DAY", "Vivian is in a dressing stall, tossing a dress outside to a", "NERVOUS SALESWOMAN.", "ANOTHER NERVOUS SALESWOMAN holds a long purple evening gown.", "EXT. RODEO DRIVE — DAY", "Vivian's arms are filled with clothing boxes and bags.  She has", "perfected her Beverly Hills sneer.  She owns this block.", "On her way back to the hotel she returns to the first boutique.", "Without a beat of hesitation she marches in.", "INT. BOUTIQUE — DAY", "Vivian, her hat partially obscuring her face from the", "Saleswoman, sails into the store carrying all her boxes and", "bags.  The Saleswoman smiles to herself.  Obviously a", "professional shopper.", "Vivian strides over to the dress she originally looked at.  She", "fingers it roughly.", "Vivian abruptly faces the Saleswoman and stares at her coldly.", "Vivian marches toward the front door.  She turns back to the", "Saleswoman, who is trying to remember who Vivian is.", "Vivian flips her off again, just to remind her.", "Vivian exits.  The Saleswoman stares after her.", "INT. BROKERAGE HOUSE — DAY", "Edward is being led through the corridors of a brokerage house", "by VANCE, a well—dressed young stockbroker.", "EXT. HELIPORT ON TOP OF SKYSCRAPER — DAY", "Edward and Vance come out of a doorway onto the rooftop of a", "large skyscraper.  There is a sleek corporate helicopter waiting", "on a landing pad.  Edward and Vance lower their heads as they", "fight through the wind generated by the rotor blades.", "As they near the helicopter, a young man in a business suit,", "JAKE, comes out to greet them.  They all have to shout over the", "sound of the engines.", "They all climb into the helicopter.  It takes off.", "EXT. PORT OF LOS ANGELES — DAY", "A helicopter flies over the port.", "INT. HELICOPTER — DAY", "They look over a huge shipyard as Jake describes it for Edward.", "Edward points toward one of the edges of the shipyard.", "Edward glares at Vance.", "Vance angrily turns on Jake.", "INT. BROKERAGE HOUSE MEETING ROOM — DAY", "Edward, Vance, and Jake enter a large meeting room.  Sitting at", "one end of a long conference table, piles of papers spread out", "before him, is WILLIAM, a crafty—looking lawyer with wire—rimmed", "glasses.  Edward smiles broadly upon seeing him.", "Edward gives Jake a friendly pat on the shoulder.", "Edward sits down next to William.  He glances back at the other", "two men.", "They exit.  William glances at Edward quizzically.", "EXT. BEVERLY WILSHIRE HOTEL — SUNSET", "Vivian's arms are packed with boxes and shopping bags as she", "strolls smugly through the hotel entrance.", "INT. BEVERLY WILSHIRE HOTEL — DAY", "She walks confidently through the hotel lobby, past the admiring", "gazes of several businessmen.  She enters the elevator.", "INT. ELEVATOR — DAY", "In the elevator, Vivian is gripping her packages like loot from", "a conquered city.  The Operator doesn't recognize her, in fact,", "he is impressed by her attire.  He starts the elevator up.", "The Operator does a double take.  Vivian smiles at him.", "They both eye each other.", "The doors open.  Vivian exits.  The Operator unhappily watches", "her go.", "INT. PENTHOUSE BEDROOM — SUNSET", "Vivian stands in front of the full length mirror studying", "herself.  She, too, can hardly recognize the person in front of", "her.  She strikes a series of \"classy\" poses, checking herself", "out.", "A chime goes off in the living room.  Vivian glances around,", "embarrassed for a moment.  She hurries into the living room.", "INT. PENTHOUSE LIVING ROOM — SUNSET", "The sun is setting through the glass windows of the penthouse,", "filling the room with a beautiful orange light.  Vivian hurries", "up to the front door.  She leans toward it suspiciously.", "Vivian slowly opens the door and peers into the hallway.  A", "MAID, in her mid-twenties, is standing there.", "Vivian stares at her blankly.  She isn't sure.", "She opens the door wide and the maid slowly enters.  She crosses", "to the bedroom and Vivian follows on her heels.", "INT. PENTHOUSE BEDROOM — SUNSET", "The maid enters the bedroom and turns down the bedspread under", "Vivian's watchful eye.  She turns back to Vivian.", "The maid starts to exit the room.", "The maid glances at the bed and then back at Vivian.  She", "shrugs.", "INT. HOTEL LOBBY — EVENING", "Edward steps to the front desk and catches the eye of a DESK", "CLERK.", "The Clerk hands Edward a few message slips and a telegram.", "Edward sorts through them.  He is tired and on edge.", "Mr. Thomas, standing on the other end of the desk, eyes Edward.", "He approaches and speaks in a low intimate voice.", "Edward continues looking through his messages.", "Edward and Mr. Thomas' eyes meet.  They are engaging in some", "sort of subtle power struggle.  A struggle that Edward intends", "to win.", "Mr. Thomas can't think how to respond.", "Mr. Thomas bows slightly and walks away.  Edward watches him go", "and turns back to the hotel Clerk, suddenly in a good mood.", "INT. PENTHOUSE LIVING ROOM — NIGHT", "Vivian stands in front of the glass windows staring out into the", "city reflectively.", "Edward comes in and tosses his message slips onto an end table.", "He looks up and sees Vivian turning toward him.  The new Vivian.", "A different woman.  His eyes widen.", "Edward comes down the steps to the living room, eyes focused on", "her, face blank.", "Vivian covers her nervousness with a quick anger.", "He tries to walk around her to admire her backside but she turns", "in place, facing him.", "Edward gives her a quick kiss on the cheek and sits down in a", "chair, exhausted.  He loosens his tie and uses one foot to try", "to slide the shoe off the other.  It's stuck.  He reaches down", "to untie the shoe, but before he can Vivian practically throws", "herself at his feet.", "Vivian kneels at his feet and unties his shoes.  She pulls them", "off and sets them down next to the chair.", "Edward takes Vivian's chin in one hand and raises her head.  He", "looks into her eyes.", "Vivian smiles brightly.  He releases her and relaxes in his", "chair.", "Vivian reaches over to the end table and picks up a pile of", "credit card receipts.", "Vivian jumps up, runs to the couch, and picks up a clothes box.", "She opens it to reveal a mint green dress.  She unzips her dress", "and pulls it off.  Underneath she is wearing a soft pink teddy.", "She starts to put on the green dress.", "Vivian stops pulling up her green dress.  She lets it drop to", "the floor and models the teddy.", "She steps out of the green dress and runs over to a bag", "containing some underwear.  She throws off the pink teddy and", "puts on the green one.", "The front door chimes.", "Vivian pulls on the mint green dress.  She zips it up and darts", "up the steps to the door.  She pulls the door open to reveal a", "BELLBOY with a tray of food.", "The Bellboy carries the tray to the table and returns to the", "door.  Without getting up from the chair, Edward hands him a", "five dollar bill as he passes.  After he has exited, Vivian", "shuts the door.", "Edward wearily gets up and walks over to the tray of food.  He", "pulls the champagne from the bucket and pops the cork.  He pours", "a glass for Vivian.  He opens the mineral water and pours some", "into a champagne glass.", "As Vivian comes down the steps Edward hands her the champagne.", "Vivian takes it.  Edward holds up his glass of water.", "They clink their glasses together.  Vivian takes a long swallow", "of champagne.", "Vivian moves over to another set of boxes.  She pauses and eyes", "Edward suggestively.", "Edward sits down.", "MONTAGE OF VIVIAN'S OUTFITS", "As Edward sits in the chair Vivian changes from outfit to", "outfit.", "She slides up to him in a sexy long white lace and silk", "nightgown.  She does a turn so he can see it.  He smiles.", "Vivian tosses the nightgown into his lap as she tries on", "something else.", "She takes a long sip from her champagne glass as she shows him a", "sexy pair of red tap pants and matching camisole.", "Edward refills her glass as she shows him a black corset and", "long stockings.", "Vivian tosses the stockings onto Edward.  He is accumulating a", "pile of lingerie on his lap.", "Vivian comes up to him in a short bright pink nightie.  Very", "drunk, she sits on his lap and finishes off the last of her", "champagne.  She lets the glass drop to the carpet and kisses", "him.", "INT. BEDROOM — NIGHT", "Edward carries a drunk Vivian into the bedroom and gently lays", "her out on the bed.", "Edward rolls her into the covers.", "He takes off his coat and shirt.", "Edward pulls off his pants and climbs into bed with her.  She", "pulls him into her arms and snuggles up to him drunkenly.", "Vivian's eyes light up.", "Edward looks into her lovely eyes.  Something about the", "sincerity of the question disturbs him.  He half-smiles.", "Pleased, she kisses him warmly on the neck.  Edward strokes her", "hair thoughtfully.", "Edward nods.", "INT. LIVING ROOM — EARLY MORNING", "Vivian and Edward eat breakfast at the dining table.  Vivian is", "dressed in one of her sexy nightgowns.", "Edward takes a sip of his orange juice and looks at Vivian", "sideways.", "He stands up and gives her a kiss on the cheek.", "INT. LIVING ROOM — DAY", "Edward, fully dressed, puts on his suit jacket as he crosses", "from the bedroom to the front door of the suite.  He pauses for", "a moment, smooths the panels of his jacket and turns to Vivian.", "She is still dressed in her nightgown.", "He exits.", "She opens a large cabinet in the wall that conceals a", "television.  She switches it on and lies down on the couch.", "INT. FINANCIAL FIRM CONFERENCE ROOM — DAY", "Edward and William sit across the table from a BATTERY OF", "INVESTMENT BROKERS.  In the center is CARL, an intense man in", "his mid-thirties with a bald head covered by a slightly off", "toupee.  All of them are dressed in almost identical blue and", "gray Brooks Brother's suits with red power ties.", "William explodes with intensity.", "The room quiets for a moment after Edward has spoken.  One of", "the other brokers speaks up.", "Edward stands.", "He exits, shutting the door behind him..  The room is silent.", "William shakes his head at the brokers.", "William exits.  The brokers glance at each other doubtfully.", "INT. LIMO - DAY", "William and Edward are sitting in the back of a limo.", "William looks at Edward and laughs.", "INT. LIVING ROOM — DAY", "Vivian is on the phone.", "INT. LIVING ROOM — DAY", "An empty plate that once held a hamburger sits on the dining", "room table.", "Vivian is stretched out on the couch.  She has been watching", "television for hours.  She flips through the channels using a", "remote control.  There's nothing on.", "She turns the television off.  She lays her head down on the", "couch and stares off into the distance, bored.", "INT. LOBBY — DAY", "Vivian comes out of the elevator wearing her mint green dress.", "She strolls though the lobby on her way to the hotel dry goods", "store.", "She spots Mr. Thomas.  With a wicked look on her face she walks", "up behind him and puts an arm on his shoulder.", "Mr. Thomas looks at her uncomfortably.", "She smiles brightly and saunters off.  Mr. Thomas watches her", "go, more amused than annoyed at her.", "INT. DRY GOODS STORE — DAY", "Vivian buys a pack of cigarettes.", "INT. LIVING ROOM — DAY", "Vivian sits in the living room smoking a cigarette.  It isn't", "satisfying.  She tears off the filter and takes a few drags.", "She sighs, bored and anxious.", "INT. HOTEL LOBBY — DAY", "Kate, looking out of place in jeans and a sweatshirt, wanders", "into the hotel lobby.  She glances around at the decor,", "cynically impressed.  She lights up a cigarette and casually", "saunters over to the elevator.", "INT. ELEVATOR - DAY", "The day Operator is not pleased with Kate's appearance.  He", "looks at her cooly as she comes inside.", "He presses a button and closes the door.", "INT. LIVING ROOM - DAY", "Vivian is dozing on the couch as the doorbell chimes.  She wakes", "up with a start.  The doorbell rings again, and again.", "Vivian crosses to the door and answers it.  She is surprised to", "see Kate on the other side.  As Vivian stands opened mouthed,", "Kate marches right past her and looks out the windows.", "Vivian quickly shuts the door.", "Kate starts to snoop around the room.  She barely looks at", "Vivian.  Vivian follows on her heels, nervous and watchful.", "Kate finds the mini-bar and opens the refrigerator.  She pulls", "out a beer and opens it.", "Kate takes a sip of beer and stares at Vivian.", "Kate looks at her beer and softens.", "Kate slugs down some more beer and scans the room.", "Kate shrugs.", "Kate nods.  She finishes her beer and looks at Vivian, sadly.", "INT. BEDROOM - DAY", "Vivian is proudly laying out all her new clothes on the bed.", "Kate looks at them, unable to conceal her growing jealousy.", "INT. LIVING ROOM - DAY", "Kate is hurrying toward the front door.  Vivian follows.", "Kate stops at the door.  Vivian stands nearby, feeling sorry for", "her friend.", "There is a moment of silence before Vivian answers.", "She crosses the room and takes the money out of her purse.  She", "slowly returns and hands it to Kate.", "She turns, opens the door and quickly exits.", "Vivian exhales a breath, both disappointed and relieved that", "Kate is finally gone.  She wanders back into the center of the", "room.  She sees the beer bottle that Kate left on the coffee", "table.  She picks it up and throws it away.", "INT. BROKERAGE HOUSE MEETING ROOM — DAY", "William and Edward are talking.", "A SECRETARY enters the room.  She hands Edward a slip of paper.", "He nods in thanks.  She exits.", "Edwards smiles.", "INT. LIVING ROOM — DAY", "Vivian is still looking out the windows pensively as the phone", "rings.  Vivian looks at it, unsure.  It rings again.  She", "debates whether to pick it up.  It rings again.", "Finally she picks it up.", "Vivian slowly sets the phone down.", "INT. DRESSING ROOM AT SAKS — DAY", "Vivian is in a private dressing room as Bridget helps her", "squeeze into a tight—fitting black evening dress.", "Bridget tugs upward on the sides of the strapless dress and", "shakes it a bit to get Vivian's breasts in place.", "Vivian sucks in and Bridget zips up the back.  Vivian steps over", "and looks at herself in a mirror.", "A sheepish look spreads across Vivian's face.", "Bridget shrugs.", "INT. HOTEL LOBBY — NIGHT", "With her hair done up and bound with a string of imitation", "diamonds, Vivian looks elegantly sexy in her black evening", "dress.  The only thing spoiling the picture as she waits in the", "lobby is the sloppy way she drags on a cigarette.", "She gets more than a couple of admiring glances from male hotel", "patrons.  She spots Mr. Thomas standing behind the check—in", "counter and crosses to him.", "Mr. Thomas smiles politely.", "Vivian puffs away on her cigarette.", "The ashes from Vivian's cigarette fall to the carpeted floor.", "Mr. Thomas winces.  He slides an ashtray toward her.", "She stashes out her cigarette in the ashtray.", "She spots Edward entering the lobby.  He gestures for her to", "come to him.", "She quickly crosses the lobby toward him.  As she does, her face", "sours as a thought comes to her.", "INT. REX RESTAURANT — NIGHT", "An array of different forks are neatly lined up on the", "tablecloth next to Vivian's salad plate.  She stares down at", "them.", "Edward sits next to Vivian.  He selects the last fork on the", "left of the plate and begins eating the salad.", "On Vivian's other side is JAMES KROSS, in his early 70's, a", "bulky self—made millionaire industrialist.  In his youth he was", "foreman in a steel mill and during World War II pioneered the", "use of welding instead of riveting in the construction of war", "ships.  But age is beginning to take its toll on him.  His skin", "is unhealthy looking and his large hands sometimes tremble when", "he speaks.", "He picks up the fork closest to his plate and starts to pick at", "the salad.", "Vivian glances back and forth between Kross and Edward's forks,", "trying to figure out which one she should use.  Does each person", "use a different one?", "Edward notices Vivian out of the corner of his eye.  She looks", "at him helplessly.  He studies her curiously.", "As he talks, Edward eyes Vivian and gently taps his finger to", "the empty spot where his fork had been.  Vivian gingerly picks", "up that fork from her setting.  Edward winks at her.  She starts", "to eat.", "Edward sets down his fork, abruptly stands, and places his", "napkin next to his plate.  He nods toward Vivian.", "Vivian has just stuffed her mouth full of salad.  She looks up", "at Edward confused.", "Vivian obediently stands, still clinging to her fork.", "Kross stands as well.  Edward stares at him coolly.", "Edward says nothing.  He starts to turn away.  Kross quickly", "turns toward Vivian.", "Vivian finishes chewing and swallows quickly.", "Edward looks over at Vivian with stern sympathy.", "Edward has never called her \"Viv\" before.  Vivian stares at him,", "unsure.  She doesn't know what to say, what he wants from her.", "She glances at Kross, who waits for her reply.", "Edward picks up his napkin and slowly sits.  Vivian and Kross", "sit.  Edward leans toward Kross and speaks to him in a low firm", "voice.", "Kross' hands tremble as he adjusts his napkin onto his lap and", "tries to calm down.", "As Kross talks, the WAITER comes by and checks their salads.", "Edward indicates that he's finished.  The Waiter begins", "collecting plates.  Vivian, though she's finished her salad, is", "still clinging to her fork.  The Waiter pauses at her side.  She", "sees him and sets down her fork.  He whisks the plate away.", "The Waiter returns with the next dish.  He sets a plate in front", "of each of them.  As they talk, Edward subtly lifts the correct", "fork and taps it to the table.  He half smiles at Vivian.", "Vivian, studiously watching his prompting, selects the correct", "fork.  They both begin to eat.", "Edward shakes his head.", "Kross sits quietly dazed.  Much as he would like to believe it", "is a lie, he knows Edward is telling the truth.", "Vivian half watches him as she eats from her plate.  Edward", "takes a bite of his food and then speaks smoothly.", "Kross shakes his head, amazed at Edward's arrogance.", "A MAITRE D' comes up and stands politely next to Edward.  Edward", "pauses and glances at him.", "The Maitre d' whispers in a low voice to Edward.  Edward nods", "and the Maitre d' exits.  Edward turns to Kross.", "Without waiting to see if he's excused, Edward stands and exits.", "Vivian and Kross sit quietly.  Vivian eats with her usual strong", "appetite.  Kross seems to be pondering some dilemma.  He stares", "at Vivian.  He knows he has been beaten, but it's difficult to", "take in front of this pretty young woman.", "Vivian stops eating.  Kross continues, his voice full of", "emotion.", "He shakes his head uncertainly.", "His eyes focus on Vivian.  She is moved by his speech.", "He is finished.  Vivian stares at him, frozen.", "Edward returns to the table.", "Kross stands up.", "Kross tosses his napkin into his plate and leaves.", "Edward sits down in his chair, calm and relaxed.  He takes a sip", "from his water glass.  He smiles brightly at Vivian and then", "laughs.", "Across the table Vivian stares at him unsmiling.", "A Waiter comes up.", "INT. HOTEL LOBBY — DAY", "Vivian seems disturbed and quiet as she and Edward return from", "dinner.  Edward, however, is in a good mood as he gentlemanly", "guides her through the hotel lobby.", "Vivian pauses before they reach the elevator.", "INT. GIFT SHOP — DAY", "Vivian stands in front of the counter.  Edward browses a", "magazine rack.", "The CLERK sets the cigarettes down on the counter.  Edward", "tosses him a couple of dollars.", "Edward pulls a woman's magazine from the rack and shows the", "cover to Vivian.  On it is a stunningly beautiful young woman.", "Vivian takes her cigarettes and stares at the cover.", "He tosses the magazine back onto the rack.  As they exit, Vivian", "glances back at the smiling face on the magazine.", "INT. HOTEL LOBBY — DAY", "Vivian lights up a cigarette as they come out of the gift shop.", "She doesn't look at Edward as they speak.", "Vivian exhales a puff of smoke.  They enter the elevator.", "INT. PENTHOUSE LIVING ROOM — NIGHT", "Vivian's face is cold and distant as she stares out of the glass", "window down at the city lights.  She quickly drains her", "champagne glass.", "Edward stands next to her.  He refills her glass with the bottle", "in one hand as he talks on the wireless phone with his other.", "Edward crosses the room and sets the champagne down on a table.", "Vivian holds her glass in a daze.  Edward, full of energy, paces", "back to her, as he listens intently to the phone.", "Something catches Edward's attention.  His eyes focus on", "Vivian's head.  He touches the diamond string wrapped around her", "hair bun.", "Vivian shakes her head \"no.\"  Edward smiles.", "He leans over and gives her a kiss on the cheek.  Back into the", "phone he says:", "He clicks the phone off.  He takes it to the table and sets it", "down.  He turns toward Vivian and slowly stalks toward her.", "He wraps an arm around her waist and gives her a kiss on the", "neck.", "Vivian turns away from him and quickly downs her champagne.", "Vivian crosses to the bottle on the table.", "She fumbles a little as she picks up the bottle to pour another", "glass.", "She starts to refill the glass, spilling champagne all over.", "Edward pulls the glass and bottle away from her.", "Vivian turns and walks away.", "Edward's eyes harden.", "Vivian strides to him, throws her arms around his neck and", "kisses him fiercely on the cheek.  Edward's fingers curl into", "the soft skin of her shoulders.  He runs his through her hair", "and unties the bun.  Vivian shakes her hair out and it falls", "across her shoulders.", "Edward gazes into her eyes.  Vivian quickly looks away.  She", "roughly unzips the back of her dress and pulls it from her", "shoulders.  Before she can get it off, Edward shoves her away", "from him.", "Vivian looks into his eyes defiantly.", "Edward is surprised to find that that actually hurts his", "feelings, and it makes him every more angry at her.  He grabs", "her by the wrists and pulls him in.", "Furious, Edward shakes her roughly.", "Edward pulls her in tightly and kisses her on the lips.  She", "turns her head.", "Edward holds her chin firm and kisses her again, deeply.  After", "a moment, Vivian begins to return it passionately.  Her hands", "wrap around the back of his head.", "Edward slides the dress from her body.  It falls to the floor.", "He carresses her back and ass.  As the kiss ends, they look into", "eachothers eyes, hot and breathless.", "Vivian looks at him, eyes burning.", "It's not a very convincing lie.  Edward is still out of breath.", "They kiss.", "INT. PENTHOUSE BEDROOM — NIGHT", "The bedcovers are on the floor and Edward and Vivian lie naked", "on the bed, drenched in sweat, exhasted.  Finished.", "Vivian rolls away from Edward and climbs off the bed.  She walks", "over to the bathroom.  Edward half rises and looks after her.", "She turns exits into the bathroom.  Edward rests his head back", "on the covers.", "INT. LIVING ROOM", "Vivian, dressed in a white silk nightgown, sits on the carpet in", "the middle of the living room.  Sunlight streams through her", "loose hair.", "Edward, dressed in his usual business suit, comes from the", "bedroom, struggling with his tie.  He sees Vivian sitting limply", "on the floor.", "Edward finishes his tie.", "Edward walks to the door and pauses.  He looks back at her as if", "he wants to say something else.  He changes his mind and exits.", "As soon as the door is closed Vivian looks up after him,", "worried.", "INT. HOTEL LOBBY — DAY", "Vivian, wearing her pink dress, strolls by shops in the hotel", "lobby, half—heartedly window shopping.  She keeps glancing", "around the lobby as if waiting for someone.", "She spots Mr. Thomas coming out of a back room.  She crosses the", "lobby and heads for him.", "Mr. Thomas spots Vivian and half smiles.  He isn't quite sure", "what he thinks about her.  Her presence in his hotel makes him", "nervous, and yet he secretly enjoys her company.", "Mr. Thomas looks around the lobby uncomfortably.", "Mr. Thomas smiles and glances around the lobby again.", "Everything seems quiet enough.  Why not?", "INT. HOTEL OFFICE — DAY", "Mr. Thomas's desk is laid out with two opposing sets of", "silverware.  He shows Vivian the correct piece from his side and", "she mirrors his actions from the other.", "Vivian does this.", "Vivian switches the fork and knife.", "INT. BROKERAGE HOUSE — DAY", "Vance is punching numbers into a computer terminal as Edward and", "William watch the display.", "Edward smiles.", "INT. BROKERAGE HOUSE MEETING ROOM — DAY", "Edward and William are lounging together at the end of a long", "meeting table.  A LOVELY YOUNG SECRETARY comes in and serves", "them coffee from a tray.", "The Secretary forces herself to smile politely.", "The Secretary pours the coffee into two cups and saucers and", "lays them neatly on the table.  She picks up the tray and exits.", "William watches her go.", "Edward takes a sip of his coffee.", "William waits until the Secretary has closed the door and then", "picks up his coffee.", "Edward changes the subject.", "INT. ELEGANT RESTAURANT — NIGHT", "Edward, William, and Vivian are dining at another elegant", "restaurant.  Vivian is decked out in her black lowcut dress.", "William stares at her cleavage as she eats daintily, holding her", "silverware carefully in her hands.", "William stares at Vivian fixedly.", "Vivian shakes her head no.", "William shakes his head.", "Vivian lowers her eyes and concentrates on her food.", "Edward eats.  William watches Vivian push the food around on her", "plate.  He seems bothered by something.", "Edward leans back in his chair and smiles smugly.", "William glares at Edward and then laughs, relaxing at last.", "Vivian stares at Edward expressionlessly.", "INT. PENTHOUSE — NIGHT", "Edward and Vivian come into the room.  Edward switches on a", "light.  Vivian walks down the steps into the living room.  Her", "face is rigid, her eyes are focused on the floor.", "Edward follows after her.", "As Edward touches her shoulder Vivian suddenly spins and", "explodes with anger, pounding him with closed fists.", "Vivian frantically pounds away at Edward, not so much to hurt", "him, but as if purging herself of emotion.", "Edward pulls back for a moment and then forcefully grabs her", "arms and throws her onto the couch.", "Vivian jumps up and runs at Edward.  Edward grabs her and throws", "her down onto the couch.  Before she can get up again, Edward", "pushes her back down.  Tears well in Vivian's eyes as she yells", "at him.", "Edward is taken aback.  He adopts a gentler tone.  Vivian sits", "on the couch, seething with rage.", "A tear falls from Vivian's eyes.  Edward shakes his head at her,", "incredulous.", "Vivian jumps to her feet.", "Edward's face sours.  She is trying his patience.", "Vivian doesn't say anything.", "Vivian is still silent.", "Vivian stands frozen for a moment.  Suddenly she spins and", "marches into the bedroom.", "INT. BEDROOM — NIGHT", "Vivian starts roughly picking up her clothes in the dim light of", "the bedroom.  As she does she starts crying.  With each item of", "clothing the tears come down harder.  Finally she is crying so", "hard she can't breathe.  She lets the clothes fall from her arms", "and starts to shake uncontrollably.", "Edward appears at the doorway.  His face is genuinely concerned.", "Vivian sobs in fits, gasping for air.", "Vivian finally manages to breathe again.  She stands limply.", "Her face is smeared black with mascara.", "Edward goes to her and wraps his arms around her shoulders.  She", "touches his hand.", "INT. BATHTUB — NIGHT", "Edward and Vivian are taking a bath together.  It isn't a bubble", "bath.  Edward wipes the black mascara from Vivian's eyes with", "his wet hands.", "He washes the black from his hands and caresses her checks again", "with warm water.", "He runs his little finger across her eyebrows and down her nose.", "Vivian smiles.", "EXT. FANCY CLOTHING STORE ON RODEO DRIVE — DAY", "Edward holds Vivian by the hand as they stand in front of a", "display window.  Inside the window is a stunning red sequined", "dress.", "Vivian's eyes light up like a child on Christmas morning.", "INT. CLOTHING STORE — DAY", "Edward sits on a comfortable chair sipping tea as he waits by", "the dressing room.  A prim, elegantly coiffed SALESWOMAN stands", "at attention by his side.", "Vivian comes out of the dressing room modelling the red dress.", "She looks beautiful.  Her face is aglow with pleasure as she", "admires herself in the mirror.  The Saleswoman checks the fit.", "The Saleswoman purrs in Vivian's ear.", "INT. JEWELRY STORE — DAY", "Edward picks out a pair of small ruby earings for Vivian and", "gently pins them through her ears.", "INT. SHOE STORE — DAY", "ANOTHER SALESMAN fits Vivian with a pair of red high heel shoes.", "Edward sits next to her.  He leans over and whispers to her.", "Vivian nods happily.", "INT. MERCEDES — DAY", "Edward is talking on his car phone.  Vivian sits happily next to", "him, admiring her new dress.", "Vivian looks over at Edward, still reeling from all the", "attention he is giving her.", "INT. FURRIER — DAY", "Vivian stands wrapped up in a grey mink coat.  She rubs the fur", "against her cheek in ecstasy.  Edward sits near her, watching.", "A handsome young SALESMAN stands by her side, his arms", "overflowing with other coats.  He looks to Edward for approval.", "He exits into the back room.  Vivian looks at Edward pleadingly.", "The Salesman comes out carrying a long, stark—white fur coat.", "Vivian's eyes widen.  The Salesman hands it to Edward.", "Edward nods.  He stands up and strides to Vivian's side.  The", "Salesman helps Vivian out of the mink and steps back.  Edward", "slides the coat over Vivian's arms.  He wraps it around her body", "and gives her a kiss.  Vivian melts.", "EXT. BURBANK AIRPORT — DAY", "Edward, dressed in a tuxedo and carrying a briefcase, leads", "Vivian, in her fur, through an airport to a private Lear jet.", "A PILOT in a leather jacket and dark sunglasses greets them.", "EXT. HELIPORT AT BURBANK AIRPORT — DAY", "The jet takes off down the landing strip.", "INT. JET — DAY", "Edward and Vivian are alone in the passenger lounge of the jet.", "It is a comfortable room featuring a long couch that curves", "across two walls, built—in bar, television and stereo.  Edward", "sorts through a pile of contracts as Vivian looks out the", "window.", "Vivian looks at the quietly reading Edward and smiles wickedly.", "She takes her fur off and lays it down on the floor.  She walks", "over to Edward and slides into his lap.  She starts to kiss his", "neck.", "Edward, grinning, pushes her away gently.", "Vivian, undaunted, slides the straps of her dress off her", "shoulders.  She stands and it falls to the floor.  Wearing only", "a pair of red panties, she lies down on the fur coat.", "Vivian gives Edward her finest come—hither look.", "Edward sets down his papers.", "EXT. SAN FRANCISCO — SUNSET", "The landing gear drop from the jet as it heads for the airport.", "INT. JET — DAY", "Vivian, naked, stares out the window at the city lights", "twinkling below.  Her eyes are full of wonder.", "Edward sits beside her, hand on her shoulder, looking at the", "view through her eyes.  The plane begins to shake a little as it", "lands.", "Vivian reaches down and picks up her red dress.  She pulls it", "on.", "Vivian smiles and turns her bare back to him.  He zips up her", "dress.", "EXT. SAN FRANCISCO OPERA HOUSE — NIGHT", "An airport limo pulls to a stop in front of the San Francisco", "Opera House.  The DRIVER walks around back and opens the", "passenger door.  Edward emerges and helps the fur—wrapped Vivian", "out.", "They walk toward the Opera House past a beautifully lit fountain", "with several graceful statues in its center.", "INT. OPERA LOBBY — NIGHT", "A crowd of well—dressed PEOPLE mill around the lobby, heading", "toward the theater.  Vivian admires the pretty dresses around", "her.  Edward has his hand on Vivian's elbow as he leads her.", "INT. THEATRE — NIGHT", "Edward and Vivian sit in a box high above the stage.  They hold", "programs while they wait for the curtain.  Vivian leans over to", "Edward and speaks in a low voice.", "The orchestra begins.", "MONTAGE OF OPERA", "The lights dim and the opera is performed.  Vivian watches it", "unfold on the stage, lights dancing across her face.  Edward", "occasionally leans over and whispers intimately into her ear,", "commenting on the actions below.", "The music continues.  Vivian's eyes focus intensely on the", "stage, as if a new world is being revealed to her.  Edward leans", "toward her ear.", "Vivian raises a hand and gently covers Edward's mouth.  She", "nods, eyes fixed on the stage.  She understands what is", "happening.", "As Vivian's hand slowly lowers, Edward glances at her, pleased.", "He takes her hand and gently strokes her fingers.", "Vivian concentrates on what is happening.  The music is reaching", "its tragic climax.  The emotions building inside Vivian swell.", "As the opera ends, she is profoundly moved.  A single tear rolls", "down her cheek.", "INT. STAIRCASE/OPERA HOUSE - NIGHT", "Vivian and Edward stand at the top of an elegant staircase", "leading down from the balcony's.  Vivian is slightly swaying as", "if weak.  Edward has a firm arm around her shoulder.", "Edward holds her tightly as other patrons move past them and", "down the stairs.  Edward smiles smuggly at her.", "Vivian knods.", "As she thinks about it, she feels the urge to cry again.  She", "fights it.  Edward gives her a warm squeeze.  She looks up into", "his eyes.", "INT. AIRPLANE — NIGHT", "Vivian with her head on Edward's lap.  He strokes her hair.", "Vivian is silent for awhile.", "INT. BEDROOM — NIGHT", "Edward is sound asleep.  Vivian stares off into the darkness.", "She can't sleep.", "She crawls out of bed.  She is wearing a pink teddy.  Edward", "stirs.  He blinks his eyes.", "He pulls himself up with difficulty.", "Edward lies back down.", "INT. LIVING ROOM — NIGHT", "Vivian stands in front of the windows, taking in the city below.", "She is wearing a pink teddy and her white mink.  She speaks", "confidently into the cordless phone as she orders from a room", "service menu.", "INT. LIVING ROOM - NIGHT", "Vivian pours herself another glass of champagne as she breaks", "open the lobster and eats a piece.  It's good.", "She looks at the caviar.  Pokes it.  Decides she isn't", "interested.", "She takes a small spoonful of chocolate mousse and dies in", "ecstasy.  She downs some more champagne.", "As she continues eating the lobster she hums a tune from the", "opera.", "EXT. HALLWAY - NIGHT", "Vivian slides a tray full of empty dishes and bottles out into", "the hallway.  She glances around, feeling a bit guilty and", "closes the door behind her.", "INT./EXT. WILLIAM'S LIMO — MORNING", "William is eating breakfast as he speaks on his car phone.", "He takes a sip of his coffee.", "INT. LIVING ROOM — MORNING", "Edward is dressed in his robe talking on the phone as he looks", "over the morning breakfast on the dining table.  Edward sips", "orange juice.", "Edward glances at his watch.", "INT. BEDROOM — MORNING", "Vivian is passed out in the bed.  Edward comes in and undoes his", "robe.  He starts to put on a suit.", "Vivian stirs.  She blinks at Edward with sleepy red eyes.", "INT. LIVING ROOM — DAY", "Vivian, in her yellow dress, stands near the bedroom as Edward", "opens the front door.  Mr. Kross slowly enters.  He looks old", "and tired.  They shake hands and Edward closes the door behind", "him.", "Edward leads him down the stairs.", "Kross notices Vivian standing across the room.  He seems", "surprised to see her.  Surprised and bothered.  He nods to her.", "They both seem uncomfortable in each other's presence.  Like", "former lovers who run into each other by surprise in public.", "Kross immediately turns his eyes away from her.  He looks at", "Edward.", "Kross's hands are trembling.  He glances nervously at Vivian and", "then back at Edward.", "Vivian is disturbed watching this broken man.  She backs away", "into the bedroom and disappears.", "Kross looks at Edward with a weak smile.", "Edward stares at Kross evenly.", "Edward notices for the first time that Vivian has left the room.", "He heads to the bedroom.", "INT. BEDROOM — DAY", "Vivian is sitting on the bed as Edward comes in.  He closes the", "door behind him.", "Vivian is staring at her feet.  Edward senses that something is", "wrong.", "Vivian looks up at Edward.", "Edward is silent for a long while.  He doesn't like this", "question.", "He turns and walks to the door.  Vivian stands.", "INT. LIVING ROOM — DAY", "Edward crosses the living room to Kross.", "INT. BEDROOM - DAY", "Vivian hears the living room door close.  He's gone.  She", "crosses to the closet and looks at the impressive collection of", "things she is accumulating.  Dresses, evening gowns, a full", "length fur.  He's bought her too.", "She closes the closet as if to get rid of the offending items.", "She goes to the bedroom phone and picks it up.", "She stops herself and hangs up the phone.  She makes up her mind", "and quickly exits the room.", "INT. ELEVATOR - DAY", "Vivian enters the elevator.  The day operator seems a little", "apprehensive at the sight of her.  Apprehensive, but polite,", "very polite.", "The elevator doors close.  Vivian is lost in her own thoughts,", "staring into space.  The operator waits a moment and then forces", "himself to speak.", "Vivian looks at him, annoyed and disappointed.", "The doors open into the lobby.  Vivian quickly exits.  The", "operator watches her go, dumbfounded.", "INT. HOTEL LOBBY — DAY", "Vivian walks up to the front desk and addresses the DESK CLERK.", "He pulls a phone from under the desk.  Mr. Thomas enters from", "the back door.  He smiles at Vivian.", "Vivian thinks about that for a moment.  The idea makes her", "nervous.", "EXT. LIMO — DAY", "A long black limo drives into Hollywood.", "INT. LIMO — DAY", "Vivian sits alone in the back of the limo.  She rubs the temples", "of her head.", "Vivian presses the intercom button.", "EXT. VIVIAN'S APARTMENT BUILDING — DAY", "The limo pulls to a stop in front of a rundown apartment", "building on a dirty Hollywood side street.", "The LIMO DRIVER, a large Latino man, steps out of the car and", "walks around to the passenger door.  As he does, he surveys the", "surroundings uncomfortably.  This is a rough neighborhood.", "He opens the door.  Vivian steps out.", "Vivian is suddenly aware of how much her appearance has changed.", "She doesn't fit into this world anymore.", "She hurries up the steps to the apartment building.  The Driver", "unhappily watches her go.", "INT. HALLWAY — DAY", "Vivian's bright new shoes and yellow dress traverse the grimy", "dark carpeted hallways.  Faded paint peels from stained walls.", "Vivian reaches the door to her apartment.  She turns the knob.", "It opens.", "INT. VIVIAN'S APARTMENT — DAY", "Vivian's apartment is small and claustrophobic.  The walls are a", "dingy green and plaster is falling from the ceiling.  There are", "a couple of worn—out overstuffed chairs and a bookcase piled", "with everything but books.  The majority of the room is given", "over to a large bed that is folded out of a couch.  A large", "mangy pile of old blankets and pillows cover it.", "On the bed, smoking rock cocaine in a small glass pipe, is Kate,", "already well on her way to getting stoned.  Two grungy looking", "men, CHUCK and JIMMY, sit on the bed with her, waiting for their", "turn.", "Vivian enters from the hallway.  With her clean expensive dress,", "hair style, low keyed makeup, she could not look more out of", "place in this setting.  She sees the two men on her bed.", "Vivian almost turns to leave, but Kate happily jumps up from the", "bed.  Her voice is a little slurred.", "Kate hands the pipe over to the guys and one of them takes a hit", "from it, using a lighter to heat the cocaine.", "As Vivian stands uneasily, Kate staggers over to her.", "Kate sloppily puts an arm on Vivian's shoulder and turns back", "toward the guys.", "Jimmy looks up from his pipe and eyes Vivian.  Vivian's stomach", "churns.", "Kate practically shoves Vivian toward the bed.  Jimmy stands and", "puts a dirty paw on her shoulder.  Vivian, dazed, like drifting", "through a bad nightmare, allows him to lead her to the bed.", "Chuck is currently taking his turn.", "Jimmy puts the pipe to her lips and is about to light the", "lighter.  Chuck reaches over to Vivian's dress.", "Chuck pulls on her dress front to expose her breasts.  Just as", "his hands reach for her, Vivian suddenly snaps out of her daze,", "shoving his hand away and hitting him in the face.", "He tears several buttons from her dress as she fights him off.", "Jimmy grabs for her and she shoves him away too.", "Vivian jumps up and bolts for the door.", "Vivian pushes past her, throws open the door and runs outside.", "INT. HALLWAY — DAY", "Vivian runs down the hallway.  Kate comes to the door and yells", "after her.", "EXT. VIVIAN'S APARTMENT BUILDING — DAY", "Vivian comes quickly out of the apartment building and heads for", "the limo.  She tries to discretely hold the front of her dress", "together, but it's obvious something is wrong.  The Driver opens", "the door for her.", "INT. LIMO — DAY", "Vivian sits in the back of the limo, clutching her dress", "together.  She begins to cry.", "INT. BROKERAGE HOUSE — DAY", "Edward and William stand in front of a conference table staring", "at a large flowchart of their acquisition and liquidation of", "Kross Enterprises.  William is pleased with himself.  Edward's", "thoughts some somewhere else.", "He starts to roll up the charts.", "Jake comes into the room.", "EXT. HELICOPTER — DAY", "Edward is sitting comfortably in the helicopter as it passes", "over the decaying shipyards.  He stares down at them", "thoughtfully.  Jake sits behind him.", "He drifts off, staring at the shipyards below.", "INT. LIVING ROOM — EVENING", "Vivian, in a different dress, is standing in front of the glass", "windows, looking out at the city, half heartedly drinking a", "glass of champagne.  The doorbell rings.  Startled, she spills", "some champagne on her hand.  She turns and looks at the door,", "edgy.  It rings again.", "Licking the champagne from her hand, she walks across the room", "and up the stairs to the door.  She opens it.", "William is standing outside with a small briefcase.", "They wait quietly for a moment, Vivian expecting him to leave", "and William standing firm.", "William walks past her and down the steps into the living room.", "He spots the open bottle of champagne and strolls over to it.", "William picks up a glass.", "Vivian is obviously uncomfortable in his presence, but she", "doesn't feel like she can refuse.", "William sets his briefcase down on the table and pours a full", "glass.  He takes a sip.", "William takes another sip.  He opens his briefcase and takes out", "a small stack of papers.", "He sets the papers down on the table and closes the briefcase.", "He walks over to the window and looks out.  He takes another", "sip.", "Vivian says nothing.  William takes a long drink and goes back", "to the bottle for a refill.  He stares at Vivian.", "Vivian is silent.  William stalks closer to her.  He takes a", "sip.", "Vivian's tone of voice suddenly becomes hostile.", "William smiles.", "He takes a sip and turns away.", "William's face sours.  He downs his champagne quickly and sets", "the glass down on the table.  Obviously straining to keep his", "voice calm, he turns to Vivian.", "Vivian says nothing.  She turns away from him.", "William half laughs.", "Vivian spins and stares at him furiously.", "William slaps her hard across the face.", "Vivian buckles over, holding her face in pain.  William stares", "at her, seething.", "He turns to start to leave, but as he does Vivian leaps at him,", "pounding him from behind.", "William turns and slaps her hard again.  He slaps her again.", "Vivian keeps punching him.", "In the background, Edward opens the door and enters the room.", "He sees the two of them fighting.  For a moment is he confused,", "but then he hurries down the steps and runs to them.", "Vivian roughly claws William with her fingernails.  Edward pulls", "her away from him.", "William, blood dripping from his cheek, lunges at her and slaps", "her again.", "Edward intervenes.  He punches William hard in the stomach.", "William buckles over in pain.  Edward pulls Vivian further away", "and lets go of her.", "As Edward moves toward William, William straightens with an", "angry look on his face.", "William is about to rush toward Vivian again when Edward slugs", "him square on the chin.  William stops cold and sways in dizzied", "pain.", "Edward grabs him by the shoulder and hauls him up the steps to", "the front door.  William, dazed, doesn't resist.", "Edward shoves him out into the hallway.", "Vivian stands alone, stunned, holding her face in pain.", "INT. HALLWAY — DAY", "Edward roughly throws William up against the wall.", "William grits his teeth.", "Edward slams him up against the wall again.", "He grabs William up and pushes him down the hall.", "Edward strides into the apartment, gathers up Williams papers", "and briefcase and hurls them into the hallway.  They scatter", "across the floor.", "Edward slams the door shut.", "William rubs his sore face.  Angrily he starts to pick up the", "papers scattered around the floor.", "INT. LIVING ROOM — NIGHT", "Vivian sits frozen on the couch.  Edward comes down the steps", "and sits next to her.", "Vivian speaks with an icily calm voice.", "Vivian slowly stands up.", "Edward is silent.", "Edward reaches into this jacket and pulls out a long gray", "envelope.", "He holds it out to her, Vivian doesn't take it.  She stares at", "the envelope.", "Edward takes her hand and puts the envelope in it.  He closes", "her fingers around it.", "Vivian stares down at the envelope.  Her eyes moisten.  She", "tries to hand it back, but Edward won't take it.  She sets the", "envelope down on the coffee table.", "She starts to cry.  Edward wraps his arms around her.  She half-", "heartedly tries to push him away, but he holds onto her.  She", "sobs in his shoulder.", "Vivian lays in Edward's warm shoulder.  The tears begin to slow.", "He takes her chin in his hand and kisses her.  She returns it.", "She falls limp in his arms.", "Edward lifts her up and carries her into the bedroom.", "INT. BEDROOM — NIGHT", "Edward lays Vivian down on the bed.  He straightens and starts", "to leave.  Vivian grabs his arm.", "Vivian holds his arm firmly.", "She puts her fingers on his mouth to stop him from talking.  She", "pulls him back to the bed and they kiss.", "Slowly, tenderly, they make love.", "INT. BEDROOM — NIGHT", "In the darkened bedroom Vivian and Edward lie together.  Edward", "sleeps deeply, peacefully with Vivian's back cuddled in close to", "his chest, his arm over her body.", "Vivian, her face swollen and puffy from the blow she received,", "stares into space, sleepless.", "She takes Edward's limp hand in her hands and carefully examines", "it.  The fingers, the palm, the tiny hairs on the back.  She", "pulls it in close to her body and holds it tightly.  She kisses", "the fingers.  In a low, barely audible voice she says:", "Almost as if she wanted to hear what it sounded like.", "INT. BEDROOM — MORNING", "A clock on the wall reads 9:03.", "Edward wakes up with a start.  He's alone in bed.  He glances", "around the room.  Vivian is gone.", "He jumps out of bed and pulls on his pants.", "INT. BATHROOM - DAY", "Vivian, dressed in her mint green dress, is finishing up her", "make-up in the bathroom mirror.  She has made a strong effort to", "cover up a nasty bruise on the side of her cheek.  It obviously", "hurts.", "Hearing Edward's voice her face flies through a range of", "emotions, first soft, then hard, then stone.", "Edward appears in the bathroom door.", "Quickly, she pushes past him into the bedroom.", "INT. BEDROOM - DAY", "Vivian quickly crosses the bedroom and Edward follows after her.", "She stops abruptly and gives him a peck on the cheek.  She then", "turns and exits.  Edward rushes after her.", "INT. LIVING ROOM — DAY", "Vivian comes out of the bedroom and makes her way across the", "living room.  Edward follows after her.", "Vivian stops again.  In her coldest hardest voice she says:", "Edward pauses.  He isn't sure.  Vivian turns and continues on.", "She turns at faces him again.", "Edward eyes her evenly.", "She grabs the envelope from the table.", "Edward is surprised that she took it.", "Vivian eyes him hardly.", "She goes to the door and opens it, exits, and slams it shut.", "Edward stares at the door, stunned.", "Vivian suddenly opens the door again and looks at him defiantly.", "She slams the door again.  Edward, furious, kicks over a coffee", "table.", "INT. HOTEL HALLWAY - DAY", "Vivian stands in front of the closed door, drained.  She slowly", "starts to walk away.  Tentatively.  As if waiting for someone to", "follow after her.  But she knows he won't.  She picks up her", "step.  He isn't following.  She moves quicker to the elevator.", "The doors of the elevator open.  She glances back around.  Still", "no one.  She gets inside.", "The elevator door closes.  The hallway is empty.", "The penthouse door slowly opens.  Edward glances down the", "hallway.  She really left.  He can't believe it.  She really", "left.", "INT. HOTEL LOBBY — DAY", "The elevator door opens and Vivian emerges. Vivian stands in the", "lobby, looking around the room, taking it all in for one last", "time.", "She crosses over to the main desk.  Mr. Thomas emerges from the", "back room and sees her.", "He notices the bruise on her face.", "Vivian touches her face guiltily.", "Mr. Thomas sees through this obvious lie.", "Vivian hands him the envelope.", "Vivian smiles faintly, turns and leaves.", "INT. BEDROOM - DAY", "Edward, dressed in a suit, has finished packing his bags.  He", "closes them tight.", "He picks up his back to leave.", "In the bedroom door is a full length mirror.  He finds himself", "faced with his reflection and pauses for a moment.  He takes a", "breath, adjusts his tie, and exits.", "INT. HOTEL LOBBY — DAY", "Edward hands his keys to the Desk Clerk at the main desk.  A", "BELLBOY is taking his bags out to his waiting Mercedes.", "He disappears into the back as Edward stands impatiently.", "Mr. Thomas, on patrol through the lobby, walks up to him.", "Edward's face visibly falls as Mr. Thomas hands him the", "envelope. He holds it loosely in his hands as he stares at it", "blankly.  Mr. Thomas discretely exits.", "The Desk Clerk returns.", "He turns and quickly exits the lobby, walking through the glass", "doors to his waiting car.", "EXT. COFFEESHOP — DAY", "Though the window of the coffee shop we can see Vivian and Kate", "standing at the counter.  Vivian is talking to one of the cooks.", "He nods and she stops the tape on the boom box and puts in her", "own.", "INT. COFFEESHOP — DAY", "As the sound of Aida fills the dingy restaraunt, Kate picks up", "two dishes of food and carries them off.  Vivian reaches into a", "cup filled with silverware and pulls out a fork and knife.  She", "follows her to the table.", "They settle down at the table.", "Vivian looks at Kate with a crooked smile.", "Kate, unable to comprehend, starts on her dinner.", "Vivian places the fork and knife down around her plate.  She", "stares at them thoughtfully and then switches them so the fork", "is to the left.", "Vivian takes a bite of steak and chews.", "Kate stops.  She stares at something out the window.  Her eyes", "widen.  Vivian glances around at where she is looking.", "Outside, across the street, looking around aimlessly, is Edward.", "He doesn't have a clue where to begin, and he is just looking", "around, talking people at random.  He looks very out of place in", "his business suit.", "Vivian turns her head away.  Her face is white.", "EXT. HOLLYWOOD BLVD. - DAY", "Edward stands on a street corner, feeling like a fool.  A RED", "HEADED PROSTITUTE walks by.  Edward stops her.", "INT. COFFEESHOP — DAY", "Vivian stares down at her food, trembling.  Kate is yelling at", "her.", "Vivian glances across the street at Edward.  The Prostitute he", "is talking to shakes her head and walks away from him.", "Vivian takes a deep breath and closes her eyes.", "EXT. HOLLYWOOD BLVD. - DAY", "Edward stands looking around.  The sun is out and it's hot.  He", "wipes the sweat from his forehead.  He turns to look in the", "other direction.", "Vivian is standing there, looking him over with a snide look on", "her face.", "They each take a step forward, throw their arms around eachother", "and kiss."]}