{"VIVIAN": [" What are you doing sitting in here eating?", " We should be working.  The rent's over due.", " A hundred and twenty.", " We shouldn't let the rent go over every month.  One of these days he's going to kick us out of our place.", " Why don't we work a little longer? Save up for next month.", " What was that?", " Yeah, it's getting cold out.", " How much?", " Sixty?  We still have enough for the rent?", " What if he hears us coming in?  He's gonna be pissed.", " Look at that.", " Look at that car.  We could make the rent and then some.", " You want a date?", " What?", " What do I look like?  A tour guide? You want a date or not?", " Directions!  He just wants directions!", " Look, Babe, I'm not in the business of giving directions.", " Okay, I'll tell you how to get to Wilshire for five bucks.", " I don't make change. Listen, for a little more I could show you the way personally and maybe we could have a little fun together.  What do you say?", " What are you, a homo or am I just playing too hard to get?", " Hey, I don't have AIDS or nothing. Here's my card from the free health clinic.  Got tested last week.  I'm probably safer than you are.  I got to be, I'm a pro.", " Ah!  You're thinking about it.  I can tell.", " Great.  I'm the best.  A hundred bucks.", " I'm growing on you already.  Two fifty for the whole night.  Not including the twenty you've already given me.", " Wait a second.", " I'm going to go with him.", " Two fifty.", " Maybe I will.  He's not too bright.", " Thanks, I will.", " Nice car.  Your's?", " What's your name?", " Vivian.  So where are we going to do it?", " You from out of town?", " I've never been to New York.  How is it?", " Make a left up there.  Why are you in LA?", " What kind of business?", " Just being friendly.", " Why?", " They don't like hookers?", " Every place has hookers.  They just don't admit it.", " …off the Boulevard?", " No.  I come here all the time.  As a matter of fact, they do rent this room by the hour.", " I don't get it.  What's a guy like you picking up a girl like me?", " You didn't put up much of a fight.", " Well then, what were you doing cruising Hollywood Blvd?", " Eh, sit!  I'll get it.", " Down there, I guess.", " What are you looking at?", " For one bottle?", " So you're here all alone?  Don't you have a girlfriend or a wife, or both?", " It all tastes the same to me.  So where's your girlfriend and wife?  Sleeping together?", " Aren't you going to have any?", " You don't have to get me drunk, honey.", " Not much.  I don't really drink.  I smoke though.  I don't guess you do?", " It was the otherwise I wanted.", " It's okay.  Why didn't your girlfriend come with you?", " She wants a new mink.", " So now I get it.  You had a fight with Miss Mink and you end up stuck here all alone.  Suddenly a pro sounds like a good idea.", " So where are we going to screw?", " Can I have my money now?", " Thanks, honey.", " Not on the lips.  Sorry.  And you'll have to wear a rubber.  You look clean but these days you never know.", " You don't last long in my business if you aren't.", " I don't want my clothes to get mushed up.", " This is fine.  I'll help you out of your clothes.", " Most guys like it quick.", " That tickles.", " That tickles.  I don't like it.", " Hot baths and sad songs.  Look, if I want some guy to turn me on I'll hire you for two fifty.  But you're paying me to make you feel good.  So lay down.", " Jesus, champagne, strawberries, mints and foreplay.  You act like you're seducing a Valley girl you picked up in a dance club.", " Yeah.  Well, you were cruising the wrong boulevard for romance. But if you want a good fuck, you found the best.  Just lay down and let me drive.", " Getting my clothes.", " What?  You want to do it again?  I thought I finished you off.", " Why do you want to sleep with me?", " You don't snore do you?  I hate that.", " One snore and I'm out of here.", " Alright.  Move over, Romeo.", " I forgot where I was.", " This is a nice bed.  It's so soft.  I slept like a stiff.", " I don't eat in the morning.", " My head hurts.  It's that champagne you made me choke down.", " No.  I'll get sick.", " I don't like orange juice either.", " Sad songs.  Hot baths.", " I saw it.  But I have to go.", " What is this stuff?", " It's good.  The orange juice isn't that bad neither.", " Yes, Eddy.", " Yeah, yeah.  I get it.  I'll give you my number.  But I charge more on Saturdays.  Especially with the sleeping thing.  I'd lose a lot of business.", " Sorry.  I guess I was hungry after all. So you want my number?", " You're kidding.", " It'd cost ya.", " Well, seven full nights and days too?", " Two thousand, so to speak.", " Sure, honey.  I'll treat you like a prince for a week.  Anything, any way you want.", " I'll treat you so nice you'll never want to let me go.", " Hey, I'll be looking forward to spending my money when you're gone.", " I need to go back to Hollywood and get some things.", " Well, a little bit of rock.  Just to get me through the week.  I'll pay for it myself.", " I just need a little buzz in the evenings to relax.  It's no different than champagne.", " I can't go a whole week without getting high.  I don't know if I can go a day.", " I'm not a drug addict!", " Alright.  A week.  But I want three thousand.", " It's a deal.", " Three thousand!  Three thousand dollars!", " Three thousand!", " Listen, lover.  When I'm not giving you the best sex of your life, I'm gonna be right here, in this tub.  Have Room Service bring the cart in. Three thousand.  To sit in a bathtub for seven days.", " Hey, I'd have taken a thousand, but we both know you can put up three.  Can't you?", " Then it's a good deal for us both. I'll keep you happy, lover.", " I'll be right here.", " Yeah.  You want me to dress like your high class girlfriend.", " How much can I spend?", " Fair.", " 'Bye, lover.  It's gonna be a fun week.", " Three… thousand… dollars.", " You wouldn't believe it, Kate.  It's like Dynasty or something.  It's a gas.  He's leaving next Friday.  I'll be back then.", " Hey, I'm the best money can buy.", " No, I don't think so.  He has some high class chick in New York and I think he's trying to piss her off.  What do I care? He's paying me three thousand dollars.", " Hey it beats walking up and down the street for a week.  When I get back we're taking a vacation.  I need one.", " Tell the Johns in Hollywood hello.  If they ask about me just tell them I'm in Beverly Hills… socializing with people of my own class.", " 'bye.", " Time to shop.", " Hi.", " Yeah.", " I'm going to be staying here for awhile.  In the Penthouse.", " I really like this hotel.  It's very nice.", " I'm just looking.", " I need some new clothes.", " How much is that?", " I didn't ask if it would fit.  I asked how much.", " What's with you?", " What's with this fucking look on your face?", " I was going to spend money here! What's with you?", " I'm just going to my room.", " I'm… I'm with a friend.", " Edward…", " He knows me!", " I just want to go back to my room.", " I just want to go back to my room.", " I was trying to get some other clothes… but… they wouldn't…", " Vivian.", " Nebraska.", " Do you have something in soft pink?", " I love it, but…", " … I don't know if it's me.", " You think that's it?", " I'm looking for Thane.", " She has?", " Yes.", " … yes.", " … Lancôme cedar rose blush, plum lip contour pencil, mat ivoire dual finish powder, Revlon rose pink lip gloss, and frosty pink nail polish.", " Yes.  I'll be putting that on my American Express card.", " Why not?", " Nope.", " Ick!  I want something in a pastel. That's horrid.", " Yes!  Let me try that on.", " It wouldn't fit me.", " 'Bye.", " Penthouse, please.", " Didn't even recognize me, did ya?", " Funny what a difference a dress makes. For a moment there you thought I was some rich person you had to suck up to.", " But you wouldn't know what that feels like because you always look like a snotty bellboy, don't you?", " I guess that's so you won't have any competition.", " Who is it?", " What?", " I don't know.  Is there some kind of trick to it?", " Well, maybe you'd better do it.  I don't know if he likes that kind of thing or not.  I'll watch to see how it's done.", " That's it?  That's all?  You just fold it over.", " You mean there are people who are too lazy to do that on their own?", " Yeah, you could chew people's food for them too. I mean, I'm not blaming you, I'm sure it isn't your idea, but I can't believe anybody expects someone to fold down their bedspread every night.  Vacuum floors, do dishes, okay, but that?", " Do you like it?", " Well?", " You hate it.", " Yeah, I don't look like a whore anymore.  I thought that's what you wanted.", " Yeah, it cost some.  But I'll pay you back out of my money…", " Really?", " You wanted something more sexy, huh? Tight, low cut.  Guy's like that.", " Taste isn't hard when you have money to spend.  The woman at Saks told me what to wear and the fag cut my hair and told me how to do my makeup.  But I hoped you'd like it.", " Here, let me help you.", " Oh.", " Well, Mr. Thomas wasn't mean to me, exactly.  Most everyone has been nice, least since I dressed up.  Funny how different people treat you.  Except the elevator boy.  He's a snot.", " Fired?  Well… … not fired.  Maybe yelled at.", " Yes, I saved all the receipts.  I bought three dresses and some other stuff.", " I didn't figure I'd be going out much. And clothes are so expensive around here. Two of them were on sale, but even then it all came to eight hundred and fifty seven dollars.  I could have done better at Sears or something but…", " Yeah… Here, let me show you what I bought.", " Yeah, like it?", " Good, I got another one that matches this dress.", " And I got a white one too, for my yellow dress.  I couldn't find a yellow one.  I kinda thought they were sexy. But classy too…", " I'll get it.", " Come on in.  Put it down there.", " I'm starting to like champagne.  Now I'll show you the good stuff.", " Well, I figured you weren't going to be taking me out a lot, so I figured what I really needed was some sexy lingerie for when I was in.", " Why don't you relax while I show you?", " Did I do good?", " I got most of it at this great sale.  A lot of it's polyester, but that white one is real silk.", " It only cost around two thirty—five.", " Are you going to let me keep it all?", " So what do you think now?  With a new do, some clean clothes, the stink washed off me.  Do I rate as good as your high class call girls?", " You want to screw?", " What do you do all day while you're gone?", " What's it for?", " What kind of company?", " Why would you want it?", " Yeah.  I'm curious about everything. Kate says it's gonna kill me someday.", " Yes.", " If it's worth that much money, why doesn't somebody else try to buy it?", " Oh.", " So you can make all that money just by buying it and then selling everything?", " What a racket!  It sounds so easy.", " So that's how you got rich?  Buying companies?", " But now that you're rich, why do you keep doing it?", " Okay.", " Like a suit.", " How about hamburgers?  Do you have any hamburgers?  Great.  And fries.  And ketchup.  Yeah.  I'm in the penthouse. The penthouse on the top floor.  Right.", " Hi.  How are you?", " How do you like my dress?  Better? Hey?", " Thanks.  See ya.", " How the am I going to last a week?", " What are you doing here?", " Kate, you'd better go.  He's not going to like it if you're here.", " Of course we're friends.  I just don't want him to get mad if he finds you here.  Besides the Hotel people are keeping an eye on me.", " We'd better not.  He might come back any time.", " I'll just fluff it up with some spray.", " Hey, I know.  Why are you acting like this?", " I wouldn't do that.", " Listen… you have any smoke?  It's been a couple days and I'm dieing for some.", " No, I promised him I wouldn't leave.", " No, I better not.  He might call or something.  I don't want to blow this. It's too much money.  I can last.", " Nice.  He's okay.  I mean he doesn't hit me or anything.", " I miss you do. Hey, you want to see what else he got me?  I got some great stuff.  Come on.", " And that one is real silk.", " I picked it out.  But he paid for it. He said I could keep it.", " I don't know.  He likes to screw me.", " No, he lives in New York.", " I don't think he's going to do it. He's just… he doesn't like me that much.", " Listen, why don't we could order some food from Room Service.  What the hell?", " I'm coming back.", " Yeah, sure.  I got some.  I'll give you some.", " Here, take it all.  I don't need it. I'll have more when I get back.  A lot more.  We'll take it easy for awhile.", " Hello?", " Fine.  Fine.  Just bored.  It's been real quiet.", " 'Bye.", " He's not really my uncle.", " How do I look?", " I'm just shaking 'cause Edward is taking me to this really fancy place. The Rex?  Is that a nice place?", " Oh sorry.", " Do I look okay for it?", " Yeah…", " Got to go.  'Bye.", " Fork?", " Oh, it's okay.", " Yeah… it's okay.", " Why are you laughing?", " Can I get some cigarettes?  I'm dieing for a smoke.", " Virginia Slim Lights.", " She's… beautiful.", " I guess you'll be glad to see her again.", " I want to get drunk quickly.  It makes it easier.", " My job.  Isn't that what you want now? For me to do my job?", " I used to smoke rock so I wouldn't think about my work.  But since you won't let me do that I have to find something else.  This isn't quite as good, but it helps.", " I'm not mad at you.  I don't feel anything about you.  It's just that you don't have to give me romantic looks and tell me I'm beautiful.  I don't want to play games with men, I just want to do my job and get it over with.", " I was drunk.", " Not with customers.  Not with you.", " You've been very generous.", " You're very handsome.", " I don't like you.", " Sure, whatever you say.", " I don't enjoy it.", " Not on the mouth.", " No.  It's just a job.", " Taking a shower.", " To get clean.", " Just sitt'n.", " I've got a headache.", " Thanks.", " Whatever you want.", " Hi.", " I've got to talk to you.  Boy, did you mix me up last night with that line about the fork.  I made a fool of myself.", " Oh, I didn't know which fork to use so I kept holding off and everyone used different ones and Edward laughed at me.", " Well then show me.  Edward might take me to dinner tonight and I don't want to look like a dummy in front of him.", " No, you got to show me the whole thing. The whole dinner thing.  From the top. You got me in this mess.", " Because if you hadn't told me, I wouldn't have even thought about it. Now I'm all jittery.", " Hey, I knew that one.  I always do that.", " But the other guy ate like this.", " No, he was a rich guy too.  I could tell.", " What's old money?", " Yeah, I think so.", " No.", " Yes.", " You fucker!  You fucking bastard!", " You asshole.  I can't believe what a shit you are!", " I'm not a piece of meat for you to offer to your friends!", " I almost picked up that fucking table and smashed it in your fucking face.  I almost did it!", " I want the money that you owe me and I'm getting out of here!", " I've been with stinking old men that made me want to puke, but I've never had anyone make me feel as dirty as you do!  You make me feel dirty inside.", " YOU DON'T OWN ME!  I say when!  I say who!  I say how much!  If I make a deal with you it's between me and you and if he wants to FUCK ME TOO then he can ask me and I'll tell him how much!", " I don't screw everyone who pulls down their pants.  I say who!  I say how much!  I run my life!  You don't run my life!", " It didn't hurt me!  It doesn't hurt you when someone pisses on you!  It just pisses you off!", " I don't know.", " Fuck off.", " You … …hurt me.", " I got so crazy.  I'm not like that.  I don't know why I got so crazy.", " Yeah, right.  What?", " Are you sure this is alright?  I don't want you to hurt your business.", " I'm okay.", " It's so soft.", " I like this one.", " I think I'm coming.", " I've never been on a plane before.", " Being quiet.", " I can see the bridge.  It's all lit up. It's so beautiful.", " Even if I hate it, I'm glad you brought me.", " If it's in Italian, how will I know what they're saying?", " I just stood up to fast.  My head is spinning.  The blood all went to my legs.  Just a second.", " Yeah.  It was… I liked it so much.  It… was sad.", " I'm okay now.", " So I guess we've got two nights left, right?", " I just wasn't sure if you might have to stay longer.  Because of business or something.", " Thank you for taking me tonight.  I'll never forget it.  Never.", " Noth'n.  Just can't sleep.", " I really feel like smoking.  I'm not used to going without it for so long.", " Can I get some champagne?  Or something to eat?  Maybe it'll help me sleep.", " No, no.  I can call.  You sleep.  I'm alright.  Really.", " Bottle of the Dom Perignon.  A bowl of chilled strawberries… And the lobster.  And some caviar.  And the chocolate mousse.  And… that's it. Make that two bottles of champagne. Yes, a magnum.  Of course.  Penthouse.", " What?", " Hi.", " What did you do to him?", " Then why is he afraid of you?  Last time I saw him he was so strong.  Now he's so scared.", " It's wrong.  What you did is wrong.", " I know enough business to know when someone is getting screwed.", " And that makes it okay, because you can buy people?  If he takes your money than you think he's just the same as you?", " At least there are some things I won't do for money.", " Roomserve, I'd like a bottle of…", " Lobby.  Thanks.", " What?", " What did he do?  Threatten you?  Give you a big tip?  Doesn't anyone have the nerve to stand up to him?  Don't say your sorry if you're not.  You don't think I belong here and you're right. I don't belong here.", " Is there a phone I can use?  I want to call a cab.", " Hi.  What's the number of a cab company?", " Umm… Hollywood like.  I need to get some medicine.  You know, for headaches.", " Yeah, I guess I have to.  The headache medicine will make it easier.", " Limo?", " Umm… I don't want Edward to know I'm leaving.  He… I just don't want…", " Yes.", " Yeah.", " I'll be okay.  It'll just be a second.", " Yeah.", " Kate?  What…", " I'm not back yet.  I… I still have one night left…", " Traded them what?", " I… I… can't stay.  I've got a limo downstairs waiting for me.", " I… I think I better go.", " I just think…", " DON'T TOUCH ME!", " I'm fine.  Just take me back.  Take me out of here.", " Hi.", " No.", " Oh, yeah, sure.", " Sometimes.", " No.", " Yeah.", " Lord Harris?", " What's it to you?", " I don't like managers.  I don't like people making money off me.", " No thanks.  I only want to get fucked by one person at a time.", " Three months.", " Just get out of here. Does Edward want you here?  I don't think he'd like it if you were talking to me like this.", " I know!", " I don't want your help!  I don't like you.  I'd rather fuck lowlifes and drug pushers than fuck you!", " You fucker!  You fucker!", " Why do guys always know how to hit a girl? Wham, right across the cheek.  Nice and high so it feels like your eye is going to explode.  Stepfathers, boyfriends, pimps, cops, even little lawyers in suits and ties. They all hit you the same.  What do they do, take all the boys aside in high school and show them how?", " Nobody needs to.  He already did a good enough job.", " I'd better go.", " No.  I want to go.  I hate it here.", " Yeah, nothing's your fault.  He just works for you doesn't he?  You just give him some of your money and you can't be blamed for what he does behind your back.  How many people has he hit while you weren't around to see it? How many?", " I'm getting out of here.", " I… I don't want it.", " I don't want it.", " HARD?  What do you know about hard!? Do you know how many guys I'd have to have to make this much money on the street?  They'd fill up this room! And I'd rather have done it that way if I could never have met you.  I wish I'd never met you.", " What can I do now?  I can't go back and I can't stay.", " I want to hate you, but I can't.  I hate myself.  I hate what I've become. I've been so low for so long I didn't realize what had happened to me.  You just held up a mirror.", " Where are you going?", " Don't leave me.  Not yet.", " I… love you.", " Yeah, you just caught me.  I'm taking off.", " Back to Hollywood, were do you think? The week's over.", " I feel better today.  Bye, honey.", " Talk about what?", " Yeah, that's what I thought.  Bye.", " Furs are out of fashion in Hollywood. And I don't have any place to wear the rest.  I'd walk home naked but the cops would stop me.", " What's to think through?  You hired a hooker for one week and the week's over.  Remember, no hassles, no headaches, no strings attached.", " Right!  I almost forgot.", " This makes it all worth while.  Three thousand dollars.", " What difference does it make what I want?  What are you going to do?  Take pity on me?  Feel sorry for me?  Maybe you could give me an extra little handout before you go?  Maybe when you come into town next time we can do it again?  Or maybe if I asked real nice you'd put me up in a little place like your model friend until you got tired of me like you did her.", " But none of that is going to change the fact that you are a slimy jerk who professionally screws people over.  You want me to hang around and laugh and giggle while you gut people over dinner?  No thanks.", " I don't want you to say anything.  I'm just leaving.  Thanks for the money.", " And you snore too!  You snore like a pig!  You did from the first night!", " No.  He didn't ask me.", " Oh.  I bumped into something.  Isn't that dumb?", " Listen, I forgot to leave something with Mr. Harris.  Would you give it to him?  Just before he goes?", " Thanks.  Thanks for everything.", " No.  There's a bus that runs up Wilshire.  I can catch that.  Goodbye.", " I've got my pride.  It's been a long time since I've had that.", " Yeah.  I think I've got to find a new line of work.", " No, it isn't.  It's someone else.", " No, it isn't him.", " What?  You need directions?", " What do I look like?  A tour guide?"], "KATE": [" I was hungry.", " I ran into a pickup truck with four guys.  Took me fifteen minutes to take care of them all.  How much you make so far?", " Then we're coasting.  We can buy some smoke and kick back till tomorrow.", " Who cares?  It's a shithole.  We'll find another one.", " It's not safe to work past midnight. All the creeps come out.  We'll make it up tomorrow.  Let's go get high.", " Keep going.  Keep going.", " Nothing to us.  It's late.  We'd better get in.", " I got it.  Two rocks.  It's good stuff.", " Sixty.", " So we're twenty short.  We'll make up the difference tomorrow.", " Forget it.  I want to get home.", " I told you only creeps come out after twelve!", " How much?", " You could of got more.", " I'll save some smoke for when you get home.  Be careful.", " Yeah, low class.", " I'm seeing a friend.  She's staying with some guy.  In the penthouse.", " Whoa, what a view!", " That's a warm welcome.  Just came to visit my pal.  Something wrong with that?", " You weren't kidding when you said it was a nice place.", " Relax, I'll just say I'm a maid or something.  Geez, I thought you'd be glad to see me.  We're still friends aren't we, or am I just poor scum to you now?", " Look at this.  A stocked fridge and everything.  Hey, why don't we order some food from Room Service?", " Well, he certainly didn't waste any time fixing you up to look like an expensive piece, did he?  Your hair's really cute, but I don't know if you're going to attract a lot of dates when you get back on the street.", " Yeah, like I taught you three months ago when you first got into town.  You didn't know nothing back then.  You wouldn't have lasted two days without me.", " I don't know.  Last night I started getting worried that you might not come back.  That you'd take his money and skip out on me.", " Hell, I would.", " Yeah, sure, I always walk around in narc land carrying.  If you want a smoke let's go back to our place and get high together.", " Give me a break.  You're not going to last a week without a smoke.  Come on, we'll buy some stuff, get silly and you'll be back here before he gets home.", " So what's Prince Charming like?", " You look great.  You really do look great.  I sure miss you.", " It pretty, it's all real pretty.  He bought you all this stuff?", " He must like you a lot to buy you all this stuff.", " Maybe it's more than that.  Maybe at the end of the week he'll want you to keep you around.", " So what?  He's got bucks.  He'll just put you up in some hotel room somewhere.  You'd have it made.  No more walking, just one steady John.", " Yeah, yeah you're right.  Guy's always like to screw someone new. I'd better get out of here.", " Nah, I ate some fried chicken.  I'm all filled up.", " I shouldn't of come.  It was stupid.  I could have blown it for you.  Anyhow I'll see you when you get back.  If you get back.", " Yeah, I know.  Just joking. Listen, you got any money left from your first night?  I mean, I just paid the rent and things have been a little slow on the street.  And I don't really feel like working tonight.", " Right.  Thanks.  See you.", " Hey, Viv!  You're just in time. This is my roomate, Viv.", " You're back.  I forgot you were coming so soon. Did you get the money?", " Oh… oh… oh.  You just came to get high? Huh?  I knew you couldn't last.  You're just in time.", " That's Chuck and Jimmy.  I traded them for some rock.  There's plenty for you.", " What do you think?  You take Jimmy.", " Limo?  My aren't we fancy pants? Listen, it's just a quicky.  They don't get nothing much for a twenty rock.", " What's with you?  It's not fair for me to do them both.", " Take a hit.  You'll feel better. You've just got the D.T.'s.", " What is it with you?  You think your too good for this because you've been with some rich creep?  Huh?  Don't forget who you are.  You have to come back here tomorrow.  Go on, take a hit.", " Have you gone nuts?", " Where are you going?  You can't run away!  You'll be back!  You'll be back here!", " I still can't believe you.", " You didn't take the money.  You didn't take any of the clothes expect the ones your wearing.  You spend a week with a millionare and you end up with nothing.", " You're nuts.  You're just nuts.  You're never gonna make it on the street.", " Yeah, we'll you'd better find a new place to live, cause I'm not going to…", " That's the guy.  That's your guy.", " No, that's your guy.  He's looking for you.", " Go out there!  Go!  What do you want? For him to put up a billboard saying he's sorry?  What are you waiting for?"], "EDWARD": [" How do I get to Wilshire Boulevard?", " I'm lost.  How do I get to Wilshire?", " Actually, I just want directions.", " I can see that.  But perhaps you'd make an exception.", " A bargain.", " All I have is a twenty…", " How do I get to Wilshire?", " You're a lovely young lady, but I'm not in the habit of picking up girls off the street.  Now…", " You're a very persuasive woman. It happens that I am alone tonight…", " A hundred dollars.  For the whole night?", " You're quite a negotiator.  Alright.  I can't believe I'm doing this, but climb in.", " It's rented.", " Edward.  What's your's?", " I'm staying in a hotel in Beverly Hills.", " New York.", " It's alright.  Are you going to tell me how to get to Wilshire?", " Business.", " You certainly ask a lot of questions.", " Listen, my overcoat's in the back seat. Why don't you put it on?", " Let's just say you're a little over— dressed for this hotel.", " It's not the kind of place that rents rooms by the hour.", " Perhaps so.  But if this hotel has any hookers, they don't look like they're…", " Exactly.", " Penthouse.", " Room Service….  I'd like a bottle of the house champagne and a bowl of chilled strawberries sent to my room. Thank you.", " Nice view?", " I've impressed you?", " Very good.", " As I recall, you where the one that picked me up.", " It started to seem like a good idea.", " Cruising?  Hmmm.  Well, I don't get to drive a lot in New York, so I thought it would be interesting to tool around and admire some of the local architecture.  I was sightseeing the Chinese Theater when I got lost and ran into you…", " That should be the champagne.", " That'll be fine.", " I think he wanted you to tip him.", " I'm afraid so.", " Both.  This is the house brand.  I didn't think you'd mind.", " More questions.  My wife divorced me years ago and is in Europe I believe, spending my money.  My girlfriend is in New York… spending my money.  Cheers.", " I wish I could.  But I've got a liver problem.  I can't have any alcohol.", " No.  I just like the smell.  Fond memories. How do you like it?", " No.  Not tobacco or otherwise.", " Try a strawberry.  It'll bring out the sweetness of the champagne.", " Better?", " I don't know.  Just being difficult.", " You put it very well.  I'm a professional man and I'd like to find a professional woman.  Any more questions?", " How about the bedroom?", " Oh… yes.", " I see.  I suppose you can't be too safe about that kind of thing.", " What are you doing?", " You could hang them in the closet.", " Hey.  Slow down.  I thought we had the whole night.", " Well, then I'm not like most guys.", " Sorry.  What do you like?", " I'm an incurable romantic.", " What are you doing?", " I thought we had all night.", " You did.  But stay the night.  I'd like to sleep with you.  I'll get you a taxi in the morning.", " Another question.  Because you're warm.", " I don't snore.  I don't believe I snore.", " That seems fair.", " Cindy, I've had it.  This is the third time I've had to take a trip alone.", " I don't care what your agent says.  One week isn't going to ruin your career.", " I want you here.  You know how I get when I'm doing business.  Last night I even… … forget last night.  I want you on a flight today or it's over.", " You promised me when you started this whole modeling thing that I would come first.  Now I'm still the one that's paying your bills and I'm not going to… Cindy!", " Stupid girl!  That's it…", " You're quite a sleeper.", " Good morning.  Would you like some breakfast?", " That must be an occupational hazard.", " Would you like some breakfast?  It's still hot.", " You should.  Come on.", " Hair of the dog.", " Just a bit.  With orange juice.  I guarantee it will make you feel better.", " Don't you like anything?", " Well, you're welcome to take a nice long bath.  The one in the bathroom is practically a pool.", " I wanted to talk to you about that.", " Crepes.", " Vivian…  It's Vivian, right?", " Vivian, I'm going to be in town until next Friday.  I'm involved in an important business deal and in the evenings I'll need to relax…", " Hey, slow down.  I'm not going to take your plate away from you.", " Actually, I was wondering if you would like to stay here for the week.", " No, no, I'm not.  You're a very… professional woman.  And I like that. Rather than call you every night and wonder if you're available, I'd just as soon have you stay here.", " How much?  Let's see if I can afford it.", " Yes.  You can do what you want during the days, but I'd like to have you on call, so to speak.", " Alright.  That seems fair.  Two thousand it is.  But let me tell you, I have very tough business to do.  There is a lot of pressure involved.  When I get tense, I need someone to help me relax.  That means no problems.  No hassles. Understand?", " I'm not just talking about sex.  I need some nice pleasant company.", " Fine.  But I will go.  This is only for a week.  I want you to be clear on that too.  I don't want you to have any expectations.  Sometimes these things get messy.", " I wish my lawyer was that honest.  I wouldn't even risk this, except you seem a very sensible girl. Businesslike.  So it's a deal?", " No, I want you to stay here while you're with me.  I don't want any trouble.  We'll buy anything you need. What do you want?", " No.  No drugs.  Not while you're with me.", " Champagne is legal.  Drugs are illegal. That's enough of a difference to me.", " Then maybe this isn't going to work out.  I didn't know you were a drug addict.", " That's fair.  Three thousand dollars for one week, no drugs, no strings attached.", " Happy, huh?", " I'm overpaying you.  Aren't I?", " I don't think it will break me.", " Good.  I've got to meet with some people.  I'll probably be gone most of the day.", " I'm going to take a chance and trust you with this.  Buy some nice clothes on Rodeo Drive.  A few dresses, not too fancy, or too sexy.  Soft pinks and pastels are nice.  I just want you to look presentable in the hotel. Understand?", " Well, let's hope you don't spend that much.", " Be reasonable.  You're a smart girl. I'll make you a deal.  If you spend too much I'll send it all back at the end of the week.  If you're sensible, I'll let you keep it.  Fair?", " 'Bye.", " Then hold off until we file.", " No, no.  I always play by the rules. There are too many people that would like to take me down.  I'm not about to give them any help.", " Good to meet you.", " What's that long building over there?", " You what?", " What kind of idiot are you?  You don't talk to anyone about this but me!", " Where did you dig up this moron?", " You people are supposed to be professionals.", " No.  Don't bother.  He's probably already told everyone he knows.", " Forget it.  Let's go up the coast.  I want to look around.", " Bill!  Where the hell have you been?", " Good, if your boys at the brokerage don't leak the whole deal.", " Skip it.  Jake's going to be good from now on.  Aren't you?", " Listen, there's something you need to look into right away.  There's a chemical treatment plant at that shipyard.  I want you to see if the permits are still valid. And what kind of limits are on them.", " Don't get too excited yet.  Check the permits first.", " Thanks for the tour.  Keep your mouths shut.  I'll see you tomorrow.", " Ask them.  What's the offering looking like?", " That's madness.  If I start paying rates like that I'll be out of business.  We've going to have to do better than that.", " You're not listening to me.  We're going to do better than that.  Aren't we?", " No.  That's all over.  I've lost my patience with her.", " No, thanks.  I've already taken care of that side of my trip.  I met a pretty, no nonsense girl who's going to stay with me for the week.  She wants a third of what those pimps charge.", " No, I was driving around the city and I found a… girl.", " The girls you try to set me up with aren't virgins either, Bill.  I'm careful.", " Drop it.", " I don't need a girl who speaks French better than I do.  Those high class hookers are just high class leeches. I'm tired of them asking me to buy them jewels as tips.  I've found a nice, anonymous girl who's thrilled to provide me with sex at a fair rate with no hassles.  She's just a simple working girl and that's all I want.", " Any messages?", " Hello.", " My niece?", " I don't have a niece.", " That pretty young girl in my room is a prostitute.", " Do you have a problem with that?", " Have some champagne sent up.  And a cheese tray or something.  Maybe a pâte and some bread.  A large bottle of mineral water. And strawberries.", " You… you look different.", " No, it's just that you look… different.", " Yes.  Yes, I did.", " You had your hair done.", " No, no.  I'll pay for it.  You look wonderful.  Lovely.", " Yes.", " No, no, this is wonderful.  I just didn't think you…  you have great taste.", " I do like it.  You look beautiful.", " Thank you.  That's much better. I had an interesting talk with the hotel manager downstairs.", " Listen to me.  I don't know what happened with you two, and I don't care.  I'm paying a lot for this room and as long as you're my guest, the people in this hotel will treat you like a queen.  If anyone hassles you, or makes you feel uncomfortable, you tell me.  Alright?  If I have to, I'll buy the hotel and burn it down to prove my point.", " You want me to have him fired?", " I'll see what I can do.  So did you buy anything else?", " Only three dresses?", " That's fine.  You were very frugal.", " New underwear too?", " Very much.", " That's Room Service.", " Cheers.", " The good stuff?", " Yes.", " It's okay, it's okay.  I don't care what you spent.  I trust you.", " Yes.  It's yours.", " Better.  You're a lot better.  You're wonderful, Vivian.", " Meet with lawyers and stockbrokers. Read financial reports.  It's pretty boring.", " I'm acquiring a company.", " It's called Kross Enterprises.  It used to build ships.  Nowadays it doesn't do much of anything.", " Are you really curious?", " All right.  Warn me if I bore you. Twenty years ago Kross was a huge corporation, and even though they're almost bankrupt today, they still have millions in assets.  Real estate, equipment, inventory.  Things that can be liquidated to generate cash.  You understand?", " Anyhow, we figure Kross is worth about 400 million.  We hope we can acquire it for between two and three hundred million.  No matter what, I'm going to make a profit.  The question is how large.", " Try is the key word there.  People have tried.  But not everyone can raise a few hundred million to toy around with .  And I know of assets the corporation owns that other people aren't aware of. It's worth more than most people think. Besides, the company management isn't particularly happy about being sold, because they'd be out of a job.", " I wouldn't lose any sleep over them. They got the corporation into the mess it's in now.", " Something like that.", " It used to be easy.  The market crash and a few scandals have made things tougher.  And management has got smarter.  I have to be more careful about my targets now.", " I guess… to get richer. I'm going to have to get dressed, I have a meeting at eight fifteen. Tomorrow I'll give you a lesson on short selling.", " You're a good listener.  I like that.", " How do I look?", " Like a suit?  Very apt.  I feel like a suit.  I'll see you tonight.", " It's not acceptable.", " Draymen Heux has offered me seventy- five in the pool at sixteen and a half. I can secure the rest I need personally.", " The market has changed, Carl.  There aren't many real players left.  I'll give you two hours to make a decision.", " They can't know for sure.  They don't have time.  They'll do it for sixteen.", " About what?", " Alright.", " I wouldn't miss it for the world.", " No.  If the three of us sit down together then we might as well announce the takeover in the Wall Street Journal.  I'll meet him in public for dinner.  Less suspicious.  Tonight, if you can arrange it.  I'll even bring a girl.  That'll keep it all on a friendly level.", " She can handle herself.  And I can handle Kross.", " Sixteen.", " We'll liven things up for you.  We're going out to dinner tonight.  I want you to look your best.  I don't think you have any clothes that will do.  Go buy something a little more formal.  Something dark and low cut.  But tasteful.  Spend whatever you have to.  If you don't know what to get, tell the salesgirl you're dining at the Rex.  And have your hair done up.  We're a little pushed for time so I'll meet you in the lobby at seven forty—five.  'Bye.", " Then call the S.E.C.", " Are you threatening me?", " Really, Mr. Kross.  I don't think we have anything to talk about.  Maybe you should see my lawyer.", " Let's go, Vivian.", " Are you sure, Viv?", " I didn't have to come here.  I don't have to talk to you.  If you have something to say you better say it without threatening me or insulting the lady.", " I really don't know.  But from what I've heard, your company doesn't have any cash.", " Then I'd be in a position of making your company a loan.  That doesn't seem to make much sense.", " Mr. Kross, you're not going to be getting any Navy contracts.", " Just that.  You're not going to be getting any new contracts from the military.  I know.", " You flatter me if you think I can tell the Pentagon what to do.  But I do know you aren't getting the contract.", " Now let me propose something to you.  If I do decide to acquire your company, I will file the proper papers with the S.E.C.  If that was to happen, I would suggest that you and the Board cooperate with me, rather than try to fight it.  You couldn't stop me, you could only lower my profit margin.  If you don't fight me, you'll find I can be a valuable friend.", " It's not your company.  It's a public company.  We both know that you can only keep it going for a couple more years before you get swallowed up by debt.", " Yes?", " Now it's my turn to apologize.  I'm afraid that I have a private call that I must deal with.  If I may be excused…", " My apologies again.", " At least stay for dinner.", " Which is?", " If you feel that way, do what you have to do.  But if you change your mind, come to me.  My door will be open.", " You and your fork.  You were such a picture.", " Yes.  Yes, but just for two.", " Of course.", " That's Cindy.", " She's very little.  Just over five feet.  But she's got the best body. It's perfect, and her face… you can see.", " Dumber than a doornail, though.  I guess they beat the intelligence out of you in finishing school.", " Cindy?  No.  That's over.  She was too much trouble.  I don't have time to play games with women.", " We were right, they don't have any cash.  The only card he had was the Navy contract and we know what happened to that.", " Well, that's your job.", " Do some research.  The guy used to be a millionaire.  Where's he get his money these days?  What banks are loaning it to him?  Find out.  We have lots of friends.  It wouldn't take much.  A couple phone calls.", " Are those real?", " They look lovely.", " Now you're thinking.  Get on it.  We're going to wrap this up by Friday.  I know it now.  Talk to you tomorrow.", " Have I ever told you how very, very beautiful you are?  You are, you know. Very beautiful.", " I certainly could have done a lot worse for a wrong turn on Hollywood Boulevard.", " Easy, doll.  You're supposed to sip it.", " Makes what easier?", " I don't think you need anymore.  You're already drunk.", " What's wrong with you?  You've been acting strange all evening.  Are you mad at me?", " Fine, then come here and get it over with.", " What is this?  What's the matter with you?  Last night you weren't complaining.  You weren't trying to rush through it.  Last night you seemed to like it.", " You didn't feel anything?  Nothing? You don't ever enjoy making love?", " Why not?  I think I've been pretty good to you the last few days.  Haven't I treated you well?", " Then what is it?  Am I ugly to you?  Am I fat and disgusting?  Do I smell bad? People have been so bold as to tell me I'm somewhat attractive.  Aren't I to you?", " Then why are you in such a rush to get it over with?  Why do you have to get drunk?  Is it really that horrible? I'm not asking you to love me.  I'm not even asking you to like me.", " Fine.  Don't like me.  But don't lie to me.  Maybe you hate me now for some reason that I can't fathom, but you enjoyed it last night as much as I did.", " Tell me the truth!", " You're lieing!", " Too late.", " You didn't enjoy that?", " Alright.  Then just do your job.", " What are you doing?", " Why do you always have to take a shower after we make love?", " What are you doing?", " Why don't you sit on the couch, or go back to bed?  Don't you feel alright?", " No wonder, the way you were drinking last night. You were great though.  You're an incredible lover.", " I hope you feel better.  I'll be gone all day.  Maybe we'll have dinner someplace nice tonight.", " Flight of fancy.  Let's offer eight.  That should bring them back down to earth.  Then we'll raise it to nine and close the deal.", " Yes.  Time to jump out of the closet.", " Black.", " So, tell me about Kross.", " Bank we know?", " Need me to call anyone?", " I will.", " So why don't we go to dinner tonight? You can meet this girl I've been talking about.", " She's incredible.  In every way.", " Tell Bill what you said to me, that first night. It was something like \"if you're looking for romance you were cruising down the wrong street.  But if you want to fuck, you've found the best…\" Was that how it went?", " What difference does it make where I found her?  I think she's great.  She's a lot smarter and prettier and better in bed than those girls at your friend's agency.  They cost an arm and a leg and they're cold as ice.  But everytime I get into town you try to push another of their girls on me.  Why is that, Bill?  Do you own a piece of that business?", " What are you thinking about, Bill?", " You want her, don't you?", " You're drooling, Bill.", " She's the best.  But you'll have to wear a condom.  She's careful about that.", " North American Steel.", " Why not?", " My, you're quiet.  You haven't said a word to me since we left the restaurant.  I kind of like it, but…", " Have you lost your mind?!", " Would you please tell me what you're mad about?", " Alright.  Just calm down.", " I'm sorry.  It was a stupid joke.  I wasn't serious….", " Can we talk about this?  Can you just try to calm down?", " I… I wasn't serious.  It was just a joke.  I was razzing Bill because he runs this call girl service.  We tease each other like that.  He brings out the worst locker room talk from me. But I didn't think you'd mind my saying… I mean, it's not as if you're from a convent.  You tell me yourself it's just a job to you.", " Of course.  You're right.  I'm sorry.", " Vivian, I'm very sorry.  You're absolutely right.  That was an idiotic and insensitive thing I did.  I can tell that you have a lot of pride and I should have known that that would hurt you.", " Alright.  I've apologized.  I've said I'm sorry.  Now if you want to take what you've earned so far and walk out of here, I'll understand.", " Do you want me to call a cab?", " Do you?", " Then think about it.  I've apologized. I've heard what you have to say. You're right, and it won't happen again.  But if you can't get over this then you should leave, because I'm only going to be here a couple more days and I'm not going to spend it fighting with you.  Understand?", " Alright.  I'll call a cab.  If you want the clothes, pack them up.", " I'm sorry.  I really am sorry.", " I've been a fiendish cad, and I'll make it up to you.", " Because I was a boor, a clod, an oaf, a cretin, a dunce, a putz, a shmuck…", " …but I shall make amends as only a Harris can.", " I shall give you an experience that will last a lifetime.", " I'm going to take you to the opera.", " That's it.  That's what you're wearing tonight.", " She'll wear it out.  I'm taking her to Aïda in San Francisco tonight.", " Feel like Cinderella yet?", " Bill, Bill, stop panicking.  I'll read the contracts on the plane.  Just have the brokerage arrange the flight for me.  Kross isn't going anywhere.  I don't need to watch the stock go down today.  Have it ready.  I'll make a couple more stops and be there in an hour or two.  'Bye.", " My empire may crumble through neglect, but it's worth it.  I've been meaning to see Aïda before it closes and now I have a good excuse.  But you must be freezing in that skimpy thing.", " No, no.  You're bound to catch pneumonia if we don't do something.", " Nice, but not what I had in mind.  I'm looking for something really special.", " Vivian, trust me, I know furs.  I'm going to find you one that will give you multiple orgasms.", " Yes.", " I'm glad you're having fun.  Now be quiet while I read these.", " Go away.", " What are you doing?", " You'd better put on your clothes.", " You sure make it hard to concentrate on my work.", " Some people say that opera is an acquired taste —— that's why everyone prefers movies —— but I don't believe it.  It's something you're born to.  But I don't mean that in an elitist sense.  Highborn, lowborn, you can always tell when someone goes to the opera for the first time.  Some love it, some hate it.  Those who love it will always love it; those who hate it might force themselves to appreciate it, but they'll never love it.  Maybe there's an opera gene in a person's DNA.", " So am I.", " I'll whisper some of the main parts of the story for you.  But you'll be surprised at how much you'll understand by the way they sing.  The music conveys their emotions more powerfully than any words.", " Radames is desperately in love with Aïda, a mere slave.  Yet he is forced to marry Amneris, the King's daughter.", " Here he tells Aïda how much loves her but…", " Are you alright.  Can you make it down the stairs?", " You liked the opera, didn't you?", " Yes, two more nights.", " No… I have to get back to New York. I've got appointments waiting for me.", " It was a pleasure.  You're welcome.", " What's the matter?", " Oh.", " I'm sorry if it's hard on you.", " Sure.  Let me call ——", " Okay.  Order anything you want.", " You're such an operator.", " Alright.  Tell him ten—thirty.", " Wake up, sleeping beauty.", " Put on some clothes.  We're about to have a guest.", " Mr. Kross.", " Have a seat.", " Excellent.  I'm sure that will be the best for everyone.", " There is nothing to apologize for. It's just business.", " I appreciate that.  And I'm sure things will go well for you.", " Perhaps you could do me one favor though.  If you could take an hour to accompany me down to my brokerage and have a brief talk with my lawyer.  Just answer a couple questions.", " Let me be completely up front with you, Mr. Kross.  We're preparing our bid now.  That bid is based on our speculation of the corporation's net worth.  The more we know the higher our bid can be.  That might affect the deal we have for your shares…", " It doesn't have to be that way.", " Good.  Vivian ——", " Excuse me for one second.", " I'm going to be gone all day.  I don't think I'll be back in time for dinner so go ahead and eat.  Alright?", " Why'd you run off?", " I… I didn't do anything to him.", " He just realised that it would be smart to let me buy him out before his company went under.  Noboby put a gun to his head.", " Wrong?  Vivian, this is a very complex transaction.  There's no right and wrong here.  You don't know anything about this kind of business.", " What?  You think Kross is some kind of martyr?  We didn't threatten him; we bought him.  He's selling out everyone at his company to get an extra dollar a share.", " I'm getting a lecture on ethics from a prostitute.", " I don't have time for this.  If you don't like it, you're free to go.  No one's holding you prisoner.", " Everything's fine.  Let's go.", " Hmm?", " I don't know.", " I just thought I'd look at the shipyards again.  Before I go back to New York.", " Would you like to come with me?", " You can always Fedex it later.", " Yes, a few things.  Not all what we wanted to hear, but…", " But… it's not important.  Let's head back.", " Cut it out!  What's going on?!", " What the hell are you doing?", " Why were you hitting her?", " Get out of here.", " You alright?", " No one's going to hit you anymore.", " I'm sorry.", " You didn't do anything wrong.  You don't have to go.", " Viv, I'm sorry what he did.  But I want you to know I had nothing to do with it.", " Alright.  I understand.", " Here.  I was going to give you this tomorrow, but I'll give it to you now. It's three thousand.", " That's crazy.  Take it.  You need it. You earned it.", " Vivian, please, don't make this hard.", " Vivian, stay.  Please stay.", " So did you.  I'm not sure I like my own reflection. Stay with me.", " I'll sleep on the couch.  I…", " Vivian…", " Vivian?  Vivian?", " There you are.", " Where are you going?", " Last night you said you didn't want to go back.", " Wait!  Wait a second.  Let's talk about this.", " What about your clothes?  And the mink. That's a ten thousand dollar mink.", " Hold on a second.  Let's think this thing through.", " Then take the money.", " What is this?  What was last night all about?  Do you really want to go?", " What do you want from me?  You want me to tell you I'll change?  You want me to give up millions of dollars of business?  You want me say I'll marry you?", " Is everything taken care of?", " It's been wonderful.", " Good.", " Umm… pardon me.  I'm looking for someone.  She's a blond woman.  Pretty. Mouthy.  Kind of difficult…", " Yes, I think I'm lost again."], "NIGHT OPERATOR": [" Floor, sir?", " Yes, sir."], "WAITER": [" Where would you like it?", " Would you like the next course, sir?"], "EDWARD (O.S.)": [" Come in!  It's open.", " Mostly.  Sometimes the companies would pay me not to buy them.", " Vivian, I'm glad you're there.  Is everything alright?", " I'll be happy to look into it for you. To be honest, I don't know if we've bought any of your stock.", " Vivian?"], "KATE (O.S.)": [" If he's really a millionaire, what does he want you for?", " Yeah, right.  Is he some kind of pervert?", " You could of got more.", " We'll get some great smoke."], "OPERATOR": [" Lobby?", " Oh.", " I wouldn't say I know her, sir.  I've seen her.  She came down from the Penthouse.  I believe she was there with Mr. Harris.", " Yes, sir.  She must have… joined him last night.", " Floor, ma'am?", " No.", " For a brief moment.", " I am not a bellboy.  I'm an assistant manager in training.  I have a bachelors degree in Hotel management. And when I'm managing the hotel I won't allow any whores on the premises.", " Yes?", " Ah, yes.  I should have known.", " Floor, ma'am?", " Ma'am, I wanted to appologise to you for the way I behaved.  It won't happen again.", " I'm sorry about what I said."], "SALESWOMAN": [" May I help you?", " Are you looking for something in particular?", " Yes.", " It's very expensive.", " I think you should leave.  You're obviously in the wrong place.", " Please leave.", " It's very pretty.  Would you like to try it on?", " Isn't it pretty?  It's on sale.", " Oh, you're so lucky.  It's supposed to be fabulous."], "SALEWOMAN": [" I don't think it would fit you.", " Pardon?"], "MR. THOMAS": [" May I help you, Miss?", " You're a guest here?", " And who is that?", " What is the matter?", " Do you know this young lady?", " Mr. Harris?", " Are you alright?", " Why don't you come with me?  We'll chat for a moment.", " My dear, I want you to understand that there are certain things that don't happen in the Beverly Wilshire.  Things that go on in other hotels.  You understand?", " But Mr. Harris is a very special customer of this hotel.  And we like to think of our special customers as friends.  As a customer, I would expect Mr. Harris to sign in any additional guests that he wants to spend the night.  But as a friend, we're willing to overlook it.  I'm assuming you're a relative.  You must be his niece.", " Of course.  Naturally when Mr. Harris leaves, I won't see you in this hotel again.  Correct?", " I would also encourage you to dress in a more appropriate manner.", " Women's clothing. Could I speak to Bridget? Bridget, hello.  This is Mr. Thomas at the Beverly Wilshire.  Well, that's flattering. Listen, I'm going to send someone to you. She's the distant niece of a special customer of our's.  A very special customer: Mr. Harris.  Yes, the Long Island Harrises.  His niece is… from out of town. You know.  And she needs a little help dressing.  Maybe you could help?  Thank you very much.  She'll be right over.", " There you are.  If you have any other problems, come ask for me personally. I'm Mr. Thomas.", " Good evening, Mr. Harris.", " I met your… \"niece\" in the lobby today.", " That pretty young girl staying in your room.  I just assumed…", " Ah, my mistake.", " No, sir.  Good evening.", " Fine.  Hello.", " It's very pretty.  The color is very becoming on you.", " Stunning.  But Miss Vivian, it really isn't necessary for me to approve every outfit you wear.", " It's a very nice restaurant.", " You look fine.  Mind what fork you use.", " Miss Vivian.", " How?", " Oh, I'm sorry.  It really isn't that difficult.", " Well, I'm on duty right now.  Just use the one on the left.", " I…?  How am I responsible?", " Alright, come with me, young lady.  In fifteen minutes I can teach you everything you need to know to dine with the queen.", " And as you pick up the knife you shift your fork to the left hand.", " You had good parents.", " Well, he was either European or badly brought up.", " That doesn't mean a thing.  Some of the richest people I've met have the worst manners.  Of course, Mr. Harris, being of old money, knows his way around a table.", " That means he has inherited his money down a long family line.  It used to be fashionable to look down upon people who became rich through their own labor. In fact, it seems to be in fashion again. But let's continue with our lesson.  Most restaurants don't even lay out their silver correctly, so if they don't, it isn't your fault if you pick up the wrong utensil. Spoons…", " Miss Vivian.", " Where are you going?", " But you're coming back, aren't you?", " Then why don't you use one of the hotel's limousines?", " Of course.  A small perk for the guests in our better rooms.", " Discretion is our middle name here at the Beverly Wilshire.", " Miss Vivian, how are you?  I understand Mr. Harris is checking out today.  Will you be accompanying him to New York?", " Oh.", " Where did you get that bruise?", " Of course.", " Is there anything else?  Anything I can do to help you?  Would you like the limo to take you anywhere?", " Goodbye, Miss Vivian.  You're always welcome back.", " Mr. Harris.  I trust your stay has been enjoyable?", " Miss Vivian, left something for me to give to you.  Here."], "BRIDGET": [" You must be Mr. Harris' niece.", " What's your name, dear?", " Well, the mini—skirt is dead, Vivian. I don't care how many designers try to bring it back, it's dead.  Goodness, you look a like a streetwalker in that. Let's find you something else.  Come on.", " Where are you from, dear?", " No wonder.  How about this?", " Like a pastel?", " These should fit.", " Don't you like the dress?", " Then we'll just have to change you, won't we?  We have a salon on the third floor. You can get your hair, nails and make-up done a tad more conservatively.", " Of course.  By the time you get back to Nebraska they'll think you were born in Beverly Hills.  Ask for Thane.", " There we go.  Take a breath.", " Your uncle will like this.", " They never are."], "THANE": [" And I'm looking for Vivian.  Bridget told me all about you.", " Good things.  Only good things. Nebraska, right?", " Well, we'll give you the princess treatment, this way.", " Vivian, this is Yule, he'll be doing your nails.  He's very gentle.  At least he is with nails.  I don't know about anything else.", " We have a lot of work to do.  Are you with me?", " This should be the right shade for the new you.  These are samples.  You'll have to go down to cosmetics and buy them.  I'll make you a list. No, no, no.  Dear, upward strokes. Always apply the blush with upward strokes, lifting the skin like so.", " See? Very simple.  Now you try it."], "COSMETICS SALESWOMAN": [" A woman who knows what she wants."], "A.N.S.": [" How about this one?"], "N.S.": [" There's a mint green dress in the window… ?"], "VANCE": [" We can't buy any more stock without filing.", " Are you sure that's wise? I could hide some blocks under another name for a few weeks.", " Mr. Harris, this is Jake Conway.  He's our top researcher.  He'll be giving us the tour.", " He's absolutely right, Jake.  That was an incredibly stupid thing to do.", " It won't happen again.  I'll pull Jake off the project.", " The word's on the street.  Stock's at ten and a quarter.", " So we're filing?"], "JAKE": [" It's a pleasure, Mr. Harris.", " This is the jewel in Kross' crown.  Prime industrial property straddling the Port of Long Beach and Los Angeles.  We can strip out all the heavy equipment.  Some of the cranes are very valuable overseas.  World War II stuff that nobody builds anymore because it costs too much.  The Japanese are salivating for them.", " Waste processing plant.  They don't use it anymore.  Most of the yard we'll just level.  The real estate possibilities are endless.  In fact, I talked to a couple of developers —— under the table, of course —— and they said we could…", " I talked to some developers about the land.", " I'm sorry, sir.  They're close friends; they'd never breathe a word…", " I'm very sorry, Mr. Harris.", " Yes, sir.", " Your helicopter's ready, Mr. Harris.", " So, did you learn a lot from Mr. Kross?", " But what?"], "WILLIAM": [" Working on your blind pool.  How does a hundred million sound?", " Leak?  What?", " Treatment plant?  What… oh!  You son of a bitch!  What a brain!", " What are you ragging them about?", " Eighteen.", " We're lucky to get money at any rate these days.  Honest.  The junk market is not what it used to be.", " Yes,sir.  I'll try to get seventeen. I'll get seventeen.  How was your flight?  Did your model friend come with you?", " You never should have helped her get that magazine cover.  Once those airheads get a taste of fame they want nothing else.  But look, while you're in town, Robert's Agency has three new girls in and they're really hot…", " A billionaire looking for a bargain.  What, you met a pro in the hotel?", " You picked up a street walker?  Are you nuts?  You know what kind of diseases they've got?", " But a street walker?  Your ex-wife of three months raped you in court and now you're going to put a street hooker in your hotel room for a week?  She's probably calling Marvin Mitchelson right now.  What if she's got a screw loose and decides to knife you in your sleep?  What if she slits her wrists in your bathroom?  How am I going to protect you when she and the hotel sue you?", " Drop it?  I'm your lawyer for godsakes. There's nothing wrong with wanting a girl, but you have to go with a reputable agency.  If you're too fucking cheap I'll have the brokerage pick up the tab.", " Carl, we're not taking about funny money.  We're talking about hard assets and a straight liquidation.  Pull out your calculator and add it up.  There's no risk here.", " No one has ever lost money in one of our deals.", " Look, you're the assholes who fucked up!  You're the ones that's getting dragged into court!  You're the ones that got burned backing amateurs with shell companies.  You're trying to make us choke on eighteen so you can lure back the customers you scared off. We're not doing this to make your life easy.  Get on the fucking phones and do your fucking sales jobs!", " Wow, that sounds great!  We'll just wait until we've already spent the money and then ask you how much you want for it.", " You know he's got his sights set on a three billion takeover of an aerospace company.  You can't dick this guy around.", " Hey, it was a great performance--I started to believe it myself--but they're going to call their spy in the mailroom of Draymen Heux and find out it's bullshit.", " The Board knows we're after them.  The word came from Kross this morning.  He wants to talk to you alone.", " Your intentions.", " I don't think you should.", " I'll have to be present when you talk.", " Not the street walker?  You're not cocky enough to take her out in public are you?  Not with Kross.", " What's it say?", " I'll work on the papers.", " Any way I can get it, angel.", " Both.", " You're right, as usual.  Completely mortgaged down to his grandson's scholarship funds.  Best of all, he's applying for another loan.", " Oh yeah.", " Nope.  It's handled.  Nice and quiet. You can forget all about it.", " She's really a looker, huh?  Hot stuff?", " Alright, but you'll have to apologize for me if I start to drool.", " You look very familiar to me.  Haven't I seen you before?", " Have you ever worked for a call girl service or in a house?", " Just on the street?", " Jesus, Edward, you're the only billionaire I know who would go catting around street corners to find a hooker.", " No.  It's just a nice agency and I like to keep my clients happy.  But if you can find true love in Hollywood, for a great markdown, that's okay by me.", " Nothing.", " Jesus, Edward, don't be so tacky.  I can rent my own girls.", " I'm not interested.", " Thanks, Ed.  That really turns me on. Now can we just drop it?  Don't we have anything else to talk about?", " No.  No way.  You'll never get it.  Not a prayer.", " No, I didn't put a horse head in his bed.  I barely did anything.  The old coot must be more desperate than either of us thought.  He agree to sell his shares at ten under the table, but he wants to talk to you. Get assurances that you're both on the same side or something.", " Anyhow, I said you might see him this morning at your hotel room. What I'd like you to do is butter him up and then drag him here so I can grill him.", " The guy's pathetic.  All you have to do is take him by the hand and bring him over.  If we could just get him to tell us the story on the Navy repair commitments it would be worth it.", " He'll be there.", " Well, that's about it.  Thirty, sixty days.  Six months.  One year.  After that, Kross is just naval history.", " The only question in my mind is what are you going to go after next.", " What are you going to do next?", " Helicopter?  Going to the opera again?", " You're such a sentimental softy.", " No.  I want to finish that chemical bid so you can take it back to New York.", " No, you know me.  I don't like loose ends.", " Hello again.", " I take it Edward isn't back from his little helicopter trip?", " May I come in?", " You like drinking alone?", " Do you mind?", " It's been a long day. You know Edward's leaving tomorrow. Don't you?  Eleven o'clock flight.", " I'm going to leave some papers here for him to take back to New York.", " Great view.  Lord Harris sure knows how to live, doesn't he?", " Just a joke.  Between me and Ed.  This must be quite a change for a hooker off the boulevard.", " You're a very pretty girl, Vivian.  Too pretty for the street.", " What do you make a week?  Five hundred? Even that?", " With the right manager you could make a lot of money.  More than Edward's giving you. Much more than you can make on the street.", " You've got a mean streak in you.  Don't you?  Maybe that's what Edward liked about you.", " There's nothing to get hostile about. I have some friends who run a nice service.  They aren't like the pimps you find on the street.  They don't muscle you.  They just help you.  Sure, they take a cut, but since you're making a lot more money you won't even think about it.", " How long have you been on the street, Vivian?", " I figured something like that.  You act tough but you don't have a clue as to where you're going.  You're still fresh off the bus from the cornfields.  How long do you think your pretty looks are going to last?", " You're just wasting yourself.  A couple years fucking lowlifes and drug pushers and your face will be ruined.", " Edward?  Oh, now I get it.  It's starting to make sense.  You don't think Edward's going to get rid of you, do you?  What do you think?  You think Edward's going to keep you? Don't you know what a cold bastard he is?  He's not going to keep you.", " Then what's your problem?  I'm trying to help you!", " Don't talk to me like that, whore.", " Fine.  Go back to the street.  End up dead in a dumpster.  What do I care?", " That little bitch!", " That's some nasty little chick you found.  I came to drop off some papers and she started pissing me off.", " What are you?  Gentleman of the year? She's just a whore.  What difference does it make?", " Hey, watch it!  Look, I left you some papers…", " What are you doing?  You need those you asshole!  You need me!", " I don't have to put up with this shit! You're going to have to crawl back to get me!"], "BOTH": [" Yes, sir."], "MAID (O.S.)": [" Housekeeping."], "MAID": [" Would you like me to turn down your bed?", " Would you like me to turn down your bedspread?", " No, not really.  It's just a service of the hotel.", " Yes.", " It's not laziness exactly.  Is just a courtesy.", " Yeah, it always seemed stupid to me too."], "CARL": [" … and we want to continue to do business with you but the M & A market is changing.  People have been scared off by the negative press on high yield bonds.  And with the upswing in inflation we have to make these offerings more tempting to offset increased risks.", " Then go to a bank.", " Not yet.", " Bill, if you're going to liquidate the company that quickly why is eighteen such a problem…", " As far as I can tell you're already there.  You've got a fifteen percent situation in a troubled stock and you need to make a bid.  I don't think there's anywhere else you can go for the money in the time you have."], "BROKER": [" The problem here is we're dealing with a blind pool for a company we can't talk about and without a firm bid being made.  Why don't we table this discussion until you've made your offering."], "KROSS (O.S.)": [" Don't play any fucking games with me, Harris.  You know damn well what stock you have and what you don't."], "KROSS": [" I know you have control over at least twenty percent of the stock.", " If you push me I might.", " You might have some explaining to do. Those guys are tired of parasites like you jerking them around.", " I came here to talk to you.  Not to eat succotash or stare at your girlfriend's tits.  I want to talk business.", " Harris, wait.", " I'm sorry.  That was out of line.", " Miss, I'm sorry about that remark.  I apologize.  It was uncalled for.", " I'm sorry.  I'll get to the point.  I think you're trying to take over my company. Given your track record, if you get it it's easy to guess you'll liquidate it. I don't want that to happen.  I built this company up myself.  I've run it for forty years.  We're in bad shape right now, but we're going to get through it…", " What would it cost to buy out your stock?  Name your price.", " Not… right now.  But we're going to get a large contract to build four destroyers for the Navy.  They're a revolutionary design and, once we can prove it, I know we'll get more orders. I could give you a promissory note.", " We'd pay you interest.  As soon as we get the contract ——", " What do you mean?", " You've sabotaged them?", " You want me to recommend to the Board that my company be raped by a man like you?", " Your boyfriend's a real sharpie, little girl. A real shark.  That's the kind of man that makes it these days.  They smell money like blood.", " There was a time when men got rich by building things.  I built ships the size of cities!  Ships that could rule the seas into the next century.  Why, last year the Navy recommissioned a ship out of mothballs that I built forty years ago.  They did it because they knew damn well no one could build anything better!  We built this country into the greatest industrial power the world has ever known.  We creamed the Japanese!  We dwarfed the rest of the world.  Dwarfed! This country sent men to the moon! But something happened…", " We made mistakes, maybe.  I don't know. Listened to too many Harvard fags telling us how to maximize profits.  And now men like your boyfriend, they make themselves rich by sucking the money out of our shipyards. They're destroying everything we built.", " Hell, I was no saint.  I screwed people too.  But for every guy I stepped on, I gave a hundred a good job.  Men like Harris are different.  They don't give, they just take.  But stay with him, little girl.  He's going to be a good little meal ticket for you.", " Forget it.  I have to go anyway.", " No.  Thank you for this talk.  You've cleared my head.  I know what to do now.", " I'm not going to pay you off.  I'm going to fight you with every resource I have.  Neither you nor any of your cronies will ever set foot in my shipyards.  You'll burn in hell first.", " I'm never going to speak to you.  I'm never going to see your face again. I'm just going to stop you.  Got that?", " Mr. Harris.", " I can't stay very long.", " Young lady.", " I'll get to the point.  As I said earlier today to your lawyer, I've reconsidered my position on your expected acquisition offer. After the filing period is over, I'll recommend to the board that we accept your bid.", " And the other night… I want to apologize for…", " Yes.  Business.", " That's all.  I just wanted to tell you my decision in person.", " Thank you.  I'd better be going.", " I don't think that's quite proper at this time.  Maybe after the filing period.", " And if I throw myself on my sword, and you promise to take care of my family.", " Alright.  I'll answer your questions. Whatever you want."], "SECRETARY": [" How do you like it, Mr. Reaves?", " Cream or sugar?"], "SALESMAN": [" I have just the thing.", " Perhaps this is more what you had in mind…"], "PILOT": [" Mr. Harris?", " Your plane is ready to go, sir."], "DESK CLERK": [" You may use this phone.", " Everything is taken care of, sir."], "DRIVER'S VOICE": [" Is this the street, ma'am?"], "LIMO DRIVER": [" Are you sure this is the right place, ma'am?", " Maybe I should go with you.  This doesn't look like a good place for a lady to be alone.", " You sure, ma'am?", " I was getting worried."], "JIMMY": [" Hey come on over.  I don't bite.", " Just relax and get high, babe."], "CHUCK": [" You're sure a good looking piece.", " Let me see what you go under there, honey."], "CLERK": [" Yes sir, I believe so.  Let me just check the phone bill."]}