{"scenarios": ["PULP [pulp] n.", "1. A soft, moist, shapeless", "mass or matter.", "2. A magazine or book containing lurid", "subject matter and being characteristically", "printed on rough, unfinished paper.", "American Heritage Dictionary: New College Edition", "INT. COFFEE SHOP - MORNING", "A normal Denny's, Spires-like coffee shop in Los Angeles. It's", "about 9:00 in the morning. While the place isn't jammed, there's a", "healthy number of people drinking coffee, munching on bacon and", "eating eggs.", "Two of these people are a YOUNG MAN and a YOUNG WOMAN. The Young", "Man has a slight working-class English accent and, like his fellow", "countryman, smokes cigarettes like they're going out of style.", "It is impossible to tell where the Young Woman is from or how old", "she is; everything she does contradicts something she did. The boy", "and girl sit in a booth. Their dialogue is to be said in a rapid-", "pace \"HIS GIRL FRIDAY\" fashion.", "The boy and girl laugh, their laughter putting a pause in there,", "back and forth.", "A WAITRESS comes by with a pot of coffee.", "The Waitress pours the Young Woman's coffee. The Young Man lights", "up another cigarette.", "The Waitress leaves. The Young Man takes a drag off of his smoke.", "The Young Woman pours a ton of cream and sugar into her coffee.", "The Young Man goes right back into it.", "He calls to the Waitress.", "Then looks to his girl.", "The Waitress comes by, pouring him some more.", "She splits.", "The Young Woman visibly takes in the idea. The Young Man continues", "in a low voice.", "The Young Woman scans the restaurant with this new information.", "She sees all the PATRONS eating, lost in conversations. The tires", "WAITRESS, taking orders. The BUSBOYS going through the motions,", "collecting dishes. The MANAGER complaining to the COOK about", "something. A smiles breaks out on the Young Woman's face.", "They both take out their .32-caliber pistols and lay them on the", "table. He looks at her and she back at him.", "And with that, Pumpkin and Honey Bunny grab their weapons, stand", "up and rob the restaurant. Pumpkin's robbery persona is that of", "the in-control professional. Honey Bunny's is that of the", "psychopathic, hair-triggered, loose cannon.", "CREDIT SEQUENCE:", "\"PULP FICTION\"", "INT. '74 CHEVY (MOVING) - MORNING", "An old gas guzzling, dirty, white 1974 Chevy Nova BARRELS down a", "homeless-ridden street in Hollywood. In the front seat are two", "young fellas - one white, one black - both wearing cheap black", "suits with thin black ties under long green dusters. Their names", "are VINCENT VEGA (white) and JULES WINNFIELD (black). Jules is", "behind the wheel.", "INT. CHEVY (TRUNK) - MORNING", "The trunk of the Chevy OPENS UP, Jules and Vincent reach inside,", "taking out two .45 Automatics, loading and cocking them.", "They CLOSE the trunk.", "EXT. APARTMENT BUILDING COURTYARD - MORNING", "Vincent and Jules, their long matching overcoats practically", "dragging on the ground, walk through the courtyard of what looks", "like a hacienda-style Hollywood apartment building.", "We TRACK alongside.", "They enter the apartment building.", "INT. RECEPTION AREA (APARTMENT BUILDING) - MORNING", "Vincent and Jules walk through the reception area and wait for the", "elevator.", "The elevator arrives, the men step inside.", "INT. ELEVATOR - MORNING", "Jules nods his head: \"Yes.\"", "Jules nods his head: \"Yes.\"", "The elevator doors open, Jules and Vincent exit.", "INT. APARTMENT BUILDING HALLWAY - MORNING", "STEADICAM in front of Jules and Vincent as they make a beeline", "down the hall.", "Jules stops Vincent.", "Jules looks at him a long moment - he's been set up.", "He starts walking down the hall.Vincent, smiling, walks a little", "bit behind.", "The two men stand in front of the door numbered \"49.\"They whisper.", "They move a little away from the door, facing each other, still", "whispering.", "Making a gun out of his finger and placing it to his head.", "Jules just looks at him.", "Jules just looks at him.", "INT. APARTMENT (ROOM 49) - MORNING", "THREE YOUNG GUYS, obviously in over their heads, sit at a table", "with hamburgers, french fries and soda pops laid out.", "One of them flips the LOUD BOLT on the door, opening it to REVEAL", "Jules and Vincent in the hallway.", "The two men stroll inside.", "The three young caught-off-guard Guys are:", "MARVIN, the black young man, who open the door, will, as the scene", "progresses, back into the corner.", "ROGER, a young blond-haired surfer kid with a \"Flock of Seagulls\"", "haircut, who has yet to say a word, sits at the table with a big", "sloppy hamburger in his hand.", "BRETT, a white, preppy-looking sort with a blow-dry haircut.", "Vincent and Jules take in the place, with their hands in their", "pockets. Jules is the one who does the talking.", "No answer.", "As Jules and Brett talk, Vincent moves behind the young Guys.", "Brett shakes his head: \"No.\"", "No answer.", "Jules grabs the burger and take a bite of it.", "Jules holds out the Big Kahuna.", "Jules grabs the cup and takes a sip.", "Roger nods his head: \"Yes.\"", "Vincent moves to the bed, reaches underneath it, pulling out a", "black snap briefcase.", "Vincent flips the two locks, opening the case. We can't see what's", "inside, but a small glow emits from the case. Vincent just stares", "at it, transfixed.", "No answer from the transfixed Vincent.", "Vincent looks up at Jules.", "Closing the case.", "As Brett talks, Jules takes out his gun and SHOOTS Roger three", "times in the chest, BLOWING him out of his chair.", "Vince smiles to himself. Jules has got style.", "Brett has just shit his pants. He's not crying or whimpering, but", "he's so full of fear, it's as if his body is imploding.", "Brett can't say a word.", "Brett still can't speak.", "Jules SNAPS, SAVAGELY TIPPING the card table over, removing the", "only barrier between himself and Brett. Brett now sits in a lone", "chair before Jules like a political prisoner in front of an", "interrogator.", "Jules takes his .45 and PRESSES the barrel HARD in Brett's cheek.", "Brett is regressing on the spot.", "Brett does his best.", "Jules' eyes go to Vincent, Vincent smirks, Jules rolls his eyes", "and SHOOT Brett in the shoulder.", "Brett SCREAMS, breaking into a SHAKING/TREMBLING SPASM in the", "chair.", "Now in a lower voice.", "The two men EMPTY their guns at the same time on the sitting", "Brett.", "AGAINST BLACK, TITLE CARD:", "MEDIUM SHOT - BUTCH COOLIDGE", "We FADE UP on BUTCH COOLIDGE, a white, 26-year-old", "prizefighter.Butch sits at a table wearing a red and blue high", "school athletic jacket. Talking to him OFF SCREEN is everybody's", "boss MARSELLUS WALLACE. The black man sounds like a cross between", "a gangster and a king.", "A hand lays an envelope full of money on the table in front of", "Butch. Butch picks it up.", "Butch nods his head: \"yes.\"", "INT. CAR (MOVING) - DAY", "Vincent Vega looks really cool behind the wheel of a 1964 cherry-", "red Chevy Malibu convertible. From the car radio, ROCKABILLY MUSIC", "PLAYS. The b.g. is a COLORFUL PROCESS SHOT.", "EXT. SALLY LeROY'S - DAY", "Sally LeRoy's is a large topless bat by LAX that Marsellus owns.", "Vincent's classic Malibu WHIPS into the near empty parking lot and", "parks next to a white Honda Civic.", "Vince knocks on the door. The front entrance is unlocked,", "revealing the Dapper Dan fellow on the inside:ENGLISH DAVE. Dave", "isn't really English, he's a young black man from Baldwin Park,", "who has run a few clubs for Marsellus, including Sally LeRoy's.", "Vincent, carrying the black briefcase from the scene between", "Vincent and Jules, steps inside. English Dave SLAMS the door in", "our faces.", "INT. SALLY LeROY'S - DAY", "The spacious club is empty this time of day. English Dave crosses", "to the bar, and Vince follows.", "VINCENT'S POV: Butch shakes hands with a huge figure with his back", "to us. The huge figure is the infamous and as of yet still UNSEEN", "Marsellus.", "English Dave smiles to himself.", "English Dave puts Vince's coffee in front of him.", "Butch bellies up to the bar next to Vincent, drinking his cup of", "\"Plain ol' American.\"", "While Butch waits for his smokes, Vincent just sips his coffee,", "staring at him. Butch looks over at him.", "Butch does a slow turn toward Vincent.", "Butch turns his body to Vincent, when...", "Vincent walks forward OUT OF FRAME, never giving Butch another", "glance. We DOLLY INTO CU on Butch, left alone in the FRAME,", "looking like he's ready to go into the manners-teaching business.", "BUTCH'S POV: Vincent hugging and kissing the obscured figure that", "is Marsellus.", "Butch makes the wise decision that is this asshole's a friend of", "Marsellus, he better let it go - for now.", "Butch is snapped out of his ass-kicking thoughts. He pays English", "Dave and walks out of the SHOT.", "DISSOLVE TO:", "INT. LANCE'S HOUSE (KITCHEN) - NIGHT", "CLOSEUP - JODY", "A woman who appears to have a fondness for earrings. Both of her", "ears are pierced five times. She also sports rings in her lips,", "eyebrows and nose.", "Jody, Vincent and a young woman named TRUDI sit at the kitchen", "table of a suburban house in Echo Park. Even though Vince is at", "the same table, he's not included in the conversation.", "Vince has been letting this conversation go through one ear and", "out the other, until that last remark.", "Jody looks at him and says as if it were the most obvious thing in", "the world.", "That thought never occurred to Vincent, but he can't deny it makes", "sense. Jody continues talking to Trudi, leaving Vincent to ponder", "the truth of her statement.", "INT. LANCE'S BEDROOM - NIGHT", "Lance, late 20s, is a young man with a wild and woolly appearance", "that goes hand-in-hand with his wild and woolly personality. LANCE", "has been selling drugs his entire adult life. He's never had a day", "job, never filed a tax return and has never been arrested. He", "wears a red flannel shirt over a \"Speed Racer\" tee-shirt.", "Three bags of heroin lie on Lance's bed.", "Lance and Vincent stand at the foot of the bed.", "Vincent takes out a roll of money that would choke a horse to", "death.", "Vincent and Lance giggle at the \"faux pas.\"", "Vincent takes out his case of the works (utensils for shooting", "up).", "Vincent takes his works out of his case and, as the two continue", "to talk, Vince shoots up.", "As he cooks his heroin...", "CLOSEUP - THE NEEDLE", "Going into Vincent's vein.", "CLOSEUP - BLOOD", "Spurting back into the syringe, mixing with the heroin.", "CLOSEUP - VINCENT'S THUMB", "Pushing down on the plunger.", "EXT. MARSELLUS WALLACE'S HOUSE - NIGHT", "Vincent walks toward the house and pulls a note off the door", "CLOSEUP - NOTE", "The Not reads:", "\"Hi Vincent,", "I'm getting dressed. The door's", "open. Come inside and make", "yourself a drink.", "Mia\"", "(music in)", "INT. MARCELLUS' HOUSE / LIVING ROOM - NIGHT", "Vincent enters on the background.", "INT. MARCELLUS' HOUSE / DRESSING ROOM - NIGHT", "MIA, Marcellus' beautiful young wife. Video screens are in the", "background. Dusty Springfield is singing \"SON OF A PREACHER MAN\".", "Mia's mouth comes toward a microphone.", "INT. MARCELLUS' HOUSE / LIVING ROOM - NIGHT", "Vincent turns.", "INT. MARCELLUS' HOUSE / DRESSING ROOM - NIGHT", "INT. MARCELLUS' HOUSE / LIVING ROOM - NIGHT", "Vincent walks.", "Vincent finds the intercom on the wall.", "INT. MARCELLUS' HOUSE / DRESSING ROOM - NIGHT", "INT. MARCELLUS' HOUSE / LIVING ROOM - NIGHT", "INT. MARCELLUS' HOUSE / DRESSING ROOM - NIGHT", "A video screen with an image of Vincent, walking. The Dusty", "Springfield song continues.", "Mia turns a knob which controls the movement of the video camera", "in Marcellus'  living room.", "INT. MARCELLUS' HOUSE / LIVING ROOM - NIGHT", "Vincent picks up a bottle of scotch. He sniffs the bottle, and", "then pours it into a glass.", "INT. MARCELLUS' HOUSE / DRESSING ROOM - NIGHT", "A razor blade cuts cocaine on a mirror.", "INT. MARCELLUS' HOUSE / LIVING ROOM - NIGHT", "Vincent drinks a glass of scotch.", "INT. MARCELLUS' HOUSE / DRESSING ROOM - NIGHT", "Mia sniffs the cocaine.", "INT. MARCELLUS' HOUSE / LIVING ROOM - NIGHT", "Vincent ips the drink and looks at a portrait of Mia on the wall.", "Mia walks into the room, and takes the needle off a record. The", "Dusty Springfield song stops.", "EXT. JACKRABBIT SLIM'S - NIGHT", "In the past six years, 50's diners have sprung up all over L.A.,", "giving Thai restaurants a run for their money. They're all", "basically the same. Decor out of an \"Archie\" comic book, Golden", "Oldies constantly emanating from a bubbly Wurlitzer, saucy", "waitresses in bobby socks, menus with items like the Fats Domino", "Cheeseburger, or the Wolfman Jack Omelette, and over prices that", "pay for all this bullshit.", "But then there's JACKRABBIT SLIM'S, the big mama of 50's diners.", "Either the best or the worst, depending on your point of view.", "Vincent's Malibu pulls up to the restaurant. A big sign with a", "neon figure of a cartoon surly cool cat jackrabbit in a red", "windbreaker towers over the establishment. Underneath the cartoon", "is the name: JACKRABBIT SLIM'S. Underneath that is the", "slogan:\"Next best thing to a time machine.\"", "Mia draws a square with her hands. Dotted lines appear on the", "screen, forming a sqaure. The lines disperse.", "INT. JACKRABBIT SLIM'S - NIGHT", "Compared to the interior, the exterior was that of a quaint", "English pub. Posters from 50's A.I.P. movies are all over the wall", "(\"ROCK ALL NIGHT,\" \"HIGH SCHOOL CONFIDENTIAL,\" \"ATTACK OF THE CRAB", "MONSTER,\" and \"MACHINE GUN KELLY\"). The booths that the patrons", "sit in are made out of the cut up bodies of 50s cars.", "In the middle of the restaurant in a dance floor. A big sign on", "the wall states, \"No shoes allowed.\"So wannabe beboppers (actually", "Melrose-types), do the twist in their socks or barefeet.", "The picture windows don't look out the street, but instead, B & W", "movies of 50's street scenes play behind them. The WAITRESSES and", "WAITERS are made up as replicas of 50's icons: MARILYN MONROE,", "ZORRO, JAMES DEAN, DONNA REED, MARTIN and LEWIS, and THE PHILIP", "MORRIS MIDGET, wait on tables wearing appropriate costumes.", "Vincent and Mia study the menu in a booth made out of a red '59", "Edsel. BUDDY HOLLY (their waiter), comes over, sporting a big", "button on his chest that says:\"Hi I'm Buddy, pleasing you please", "me.\"", "Buddy exits.", "Vincent takes a look around the place. The YUPPIES are dancing,", "the DINERS are biting into big, juicy hamburgers, and the icons", "are playing their parts. Marilyn is squealing, The Midget is", "paging Philip Morris, Donna Reed is making her customers drink", "their milk, and Dean and Jerry are acting a fool.", "Vincent takes out his pouch of tobacco and begins rolling himself", "a smoke.", "After a second of watching him -", "As he finishes licking it -", "He hands her the rolled smoke. She takes it, putting it to her", "lips. Out of nowhere appears a Zippo lighter in Vincent's hand. He", "lights it.", "He begins rolling one for himself.", "As this time, the SOUND of a subway car fills the diner, making", "everything SHAKE and RATTLE. Marilyn Monroe runs to a square vent", "in the floor. An imaginary subway train BLOWS the skirt of her", "white dress around her ears as she lets out a squeal. The entire", "restaurant applauds.", "Back to Mia and Vincent.", "Buddy comes back with the drinks. Mia wraps her lips around the", "straw of her shake.", "She slides the shake over to him.", "Vincent smiles.", "He takes a sip.", "He slides the shake back.", "Then the first of an uncomfortable silence happens.", "INT. JACKRABBIT SLIM'S (LADIES ROOM) - NIGHT", "Mia powders her nose by doing a big line of coke off the bathroom", "sink. Her head jerks up from the rush.", "INT. JACKRABBIT SLIM'S (DINING AREA) - NIGHT", "Vincent digs into his Douglas Sirk steak. As he chews, his eyes", "scan the Hellsapopinish restaurant.", "Mia comes back to the table.", "Pointing at Marilyn in the white dress serving a table.", "Then, pointing at a BLONDE WAITRESS in a tight sweater and capri", "pants, taking an order from a bunch of FILM GEEKS -", "Mia nods her head: \"Yes.\"", "Mia and Vincent smile.", "Vincent is slow to answer.", "ED SULLIVAN AND MARILYN MONROE STAND ON STAGE", "Patrons cheer.", "Ed Sullivan is with Marilyn Monroe, who holds a trophy.", "Marilyn holds the trophy.", "Mia holds her hand.", "Vincent reacts.", "Vincent and Mia walk onto the dance floor, toward Ed Sullivan.", "Patrons cheer.", "Vincent and Mia walk up to the microphone.", "Mia and Vincent dance to Chuck Berry's \"YOU NEVER CAN TELL\". They", "make hand movements as they dance.", "INT. MARSELLUS WALLACE'S HOME - NIGHT", "The front door FLINGS open, and Mia and Vincent dance tango-style", "into the house, singing a cappella the song from the previous", "scene. They finish their little dance, laughing.", "Then...", "The two just stand face to face looking at each other.", "Mia moves away to attend to both. Vincent hangs up his overcoat on", "a big bronze coat rack in the alcove.", "Vincent shuffles off to the john.", "Mia moves to her CD player, thumbs through a stack of CDs and", "selects one: k.d. lang. The speakers BLAST OUT a high energy", "country number, which Mia plays air-guitar to. She dances her way", "around the room and finds herself by Vincent's overcoat hanging on", "the rack. She touches its sleeve. It feels good.", "Her hand hoes in its pocket and pulls out his tobacco pouch. Like", "a little girl playing cowboy, she spreads the tobacco on some", "rolling paper. Imitating what he did earlier, licks the paper and", "rolls it into a pretty good cigarette. Maybe a little too fat, but", "not bad for a first try. Mia thinks so anyway. Her hand reaches", "back in the pocket and pulls out his Zippo lighter. She SLAPS the", "lighter against her leg, trying to light it fancy-style like Vince", "did. What do you know, she did it! Mia's one happy clam. She", "triumphantly brings the fat flame up to her fat smoke, lighting it", "up, then LOUDLY SNAPS the Zippo closed.", "The Mia-made cigarette is brought up to her lips, and she takes a", "long, cool drag. Her hand slides the Zippo back in the overcoat", "pocket. But wait, her fingers touch something else. Those fingers", "bring out a plastic bag with white powder inside, the madman that", "Vincent bought earlier from Lance. Wearing a big smile, Mia brings", "the bag of heroin up to her face.", "INT. BATHROOM (MARSELLUS WALLACE'S HOUSE) - NIGHT", "Vincent stands at the sink, washing his hands, talking to himself", "in the mirror.", "LIVING ROOM", "Mia has the unbeknownst-to-her heroin cut up into big lines on her", "glass top coffee table. Taking her trusty hundred dollar bill like", "a human Dust-Buster, she quickly snorts the fat line.", "CLOSEUP - MIA", "Her head JERKS back. Her hands go to her nose (which feels like", "it's on fucking fire), something is terribly wrong. Then... the", "rush hits...", "BATHROOM", "Vincent dries his hands on a towel while he continues his dialogue", "with the mirror.", "LIVING ROOM", "Mia is on all fours trying to crawl to the bathroom, but it's like", "she's trying to crawl with the bones removed from her knees. Blood", "begins to drip from Mia's nose. Then her stomach gets into the act", "and she VOMITS.", "BATHROOM", "Vince continues.", "Now that he's given himself a little pep talk, Vincent's ready for", "whatever's waiting for him on the other side of that door. So he", "goes through it.", "LIVING ROOM", "We follow behind Vincent as he walks from the bathroom to the", "living room, where he finds Mia  lying on the floor like a rag", "doll. She's twisted on her back. Blood and puke are down her", "front. And her face is contorted. Not out of the tightness of", "pain, but just the opposite, the muscles in her face are so", "relaxed, she lies still with her mouth wide open. Slack-jawed.", "Vincent moves like greased lightning to Mia's fallen body. Bending", "down where she lays, he puts his fingers on her neck to check her", "pulse. She slightly stirs.", "Mia is aware of Vincent over her, speaking to her.", "But she's unable to communicate Mia makes a few lost mumbles, but", "they're not distinctive enough to be called words.", "Vincent props her eyelids open and sees the story.", "Mia is incapable of answering. He SLAPS her face hard.", "Vincent SPRINGS up and RUNS to his overcoat, hanging on the rack.", "He goes through the pockets FRANTICALLY. It's gone. Vincent makes", "a beeline to Mia. We follow.", "He reaches her and hoists the dead weight up in his arms.", "We follow behind as he hurriedly walks the practically-unconscious", "Mia through the house and out the front door.", "EXT.VINCENT'S HOT ROD (MOVING) - NIGHT", "INSERT SPEEDOMETER: red needle on a hundred.", "Vincent driving like a madman in a town without traffic laws,", "speeds the car into turns and up and over hills.", "INT.VINCENT'S HOT ROD (MOVING) - NIGHT", "Vincent, one hand firmly on the wheel, the other shifting like", "Robocop, both eyes staring straight ahead except when he glances", "over at Mia.", "Mia, slack-jawed expression, mouth gaping, posture of a bag of", "water.", "Vincent takes a cellular phone out of his pocket. He punches a", "number.", "INT. LANCE'S HOUSE - NIGHT", "At this late hour, LANCE has transformed from a bon vivant drug", "dealer to a bathrobe creature.", "He sits in a big comfy chair, ratty blue gym pants, a worn-out but", "comfortable tee-shirt that has, written on it, \"TAFT, CALIFORNIA\",", "and a moth-ridden terry cloth robe. In his hand is a bowl of Cap'n", "Crunch with Crunch Berries. In front of him on the coffee table is", "a jug of milk, the box the Cap'n Crunch with Crunch Berries came", "out of, and a hash pipe in an ashtray.", "On the big-screen TV in front of the table is the Three Stooges,", "and they're getting married.", "The phone RINGS.", "Lance puts down his cereal and makes his way to the phone.", "It RINGS again.", "Jody, his wife, CALLS from the bedroom, obviously woken up.", "VINCENT IN THE MALIBU", "Vincent is still driving like a stripe-assed ape, clutching the", "phone to his ear. WE CUT BACK AND FORTH during the conversation.", "At that moment insideLance's house, WE HEARVINCENT's Malibu coming", "up the street. Lance hangs up the phone, goes to his curtains and", "YANKS the cord. The curtains open with a WHOOSH in time to  see", "Vincent's Malibu DRIVING UP on his front lawn and CRASHING into", "his house. The window Lance is looking out of SHATTERS from the", "impact.", "Lance CHARGES from the window, out the door to his front lawn.", "EXT. LANCE'S HOUSE - NIGHT", "Vincent is already out of the car, working on getting Mia out.", "INT. LANCE'S HOUSE - NIGHT", "WE START in Lance's and Jody's bedroom.", "Jody, in bed, throws off the covers and stands up. She's wearing a", "long tee-shirt with a picture of Fred Flintstone on it.", "We follow HANDHELD behind her as she opens the door, walking", "through the hall into the living room.", "As she walks in the living room, she sees Vincent and Lance", "standing over Mia, who's lying on the floor in the middle of the", "room.", "From here on in, everything in this scene is frantic, like a", "DOCUMENTARY in an emergency ward, with the big difference here", "being nobody knows what the fuck they're doing.", "Lance looks up at Jody.", "She angrily turns and disappears into the bedroom looking for the", "shot.", "WE MOVE into the room with the two men.", "WE FOLLOW Lance as he runs out of the living room into a...", "INT. SPARE ROOM", "With a bunch of junk in it. He frantically starts scanning the", "junk for the book he's looking for, repeating the words, \"Come", "on,\" endlessly.", "From OFF SCREEN we hear:", "Lance continues his frenzied search.", "WE HEAR Jody in the living room now as she talks to Vincent.", "Jody calls to LANCE.", "As he continues searching, flipping and knocking over shit, Jody", "appears in the doorway.", "Lance spins toward her.", "Lance angrily knocks over a pile of shit and leaves the SHOT", "heading for the living room.", "LIVING ROOM", "Vincent is bent over Mia, talking softly to her, when Lance", "reenters the room.", "Lance bends down by the black case brought in by Jody. He opens it", "and begins preparing the needle for injection.", "Vince rips her blouse open.", "Jody stumbles back in the room, hanging back from the action.", "Vince points to Mia's right breast.Lance glances over and nods.", "As Lance readies the injection, Vincent looks up at Jody.", "Jody runs to the desk, opens the top drawer and, in her", "enthusiasm, she pulls the drawer out of the desk, the contents of", "which (bills, papers, pens) spill to the floor.", "The injection is ready. Lance hands Vincent the needle.", "Jody hurriedly joins them in the huddle, a big fat red magic", "marker in her hand.", "Vincent grabs the magic marker out of Jody's hand and makes a big", "red dot inMIA's body where her heart is.", "Lance demonstrates a stabbing motion, which looks like \"The Shape\"", "killing its victims in \"HALLOWEEN\".", "Vincent lifts the needle up above his head in a stabbing motion.", "He looks down on Mia.", "Mia is fading fast. Soon nothing will help her.", "Vincent's eyes narrow, ready to do this.", "Lance, on this knees right beside Vincent, does not know what to", "expect.", "RED DOT on Mia's body.", "Needle raised ready to strike.", "Jody's face is alive with anticipation.", "NEEDLE in that air, poised like a rattler ready to strike.", "The needle leaves frame, THRUSTING down hard.", "Vincent brings the needle down hard, STABBING Mia in the chest.", "Mia's head if JOLTED from the impact.", "The syringe plunger is pushed down, PUMPING the adrenalin out", "through the needle.", "Mia's eyes POP WIDE OPEN and she lets out a HELLISH cry of the", "banshee. She BOLTS UP in a sitting position, needle stuck in her", "chest - SCREAMING.", "Vincent, Lance and Jody, who were in sitting positions in front of", "Mia, JUMP BACK, scared to death.", "Mia's scream runs out. She slowly starts taking breaths of air.", "The other three, now scooted halfway across the room, shaken to", "their bones, look to see if she's alright.", "Mia, still breathing, not looking up at them, says in a relatively", "normal voice.", "Vincent and Lance collapse on their backs, exhausted and shaking", "from how close to death Mia came.", "INT. VINCENT'S MALIBU (MOVING) - NIGHT", "Vincent is behind the wheel driving Mia home. No one says", "anything, both are still too shaken.", "EXT. FRONT OF MARSELLUS WALLACE'S HOUSE - NIGHT", "The Malibu pulls up to the front. Mia gets out without saying a", "word (still in a daze) and begins walking down the walkway toward", "her front door.", "She turns around.", "Vincent's out of the car, standing on the walkway, a big distance", "between the two.", "Mia smiles.", "The two walk toward each other, holding out their hands to shake", "and shake they do.", "Mia lets go of Vincent's hand and silently makes the see-no-evil,", "hear-no-evil, and speak-no-evil sign with her hands.", "Vincent smiles.", "Mia giggles.", "Vincent turns to leave.", "Vincent turns around.", "They both smile, but neither laugh.", "Mia turns and walks inside her house.", "CLOSEUP - VINCENT", "After Mia walks inside. Vincent continues to look at where she", "was. He brings his hands to his lips and blows her a kiss. Then", "exits FRAME leaving it empty. WE HEAR his Malibu START UP and", "DRIVE AWAY.", "FADE UP", "On the cartoon \"SPEED RACER.\" Speed is giving a detailed", "description of all the features on his race car \"The Mac-5,\" which", "he does at the beginning of every episode.", "OFF SCREEN we hear a WOMAN'S VOICE", "BUTCH'S POV", "We're in the living room of a modest two bedroom house in", "Alhambra, California, in the year 1972. BUTCH'S MOTHER, 35ish,", "stands in the doorway leading into the living room. Next to her is", "a man dressed in the uniform of an American Air Force officer. The", "CAMERA is the perspective of a five-year old boy.", "CAPT. KOONS steps inside the room toward the little boy and bends", "down on one knee to bring him even  ith the boy's eyeline. When", "Koons speaks, he speaks with a slight Texas accent.", "The Captain pulls a gold wrist watch out of his pocket.", "Capt. Koons hands the watch to Butch. A little hand comes into", "FRAME to accept it.", "INT. LOCKER ROOM - NIGHT", "The 27-year old Butch Coolidge is dressed in boxing regalia:", "trunks, shoes and gloves. He lies on a table catching a few", "zzzzzz's before his big fight. Almost as soon as WE CUT to him, he", "wakes up with a start. Shaken by the bizarre memory, he wipes his", "sweaty face with his boxing glove.", "His trainer KLONDIKE, an older fireplug, opens the door a little,", "sticking his head in the room. Pandemonium seems to be breaking", "out behind Klondike in the hallway.", "Klondike steps inside, closing the door on the WILD MOB outside.", "He goes to the long yellow robe hanging on a hook. Butch hops off", "the table and, without a word, Klondike helps him on with the", "robe, which says on the back: \"BATTLING BUTCH COOLIDGE\".", "The two men head for the door. Klondike opens the door for Butch.", "As Butch steps into the hallway, the  Crowd goes apeshit. Klondike", "closes the door behind him, leaving us in the quiet, empty locker", "room.", "TITLE CARD:", "\"THE GOLD WATCH\"", "WE HEAR OVER THE BLACK AND WHITE TITLE:", "The SOUND of chaos in the b.g.", "EXT. ALLEY (RAINING) - NIGHT", "A taxi is parked in a dark alley next to an auditorium. The sky is", "PISSIN' DOWN RAIN. WE SLOWLY DOLLY toward the parked car. The", "SOUND of the CAR RADIO can be heard coming from inside.", "INT. TAXI (PARKED/RAINING) - NIGHT", "Inside the taxi, behind the wheel, is a female cabbie named", "ESMARELDA VILLALOBOS. A young woman, with Spanish looks, sits", "parked, drinking a steaming hot cup of coffee out of a white", "styrofoam cup.", "The Sportscasters continue their coverage.", "Esmarelda shuts off the radio.", "She takes a sip of coffee, then hears a NOISE behind her in the", "alley. She sticks her head out of the car door to see:", "EXT. BOXING AUDITORIUM (RAINING) - NIGHT", "A window about three stories high opens on the auditorium-side of", "the alley. A gym bag is tossed out into a garbage dumpster below", "the window. Then, Butch Coolidge, still dressed in boxing trunks,", "shoes, gloves and yellow robe, LEAPS to the dumpster below.", "ESMARELDA'S REACTION takes in the strangeness of this sight.", "Gym bag in hand, Butch CLIMBS out of the dumpster and RUNS to the", "taxi. Before he climbs in, he takes off his robe and throws it to", "the ground.", "INT. TAXI (PARKED / RAINING) - NIGHT", "Butch, soaking wet, naked except for trunks, shoes and gloves,", "HOPS in the backseat, SLAMMING the door.", "Esmarelda, staring straight ahead, talks to Butch through the", "rearview mirror:", "The ignition key is TWISTED. The engine ROARS to life.", "The meter is FLIPPED on.", "Esmarelda's bare foot STOMPS on the gas pedal.", "EXT. BOXING AUDITORIUM (RAINING) - NIGHT", "The cab WHIPS out of the alley, FISH-TAILING on the wet pavement", "in front of the auditorium at a rapid pace.", "INT. WILLIS LOCKER ROOM (AUDITORIUM) - NIGHT", "Locker room door opens, Enghlish Dave fights his way through the", "pandemonium which is going on outside in the hall, shutting the", "door on the madness. Once inside, English Dave takes time to", "adjust his suit and tie. Mia is standing by the door. She sees", "Vincent with English Dave.", "In the room, black boxer FLOYD RAY WILLIS lies on a table - dead.", "His face looks like he went dunking for bees. His TRAINER is on", "his knees, head on Floyd's chest, crying over the body.", "The huge figure that is Marsellus Wallace stands at the table,", "hand on the Trainer's shoulder, lending emotional support. We", "still do not see Marsellus clearly, only that he is big.", "Mia sits in a chair at the far end of the room.", "Marsellus looks up, sees English Dave and walks over to him.", "INT. CAB (MOVING / RAINING) - NIGHT", "Butch gets one of his boxing gloves off.", "Esmeralda watches in the rearview mirror.", "He tries to roll down one of the backseat windows, but can't find", "the roll bar.", "She presses a button and the back window moves down. Butch tosses", "his boxing glove out the window, then starts untying the other", "one.", "Esmeralda can't keep quiet anymore.", "As he tosses his other glove out the window.", "He finished wiping himself down.", "He tosses the towel out the window.", "Silence, as Butch digs in his bag for a t-shirt.", "Butch pulls on his tee-shirt.", "Esmarelda bounces in her seat with excitment.", "Butch leans forward. Esmarelda, keeping her eyes on the road,", "passes a cigarette back to him. He takes it. Then, still not", "looking behind her, she brings up her hand, a lit match in it.", "Butch lights his smoke, then blows out the match.", "He takes a long drag.", "He looks at her license", "Esmarelda nods her head: \"yes.\"", "EXT. PHONE BOOTH (RAINING) - NIGHT", "We DOLLY around a phone booth as Butch talks inside.", "Butch hangs up the phone. He looks at the cab waiting to take him", "wherever he wants to go.", "EXT. MOTEL (STOPPED / RAINING) - NIGHT", "Esmeralda's taxi pulled into the motel parking lot. The rain has", "stopped, but the night is still soaked. Butch gets out, now fully", "dressed in tee-shirt, jeans and high school athletic jacket. He", "leans in the driver's side window.", "Handing her the money.", "Butch holds up a hundred dollar bill.", "Esmarelda's eyes light up. She goes to take it. Butch holds it out", "of reach.", "He gives her the bill.", "He tweaks her nose, she smiles, and he turns and walks away. She", "drives off.", "INT. MOTEL (ROOM SIX) - NIGHT", "Butch enters and turns on the light.", "Lying curled up on the bed, fully dressed, with her back to us is", "Butch's French girlfriend, FABIENNE.", "Butch flicks the switch back, making the room dark again.", "Butch climbs into bed, spooning Fabienne from behind.", "When Butch and Fabienne speak to each other, they speak in baby-", "talk.", "Fabienne rolls over and Butch gets on top of her. They kiss.", "Butch nods his head: \"yes.\"", "Butch nods his head: \"yes.\"", "Butch nods his head: \"no.\"", "Butch nods his head: \"yes.\"", "Butch's hand goes out of frame and starts massaging her crotch.", "Fabienne reacts.", "Fabienne lies her head back.", "Butch continues to massage her crotch.", "Butch kisses her on the mouth.", "She nods her head: \"yes.\"", "Butch's head goes down out of frame to carry out the oral", "pleasure. Fabienne's face is alone in the frame.", "MOTEL ROOM", "Same motel room, except empty. WE HEAR THE SHOWER RUNNING in the", "bathroom. The CAMERA MOVES to the bathroom doorway. We see", "Fabienne in a white terry cloth robe that seems to swallow her up.", "She's drying her head with a towel. Butch is inside the shower", "washing up. We see the outline of his naked body through the smoky", "glass of the shower door. Steam fills the bathroom. Butch turns", "the shower off and opens the door, popping his head out.", "She finishes drying her hair and wraps the towel like a turban on", "her head.", "She hands him a towel.", "Butch exits the bathroom. We stay on Fabienne as she brushes her", "teeth.", "Butch keeps on from the other room.", "Fabienne brushes her teeth. We watch her for a moment or two, then", "she remember something.", "She walks out of the bathroom to ask Butch a question, only to", "find him sound asleep in bed.", "She looks at him for a moment.", "She exits frame, going back in the bathroom. WE STAY on the WIDE", "SHOT of the unconscious Butch in bed.", "MOTEL ROOM - MORNING", "SAME SHOT AS BEFORE, the next morning. We find Butch still asleep", "in bed.", "Fabienne brushes her teeth half in and half out of the bathroom so", "she can watch TV at the same time. She still wears the terry cloth", "robe from the night before.", "ON TV: WILLIAM SMITH and a BUNCH OF HELL'S ANGELS are taking on", "the entire Vietnamese army in the film \"THE LOSERS\".", "Butch wakes from his sleep, as if a scary monster was chasing him.", "His start startles Fabienne.", "Butch squints down the front of the bed at her, trying to focus.", "Butch, still trying to chase the cobwebs away, sees on TV Hell's", "Angels tear-assin' through a Vietnamese prison camp.", "Fabienne enters the room.", "She reaches over and turns off the TV.", "Fabienne laughs.", "Laying on top of him.", "She kisses Butch.", "Fabienne gives Butch a sweet long kiss.", "Butch climbs out of bed and starts pulling clothes out of the", "suitcase that Fabienne brought.", "Butch is finished dressing.", "As he goes through the suitcase.", "By now, Butch is frantically rummaging through the suitcase.", "He's now throwing clothes.", "Fabienne can hardly speak, she's never seen Butch this way.", "Fabienne is crying and scared.", "Butch lowers his voice, which only serves to make him more", "menacing.", "Butch freaks out, he punches the air.", "Fabienne SCREAMS and backs into a corner,", "Butch picks up the motel TV and THROWS IT AGAINST the wall.", "Fabienne SCREAMS IN HORROR.", "Butch looks toward her, suddenly calm.", "He bends down in front of the woman who has sunk to the floor.", "He touches her hand, she flinches.", "He kisses her hand. Then rises.", "Fabienne is still sniffling.", "Butch goes to the closet.", "Butch puts on his high school jacket.", "Rising from the floor.", "Butch brings her close and puts his hands on her face.", "He kisses her once more and heads for the door.", "And with that, he's out the door.", "Fabienne sits on the bed and looks at the money he gave her.", "INT. HONDA (MOVING) - DAY", "Butch is beating the steering wheel and the dash with his fists as", "he drives down the street.", "EXT. CITY STREET - DAY", "The little Honda races toward its destination as fast as is little", "engine will take it.", "A parking meter red flag rises up, then out, leaving the arrow", "pointing at one hour.", "EXT. RESIDENTIAL STREET CORNER - DAY", "Butch isn't completely reckless. He has parked his car a couple of", "blocks from his apartment to check things out before he goes", "boppin' through the front door.", "EXT. ALLEY - DAY", "Butch walks down the alley until he gets to another street, then", "he discreetly glances out.", "EXT. STREET - BUTCH'S APARTMENT - DAY", "Everything seems normal. More or less the right number of cars in", "the street. None of the parked cars appear out of place. None of", "them have a couple of goons sitting inside. Basically, it looks", "like normal morning activity in front of Butch's home.", "Butch peers around a wall, taking in the vital information.", "Butch walks out of the alley and is ready for anything. He crosses", "the street and enters his apartment courtyard.", "Across the street from Butch's building, on the corner, is a", "combination donut shop and Japanese restaurant. A big sign sticks", "up in the air, with the name \"Teriyaki Donut\" and a graphic of a", "donut sticking out of a bowl of rice.", "EXT. BUTCH'S APARTMENT COURTYARD - DAY", "Butch is in the courtyard of his North Hollywood apartment", "building. Once again, everything appears normal - the laundry", "room, the pool, his apartment door - nothing appears disturbed.", "Butch climbs the stairs leading to his apartment, number 12. He", "steps outside the door and listens inside. Nothing.", "Butch slowly inserts the key into the door, quietly opening it.", "INT. BUTCH'S APARTMENT - DAY", "His apartment hasn't been touched.", "He cautiously steps inside, shuts the door and takes a quick look", "around. Obviously, no one is there.", "Butch walks into his modest kitchen, and opens the refrigerator.", "He takes out a carton of milk and drinks from", "it.", "With carton in hard, Butch surveys the apartment. Then he goes to", "the bedroom.", "His bedroom is like the rest of the apartment - neat, clean and", "anonymous. The only things personal in his room are a few boxing", "trophies, an Olympic silver medal, a framed issue of \"Ring", "Magazine\" with Butch on the cover, and a poster of Jerry Quarry", "and one of George Chuvalo.", "Sure enough, there's the watch just like he said it was: On the", "bedside table, hanging on his little kangaroo statue.", "He walks through the apartment and back into the kitchen. He opens", "a cupboard and takes out a box of Pop Tarts. Putting down the", "milk, he opens the box, takes out two Pop Tarts and puts them in", "the toaster.", "Butch glances to his right, his eyes fall on something.", "What he sees is a small compact Czech M61 submachine gun with a", "huge silencer on it, lying on his kitchen counter.", "He picks up the intimidating peace of weaponary and examines it.", "Then... a toilet FLUSHES.", "Butch looks up to the bathroom door, which is parallel to the", "kitchen. There is someone behind it.", "Like a rabbit caught in a radish patch, Butch freezes, not knowing", "what to do.", "The bathroom door opens and Vincent Vega steps out of  the", "bathroom, tightening his belt. In his hand is the book \"MODESTY", "BLAISE\" by Peter O'Donnell.", "Vincent and Butch lock eyes.", "Vincent freezes.", "Butch doesn't move, except to point the M61 in Vincent's", "direction.", "Neither man opens his mouth.", "Then... the toaster LOUDLY kicks up the Pop Tarts.", "That's all the situation needed.", "Butch's finger HITS the trigger.", "MUFFLED FIRE SHOOTS out of the end of the gun.", "Vincent is seemingly WRACKED with twenty bullets SIMULTANEOUSLY -", "LIFTING him off his feet, PROPELLING him through the air and", "CRASHING through the glass shower door at the end of the bathroom.", "By the time Butch removes his finger from the trigger, Vincent is", "annihilated.", "Butch stands frozen, amazed at what just happened. His look goes", "from the grease spot in the bathroom that was once Vincent, down", "to the powerful piece of artillery in his grip.", "With the respect it deserves, Butch carefully places the M61 back", "on the kitchen counter.", "Then he exits the apartment, quickly.", "EXT. APARTMENT COURTYARD - DAY", "Butch, not running, but walking very rapidly, crosses the", "courtyard", "... comes out of the apartment building, crosses the street", "... goes through the alley", "... and into his car in one STEADICAM SHOT.", "EXT. HONDA - DAY", "Butch CRANKS the car into gear and drives away. The big wide smile", "of a survivor breaks across his face.", "EXT. APARTMENT BUILDING STREET - DAY", "The Honda turns down the alley and slowly cruises by his apartment", "building.", "INT. HONDA - DAY", "Butch looks out the window at his former home.", "This makes the boxer laugh out loud. As he laughs, he flips a tape", "in the cassette player. When the MUSIC starts, he SINGS along with", "it.", "He drives by the apartment, but is stopped at the light on the", "corner across from Teriyaki Donut.", "Butch is still chuckling, singing along with the song, as we see:", "THROUGH THE WINDSHIELD", "The big man himself, Marsellus Wallace, exit Teriyaki Donut,", "carrying a box of a dozen donuts and two large styrofoam cups of", "coffee. He steps off the curb, crossing the street in front of", "Butch's car. This is the first time we see Marsellus clearly.", "Laughing boy stops when he sees the big man directly in front of", "him.", "When Marsellus is in front of Butch's car, he casually glances to", "his left, sees Butch, continues walking... then STOPS!", "DOUBLE-TAKE: \"Am I really seeing what I'm seeing?\"", "Butch doesn't wait for the big man to answer his own question. He", "STOMPS on the gas pedal.", "The little Honda SLAMS into Marsellus, sending him, the donuts and", "the coffee HITTING the pavement at thirty miles an hour.", "Butch CUTS into cross traffic and is BROAD-SIDED by a gold Camaro", "Z-28, BREAKING all the windows in the Honda and sending it up on", "the sidewalk.", "Butch sits dazed and confused in the crumpled mess of what at one", "time was Fabienne's Honda. Blood flows from his nostrils. The", "still-functional tape player continues to play. A PEDESTRIAN pokes", "his head inside.", "Butch look at him, spaced-out.", "Marsellus Wallace lies sprawled out in the street. GAWKERS gather", "around the body.", "This jerk's yelling makes Marsellus come to.", "TWO PEDESTRIANS help the shaken Butch out of the wreckage.", "The woozy Marsellus gets to his feet.", "Marsellus follows the Gawker's finger and sees Butch Coolidge down", "the street, looking a shambles.", "The big man takes out a .45 Automatic and the Gawkers back away.", "Marsellus starts moving toward Butch.", "Butch sees the fierce figure making a wobbly bee-line toward him.", "Marsellus brings up his weapon and FIRES, but he's so hurt, shaky", "and dazed that his arm goes wild.", "He HITS a LOOKY-LOO WOMAN in the hip. She falls to the ground,", "screaming.", "That's all Butch needs to see. He's outta here.", "Marsellus RUNS after him.", "The CROWD looks agape.", "Butch is in a mad, limping RUN.", "The big man's hot on his ass with a cockeyed wobbly run.", "Butch cuts across traffic and dashes into a business with a sign", "that reads \"MASON-DIXIE PAWNSHOP\".", "INT. MASON-DIXIE PAWNSHOP - DAY", "MAYNARD, a hillbilly-lookin' boy, stands behind the counter of his", "pawnshop when, all of a sudden, chaos in the form of Butch RACES", "into his world.", "Butch quickly takes measure of the situation, than stands next to", "the door.", "Before Maynard can finish his threat, Marsellus CHARGES in. He", "doesn't get past the doorway  because Butch LANDS his fist in", "Marsellus' face.", "The gangster's feet go out from under him and the big man FALLS", "FLAT on his back.", "Outside, two police cars with their SIRENS BLARING race by.", "Butch POUNCES on the fallen body, PUNCHING him twice more in the", "face.", "Butch takes the gun out of Marsellus' hand, than grabs ahold of", "his middle finger.", "He BREAKS the finger. Marsellus lets out a pain sound.Butch then", "places the barrel of the .45 between his eyes, PULLS back the", "hammer and places his open hand behind the gun to shield the", "splatter.", "Butch and Marsellus look up at Maynard, who's brandishing a pump-", "action shotgun, aimed at the two men.", "Butch does.", "Butch slowly gets up and moves to the counter. As soon as he gets", "there, Maynard HAULS OFF, HITTING him hard in the face with the", "butt of the shotgun, knocking Butch down and out.", "After Butch goes down, Maynard calmly lays the shotgun on the", "counter and moves to the telephone.", "Marsellus Wallace, from his position on the floor, groggily", "watches the pawnshop owner dial a number. Maynard waits on the", "line while the other end rings. Then it picks up.", "Marsellus passes out.", "INT. PAWNSHOP BACK ROOM - DAY", "TWO SHOT - BUTCH AND MARSELLUS", "They are tied up in two separate chairs. In their mouths are two", "S&M-style ball gags (a belt goes around their heads and a little", "red ball sticks in their mouths). Both men are unconscious.", "Maynard steps in with a fire extinguisher and SPRAYS both guys", "until they're wide awake and wet as otters. The two prisoners look", "up at their captors.", "Maynard stands in front of them, fire extinguisher in one hand,", "shotgun in the other, and Marsellus' .45 sticking in his belt.", "A BUZZER buzzes.", "Without saying another word, Maynard climbs up the stairs that", "lead to red curtains and goes through them.", "WE HEAR, on the other side of the curtains, Maynard let Zed inside", "the store.", "Butch and Marsellus look around the room. The basement of the", "pawnshop has been converted into a dungeon. After taking in their", "predicament, Butxh and Marsellus look at each other, all traces of", "hostility gone, replaced by a terror they both share at what", "they've gotten themselves into.", "Maynard and ZED come through the curtains. Zed is an even more", "intense version of Maynard, if such a thing is possible. The two", "hillbillys are obviously brothers. Where Maynard is a vicious", "pitbull, Zed is a deadly cobra. Zed walks in and stands in front", "of the two captives. He inspects them for a long time, then says:", "Butch makes no reply.", "Maynard opens a trap door in the floor.", "Maynard reaches into the hole and comes back holding onto a leash.", "He gives it a rough yank and, from below the floor, rises THE", "GIMP.", "The Gimp is a man they keep dressed from head to toe in black", "leather bondage gear. There are zippers, buckles and studs here", "and there on the body. On his head is a black leather mask with", "two eye holes and a zipper (closed) for a mouth. They keep him in", "a hole in the floor big enough for a large dog.", "Zed takes the chair, sits it in front of the two prisoners, then", "lowers into it. Maynard hands The Gimp's leash to Zed, then backs", "away.", "The Gimp gets on its knees.", "Maynard hangs back while Zed appraises the two men.", "Then with his little finger, Zed does a silent \"Eenie, meany,", "miney, moe... \" just his mouth mouthing the words and his finger", "going back and forth between the two.", "Butch are Marsellus are terrified.", "Maynard looks back and forth at the victims.", "The Gimps's eyes go from one to the other inside the mask.", "Zed continues his silent sing-song with his finger moving left to", "right, then it stops.", "TWO SHOT - BUTCH AND MARSELLUS", "After a beat, THE CAMERA MOVES to the right, zeroing in on", "Marsellus.", "Zed stands up.", "Zed grabs Marsellus' chair and DRAGS him into Russell's old room.", "Russell, no doubt, was some other poor bastard that has the", "misfortune of stumbling into the Mason-Dixie pawnshop. Whatever", "happened to Russell is known only to Maynard and Zed because his", "old room, a back room in the back of the back room, is empty.", "As Marsellus is dragged away, he locks eyes with Butch before he", "disappears behind the door of Russell's old room.", "The Gimp rises. Maynard ties The Gimp's leash to a hook on the", "ceiling.", "The Gimp bows its head: \"yes.\"Maynard disappears into Russell's", "old room. There must be a stereo in there because suddenly The", "Judds, singing in harmony, fills the air.", "Butch looks at The Gimp. The Gimp giggles from underneath the mask", "as if this were the funniest moment in the history of comedy.", "From behind the door we hear country MUSIC, struggling, and:", "We the HEAR Maynard and Zed beat on Marsellus.", "Butch pauses, listens to the voices. Then, in a panic, hurriedly", "struggles to get free.", "The Gimp is laughing wildly.", "The ropes are on too tight and Butch can't break free.", "The Gimp slaps his knee laughing", "In the back room, we hear:", "Butch stops struggling and lifts up on his arms. Then, quite", "easily, the padded chair back slides up and off as if it were", "never connected by a bolt.", "The Gimp sees this and its eyes widen.", "The Gimp FLAILS WILDLY, trying to get the leash off the hook. He", "tries to yell, but all that comes out are excited gurgles and", "grunts.", "Butch is out of his chair, quickly dispensing three BOXER'S", "PUNCHES to its face. The punches knock The Gimp out, making him", "fall to his knees, this HANGING HIMSELF by the leash attached to", "the hook,", "Butch removes the ball gag, then silently makes his way through", "the red curtains.", "INT. PAWNSHOP - DAY", "Butch sneaks to the door.", "On the counter is a big set of keys with a large Z connected to", "the ring. Grabbing them, he's about to go out when he stops and", "listens to the hillbilly psychopaths having their way with", "Marsellus.", "Butch decides for the life of him, he can't leave anybody in a", "situation like that. Se he begins rooting around the pawnshop for", "a weapon to bash those hillbillies' heads in with.", "He picks up a big destructive-looking hammer, then discards it:", "Not destructive enough. He picks up a chainsaw, thinks about it", "for a moment, then puts it back. Next, a large Louisville slugger", "he tries on for size. But then he spots what he's been looking", "for:", "A Samurai sword.", "It hands in its hand-carved wood sheath from a nail on the wall,", "next to a neon \"DAD'S OLD-FASHIONED ROOT BEER\" sign. Butch takes", "the sword off the wall, removing it from ist sheath. It's a", "magnificent piece of steel. It seems to glisten in the low-wattage", "light of the pawnshop. Butch touches his thumb to the blade to see", "if the sword is just for show. Not on your life. It's as sharp as", "it gets. This weapon seems made to order for the Brothers Grimm", "downstairs. Holding the sword pointed downward, Takakura Ken-", "style, he disappears through the red curtains to take care of", "business.", "INT. PAWNSHOP BACK ROOM - DAY", "Butch quietly sneaks down the stairs leading to the dungeon.", "Sodomy and the Judds can still be heard going string behind the", "closed door that leads to Russell's old room.", "INT. RUSSELL'S OLD ROOM - DAY", "Butch's hand comes into frame, pushing the door open. It swings", "open silently, revealing the rapists, who have switched positions.", "Zed is now bent over Marsellus, who is bent over a wooden horse.", "Maynard watches. Both have their backs to Butch.", "Maynard faces the CAMERA, grinning, while Butch comes up behind", "him with the sword.", "Miserable, violated, and looking like a rag doll, Marsellus, red", "ball gag still in mouth, opens his watery eyes to see Butch coming", "up behind Maynard. His eyes widen.", "Maynard turns and sees Butch holding the sword.", "Butch SCREAMS... with one mighty SWING, SLASHES Maynard across the", "front, moving past him, eyes and blade now locked on Zed.", "Maynard stands trembling, his front sliced open, in shock.", "Butch, while never taking his eyes off Zed, THRUSTS the sword", "behind him, SKEWERING Maynard, then EXTRACTS it, pointing the", "blade toward Zed. Maynard COLLAPSES.", "Zed disengages from Marsellus in a hurry and his eyes go from the", "tip of Butch's sword to Marsellus' .45 Automatic, which lies", "within reach.", "Butch's eyes follow Zed's.", "Zed's hand inches toward the weapon.", "Butch GRIPS the sword tighter.", "Zed studies Butch.", "Butch looks hard at Zed.", "Then a VOICE says:", "Butch steps aside, REVEALING Marsellus standing behind him,", "holding Maynard's pump-action shotgun.", "KABOOM!!!!", "Zed is BLASTED in the groin. Down he goes, SCREAMING in AGONY.", "Marsellus, looking down at his whimpering rapist, EJECTS the used", "shotgun shell.", "Butch lowers the sword and hangs back. Not a word, until:", "Long pause.", "The two men shake hands, then hug one another.", "Butch leaves Russell's old room through the red curtains.", "Marsellus walks over to a phone, dialing a number.", "EXT. MASON-DIXIE PAWNSHOP - DAY", "Butch, still shaking in his boots, exits the pawnshop. He looks", "ahead and sees, parked in front of the establishment, Zed's Big", "Chrome Chopper with a teardrop gas tank that has the name \"GRACE\"", "on it. He climbs aboard, takes out the keys with the big Z on them", "and starts up the huge hog. It RUMBLES to life, making sounds like", "a rocket fighting for orbit. Butch twists the accelerator handle", "and SPEEDS off.", "WE CUT BACK AND FORTH BETWEEN...", "INT. BUTCH AND FABIENNE'S HOTEL ROOM - DAY", "Fabienne stands in front of a mirror wearing a \"Frankie says,", "Relax\" tee-shirt, singing along with MUSIC coming from a BOOM BOX.", "EXT. CITY STREET - CHOPPER (MOVING) - DAY", "Butch drives down the street, humping a hot dog named \"GRACE.\" He", "checks his father's watch. It says: 10:30.", "The SONG in the motel room PLAYS OVER this.", "EXT. MOTEL ROOM - DAY", "Butch rides up on Grace. He hops off and runs inside the motel", "room, while we stay outside with the bike.", "Butch runs out and hops back on the bike. Fabienne exits the motel", "room with the boom box and a large purse. When she sees Butch on", "the chopper, she stops dead.", "Fabienne slowly approaches the two-wheel demon.", "She doesn't move.", "Butch looks at her.", "Fabienne starts to cry.", "Butch realizes that this is not the way to get her on the bike. He", "turns off the engine and reaches out, taking her", "hand.", "Fabienne does climb on. Butch STARTS her up.", "And with that, the two lovebirds PEEL AWAY on Grace, as the SONG", "on the BOOM BOX RISES.", "TITLE CARD:", "\"JULES VINCENTJIMMIE &THE WOLF\"", "TITLE DISAPPEARS.", "Over black, we can HEAR in the distance, men talking.", "INT. BATHROOM - DAY", "We're in the bathroom of the Hollywood apartment we were in", "earlier. In fact, we're there at exactly the same time. Except", "this time, we're in the bathroom with the FOURTH MAN. The Fourth", "Man is pacing around the small room, listening hard to what's", "being said on the other side of the door, tightly CLUTCHING his", "huge silver .357 Magnum.", "BANG! BANG! BOOM! POW! BAM BAM BAM BAM BAM!", "The Fourth Man freaks out. He THROWS himself against the back", "wall, gun outstretched in front of him, a look of yellow fear on", "his face, ready to blow in half anybody fool enough to stick their", "head through that door.", "Then he listens to them talk.", "Waiting for them isn't the smartest move. Bursting out the door", "and blowing them all away while they're fuckin' around is the way", "to go.", "INT. APARTMENT - DAY", "The bathroom door BURSTS OPEN and the Fourth Man CHARGES out,", "silver Magnum raised, FIRING SIX BOOMING SHOTS from his hand", "cannon.", "DOLLY INTO Fourth Man, same as before.", "He SCREAM until he's dry firing. Then a look of confusion crosses", "his face.", "TWO SHOT - JULES AND VINCENT", "Standing next to each other, unharmed. Amazing as it seems, none", "of the Fourth Man's shots appear to have hit anybody. Jules and", "Vincent exchange looks like, \"Are we hit?\" They're as confused at", "the shooter. After looking at each other, they bring their looks", "up to the Fourth Man.", "The Fourth Man is taken out of the scenario by the two men's", "bullets who, unlike his, HIT their marks. He drops DEAD.", "The two men lower their guns. Jules, obviously shaken, sits down", "in a chair. Vincent, after a moment of respect, shrugs it off.", "Then heads toward Marvin in the corner.", "Jules rises, moving toward Vincent.", "Vincent prepares to leave.", "EXT. HOLLYWOOD APARTMENT BUILDING - MORNING", "The Chevy Nova PROPELS itself into traffic.", "INT. NOVA (MOVING) - MORNING", "Jules is behind the wheel,Vincent in the passenger seat and Marvin", "in the back.", "Vincent turns to the backseat with the .45 casually in his grip.", "Vincent's .45 goes BANG!", "Marvin is hit in the upper chest, below the throat. He GURGLES", "blood and SHAKES.", "Jules takes out a cellular phone and starts punching digits.", "INT. JIMMIE'S BATHROOM - DAY", "Jules is bent over a sink, washing his bloody hands while Vincent", "stands behind him.", "Jules rises and dries his hands. Vincent takes his place at the", "sink.", "Vincent finishes, then dries his hands on a white towel.", "When Vincent is finished drying his hands, the towel is stained", "with red.", "INT. JIMMIE'S KITCHEN - MORNING", "Three men are standing in Jimmie's kitchen, each with a mug of", "coffee. Jules, Vincent and JIMMIE DIMMICK, a young man in his late", "20s dressed in a bathrobe.", "Jules starts to \"Jimmie\" him -", "Jules starts to \"Jimmie\" him.", "INT. MARSELLUS WALLACE'S DINING ROOM - MORNING", "Marsellus Wallace sits at his dining table in a big comfy robe,", "eating his large breakfast, while talking on the phone.", "INT. JIMMIE'S BEDROOM - MORNING", "Jules paces around in Jimmie's bedroom on the phone.", "INT. HOTEL SUITE - MORNING", "The CAMERA looks through the bedroom doorway of a hotel suite into", "the main area. We SEE a crap game being played on a fancy crap", "table by GAMBLERS in tuxedos and LUCKY LADIES in fancy evening", "gowns. The CAMERA PANS to the right revealing: Sitting on a bed,", "phone in hand with his back to us, the tuxedo-clad WINSTON WOLF", "aka \"THE WOLF\". We also see The Wolf has a small notepad that he", "jots details", "in.", "We SEE his book. The page has written on it:", "\"1265 Riverside Drive", "Toluca Lake", "1 body (no head)", "Bloody shot-up car", "Jules (black)\"", "He writes:", "\"Vincent (Dean Martin)", "Jimmie (house)", "Bonnie (9:30)\"", "He hangs up. We never see his face.", "TITLE CARD OVER BLACK:", "\"NINE MINUTES AND THIRTY-SEVEN SECONDS LATER\"", "EXT. JIMMIE'S STREET - MORNING", "A silver Porsche WHIPS the corner leading to Jimmie's home, in", "HYPER DRIVE. Easily doing 135 mph, the Porsche stops on a dime in", "front of Jimmie's house.", "A ringed finger touches the doorbell: DING DONG.", "INT. JIMMIE'S HOUSE - MORNING", "Jimmie opens the door. We see, standing in the doorway, the", "tuxedo-clad man. He looks down to his notebook, then up at Jimmie.", "In the dining room, Jules and Vincent stand up.", "INT. JIMMIE'S GARAGE - MORNING", "The three men hand back as The Wolf examines the car. He studies", "the car in silence, opening the door, looking inside, circling it.", "Jimmie exists. The Wolf continues his examination.", "INT. KITCHEN - MORNING", "Jimmie hands The Wolf a cup of coffee.", "He takes a sip, then, pacing as he thinks, lays out for the three", "men the plan of action.", "The Wolf and Jimmie turn, heading for the bedroom, leaving Vincent", "and Jules standing in the kitchen.", "The Wolf stops and turns around.", "The Wolf takes a step toward him.", "INT. JIMMIE'S BEDROOM - MORNING", "Jimmie's gathering all the bedspreads, quilts and linen he has.", "The Wolf is on the phone.", "Jimmie comes over with a handful of linen.", "INT. GARAGE - MORNING", "Both Jules and Vincent are inside the car cleaning it up. Vincent", "is in the front seat washing windows, while Jules is in the", "backseat, picking up little pieces of skull and gobs of brain.", "Both are twice as bloody as they were before.", "INT. CHEVY NOVA - MORNING", "The interior of the car has been cleaned and lined with bedspreads", "and quilts. Believe it or not, what looked like a portable", "slaughterhouse can actually pass for a non-descript vehicle.", "The Wolf circles the car examining it.", "Jules and Vincent stand aside, their clothes are literally a", "bloody mess, but they do have a sense of pride in what a good job", "they've done.", "EXT. JIMMIE'S BACKYARD - MORNING", "Jules and Vincent stand side by side in their black suits, covered", "in blood, in Jimmie's backyard. Jimmie holds a plastic Hefty trash", "bag, while The Wolf holds a garden hose with one of those guns", "nossles attached.", "As they follow directions, The Wolf enjoys a smoke.", "He hands the now-naked men a bar of soap.", "He hits the trigger, water SHOOTS OUT, SMACKING both men.", "The two men, trembling, scrub themselves.", "The Wolf stops the hose, tossing it on the ground.", "Jimmie tosses them each a towel, which they rub furiously across", "their bodies.", "JULES ANDVINCENT", "In their tee-shirts and swim trunks. They look a million miles", "away from the black-suited, bad-asses we first met.", "The Wolf and Jimmie laugh.", "INT. JIMMIE'S GARAGE - MORNING", "The garbage bag is tossed in the car trunk on top of Marvin. The", "Wolf SLAMS is closed.", "EXT. MONSTER JOE'S TRUCK AND TOW - MORNING", "Jules and Vincent wait by Winston's Porsche.", "Jules and Vincent bump fists.", "Winston laughs, the boys groan.", "Winston grabs Jules' wrist and pantomimes like he's in a \"DEAD", "ZONE\" trance.", "Winston turns to leave.", "He turns around.", "The Wolf smiles.", "He turns and banters with Raquel as they get in the Porsche.", "The Porsche SHOOTS OFF down the road.", "The two men left alone look at each other.", "INT. COFFEE SHOP - MORNING", "Jules and Vincent sit at a booth. In front of Vincent is a big", "stack of pancakes and sausages, which he eats with gusto. Jules,", "on the other hand, just has a cup of coffee and a muffin. He seems", "far away in thought. The Waitress pours a refill for both men,", "The two men laugh.", "Vincent takes a bite of food. Jules takes a sip of coffee In the", "b.g., we see a PATRON call the Waitress.", "We recognize the patron to be Pumpkin from the first scene of", "Pumpkin and Honey Bunny.", "Vincent exitsfor the restroom.", "Jules, alone, takes a mouthful of muffin, then... Pumpkin and", "Honey Bunny rise with guns raised.", "Jules looks up, not believing what he's seeing. Under the table,", "Jules' hand goes to his .45 Automatic. He pulls it out, COCKING", "IT.", "Like lightning, Pumpkin moves over to the kitchen. While Honey", "Bunny SCREAMS out threats to the PATRONS, keeping them terrified.", "Three COOKS and two BUSBOYS come out of the kitchen.", "They comprende. The portly MANAGER speaks up.", "Pumpkin head his way.", "He reaches him and sticks the barrel of his gun hard in the", "Manager's neck.", "The Patrons SCREAM. Jules watches all this silently, his hand", "tightly gripping the .45 Automatic under the table.", "INT. COFFEE SHOP BATHROOM - MORNING", "Vincent, on the toilet, oblivious to the pandemonium outside,", "reads his \"MODESTY BLAISE\" book.", "INT. COFFEE SHOP - MORNING", "Cash register drawer opens. Pumpkin stuffs the money from the till", "in his pocket. Then walks from behind the counter with a trash bag", "in his hand.", "Pumpkin goes around collecting wallets. Jules sits with his .45", "ready to spit under the table.", "Pumpkin sees Jules sitting in his booth, holding his wallet,", "briefcase next to him. Pumpkin crosses to him, his tone more", "respectful, him manner more on guard.", "Jules DROPS his wallet in the bag. Using his gun as a pointer,", "Pumpkin points to the briefcase.", "Jules' free hand lays palm flat on the briefcase.", "Pumpkin is definitely surprised by his answer. He aims the gun", "right in the middle of Jules' face and pulls back the hammer.", "This exchange has been kind of quiet, not everybody heard it, but", "Honey Bunny senses something's wrong.", "Jules raises his hand off the briefcase.", "Jules flips the locks and opens the case, revealing it to Pumpkin", "but not to us. The same light SHINES from the case. Pumpkin's", "expression goes to amazement. Honey Bunny, across the room, can't", "see shit.", "Jules nods his head: \"yes.\"", "Jules nods his head: \"yes.\"", "Jules SLAMS the case closed, then sits back, as if offering the", "case to Pumpkin. Pumpkin, one big smile, bends over to pick up the", "case.", "Like a rattlesnake, Jules' free hand GRABS the wrist of Pumpkin's", "gun hand, SLAMMING it on the table. His other hand comes from", "under the table and STICKS the barrel of his .45 hand under", "Pumpkin's chin.", "Honey Bunny freaks out, waving his gun in Jules' direction.", "Whenever Jules talks to Yolanda, he never looks at her, only at", "Pumpkin.", "No answer.", "Pumpkin looks at him.", "Pumpkin lets go of his gun and places both hands on the table.", "Yolanda can't stand it anymore.", "Yolanda WHIPS her gun toward the stranger.", "Vincent, by the bathroom, has his gun out, dead-aimed at Yolanda.", "Pumpkin looks in the bag and - sure enough - there's a wallet with", "\"Bad Motherfucker\" embroidered on it.", "Jules lowers his gun, lying it on the table.", "Pumpkin looks at him, to the money in his hand, then to Yolanda.", "She looks back.", "Grabbing the trash bag full of wallets, the two RUN out the door.", "Jules, who was never risen from his seat the whole time, takes a", "sip of coffee.", "He pushes it aside.", "Vincent appears next to Jules.", "Vincent throws some money on the table and Jules grabs the", "briefcase.", "Then, to the amazement of the Patrons, the Waitresses, the Cooks,", "the Bus Boys, and the Manager, these two bad-ass dudes - wearing", "UC Santa Cruz and \"I'm with Stupid\" tee-shirts, swim trunks,", "thongs and packing .45 Automatics - walk out of the coffee shop", "together without saying a word.", "THE END"]}