{"YOUNG MAN": [" No, forget it, it's too risky. I'm through doin' that shit.", " I know that's what I always say. I'm always right too, but -", " - yeah, well, the days of me forgittin' are over, and the days of me rememberin' have just begun.", " I sound like a sensible fucking man, is what I sound like.", " Well take heart, 'cause you're never gonna hafta hear it again. Because since I'm never gonna do it again, you're never gonna hafta hear me quack about how I'm never gonna do it again.", " Correct. I got all tonight to quack.", " I'm doin' fine.", " I mean the way it is now, you're takin' the same fuckin' risk as when you rob a bank. You take more of a risk. Banks are easier! Federal banks aren't supposed to stop you anyway, during a robbery. They're insured, why should they care? You don't even need a gun in a federal bank. I heard about this guy, walked into a federal bank with a portable phone, handed the phone to the teller, the guy on the other end of the phone said: \"We got this guy's little girl, and if you don't give him all your money, we're gonna kill 'er.\"", " Fuckin' A it worked, that's what I'm talkin' about! Knucklehead walks in a bank with a telephone, not a pistol, not a shotgun, but a fuckin' phone, cleans the place out, and they don't lift a fuckin' finger.", " I don't know. There probably never was a little girl - the point of the story isn't the little girl. The point of the story is they robbed the bank with a telephone.", " I'm not sayin' I wanna rob banks, I'm just illustrating that if we did, it would be easier than what we been doin'.", " Naw, all those guys are goin' down the same road, either dead or servin' twenty.", " What have we been talking about? Yeah, no- more-liquor-stores. Besides, it ain't the giggle it usta be. Too many foreigners own liquor stores. Vietnamese, Koreans, they can't fuckin' speak English. You tell 'em: \"Empty out the register,\" and they don't know what it fuckin' means. They make it too personal. We keep on, one of those gook motherfuckers' gonna make us kill 'em.", " I don't wanna kill anybody either. But they'll probably put us in a situation where it's us of them. And if it's not the gooks, it these old Jews who've owned the store for fifteen fuckin' generations. Ya got Grandpa Irving sittin' behind the counter with a fuckin' Magnum. Try walkin' into one of those stores with nothin' but a telephone, see how far it gets you. Fuck it, forget it, we're out of it.", " Not this life.", " Garcon! Coffee!", " This place.", " What's wrong with that? People never rob restaurants, why not? Bars, liquor stores, gas stations, you get your head blown off stickin' up one of them. Restaurants, on the other hand, you catch with their pants down. They're not expecting to get robbed, or not as expecting.", " Correct. Just like banks, these places are insured. The managers don't give a fuck, they're just tryin' to get ya out the door before you start pluggin' diners. Waitresses, forget it, they ain't takin' a bullet for the register. Busboys, some wetback gettin' paid a dollar fifty a hour gonna really give a fuck you're stealin' from the owner. Customers are sittin' there with food in their mouths, they don't know what's goin' on. One minute they're havin' a Denver omelette, next minute somebody's stickin' a gun in their face.", " See, I got the idea last liquor store we stuck up. 'Member all those customers kept comin' in?", " They you got the idea to take everybody's wallet.", " That was a good idea.", " We made more from the wallets then we did the register.", " A lot of people go to restaurants.", " Pretty smart, huh?", " Remember, same as before, you're crowd control, I handle the employees.", " I love you, Honey Bunny."], "YOUNG WOMAN": [" You always say that, the same thing every time: never again, I'm through, too dangerous.", " - but you forget about it in a day or two -", " When you go on like this, you know what you sound like?", " You sound like a duck. Quack, quack, quack, quack, quack, quack, quack...", " After tonight.", " Oh yes, thank you.", " Did it work?", " Did they hurt the little girl?", " You wanna rob banks?", " So you don't want to be a bank robber?", " And no more liquor stores?", " I'm not gonna kill anybody.", " Well, what else is there, day jobs?", " Well what then?", " Here? It's a coffee shop.", " I bet in places like this you couldcut down on the hero factor.", " Yeah.", " Uh-huh.", " Thanks.", " Yes we did.", " A lot of wallets.", " Pretty smart. I'm ready, let's go, right here, right now.", " Got it.", " I love you, Pumpkin."], "WAITRESS": [" Can I get anybody anymore coffee?", " \"Garcon\" means boy."], "PUMPKIN": [" Everybody be cool this is a robbery!", " Everybody be cool, this is a robbery!", " Customers stay seated, waitresses on the floor.", " You Mexicans in the kitchen, get out here! Asta luego!", " On the floor or I'll cook you ass, comprende?", " You're gonna give me a problem?", " What? You said you're gonna give me a problem?", " I don't know, Honey Bunny. He looks like the hero type to me!", " Tell everyone to cooperate and it'll be all over.", " Well done, now git your fuckin' ass on the ground.", " Okay people, I'm going to go 'round and collect your wallets. Don't talk, just toss 'em in the bag. We clear?", " In the bag.", " What's in that?", " You boss makes you do his laundry?", " Sounds like a shit job.", " Open it up.", " I didn't hear you.", " Looks like we got a vigilante in our midst.", " You don't open up that case, it's gonna be the last.", " I'm countin' to three, and if your hand ain't off that case, I'm gonna unload right in your fuckin' face. Clear? One...", " ... two... three.", " Open it.", " Is that what I think it is?", " It's beautiful.", " Chill out, honey!", " I'm gonna be okay.", " I promise.", " Just chill out.", " Yolanda.", " It's cool, Honey Bunny, we're still cool.", " Which one is it?", " About fifteen hundred dollars.", " What?", " Not regularly."], "HONEY BUNNY": [" Any of you fuckin' pricks move and I'll execute every one of you motherfuckers! Got that?", " Any of you fuckin' pricks move and I'll execute every one of you motherfuckers! Got that?!", " Now mean fuckin' now! Do it or die, do it or fucking die!", " Don't take any chances. Execute him!", " What's goin' on?", " Shoot 'em in the face!", " What is it? What is it?", " Goddammit, what is it?", " Let him go! Let him go! I'll blow your fuckin' head off! I'll kill ya! I'll kill ya! You're gonna die, you're gonna fuckin' die bad!", " Let him go!"], "JULES": [" - Okay now, tell me about the hash bars?", " Well, hash is legal there, right?", " Those are hash bars?", " That did it, man - I'm fuckin' goin', that's all there is to it.", " What?", " Examples?", " They don't call it a Quarter Pounder with Cheese?", " What'd they call it?", " Royale with Cheese. What'd they call a Big Mac?", " Le Big Mac. What do they call a Whopper?", " What?", " Goddamn!", " Uuccch!", " We should have shotguns for this kind of deal.", " Three or four.", " I'm not sure.", " It's possible.", " Mia.", " I dunno, however people meet people. She usta be an actress.", " I think her biggest deal was she starred in a pilot.", " Well, you know the shows on TV?", " Yes, but you're aware that there's an invention called television, and on that invention they show shows?", " Well, the way they pick the shows on TV is they make one show, and that show's called a pilot. And they show that one show to the people who pick the shows, and on the strength of that one show, they decide if they want to make more shows. Some get accepted and become TV programs, and some don't, and become nothing. She starred in one of the ones that became nothing.", " You remember Antwan Rockamora? Half-black, half-Samoan, usta call him Tony Rocky Horror.", " I wouldn't go so far as to call the brother fat. He's got a weight problem. What's the nigger gonna do, he's Samoan.", " Well, Marsellus fucked his ass up good. And word around the campfire, it was on account of Marsellus Wallace's wife.", " No no no no no no no, nothin' that bad.", " He gave her a foot massage.", " Sent a couple of guys over to his place. They took him out on the patio of his apartment, threw his ass over the balcony. Nigger fell four stories. They had this garden at the bottom, enclosed in glass, like one of them greenhouses - nigger fell through that. Since then, he's kinda developed a speech impediment.", " Whaddya mean?", " You don't think he overreacted?", " It was a foot massage, a foot massage is nothing, I give my mother a foot massage.", " It ain't no ballpark either. Look maybe your method of massage differs from mine, but touchin' his lady's feet, and stickin' your tongue in her holyiest of holyies, ain't the same ballpark, ain't the same league, ain't even the same fuckin' sport. Foot massages don't mean shit.", " Don't be tellin' me about foot massages - I'm the foot fuckin' master.", " Shit yeah. I got my technique down man, I don't tickle or nothin'.", " Fuck you.", " Fuck you.", " Man, you best back off, I'm gittin' pissed - this is the door.", " What time is it?", " It ain't quite time, let's hang back.", " Look, just because I wouldn't give no man a foot massage, don't make it right for Marsellus to throw Antwan off a building into a glass-motherfuckin-house, fuckin' up the way the nigger talks. That ain't right, man. Motherfucker do that to me, he better paralyze my ass, 'cause I'd kill'a motherfucker.", " That's an interesting point, but let's get into character.", " Mia. Why you so interested in big man's wife?", " Take care of her?", " You're gonna be takin'MIA Wallace out on a date?", " Hey kids.", " How you boys doin'?", " Am I trippin', or did I just ask you a question.", " Do you know who we are?", " We're associates of your business partner Marsellus Wallace, you remember your business partner dont'ya?", " Now I'm gonna take a wild guess here: you're Brett, right?", " I thought so. Well, you remember your business partner Marsellus Wallace, dont'ya Brett?", " Good for you. Looks like me and Vincent caught you at breakfast, sorry 'bout that. What'cha eatin'?", " Hamburgers. The cornerstone of any nutritious breakfast. What kinda hamburgers?", " No, I mean where did you get'em? MacDonald's, Wendy's, Jack-in-the-Box, where?", " Big Kahuna Burger. That's that Hawaiian burger joint. I heard they got some tasty burgers. I ain't never had one myself, how are they?", " Mind if I try one of yours?", " Yours is this one, right?", " Uuummmm, that's a tasty burger. Vince, you ever try a Big Kahuna Burger?", " You wanna bite, they're real good.", " Well, if you like hamburgers give 'em a try sometime. Me, I can't usually eat 'em 'cause my girlfriend's a vegetarian. Which more or less makes me a vegetarian, but I sure love the taste of a good burger. You know what they call a Quarter Pounder with Cheese in France?", " Tell 'em, Vincent.", " Royale with Cheese, you know why they call it that?", " Check out the big brain on Brett. You'a smart motherfucker, that's right. The metric system. What's in this?", " Sprite, good, mind if I have some of your tasty beverage to wash this down with?", " Uuuuummmm, hit's the spot! You, Flock of Seagulls, you know what we're here for?", " Then why don't you tell my boy here Vince, where you got the shit hid.", " - I don't remember askin' you a goddamn thing. You were sayin'?", " We happy?", " Vincent!", " We happy?", " My name's Pitt, and you ain't talkin' your ass outta this shit.", " Oh, I'm sorry. Did that break your concentration? I didn't mean to do that. Please, continue. I believe you were saying something about \"best intentions.\"", " Whatsamatter? Oh, you were through anyway. Well, let me retort. Would you describe for me what Marsellus Wallace looks like?", " What country you from!", " \"What\" ain't no country I know! Do they speak English in \"What?\"", " English-motherfucker-can-you-speak-it?", " Then you understand what I'm sayin'?", " Now describe what Marsellus Wallace looks like!", " Say \"What\" again! C'mon, say \"What\" again! I dare ya, I double dare ya motherfucker, say \"What\" one more goddamn time!", " Now describe to me what Marsellus Wallace looks like!", " - go on!", " - does he look like a bitch?!", " Does-he-look-like-a-bitch?!", " Then why did you try to fuck 'im like a bitch?!", " Yes ya did Brett. Ya tried ta fuck 'im. You ever read the Bible, Brett?", " There's a passage I got memorized, seems appropriate for this situation: Ezekiel 25:17. \"The path of the righteous man is beset on all sides by the inequities of the selfish and the tyranny of evil men. Blessed is he who, in the name of charity and good will, shepherds the weak through the valley of darkness, for he is truly his brother's keeper and the finder of lost children. And I will strike down upon thee with great vengeance and furious anger those who attempt to poison and destroy my brothers. And you will know my name is the Lord when I lay my vengeance upon you.\"", " We should be fuckin' dead right now. Did you see that gun he fired at us? It was bigger than him.", " We should be fuckin' dead!", " That shit wasn't luck. That shit was somethin' else.", " That was... divine intervention. You know what divine intervention is?", " Yeah, man, that's what is means. That's exactly what it means! God came down from Heaven and stopped the bullets.", " Don't do that! Don't you fuckin' do that! Don't blow this shit off! What just happened was a fuckin' miracle!", " Wrong, wrong, this shit doesn't just happen.", " We should be fuckin' dead now, my friend! We just witnessed a miracle, and I want you to fuckin' acknowledge it!", " If you wanna play blind man, then go walk with a Shepherd. But me, my eyes are wide fuckin' open.", " That's it for me. For here on in, you can consider my ass retired.", " Don't blaspheme!", " - I said don't do that -", " I'm tellin' Marsellus today I'm through.", " Don't worry, I will.", " I don't give a damn if he does.", " What the fuck's happening?", " Why the fuck did you do that?", " I've seen a lot of crazy-ass shit in my time -", " The car didn't hit no motherfuckin' bump!", " Look at this mess! We're drivin' around on a city street in broad daylight -", " Well you better be thinkin' about it now, motherfucker! We gotta get this car off the road. Cops tend to notice shit like you're driving a car drenched in fuckin' blood.", " This is the Valley,Vincent. Marsellus don't got no friendly places in the Valley.", " A buddy of mine in Toluca Lake.", " On the other side of the hill, by Burbank Studios. If Jimmie's ass ain't home, I don't know what the fuck we're gonna go. I ain't got any other partners in 818. Jimmie! How you doin' man, it's Jules. Listen up man, me an' my homeboy are in some serious shit. We're in a car we gotta get off the road, pronto! I need to use your garage for a couple hours.", " We gotta be real fuckin' delicate with this Jimmie's situation. He's one remark away from kickin' our asses out the door.", " Well, we ain't leavin' 'til we made a couple phone calls. But I never want it to reach that pitch. Jimmie's my friend and you don't bust in your friend's house and start tellin' 'im what's what.", " Put yourself in his position. It's eight o'clock in the morning. He just woke up, he wasn't prepared for this shit. Don't forget who's doin' who a favor.", " What the fuck did you just do to his towel? VINCENT I was just dryin' my hands.", " You're supposed to wash 'em first.", " I watched you get 'em wet.", " I used the same soap you did and when I dried my hands, the towel didn't look like a fuckin' Maxie pad. Look, fuck it, alright. Who cares? But it's shit like this that's gonna bring this situation to a boil. If he were to come in here and see that towel like that... I'm tellin' you Vincent, you best be cool. 'Cause if I gotta get in to it with Jimmie on account of you... Look, I ain't threatenin' you, I respect you an' all, just don't put me in that position.", " Jules, you ask me nice like that, no problem. He's your friend, you handle him.", " Goddamn Jimmie, this is some serious gourmet shit. Me an' Vincent woulda been satisfied with freeze-dried Tasters Choice. You spring this gourmet fuckin' shit on us. What flavor is this?", " What?", " Jimmie -", " Naw man, I didn't.", " Why?", " Jimmie -", " That's all we want. We don't wanna fuck up your shit,We just need to call our people to bring us in.", " You got to appreciate what an explosive element this Bonnie situation is. If she comes home from a hard day's work and finds a bunch of gangsters doin' a bunch of gangsta' shit in her kitchen, ain't no tellin' what she's apt to do.", " I don't wanna hear about no motherfuckin' \"ifs.\"What I wanna hear from your ass is: \"you ain't got no problems, Jules. I'm on the motherfucker. Go back in there, chill them niggers out and wait for the cavalry, which should be comin' directly.\"", " You sendin' The Wolf?", " Shit Negro, that's all you had to say.", " Aside from how it looks, the car's cool.", " Hey man, as far as I know, the motherfucker's tip-top.", " It ain't that way, Mr. Wolf. Your help is definitely appreciated.", " I will never forgive your ass for this shit. This is some fucked-up repugnant shit!", " Man, get outta my face with that shit! The motherfucker who said that never had to pick up itty-bitty pieces of skull with his fingers on account of your dumb ass.", " You're gettin' ready to blow? I'm a mushroom-cloud-layin' motherfucker! Every time my fingers touch brain I'm \"SUPERFLY T.N.T,\" I'm the \"GUNS OF NAVARONE.\" I'm what Jimmie Walker usta talk about. In fact, what the fuck am I doin' in the back? You're the motherfucker should be on brain detail. We're tradin'. I'm washin' windows and you're pickin' up this nigger's skull.", " This morning air is some chilly shit.", " Now Jimmie, don't do nothin' stupid like puttin' that out in front of your house for Elmo the garbage man to take away.", " Goddamn, that water's fuckin' cold!", " Ha ha ha. They're your clothes, motherfucker.", " Yeah, well, out asses ain't the expert on wearin' dorky shit that your is.", " Don't do shit unless -", " Unless you do it first.", " We cool?", " Inglewood. It's your future: I see... a cab ride. Sorry guys, move out of the sticks. Say goodbye, Raquel", " Mr. Wolf.", " I was a pleasure watchin' you work.", " Wanna share a cab?", " Sure.", " Naw, I don't eat pork.", " I ain't Jewish man, I just don't dig on swine.", " They're filthy animals. I don't eat filthy animals.", " A sewer rat may taste like pumpkin pie. I'll never know 'cause even if it did, I wouldn't eat the filthy motherfucker. Pigs sleep and root in shit. That's a filthy animal. I don't wanna eat nothin' that ain't got enough sense to disregard its own feces.", " I don't eat dog either.", " I wouldn't go so far as to call a dog filthy, but they're definitely dirty. But a dog's got personality. And  personality goes a long way.", " We'd have to be talkin' 'bout one motherfuckin' charmin' pig. It'd have to be the Cary Grant of pigs.", " I just been sittin' here thinkin'.", " The miracle we witnessed.", " Do you know that a miracle is?", " What's an act of God?", " Don't you see, Vince, that shit don't matter. You're judging this thing the wrong way. It's not about what. It could be God stopped the bullets, he changed Coke into Pepsi, he found my fuckin' car keys. You don't judge shit like this based on merit. Whether or not what we experienced was an according-to-Hoyle miracle is insignificant. What is significant is I felt God's touch, God got involved.", " That's what's fuckin' wit' me! I don't know why. But I can't go back to sleep.", " The life, most definitely.", " That's what I've been sitting here contemplating. First, I'm gonna deliver this case to Marsellus. Then, basically, I'm gonna walk the earth.", " You know, like Caine in \"KUNG FU.\" Just walk from town to town, meet people, get in adventures.", " Until God puts me where he want me to be.", " If it takes forever, I'll wait forever.", " I'll just be Jules, Vincent - no more, no less.", " Look my friend, this is just where me and you differ -", " All shapes and sizes, Vince.", " If you find my answers frightening, Vincent, you should cease askin' scary questions.", " My boss' dirty laundry.", " When he wants it clean.", " Funny, I've been thinkin' the same thing.", " 'Fraid I can't do that.", " Yes, you did.", " I don't mean to shatter your ego, but this ain't the first time I've had gun pointed at me.", " Keep your fuckin' mouth closed, fat man, this ain't any of your goddamn business!", " You win.", " It's all yours, Ringo.", " Tell that bitch to be cool! Say, bitch be cool! Say, bitch be cool!", " Tell her it's gonna be okay.", " Promise her.", " Tell her to chill.", " What's her name?", " So, we cool Yolanda? We ain't gonna do anything stupid, are we?", " Nobody's gonna hurt anybody. We're gonna be like three Fonzies. And what' Fonzie like?", " C'mon Yolanda, what's Fonzie like?", " Correct-amundo! And that's what we're gonna be, we're gonna be cool. Now Ringo, I'm gonna count to three and I want you to let go your gun and lay your palms flat on the table. But when you do it, do it cool. Ready?", " One... two... three.", " Yolanda, I thought you were gonna be cool. When you yell at me, it makes me nervous. When I get nervous, I get scared. And when motherfuckers get scared, that's when motherfuckers get accidentally shot.", " That seems to be the situation. Now I don't want that and you don't want that and Ringo here don't want that. So let's see what we can do. Now this is the situation. Normally both of your asses would be dead as fuckin' fried chicken. But you  appened to pull this shit while I'm in a transitional period. I don't wanna kill ya, I want to help ya. But I'm afraid I can't give you the case. It don't belong to me. Besides, I went through too much shit this morning on account of this case to just hand it over to your ass.", " It's cool, Vincent! It's cool! Don't do a goddamn thing. Yolanda, it's cool baby, nothin's changed. We're still just talkin'. Tell her we're still cool.", " Nothin' I can't handle. I want you to just hang back and don't do shit unless it's absolutely necessary.", " Yolanda, how we doin, baby?", " Just hang in there, baby, you're doing' great,Ringo's proud of you and so am I. It's almost over. Now I want you to go in that bag and find my wallet.", " It's the one that says Bad Motherfucker on it.", " That's my bad motherfucker. Now open it up and take out the cash. How much is there?", " Put it in your pocket, it's yours. Now with the rest of them wallets and the register, that makes this a pretty successful little score.", " You ain't gonna do a goddamn thing, now hang back and shut the fuck up. Besides, I ain't givin' it to him. I'm buyin' somethin' for my money. Wanna know what I'm buyin' Ringo?", " Your life. I'm givin' you that money so I don't hafta kill your ass. You read the Bible?", " There's a passage I got memorized. Ezekiel 25:17. \"The path of the righteous man is beset on all sides by the inequities of the selfish and the tyranny of evil men. Blessed is he who, in the name of charity and good will, shepherds the weak through the valley of the darkness. For he is truly his brother's keeper and the finder of lost children. And I will strike down upon thee with great vengeance and furious anger those who attempt to poison and destroy my brothers. And you will know I am the Lord when I lay my vengeance upon you.\"I been sayin' that shit for years. And if you ever heard it, it meant your ass. I never really questioned what it meant. I thought it was just a cold- blooded thing to say to a motherfucker 'fore you popped a cap in his ass. But I saw some shit this mornin' made me think twice. Now I'm thinkin', it could mean you're the evil man. And I'm the righteous man. And Mr. .45 here, he's the shepherd protecting my righteous ass in the valley of darkness. Or is could by you're the righteous man and I'm the shepherd and it's the world that's evil and selfish.", " It's cold.", " That's probably a good idea."], "VINCENT": [" What so you want to know?", " Yeah, it's legal, but is ain't a hundred percent legal. I mean you can't walk into a restaurant, roll a joint, and start puffin' away. You're only supposed to smoke in your home or certain designated places.", " Yeah, it breaks down like this: it's legal to buy it, it's legal to own it and, if you're the proprietor of a hash bar, it's legal to sell it. It's legal to carry it, which doesn't really matter 'cause - get a load of this - if the cops stop you, it's illegal for this to search you. Searching you is a right that the cops in Amsterdam don't have.", " You'll dig it the most. But you know what the funniest thing about Europe is?", " It's the little differences. A lotta the same shit we got here, they got there, but there they're a little different.", " Well, in Amsterdam, you can buy beer in a movie theatre. And I don't mean in a paper cup either. They give you a glass of beer, like in a bar. In Paris, you can buy beer at MacDonald's. Also, you know what they call a Quarter Pounder with Cheese in Paris?", " No, they got the metric system there, they wouldn't know what the fuck a Quarter Pounder is.", " Royale with Cheese.", " Big Mac's a Big Mac, but they call it Le Big Mac.", " I dunno, I didn't go into a Burger King. But you know what they put on french fries in Holland instead of ketchup?", " Mayonnaise.", " I seen 'em do it. And I don't mean a little bit on the side of the plate, they fuckin' drown 'em in it.", " How many up there?", " Counting our guy?", " So there could be five guys up there?", " We should have fuckin' shotguns.", " What's her name?", " How did Marsellus and her meet?", " She ever do anything I woulda saw?", " What's a pilot?", " I don't watch TV.", " Yeah.", " Yeah maybe, fat right?", " I think I know who you mean, what about him?", " What'd he do, fuck her?", " Well what then?", " A foot massage?", " That's all?", " What did Marsellus do?", " That's a damn shame.", " Still I hafta say, play with matches, ya get burned.", " You don't be givin' Marsellus Wallace's new bride a foot massage.", " Antwan probably didn't expect Marsellus to react like he did, but he had to expect a reaction.", " It's laying hands on Marsellus Wallace's new wife in a familiar way. Is it as bad as eatin' her out - no, but you're in the same fuckin' ballpark. JULES Whoa... whoa... whoa... stop right there. Eatin' a bitch out, and givin' a bitch a foot massage ain't even the same fuckin' thing.", " Not the same thing, the same ballpark.", " Have you ever given a foot massage?", " Given a lot of 'em?", " Have you ever given a guy a foot massage?", " How many?", " Would you give me a foot massage - I'm kinda tired.", " Seven-twenty-two in the morning.", " I'm not sayin' he was right, but you're sayin' a foot massage don't mean nothing, and I'm sayin' it does. I've given a million ladies a million foot massages and they all meant somethin'. We act like they don't, but they do. That's what's so fuckin' cool about 'em. This sensual thing's goin' on that nobody's talkin about, but you know it and she knows it, fuckin'Marsellus knew it, and Antwan shoulda known fuckin' better. That's his fuckin' wife, man. He ain't gonna have a sense of humor about that shit.", " What's her name again?", " Well, Marsellus is leavin' for Florida and when he's gone, he wants me to take care of Mia.", " Not that! Take her out. Show her a good time. Don't let her get lonely.", " It ain't a date. It's like when you and your buddy's wife go to a movie or somethin'. It's just... you know... good company.", " It's not a date.", " No.", " I ain't hungry.", " Royale with Cheese.", " Got it.", " We're happy.", " Where's the big man?", " How 'bout a cup of just plain ol' American?", " At Marsellus' request. ENGLISH DAVE Have you met Mia?", " Not yet.", " What's so funny?", " Look, I'm not a idiot. She's the big man's fuckin' wife. I'm gonna sit across a table, chew my food with my mouth closed, laugh at her jokes and that's all I'm gonna do.", " I ain't your friend, palooka.", " I think ya heard me just fine, punchy.", " Excuse me, sorry to interrupt. I'm curious, why would you get a stud in your tongue?", " Remember, I just got back from Amsterdam.", " That's a bold statement.", " Give me three hundred worth of the madman. If it's as good as you say, I'll be back for a thousand.", " Which one's Trudi? The one with all the shit in her face?", " I'm on my way somewhere. I got a dinner engagement. Rain check?", " You don't mind if I shoot up here?", " Mucho gracias.", " You know what some fucker did to it the other day?", " Fuckin' keyed it.", " Tell me about it. I had the goddamn thing in storage three years. It's out five fuckin' days - five days, and some dickless piece of shit fucks with it.", " I just wish I caught 'em doin' it, ya know? Oh man, I'd give anything to catch 'em doin' it. It'a been worth his doin' it, if I coulda just caught 'em, you know what I mean?", " Hello?", " Hello.", " Hello.", " Okay.", " What the fuck is this place?", " Come on, Mia, let's go get a steak.", " After you, kitty-cat.", " I'll have the Douglas Sirk steak.", " Bloody as hell. And to drink, a vanilla coke. BUDDY How 'bout you, Peggy Sue?", " Did you just order a five-dollar shake?", " A shake? Milk and ice cream?", " It costs five dollars?", " You don't put bourbon in it or anything?", " Just checking.", " It's like a wax museum with a pulse rate.", " Rollin' a smoke.", " It's just tobacco.", " You can have his one, cowgirl.", " Think nothing of it.", " Sure did. I heard you did a pilot.", " What was it?", " What?", " What was your specialty?", " Do you remember any of the jokes?", " Tell me.", " C'mon, don't be that way.", " You told it in front of fifty million people and you can't tell it to me? I promise I won't laugh.", " That's not what I meant and you know it.", " I meant I wouldn't laugh at you.", " What a gyp.", " Can I have a sip of that? I'd like to know what a five-dollar shake tastes like.", " Yeah, but maybe I do.", " milk shake.", " I don't know if it's worth five dollars, but it's pretty fuckin'  good.", " What?", " I don't know.", " I don't think we're there yet. But don't feel bad, we just met each other.", " I'll do that.", " We're lucky we got it at all. Buddy Holly doesn't seem to be much of a waiter. We shoulda sat in Marilyn Monroe's section.", " No there's not.", " That's Marilyn Monroe...", " ... and that's Mamie Van Doren. I don't see Jayne Mansfield, so it must be her night off.", " I have moments.", " Actually, there's something I've wanted to ask you about, but you seem like a nice person, and I didn't want to offend you.", " Only if you promise not to get offended.", " Then let's just forget it.", " Is that a fact?", " What do you think about what happened to Antwan?", " Tony Rocky Horror.", " That's one way to say it. Another way is, he was thrown out. Another was is, he was thrown out by Marsellus. And even another way is, he was thrown out of a window by Marsellus because of you.", " No it's not, it's just what I heard.", " They.", " They certainly do.", " No. They just said Rocky Horror gave you a foot massage.", " No and, that's it.", " Yeah.", " At the time I was told, it seemed reasonable.", " No, it seemed excessive. But that doesn't mean it didn't happen. I heard Marsellus is very protective of you.", " But did it happen?", " No, no, no no, no, no, no, no.", " All right.", " All right, you asked for it.", " Was than an uncomfortable silence?", " I'm gonna take a piss.", " One drink and leave. Don't be rude, but drink your drink quickly, say goodbye, walk out the door, get in your car, and go down the road.", " ... It's a moral test of yourself, whether or not you can maintain loyalty. Because when people are loyal to each other, that's very meaningful.", " So you're gonna go out there, drink your drink, say \"Goodnight, I've had a very lovely evening,\" go home, and jack off. And that's all you're gonna do.", " Jesus Christ!", " Mia! MIA! What the hell happened?", " I'll be a son-of-a-bitch. Mia! MIA! What did you take? Answer me honey, what did you take?", " Okay honey, we're getting you on your feet.", " We're on our feet now, and now we're gonna talk out to the car. Here we go, watch us walk.", " Lance, this is Vincent, I'm in big fuckin' trouble man, I'm on my way to your place.", " You still got an adrenalin shot?", " I need it man, I got a chick she's fuckin' ODing on me.", " No choice.", " Yeah. She's dyin'.", " Negative.", " Sorry.", " Too late, I'm already here.", " If you're through havin' your little hissy fit, this chick is dyin', get your needle and git it now!", " This fucked up bitch is Marsellus Wallace's wife. Now if she fuckin' croaks on me, I'm a grease spot. But before he turns me into a bar soap, I'm gonna be forced to tell 'im about how you coulda saved her life, but instead you let her die on your front lawn.", " She's ODing on us.", " You two are a match made in heaven.", " What do you need a medical book for?", " You've had that thing for six years and you never used it?", " Well then get it.", " I'm not fuckin' stoppin' you.", " Quit fuckin' around man and give her the shot!", " Does it have to be exact?", " Well, I don't know exactly where her heart is, I think it's here.", " I need a big fat magic marker, got one?", " I need a big fat magic marker, any felt pen'll do, but a magic marker would be great.", " You're gonna give her the shot.", " I've never does this before.", " Okay, what do I do?", " I gotta stab her?", " What happens after that?", " This ain't a fuckin' joke man!", " Count to three.", " What are your thoughts on how to handle this?", " Well I'm of the opinion that Marsellus can live his whole live and never ever hear of this incident.", " I seriously doubt that.", " Let's shake on it.", " Mum's the word.", " If you'll excuse me, I gotta go home and have a heart attack.", " Sure, but I think I'm still a little too petrified to laugh.", " I can't wait.", " Mia. How you doin'?", " Why the fuck didn't you tell us about that guy in the bathroom? Slip your mind? Forget he was in there with a goddamn hand cannon?", " .357.", " Yeah, we were lucky.", " Yeah, maybe.", " Yeah, I think so. That means God came down from Heaven and stopped the bullets.", " I think we should be going now.", " Chill the fuck out, Jules, this shit happens.", " Do you wanna continue this theological discussion in the car, or at the jailhouse with the cops?", " Okay man, it was a miracle, can we leave now?", " ... Ever seen that show \"COPS?\"I was watchin' it once and this cop was on it who was talkin' about this time he got into this gun fight with a guy in a hallway. He unloads on this guy and he doesn't hit anything. And these guys were in a hallway. It's a freak, but it happens.", " What the fuck does that mean?", " Jesus Christ!", " Goddammit, Jules -", " - you're fuckin' freakin' out!", " While you're at it, be sure to tell 'im why.", " I'll bet ya ten thousand dollars, he laughs his ass off.", " Marvin, what do you make of all this?", " C'mon, Marvin. Do you think God came down from Heaven and stopped the bullets?", " I just accidentally shot Marvin in the throat.", " I didn't mean to do it. I said it was an accident.", " - chill out, man, it was an accident, okay? You hit a bump or somethin' and the gun went off.", " Look! I didn't mean to shoot this son-of- a-bitch, the gun just went off, don't ask me how!", " - I know, I know, I wasn't thinkin' about the splatter.", " Can't we just take it to a friendly place?", " Well, don't look at me, this is your town, Jules.", " Who ya callin'?", " Where's Toluca Lake.", " If he kicks us out, whadda we do?", " Just tell 'im not to be abusive. He kinda freaked out back there when he saw Marvin.", " If the price of that favor is I gotta take shit, he can stick his favor straight up his ass.", " You watched me wash 'em.", " I washed 'em. Blood's real hard to get off. Maybe if he had some Lava, I coulda done a better job.", " A \"please\" would be nice.", " I said a \"please\" would be nice.", " I don't mean any disrespect. I just don't like people barkin' orders at me.", " Did you ever hear the philosophy that once a man admits he's wrong, he's immediately forgiven for all wrong-doings?", " I got a threshold, Jules. I got a threshold for the abuse I'll take. And you're crossin' it. I'm a race car and you got me in the red. Redline 7000, that's where you are. Just know, it's fuckin' dangerous to be drivin' a race car when it's in the red. It could blow.", " All the way?", " Are you sure this is absolutely necessary?", " What?", " I'm cool, Mr. Wolf. My gun just went off, I dunno how.", " Redondo Beach.", " You know I could go for some breakfast. What to have breakfast with me?", " Thanks a bunch. Want a sausage?", " Are you Jewish?", " Why not?", " Sausages taste good. Pork chops taste good.", " How about dogs? Dogs eat their own feces.", " Yes, but do you consider a dog to be a filthy animal?", " So by that rationale, if a pig had a better personality, he's cease to be a filthy animal?", " Good for you. Lighten up a little. You been sittin' there all quiet.", " About what?", " The miracle you witnessed. I witnessed a freak occurrence.", " An act of God.", " I guess it's when God makes the impossible possible. And I'm sorry Jules, but I don't think what happened this morning qualifies.", " But why?", " So you're serious, you're really gonna quit?", " So if you're quitting the life, what'll you do?", " What do you mean, walk the earth?", " How long do you intend to walk the earth?", " What if he never does?", " So you decided to be a bum?", " No Jules, you're gonna be like those pieces of shit out there who beg for change. They walk around like a bunch of fuckin' zombies, they sleep in garbage bins, they eat what I throw away, and dogs piss on 'em. They got a word for 'em, they're called bums. And without a job, residence, or legal tender, that's what you're gonna be - a fuckin' bum!", " - what happened was peculiar - no doubt about it - but it wasn't water into wine.", " Stop fuckin' talkin' like that!", " I gotta take a shit. To be continued.", " What the hell's goin' on, Jules?", " Check.", " Jules, if you give this nimrod fifteen hundred buck, I'm gonna shoot 'em on general principle.", " I think we oughta leave now."], "BRETT": [" We're doin' okay.", " I'm Brett.", " I remember him.", " Hamburgers.", " Cheeseburgers.", " Big Kahuna Burger.", " They're good.", " No.", " Yeah.", " No.", " Because of the metric system?", " Sprite.", " Sure.", " Look, what's your name? I got his name'sVINCENT, but what's yours?", " I just want you to know how sorry we are about how fucked up things got between us and Mr. Wallace. When we entered into this thing, we only had the best intentions -", " What?", " What?", " Yes.", " Yes.", " What?", " Well he's... he's... black -", " ... and he's... he's... bald -", " What?", " No.", " I didn't.", " Yes."], "MARVIN": [" It's under the be -", " I don't even have an opinion."], "ROGER": [" It's under the bed."], "MARSELLUS (O.S.)": [" I think you're gonna find - when all this shit is over and done - I think you're gonna find yourself one smilin' motherfucker. Thing is Butch, right now you got ability. But painful as it may be, ability don't last. Now that's a hard motherfuckin' fact of life, but it's a fact of life your ass is gonna hafta git realistic about. This business is filled to the brim with unrealistic motherfuckers who thought their ass aged like wine. Besides, even if you went all the way, what would you be? Feather-weight champion of the world. Who gives a shit? I doubt you can even get a credit card based on that.", " Now the night of the fight, you may fell a slight sting, that's pride fuckin' wit ya. Fuck pride! Pride only hurts, it never helps. Fight through that shit. 'Cause a year from now, when you're kickin' it in the Caribbean you're gonna say, \"Marsellus Wallace was right.\"", " In the fifth, your ass goes down.", " Say it!", " Vincent Vega has entered the building, git your ass over here!", " What'cha got?", " I'm prepared to scour the earth for this motherfucker. If Butch goes to Indo China, I want a nigger hidin' in a bowl of rice, ready to pop a cap in his ass.", " Step aside, Butch."], "BUTCH": [" I got no problem with that.", " In the fifth, my ass goes down.", " Can I get a pack'a Red Apples?", " Non.", " Lookin' at somethin', friend?", " What was that?", " I'm ready.", " If you're the cab I called, I'm the guy you're supposed to pick up.", " Outta here.", " Hey, how do I open the window back here?", " What?", " Whatever gave you that idea?", " I'm him.", " He's dead?", " Sorry 'bout that, Floyd.", " What does what feel like?", " Are you some kinda weirdo?", " Tell ya what, you give me one of them cigarettes, I'll give you an answer.", " So...", " ... Esmarelda Villalobos - is that Mexican?", " It's a very pretty name.", " That's one hell of a name you got there, sister.", " Butch.", " I'm an American, our names don't mean shit. Anyway, moving right along, what is it you wanna know, Esmarelda?", " - I couldn't tell ya. I didn't know he was dead 'til you told me he was dead. Now I know he's dead, do you wanna know how I feel about it?", " I don't feel the least little bit bad.", " What's I tell ya, soon as the word got out a fix was in, the odds would be outta control. Hey, if he was a better fighter he's be alive. If he never laced up his gloves in the first place, which he never shoulda done, he'd be alive. Enough about the poor unfortunate Mr. Floyd, let's talk about the rich and prosperous Mr. Butch. How many bookies you spread it around with? Eight? How long to collect? So by tomorrow evening, you'll have it all? Good news Scotty, real good news - I understand a few stragglers aside. Me an' Fabienne're gonna leave in the morning. It should take us a couple days to get into Knoxville. Next time we see each other, it'll be on Tennessee time.", " Fabienne my love, our adventure begins.", " Merci beaucoup. And here's a little something for the effort.", " Now if anybody should ask you about who your fare was tonight, what're you gonna tell 'em?", " Bon soir, Esmarelda.", " Is that better, sugar pop?", " Pretty hard. I got into a fight.", " Uh-huh?", " You were lookin' in the mirror and you wish you had some pot?", " Well you should be happy, 'cause you do.", " I didn't realize there was a difference between a tummy and a pot belly.", " You want me to have a pot?", " You think guys would find that attractive?", " If I had a pot belly, I'd punch you in it.", " Right in the belly.", " You'd do that to me?", " Did you get everything, sugar pop?", " Good job.", " You didn't listen to the radio?", " I won alright.", " Sure am.", " Floyd retired too.", " Not no more.", " We ain't at the finish, baby.", " Fabienne, I want you to be with me.", " ... and ever.", " Oui.", " Will you kiss it?", " I think I cracked a rib.", " No retard, from the fight.", " My name is Fabby! My name is Fabby!", " Okay, sorry, sorry, sorry, I take it back! Can I have a towel please, Miss Beautiful Tulip.", " I didn't call you a Mongoloid, I called you a retard, but I took it back.", " Merci beaucoup.", " Yes, lemon pie.", " I'm not sure yet. Wherever you want. We're gonna get a lot of money from this. But it ain't gonna be so much, we can live like hogs in the fat house forever. I was thinking we could go somewhere in the South Pacific. The kinda money we'll have'll carry us a long way down there.", " You betcha. And if after awhile you don't dig Bora Bora, then we can move over to Tahiti or Mexico.", " You don't speak Bora Boran either. Besides, Mexican is easy: Donde esta el zapataria?", " Where's the shoe store?", " Excellent pronunciation. You'll be my little mama ceta in no time.", " What are you watching?", " Are you watchin' it?", " Would you please?", " It's a little too early in the morning for explosions and war.", " How should I know, you were the one watchin' it.", " Oh, I... don't remember. It's really rare I remember a dream.", " Fabienne, I'm not lying to you, I don't remember.", " I don't talk in my sleep, do I talk in my sleep?", "", " One more kiss and I'll get up.", " Yep.", " What time is it?", " Eleven.", " Anything to drink with that?", " Pie for breakfast?", " - where's my watch?", " No, it's not. It's not here.", " Yes I've fuckin' looked!!", " What the fuck do you think I'm doing?! Are you sure you got it?", " - on the little kangaroo.", " Oh it most definitely should be here, but it's not. So where is it?", " Fabienne, that was my father's fuckin' watch. You know what my father went through to git me that watch?... I don't wanna get into it right now... but he went through a lot. Now all this other shit, you coulda set on fire, but I specifically reminded you not to forget my father's watch. Now think, did you get it?", " You believe so? You either did, or you didn't, now which one is it?", " Are you sure?", " No! It's not your fault. You left it at the apartment.", " If you did leave it at the apartment, it's not your fault. I had you bring a bunch of stuff. I reminded you about it, but I didn't illustrate how personal the watch was to me. If all I gave a fuck about was my watch, I should've told you. You ain't a mind reader.", " Don't be. It just means I won't be able to eat breakfast with you.", " Because I'm going back to my apartment to get my watch.", " That's what I'm gonna find out. If they are, and I don't think I can handle it, I'll split.", " Don't feel bad, sugar pop. Nothing you could ever do would make me permanently angry at you. I love you, remember? Now here's some money, order those pancakes and have a great breakfast.", " I'll be back before you can say, blueberry pie.", " Well maybe not that fast, but fast. Okay? Okay?", " Bye-bye, sugar pop.", " I'm gonna take your Honda.", " Of all the fuckin' things she coulda forgot, she forgets my father's watch. I specifically reminded her not to forget it. \"Bedside table - on the kangaroo.\" I said the words: \"Don't forget my father's watch.\"", " Holy shit.", " That's how you're gonna beat 'em, Butch. They keep underestimatin' ya.", " I guess.", " Sacre bleu.", " Shut up!", " So you like chasing people, huh?", " Well guess what, big man, you caught me -", " Look mister, this ain't any of your business -", " Hey hillbilly.", " You want that gun, Zed? Pick it up.", " You okay?", " What now?", " I meant what now, between me and you?", " So we're cool?", " Deal.", " Honey, grab your radio and your purse and let's go!", " Fuck the bags. We'll miss our train if we don't split now.", " We're cool. In fact, we're super-cool. But we gots to go. I'll wait for you outside.", " It's a chopper, baby, hop on.", " Sorry baby, I crashed the Honda.", " I might've broke my nose, no biggie. Hop on.", " Honey, we gotta hit the fuckin' road!", " I'm sorry, baby-love.", " I'm sorry I worried you, sweetie. Everything's fine. Hey, how was breakfast?", " - did you get the blueberry pancakes?", " Baby-love, from the moment I left you, this has been without a doubt the single weirdest day of my entire life. Climb on an' I'll tell ya about it.", " It's a chopper.", " Zed's.", " Zed's dead, baby, Zed's dead."], "ENGLISH DAVE": [" Vincent Vega, our man in Amsterdam, git your ass on in here.", " He's over there, finishing up some business.", " Comin' up. I hear you're taking Mia out tomorrow?", " Not a goddamn thing.", " My name's Paul, and this is between y'all.", " Filters?", " He booked.", " I'll take care of it."], "ENGLISH DAVE (O.S.)": [" Hand back for a second or two, and when you see the white boy leave, go on over. In the meanwhile, can I make you an espresso?", " Pack of Red Apples, dollar-forty."], "JODY": [" ... I'll lend it to you. It's a great book on body piercing.", " Forget that gun. That gun goes against the entire idea behind piercing. All of my piercing, sixteen places on my body, every one of 'em done with a needle. Five in each ear. One through the nipple on my left breast. One through my right nostril. One through my left eyebrow. One through my lip. One in my clit. And I wear a stud in my tongue.", " It's a sex thing. It helps fellatio.", " It's only one-thirty in the goddamn mornin'! What the fuck's goin' on out here?", " Who's she?", " What's wrong with her?", " Well get her the hell outta here!", " Don't yell and me!", " Whata re you looking for?", " I never saw a medical book.", " Well if it's that important, why didn't you keep it with the shot?", " While you're lookin' for it, that girl's gonna die on our carpet. You're never gonna find it in all this shit. For six months now, I've been telling you to clean this room -", " What?", " Hold on.", " Got it.", " Anybody want a beer?"], "TRUDI": [" You know how they use that gun when they pierce your ears? They don't use that when they pierce your nipples, do they?"], "LANCE (O.S.)": [" Vince, you can come in now!", " ... two...", " ... three!"], "LANCE": [" Now this is Panda, from Mexico. Very good stuff. This is Bava, different, but equally good. And this is Choco from the Hartz Mountains of Germany. Now the first two are the same, forty-five an ounce - those are friend prices - but this one... ... this one's a little more expensive. It's fifty-five. But when you shoot it, you'll know where that extra money went. Nothing wrong with the first two. It's real, real, real, good shit. But this one's a fuckin' madman.", " Am I a nigger? Are you in Inglewood? No. You're in my house. White people who know the difference between good shit and bad shit, this is the house they come to. My shit, I'll take the Pepsi Challenge with Amsterdam shit any ol' day of the fuckin' week.", " This ain't Amsterdam, Vince. This is a seller's market. Coke is fuckin' dead as disco. Heroin's comin' back in a big fuckin' way. It's this whole seventies retro. Bell bottoms, heroin, they're as hot as hell.", " I just hope I still have it. Whaddya think of Trudi? She ain't got a boyfriend, wanna hand out an' get high?", " No, that's Jody. That's my wife.", " No problem?", " Me casa, su casa.", " Still got your Malibu?", " What?", " Oh man, that's fucked up.", " They should be fuckin' killed. No trial, no jury, straight to execution.", " It's chicken shit. You don't fuck another man's vehicle.", " I can hear it!", " I told 'em and that's what I'm gonna tell this fuckin' asshole right now! Hello, do you know how late it is? You're not supposed to be callin' me this fuckin' late.", " Whoa, hold you horses man, what's the problem?", " Maybe.", " Don't bring her here! I'm not even fuckin' joking with you, don't you be bringing some fucked up pooh-butt to my house!", " She's ODin'?", " Then bite the fuckin' bullet, take 'er to a hospital and call a lawyer!", " She ain't my fuckin' problem, you fucked her up, you deal with it - are you talkin' to me on a cellular phone?", " I don't know you, who is this, don't come here, I'm hangin' up.", " Have you lost your mind?! You crashed your car in my fuckin' house! You talk about drug shit on a cellular fuckin' phone -", " Are you deaf? You're not bringin' that fucked up bitch in my house!", " Get that black box in the bedroom I have with the adrenalin shot.", " Look, just keep talkin' to her, okay? While she's gettin' the shot, I gotta get a medical book.", " To tell me how to do it. I've never given an adrenalin shot before.", " I never had to use it. I don't go joy- poppin' with bubble-gummers, all of myfriends can handle their highs!", " I am, if you'll let me.", " Stop talkin' to me, and start talkin' to her.", " I'm looking as fast as I can!", " My black medical book!", " My black fuckin' medical book. It's like a text book they give to nurses.", " Trust me, I have one.", " I don't know! Stop bothering me!", " While I'm doing this, take her shirt off and find her heart.", " Yeah, it has to be exact! I'm giving her an injection in the heart, so I gotta exactly hit her in the heart.", " That's it.", " It's ready, I'll tell you what to do.", " No, you're gonna give her the shot.", " I've never done this before either, and I ain't starting now. You brought 'er here, that means you give her the shot. The day I bring an ODing bitch to your place, then I gotta give her the shot.", " Well, you're giving her an injection of adrenalin straight to her heart. But she's got a breast plate in front of her heart, so you gotta pierce through that. So what you gotta do is bring the needle down in a stabbing motion.", " If you want the needle to pierce through to her heart, you gotta stab her hard. Then once you do, push down on the plunger.", " I'm curious about that myself.", " She's supposed to come out of it like - - that.", " One...", " If you're okay, say something."], "MIA (V.O.)": [" Hi, Vincent. I'm getting dressed. The door's open. Come inside and make yourself a drink."], "MIA": [" Vincent.", " Vincent. I'm on the intercom.", " It's on the wall by the two African fellas.", " To your right.", " ... warm. Warmer. Disco.", " Push the button if you want to talk.", " Go make yourself a drink., and I'll be down in two shakes of a lamb's tail.", " The bar's by the fireplace.", " Let's go.", " This is Jackrabbit Slim's. An Elvis man should love it.", " You can get a steak here, daddy-o. Don't be a...", " I'll have the Durwood Kirby burger - bloody - and a five-dollar shake.", " Martin and Lewis.", " Sure did.", " Uh-huh.", " Whaddya think?", " What are you doing?", " Here?", " Oh. Well in that case, will you roll me one, cowboy?", " Thanks.", " Marsellus said you just got back from Amsterdam.", " That was my fifteen minutes.", " It was show about a team of female secret agents called \"Fox Force Five.\"", " \"Fox Force Five.\"Fox, as in we're a bunch of foxy chicks. Force, as in we're a force to be reckoned with. Five, as in there's one... two ... three... four... five of us. There was a blonde one, Sommerset O'Neal from that show \"Baton Rouge,\" she was the leader. A Japanese one, a black one, a French one and a brunette one, me. We all had special skills. Sommerset had a photographic memory, the Japanese fox was a kung fu master, the black girl was a demolition expert, the French fox' specialty was sex...", " Knives. The character I played, Raven McCoy, her background was she was raised by circus performers. So she grew up doing a knife act. According to the show, she was the deadliest woman in the world with a knife. But because she grew up in a circus, she was also something of an acrobat. She could do illusions, she was a trapeze artist - when you're keeping the world safe from evil, you never know when being a trapeze artist's gonna come in handy. And she knew a zillion old jokes her grandfather, an old vaudevillian, taught her. If we woulda got picked up, they woulda worked in a gimmick where every episode I woulda told and ol joke.", " Well I only got the chance to say one, 'cause we only did one show.", " No. It's really corny.", " No. You won't like it and I'll be embarrassed.", " That's what I'm afraid of.", " You're quite the silver tongue devil, aren't you?", " That's not what you said Vince. Well now I'm definitely not gonna tell ya, 'cause it's been built up too much.", " Yummy!", " Be my guest.", " You can use my straw, I don't have kooties.", " Kooties I can handle.", " Told ya.", " Don't you hate that?", " Uncomfortable silences. Why do we feel it's necessary to yak about bullshit in order to be comfortable?", " That's when you know you found somebody special. When you can just shit the fuck up for a minute, and comfortably share silence.", " Well I'll tell you what, I'll go to the bathroom and powder my nose, while you sit here and think of something to say.", " I said goddamn!", " Don't you love it when you go to the bathroom and you come back to find your food waiting for you?", " Which one, there's two Marilyn Monroes.", " Pretty smart.", " Did ya think of something to say?", " Oooohhhh, this doesn't sound like mindless, boring, getting-to-know-you chit-chat. This sounds like you actually have something to say.", " You can't promise something like that. I have no idea what you're gonna ask. You could ask me what you're gonna ask me, and my natural response could be to be offended. Then, through no fault of my own, I woulda broken my promise.", " That is an impossibility. Trying to forget anything as intriguing as this would be an exercise in futility.", " Besides, it's more exciting when you don't have permission.", " Who's Antwan?", " He fell out of a window.", " Is that a fact?", " Who told you this?", " They talk a lot, don't they?", " Well don't by shyVincent, what exactly did they say?", " Let me help you Bashful, did it involve the F-word?", " And...?", " You heard Marsellus threw Rocky Horror out of a four-story window because he massaged my feet?", " And you believed that?", " Marsellus throwing Tony out of a four- story window for giving me a foot massage seemed reasonable?", " A husband being protective of his wife is one thing. A husband almost killing another man for touching his wife's feet is something else.", " The only thing Antwan ever touched of mine was my hand, when he shook it. I met Anwan once - at my wedding - then never again. The truth is, nobody knows why Marsellus tossed Tony Rocky Horror out of that window except Marsellus and Tony Rocky Horror. But when you scamps get together, you're worse than a sewing circle.", " Right here.", " I wanna dance.", " No, no, no, no, no, no, no. I do believe Marsellus, my husband, your boss, told you to take me out and do whatever I wanted, Now, I want to dance. I want to win. I want that trophy.", " So, dance good.", " Missus Mia Wallace.", " Vincent Vega.", " I don't know what that was. Music and drinks!", " That was a little bit more information than I needed to know, but for right ahead.", " Disco! Vince, you little cola nut, you've been holding out on me.", " Something.", " What's yours?", " Don't worry about it. If Marsellus ever heard of this, I'd be in as much trouble as you.", " If you can keep a secret, so can I.", " You still wanna hear my \"FOX FORCE FIVE\" joke?", " Uh-huh. You won't laugh because it's not funny. But if you still wanna hear it, I'll tell it.", " Three tomatoes are walking down the street, a poppa tomato, a momma tomato, and a little baby tomato. The baby tomato is lagging behind the poppa and momma tomato. The poppa tomato gets mad, goes over to the momma tomato and stamps on him - - and says: catch up.", " See ya 'round, Vince.", " Great. I never thanked you for the dinner."], "BUDDY": [" Hi I'm Buddy, what can I get'cha?", " How d'ya want it, burnt to a crisp, or bloody as hell?", " How d'ya want that shake, Martin and Lewis, or Amos and Andy?", " Yep.", " Nope."], "ED SULLIVAN": [" Ladies and gentlemen, now the moment you've all been waiting for, the world- famous Jackrabbit Slim's twist contest.", " ... One lucky couple will win this handsome trophy that Marilyn here is holding.", " ... Now, who will be our first contestants?", " Let's hear it for our first contestants.", " Now let's meet our first contestants here this evening. Young lady, what is your name?", " And, uh, how 'bout your fella here?", " All right, let's see what you can do. Take it away!"], "PREACHER (EMIL SIMKUS)": [" Hold hands, you love birds."], "JODY (O.S.)": [" Lance! The phone's ringing!", " I thought you told those fuckin' assholes never to call this late!", " What the hell was that?", " What's he lookin' for?", " What are you lookin' for?"], "LANCE ANDVINCENT": [" Get the fuckin' shot!"], "VINCENT (O.S.)": [" Hurry up man! We're losin' her!", " I dunno, some medical book.", " - get your ass in here, fuck the book!", " Mia!", " Friend of yours?", " What the fuck's goin' on here?"], "WOMAN'S VOICE (O.S.)": [" Butch."], "MOTHER": [" Butch, stop watching TV a second. We got a special visitor. Now do you remember when I told you your daddy dies in a P.O.W. camp?", " Well this here is Capt. Koons. He was in the P.O.W. camp with Daddy."], "BUTCH (O.S.)": [" Uh-huh.", " Que hora es?", " What time is it?", " Time for bed. Sweet dream, jellybean."], "CAPT. KOONS": [" Hello, little man. Boy I sure heard a bunch about you. See, I was a good friend of your Daddy's. We were in that Hanoi pit of hell over five years together. Hopefully, you'll never have to experience this yourself, but when two men are in a situation like me and your Daddy were, for as long as we were, you take on certain responsibilities of the other. If it had been me who had not made it, Major Coolidge would be talkin' right now to my son Jim. But the way it worked out is I'm talkin' to you, Butch. I got somethin' for ya.", " This watch I got here was first purchased by your great-granddaddy. It was bought during the First World War in a little general store in Knoxville, Tennessee. It was bought by private Doughboy Ernie Coolidge the day he set sail for Paris. It was your great-granddaddy's war watch, made by the first company to ever make wrist watches. You see, up until then, people just carried pocket watches. Your great-granddaddy wore that watch every day he was in the war. Then when he had done his duty, he went home to your great- grandmother, took the watch off his wrist and put it in an ol' coffee can. And in that can it stayed 'til your grandfather Dane Coolidge was called upon by his country to go overseas and fight the Germans once again. This time they called it World War Two. Your great-granddaddy gave it to your granddad for good luck. Unfortunately, Dane's luck wasn't as good as his old man's. Your granddad was a"], "CAPT. KOONS (CONT'D)": [" Marine and he was killed with all the other Marines at the battle of Wake Island. Your granddad was facing death and he knew it. None of those boys had any illusions about ever leavin' that island alive. So three days before the Japanese took the island, your 22-year old grandfather asked a gunner on an Air Force transport named Winocki, a man he had never met before in his life, to deliver to his infant son, who he had never seen in the flesh, his gold watch. Three days later, your grandfather was dead. But Winocki kept his word. After the war was over, he paid a visit to your grandmother, delivering to your infant father, his Dad's gold watch. This watch. This watch was on your Daddy's wrist when he was shot down over Hanoi. He was captured and put in a Vietnamese prison camp. Now he knew if the gooks ever saw the watch it's be confiscated. The way your Daddy looked at it, that watch was your birthright. And he'd be damned if and slopeheads were gonna put their greasy yella hands on his boy's birthright. So he hid it in the one place he knew he could hide somethin'. His ass. Five long years, he wore this watch up his ass. Then when he died of disentary, he gave me the watch. I hid with uncomfortable hunk of metal up my ass for two years. Then, after seven years, I was sent home to my family. And now, little man, I give the watch to you."], "KLONDIKE": [" It's time, Butch."], "SPORTSCASTER #1 (O.S.)": [" - Well Dan, that had to be the bloodiest and, hands-down, the most brutal fight this city has ever seen.", " ... Coolidge was out of there faster than I've ever seen a victorious boxer vacate the ring. Do you think he knew Willis was dead?", " Do you feel this ring death tragedy will have an effect on the world of boxing?"], "SPORTSCASTER #2 (O.S.)": [" My guess would be yes, Richard. I could see from my position here, the frenzy in his eyes give way to the realization of what he was doing. I think any man would've left the ring that fast.", " Oh Dan, a tragedy like this can't help but shake the world of boxing to its very foundation. But it's of paramount importance that during the sad weeks ahead, the eyes of the W.B.A. remain firmly fixed on the - CLICK -"], "ESMARELDA": [" Are you the man I was supposed to pick up?", " Where to?", " I have to do it.", " Hey, mister?", " You were in that fight? The fight on the radio - you're the fighter?", " No c'mon, you're him, I know you're him, tell me you're him.", " You killed the other boxing man.", " The radio said he was dead.", " What does it feel like?", " Killing a man. Beating another man to death with your bare hands.", " No, it's a subject I have much interest in. You are the first person I ever met who has killed somebody. So, what was it like to kill a man?", " Deal!", " The name is Spanish, but I'm Columbian.", " It mean \"Esmarelda of the wolves.\"", " Thank you. And what is your name?", " Butch. What does it mean?", " I want to know what it feels like to kill a man -", " Forty-five sixty.", " The truth. Three well-dressed, slightly toasted, Mexicans.", " Sleep well, Butch."], "FABIENNE": [" Keep the light off.", " Oui. Hard day at the office?", " Poor baby. Can we make spoons?", " I was looking at myself in the mirror.", " I wish I had a pot.", " A pot. A pot belly. Pot bellies are sexy.", " Shut up, Fatso! I don't have a pot! I have a bit of a tummy, like Madonna when she did \"Lucky Star,\" it's not the same thing.", " The difference is huge.", " No. Pot bellies make a man look either oafish, or like a gorilla. But on a woman, a pot belly is very sexy. The rest of you is normal. Normal face, normal legs, normal hips, normal ass, but with a big, perfectly round pot belly. If I had one, I'd wear a tee-shirt two sizes too small to accentuate it.", " I don't give a damn what men find attractive. It's unfortunate what we find pleasing to the touch and pleasing to the eye is seldom the same.", " You'd punch me in my belly?", " I'd smother you. I'd drop it on your right on your face 'til you couldn't breathe.", " Yes!", " Yes, I did.", " Did everything go as planned?", " I never listen to your fights. Were you the winner?", " Are you still retiring?", " What about the man you fought?", " Really?! He won't be fighting no more?!", " So it all worked out in the finish?", " We're in a lot of danger, aren't we?", " If they find us, they'll kill us, won't they?", " But they won't find us, will they?", " Do you still want me to go with you?", " I don't want to be a burden or a nuisance -", " Say it!", " Forever?", " Do you love me?", " Butch? Will you give me oral pleasure?", " But you first.", " Butch my love, the adventure begins.", " Giving me oral pleasure?", " Don't call me retard.", " Shut up fuck head! I hate that Mongoloid voice.", " Oh I like that, I like being called a tulip. Tulip is much better than Mongoloid.", " Butch?", " Where are we going to go?", " So if we wanted, we could live in Bora Bora?", " But I do not speak Spanish.", " What does that mean?", " Donde esta el zapataria?", " Que hora es?", " What time is it?", " Butch.", " Forget it.", " Merde! You startled me. Did you have a bad dream?", " A motorcycle movie, I'm not sure the name.", " In a way. Why? Would you like for me to switch it off?", " What was it about?", " No, imbecile, what was your dream about?", " You just woke up from it.", " Well, let's look at the grumpy man in the morning. I didn't say you were lying, it's just odd you don't remember your dreams. I always remember mine. Did you know you talk in your sleep?", " You did last night.", " I don't know. I couldn't understand you.", " Why don't you get up and we'll get some breakfast at that breakfast place with the pancakes.", " Satisfied?", " Then get up, lazy bones.", " Almost nine in the morning. What time does our train arrive?", " I'm gonna order a big plate of blueberry pancakes with maple syrup, eggs over easy, and five sausages.", " Oh yes, that looks nice. To drink, a tall glass or orange juice and a black cup of coffee. After that, I'm going to have a slice of pie.", " Any time of the day is a good time for pie. Blueberry pie to go with the pancakes. And on top, a thin slice of melted cheese -", " It's there.", " Have you looked?", " Uhhh... yes... beside the table drawer -", " Yes, it was on your little kangaroo. BUTCH Well it's not here!", " Well it should be!", " I believe so...", " Then I did.", " No.", " I'm sorry.", " Why does it mean that?", " Won't the gangsters be looking for you there?", " I was so dreadful. I saw your watch, I thought I brought it. I'm so sorry.", " Don't go.", " Blueberry pie.", " Okay.", " Bye.", " Okay.", " Where did you get this motorcycle?", " What happened to my Honda?", " You're hurt?", " You were gone so long, I started to think dreadful thoughts.", " It was good -", " No, they didn't have blueberry pancakes, I had to get buttermilk - are you sure you're okay?", " Butch, whose motorcycle is this?", " Whose chopper is this?", " Who's Zed?"], "What did I say?": [""], "PEDESTRIAN": [" Jesus, are you okay?"], "GAWKER #1": [" He's dead! He's dead!"], "GAWKER #2": [" If you need a witness in court, I'll be glad to help. He was a drunken maniac. He hit you and crashed into that car.", " Him."], "MARSELLUS": [" Who?", " Well, I'll be damned.", " Naw man. I'm pretty fuckin' far from okay!", " What now? Well let me tell you what now. I'm gonna call a couple pipe-hittin' niggers, who'll go to work on homes here with a pair of pliers and a blow torch. Hear me talkin' hillbilly boy?! I ain't through with you by a damn sight. I'm gonna git Medieval on your ass.", " Oh, that what now? Well, let me tell ya what now between me an' you. There is no me an' you. Not no more.", " Yeah man, we're cool. One thing I ask - two things I ask: Don't tell nobody about this. This shit's between me and you and the soon-to-be-livin'-the-rest-of-his- short-ass-life-in-agonizing-pain, Mr. Rapist here. It ain't nobody else's business. Two: leave town. Tonight. Right now. And when you're gone, stay gone. You've lost your Los Angeles privileges. Deal?", " Go on now, get your ass outta here.", " Hello Mr. Wolf, it's Marsellus. Gotta bit of a situation.", " I've grasped that, Jules. All I'm doin' is contemplating the \"ifs.\"", " You ain't got no problems, Jules. I'm on the motherfucker. Go back in there, chill them niggers out and wait for The Wolf, who should be comin' directly.", " Feel better?"], "LOOKY-LOO WOMAN": [" Oh my God, I've been shot!"], "MAYNARD": [" Can I help you wit' somethin'?", " Now you just wait one goddamn minute -", " - I'm makin' it my business! Now toss that gun!", " Now you on top, stand up and come to the counter.", " Zed? It's Maynard. The spider just caught a coupl'a flies.", " Nobody kills anybody in my place of business except me or Zed.", " That's Zed.", " I did.", " They did that to each other. They was fightin' when they came in. This one was gonna shoot that one.", " Yeah, it ain't Tuesday is it?", " Then she'll be fine.", " I think The Gimp's sleepin'.", " Wake up!", " Down!", " Who's first?", " Naw, drag big boy to Russell's old room.", " Up!", " Keep an eye on this one."], "MAYNARD (O.S.)": [" - hold it right there, godammit!", " Whoa, this boy's got a bit of fight in 'em!", " That's it... that's it boy, you're goin' fine. Oooooooh, just like that... that's good. Stay still... stay still goddamn ya! Zed goddammit, git over here and hold 'em!"], "ZED": [" You said you waited for me?", " Then how come they're all beat up?", " You were gonna shoot him?", " Hey, is Grace gonna be okay in front of this place?", " No, it's Thursday.", " Bring out The Gimp.", " Well, I guess you'll just wake 'em up then, won't you?", " I ain't fer sure yet.", " Wanna do it here?"], "ZED (O.S.)": [" You wanna fight? You wanna fight? Good, I like to fight!"], "THE GIMP": [" Huhng?"], "FABIENNE (O.S.)": [" Butch, I was so worried!", " But what about all our bags?", " Is everything well? Are we in danger?"], "JULES (O.S.)": [" You ever read the Bible, Brett?", " There's a passage I got memorized, seems appropriate for this situation: Ezekiel 25:17. \"The path of the righteous man is beset on all sides by the inequities of the selfish and the tyranny of evil men...\"", " \"... blessed is he who, in the name of charity and good will, shephered the weak through the valley of darkness. And I will strike down upon thee with great vengeance and furious anger those who attempt to poison and destroy my brothers. And you will know I am the Lord when I lay my vengeance upon you.\"", " Yeah, Marvin-Vincent-Vincent-Marvin."], "BRETT (O.S.)": [" Yes!"], "FOURTH MAN": [" Die... die... die... die...!", " I don't understand -"], "JIMMIE": [" Knock it off, Julie.", " I'm not a cobb or corn, so you can stop butterin' me up. I don't need you to tell me how good my coffee is. I'm the one who buys it, I know how fuckin' good it is. When Bonnie goes shoppin;, she buys shit. I buy the gourmet expensive stuff 'cause when I drink it, I wanna taste it. But what's on my mind at this moment isn't the coffee in my kitchen, it's the dead nigger in my garage.", " - I'm talkin'. Now let me ask you a question, Jules. When you drove in here, did you notice a sign out front that said, \"Dead nigger storage?\"", " - answer to question. Did you see a sign out in front of my house that said, \"Dead nigger storage?\"", " You know why you didn't see that sign?", " 'Cause storin' dead niggers ain't my fuckin' business!", " - I ain't through! Now don't you understand that if Bonnie comes home and finds a dead body in her house, I'm gonna get divorced. No marriage counselor, no trial separation - fuckin' divorced. And I don't wanna get fuckin' divorced. The last time me an' Bonnie talked about this shit was gonna be the last time me an' Bonnie talked about this shit. Now I wanna help ya out Julie, I really do. But I ain't gonna lose my wife doin' it.", " - don't fuckin' Jimmie me, man, I can't be Jimmied. There's nothin' you can say that's gonna make me forget I love my wife. Now she's workin' the graveyard shift at the hospital. She'll be comin' home in less than an hour and a half. Make your phone calls, talk to your people, than get the fuck out of my house.", " Then I suggest you get to it. Phone's in my bedroom. ... well, say she comes home. Whaddya think she'll do? No fuckin' shit she'll freak. That ain't no kinda answer. You know 'er, I don't. How bad, a lot or a little?", " Yeah.", " Good, 'cause we got one.", " Please do.", " 100%.", " Uh-huh.", " She won't at that.", " Yes.", " Sure, how do you take it?", " Yeah. Exactly. Under the sink.", " Mr. Wolf, you gotta understand somethin' -", " You gotta understand something, Winston. I want to help you guys out and all, but that's my best linen. It was a wedding present from my Uncle Conrad and Aunt Ginny, and they ain't with us anymore -", " Sure.", " No.", " Oak's nice.", " I can't believe that's the same car.", " Dorks. They look like a couple of dorks.", " I guess you just gotta know how to wear them."], "THE WOLF": [" Is she the hysterical type? When she due? Give me the principals' names again? Jules...", " ... Vincent... Jimmie... Bonnie...", " Expect a call around 10:30. It's about thirty minutes away. I'll be there in ten.", " You're Jimmie, right? This is your house?", " I'm Winston Wolf, I solve problems.", " So I heard. May I come in?", " You must be Jules, which would make you Vincent. Let's get down to brass tacks, gentlemen. If I was informed correctly, the clock is ticking, is that right, Jimmie?", " Your wife, Bonnie... ... comes home at 9:30 in the AM, is that correct?", " I was led to believe if she comes home and finds us here, she wouldn't appreciate it none too much.", " That give use forty minutes to get the fuck outta Dodge, which, if you do what I say when I say it, should by plenty. Now you got a corpse in a car, minus a head, in a garage. Take me to it.", " Jimmie?", " Do me a favor, will ya? Thought I smelled some coffee in there. Would you make me a cup?", " Lotsa cream, lotsa sugar.", " About the car, is there anything I need to know? Does it stall, does it make a lot of noise, does it smoke, is there gas in it, anything?", " Positive? Don't get me out on the road and I find out the brake lights don't work.", " Good enough, let's go back to the kitchen.", " Thank you, Jimmie.", " Okay first thing, you two. Take the body, stick it in the trunk. Now Jimmie, this looks to be a pretty domesticated house. That would lead me to believe that in the garage or under the sink, you got a bunch of cleaners and cleaners and shit like that, am I correct?", " Good. What I need you two fellas to do is take those cleaning products and clean the inside of the car. And I'm talkin' fast, fast, fast. You need to go in the backseat, scoop up all those little pieces of brain and skull. Get it out of there. Wipe down the upholstery - now when it comes to upholstery, it don't need to be spic and span, you don't need to eat off in. Give it a good once over. What you need to take care of are the really messy parts. The pools of blood that have collected, you gotta soak that shit up. But the windows are a different story. Them you really clean. Get the Windex, do a good job. Now Jimmie, we need to raid your linen closet. I need blankets, I need comforters, I need quilts, I need bedspreads. The thicker the better, the darker the better. No whites, can't use 'em. We need to camouflage the interior of the car. We're gonna line the front seat and the backseat and the floor boards with quilts and blankets. If a cop stops us and starts stickin' his big snout in the car, the subterfuge won't last. But at a glance, the car will appear to be normal. Jimmie - lead the way, boys - get to work.", " Come again?", " Set is straight, Buster. I'm not here to say \"please.\"I'm here to tell you want to do. And if self-preservation is an instinct you possess, you better fuckin' do it and do it quick. I'm here to help. If my help's not appreciated, lotsa luck gentlemen.", " If I'm curt with you, it's because time is a factor. I think fast, I talk fast, and I need you guys to act fast if you want to get out of this. So pretty please, with sugar on top, clean the fuckin' car.", " It's a 1974 Chevy Nova. White. Nothin', except for the mess inside. About twenty minutes. Nobody who'll be missed. You're a good man, Joe. See ya soon. How we comin', Jimmie?", " - Winston, Jimmie - please, Winston.", " - let me ask you a question, if you don't mind?", " Were you Uncle Conrad and Aunt Ginny millionaires?", " Well, your Uncle Marsellus is. And I'm positive if Uncle Conrad and Aunt Ginny were millionaires, they would've furnished you with a whole bedroom set, which your Uncle Marsellus is more than happy to do. I like oak myself, that's what's in my bedroom. How 'bout you Jimmie, you an oak man?", " Fine job, gentlemen. We may get out of this yet.", " Well, let's not start suckin' each other's dicks quite yet. Phase one is complete, clean the car, which moves us right along to phase two, clean you two.", " Strip.", " To your bare ass.", " Quickly gentlemen, we got about fifteen minutes before Jimmie's better-half comes pulling into the driveway.", " You know what you two look like?", " Like a couple of guys who just blew off somebody's head. Yes, strippin' off those bloody rags is absolutely necessary. Toss the clothes in Jim's garbage bag.", " Don't worry, we're takin' it with us. Jim, the soap.", " Okay gentlemen, you're both been to County before, I'm sure. Here it comes.", " Better you than me, gentlemen.", " Don't be afraid of the soap, spread it around.", " Towel 'em.", " You're dry enough, give 'em their clothes.", " Perfect. Perfect. We couldn't've planned this better. You guys look like... what do they look like, Jimmie?", " C'mon, gentlemen, we're laughin' and jokin' our way into prison. Don't make me beg.", " Gentlemen, let's get our rules of the road straight. We're going to a place called Monster Joe's Truck and Tow. Monster Joe and his daughter Raquel are sympathetic to out dilemma. The place is North Hollywood, so a few twist and turns aside, we'll be goin' up Hollywood Way. Now I'll drive the tainted car. Jules, you ride with me. Vincent, you follow in my Porsche. Now if we cross the path of any John Q. Laws, nobody does a fuckin' thing 'til I do something. What did I say?", " - unless what?", " Spoken like a true prodigy. How 'bout you, Lash Larue? Can you keep your spurs from jingling and jangling?", " Fair enough. I drive real fuckin' fast, so keep up. If I get my car back any different than I gave it, Monster Joe's gonna be disposing of two bodies."], "WINSTON": [" Like it never happened.", " Boys, this is Raquel. Someday, all this will be hers.", " I'm takin' m'lady out to breakfast. Maybe I can drop you two off. Where do you live?", " I'll see you two around, and stay outta trouble, you crazy kids.", " Call me Winston.", " You hear that, young lady? Respect. You could lean a lot from those two fine specimens. Respect for one's elders shows character.", ""], "RAQUEL": [" Hi. You know, if they ever do \"I SPY: THE MOTION PICTURE,\" you guys, I'd be great. What's with the outfits. You guys going to a volleyball game?", " Goodbye, Raquel.", " I have character.", " Oh you're so funny, oh you're so funny."], "PATRON": [" Garcon! Coffee!"], "MANAGER": [" I'm the manager here, there's no problem, no problem at all -", " No, I'm not. I'm not gonna give you any problem!", " Please don't! I'm not a hero. I'm just a coffee shop manager. Take anything you want.", " Everybody just be calm and cooperate with them and this will be all over soon!", " Quit causing problems, you'll get us all killed! Give 'em what you got and get 'em out of here."], "YOLANDA": [" Don't you hurt him.", " He's cool?", " Okay, now let him go!", " Just know: you hurt him, you die.", " I gotta go pee! I want to go home."], "JULES (CONT'D)": [" I'd like that. But that shit ain't the truth. The truth is you're the weak. And I'm the tyranny of evil men. But I'm tryin'. I'm tryin' real hard to be a shepherd."]}