{"scenarios": ["T", "BURNING.  Massive flames.  A dark shape emerges- The BAT", "SYMBOL.  Growing.  Filling the screen with BLACKNESS.", "DAYLIGHT.  Moving over the towers of downtown Gotham...", "Closing in on an office building... On a large window...", "Which SHATTERS to reveal-", "INT. OFFICE, HIGH RISE -- DAY", "A man in a CLOWN MASK holding a SMOKING SILENCED PISTOL", "ejects a shell casing.  This is DOPEY.  He turns to a second", "man, HAPPY, also in clown mask, who steps forward with a", "CABLE LAUNCHER, aims at a lower roof across the street and", "FIRES a cable across.  Dopey secures the line to an I-beam", "line- CLAMP on- sends a KIT BAG out then steps OUT the", "window...", "EXT. HIGH-RISE -- DAY", "...into space.  The men SLIDE across the DIZZYING DROP...", "landing on the lower roof across the street.", "EXT. DOWNTOWN GOTHAM -- DAY", "A MAN on the corner, back to us, holding a CLOWN MASK.  An", "SUV pulls up.  The man gets in, puts on his mask.  Inside the", "car- two other men wearing CLOWN MASKS.", "One of the Clowns looks up from loading his automatic weapon.", "Grumpy cocks his weapon.  Bozo pulls the car over in front of", "the GOTHAM FIRST NATIONAL BANK.", "EXT. ROOFTOP, BANK -- CONTINUOUS", "Dopey PRIES open an access panel-", "Dopey pulls out thick bundles of blue CAT 5 cables.", "EXT. BANK -- CONTINUOUS", "Grumpy, Chuckles and Bozo get out of the car and march into", "the bank CARRYING ASSAULT RIFLES-", "INT. BANK -- DAY", "The Security Guard looks up- Grumpy FIRES into the ceiling.", "Customers SCREAM.  Chuckles CRACKS the Security Guard.", "As Grumpy and Bozo round up the hostages, one of the TELLERS", "presses a button mounted beneath her window- a SILENT ALARM.", "EXT. ROOFTOP -- DAY", "Dopey watches the alarm PING his handheld.", "Behind him, Happy RAISES his silenced HANDGUN.", "Happy SHOOTS.  Dopey SLUMPS.  Happy picks up his bag and", "FORCES OPEN the roof access door...", "INT. STAIRWELL, BANK -- DAY", "...and speeds down the stairs, to the basement.  He SLAMS", "open the door...", "INT. VAULT ROOM, BANK -- DAY", "...and comes face to face with a huge VAULT.", "INT. LOBBY, BANK -- DAY", "Bozo and Grumpy move down the line of hostages- Bozo hands", "each Hostage OBJECTS from a bag.  A GRENADE.  Grumpy follows,", "PULLING THE PINS.", "BLAM.  Chuckles is BLOWN OFF HIS FEET- Grumpy and Bozo DIVE", "for cover- the Bank Manager steps out of his office, SHOTGUN", "in hand.  Hostages SCRAMBLE, CLINGING their grenades...", "INT. VAULT ROOM, BANK -- DAY", "Happy CLAMPS a DRILL to the vault- the bit SPINS- SLIDES into", "the metal door- a BOLT of ELECTRICITY RIPS THROUGH THE DRILL,", "THROWING HAPPY TO THE FLOOR-", "INT. LOBBY, BANK -- DAY", "Grumpy and Bozo cower as the Bank Manager FIRES again.", "Bozo raises TWO fingers.  Grumpy squeezes off a SHOT.  The", "Bank Manager FIRES.  FIRES again.  Grumpy looks at Bozo, who", "nods.  Grumpy JUMPS UP.", "The Bank Manager FIRES- Grumpy GRUNTS as buckshot CLIPS his", "shoulder.  FALLS.  The Bank Manager moves in for the kill,", "FUMBLING for new shells.  Bozo STANDS- SHOOTS him.", "Bozo picks up the shotgun.  Grumpy checks his wound- it's", "superficial.  He struggles to his feet.", "Bozo's mask stares him down.  Grumpy heads for the stairs in", "the back.  Bozo starts loading fresh shells into the shotgun.", "Bozo looks down at him.  Says nothing.", "INT. VAULT ROOM, BANK -- DAY", "Happy at the vault door, barefoot, turning the tumblers with", "hands stuffed into his SNEAKERS.  Grumpy walks in.", "Happy shrugs.  Grips the WHEEL BOLT and SPINS it.", "Happy FREEZES.  The wheel SPINS to a STOP- the vault DOOR", "CLUNKS OPEN- Happy GRABS for his weapon- SPINS to see Grumpy", "SHOOT.  Grumpy steps over Happy into the vault...", "INT. VAULT, BANK -- DAY", "...which is filled with an eight-foot MOUNTAIN OF CASH.", "INT. LOBBY, BANK -- DAY", "Grumpy walks into the lobby, straining under several DUFFELS", "filled with cash.  He DUMPS them.  Looks at Bozo.  LAUGHS.", "INT. LOBBY, BANK -- DAY", "Bozo walks back into the lobby with two more DUFFELS.  Sets", "them down on an ENORMOUS PILE.  Grumpy looks at it.", "Grumpy JABS his pistol in Bozo's back.  Takes his weapon.", "Bozo steps backwards.  SMASH.  Hostages SCREAM as the TAIL", "END OF A YELLOW SCHOOL BUS ROCKETS through the front of the", "bank, SLAMMING Grumpy into the teller's window.", "Bozo picks up Grumpy's weapon.  Another clown OPENS the rear", "door of the bus.  Bozo SHOOTS him.  Then loads the bags onto", "the bus.  The wounded Bank Manager watches him.  In the", "distance: SIRENS.", "Bozo slowly shakes his head.", "Bozo turns back to the Bank Manager.  Crouches over him.", "Joker slides a GRENADE into the man's mouth.  A PURPLE THREAD", "is knotted around the pin.", "Bozo PULLS off his MASK.  The Bank Manager GASPS.  In the", "reflections of the glass DEBRIS behind the Bank Manager we", "see GLIMPSES of a SCARRED MOUTH and CLOWN MAKEUP.  THE JOKER.", "The Bank Manager's eyes go wide.  The Joker rises, strolls", "towards the bus, the purple thread attached to the grenade", "pin UNRAVELLING FROM THE PURPLE LINING of his jacket as he", "walks.  The Joker climbs into the bus, SHUTS the rear door,", "TRAPPING THE PURPLE THREAD...", "EXT. SCHOOL, GOTHAM -- DAY", "Kids pour out, heading onto a long line of school buses.", "INT. BANK -- CONTINUOUS", "As the bus pulls out, the purple thread PULLS THE PIN-", "hostages scream and scurry away from the Bank Manager, who", "shakes with fear as, with a FIZZ, the grenade does not", "explode, but SPEWS RED SMOKE.", "EXT. BANK -- DAY", "The School Bus pulls free of the Bank wall and pulls out onto", "the street, SLIDING INTO THE LINE OF IDENTICAL BUSES HEADING", "PAST THE BANK.  The buses trundle past COP CARS racing up the", "street... and we-", "EXT. MOVING OVER GOTHAM -- NIGHT", "From the top of a brick building a SHAFT OF LIGHT comes on.", "EXT. VARIOUS LOCATIONS -- CONTINUOUS", "A PATROLMAN looks up at the BAT-SIGNAL.  Smiles.  A DEALER", "standing beside a car spots the signal.  Steps back.", "INT. MAJOR CRIMES UNIT, GOTHAM CENTRAL -- NIGHT", "DETECTIVE RAMIREZ, female, rookie detective, 30's, makes", "coffee, watching a news show on the television.", "ON SCREEN: The host, MIKE ENGEL, lays into the MAYOR.", "WUERTZ looks up, listless.  Crumples up a paper.", "He throws the paper at the trash.  It rebounds off a board", "headed 'BATMAN: SUSPECTS.'  Lined with pictures: Abraham", "Lincoln.  Elvis.  The Abominable Snowman.", "EXT. ROOFTOP, MAJOR CRIMES UNIT -- NIGHT", "Ramirez comes out onto the roof.  LIEUTENANT GORDON sits by a", "SEARCHLIGHT.  She hands Gordon a cup of coffee.", "Gordon gets up.  Looks into the sky at the bat-signal.", "EXT. PARKING GARAGE -- NIGHT", "Two black SUV's pull onto the top floor.  A large man emerges-", "the CHECHEN.  A BODYGUARD points at the sky.  The Chechen", "peers up at the BAT-SIGNAL.  Shrugs.", "BODYGUARD 2 opens the back door- three enormous ROTWEILERS", "emerge, GROWLING.  The Chechen crouches, KISSING the dogs.", "The Chechen moves to the second SUV, reaches in and DRAGS out", "a skinny, wild-eyed JUNKIE by his hair.", "The Chechen drags the Junkie towards a battered white van.", "The van's REAR DOORS OPEN... two armed THUGS emerge, carrying", "BARRELS...  a third hovers in the dark interior.", "The figure emerges: SCARECROW.  Wearing his mask.", "The Chechen frowns.  THE DOGS START BARKING.", "A BURLY THUG at the periphery is suddenly SUCKED into the", "darkness.  In his place a shadow straightens, revealing", "POINTED BAT-EARS against the glittering skyline.", "A BODYGUARD to the side DISAPPEARS with a scream, and a", "SECOND BAT-SHADOW appears.", "The Chechen looks taken aback.  Three more BAT-SHADOWS", "appear... even the dogs stop growling.", "BOOM!  A hole appears in the SUV next to the Chechen.  The", "first bat-shadow steps into the light carrying a SHOTGUN.", "CHAOS as men scatter and the rooftop erupts in GUNFIRE.  The", "Chechen TURNS as he hears one of his men SCREAM.", "A Bodyguard releases the DOGS- they RACE, SALIVATING, into", "the darkness...", "The Dogs RACE towards a Bat-Shadow- the first dog LEAPS, gets", "its JAWS around the Bat-Shadow's throat...", "Scarecrow ducks behind the van- holes PUNCHED in the side by", "shotgun blasts right behind him.  He starts to climb into the", "driver's seat-", "The muzzle of a shotgun is pressed to the back of his head- a", "bat-shadow is behind him- he SPRAYS him with FEAR TOXIN- the", "bat-shadow collapses to the ground, SCREAMING.  The Cechnyan,", "cowering from gunfire, looks down at him.", "A HUGE BLACK SHAPE SLAMS down onto a row of parked cars.  The", "BATMOBILE.", "The Chechen's men BLAST away at the front of the car: the", "bullets SPARK off its monstrous surface harmlessly...", "INT. BATMOBILE -- CONTINUOUS", "The cockpit is EMPTY.  One of the screens reads \"LOITER\".", "The shooting STOPS.  The screen switches to \"INTIMIDATE\"", "EXT. PARKING GARAGE -- CONTINUOUS", "The men STARE at the Batmobile for a quiet moment... BOOM!", "The Batmobile CANNONS blast cars all around the men-", "A bat-shadow lines up his shotgun on a running bodyguard-", "CLUNK- a BLACK GAUNTLET grasps the barrel and BENDS it", "upwards with a HOWL of tortured steel- the bat-shadow looks", "into the face of the Batman.  The REAL BATMAN.", "The Bat-shadow STUMBLES BACKWARDS in terror, leaving the bent", "shotgun in Batman's hand.  Batman OPENS his hand, revealing a", "PNEUMATIC MANGLE hidden in his palm-", "Batman bears down on the dogs mauling another bat-shadow-", "DRAWS his GRAPPLING GUN and SHOOTS his grapple into the fake", "Batman's leg and RIPS him from the dogs, one dog HANGING ON", "as Batman pulls the unconscious man away...  the Chechen RUNS", "down the ramp towards the exit...", "As Batman KICKS the dog off the fake Batman- the Chechen gets", "into his SUV- another dog LOCKS ITS JAWS around Batman's", "forearm, RIPPING, TEARING- Batman SWINGS THE DOG OVER HIS", "HEAD- SMASHES it against the ground- its jaws OPEN...", "Batman rises, an engine RACES behind him- he can't turn in", "time- BLAM- he's SLAMMED sideways by the speeding van.", "INT. VAN -- CONTINUOUS", "Scarecrow, driving, NODS at him and hits the gas... Batman", "raises his hand, revealing his jointed mangle and pistons.", "The mangle STRAIGHTENS and ROTATES from his palm to the knife", "edge of his opened hand...", "Batman CHOPS straight through the windshield- pulls his hand", "out and CHOPS again- the mangle gets STUCK- Scarecrow steers", "towards a column...", "EXT. PARKING GARAGE -- CONTINUOUS", "Batman can't free himself- he turns a dial on his forearm", "piston- EXPLOSIVE BOLTS blow, freeing his gauntlet from the", "mangle- he ROLLS free of the van as it SCRAPES the column and", "barrels down the circular exit ramp.", "Batman rises.  A phony batman lying on the ground watches as", "Batman climbs up to the edge of the ten-story corkscrew ramp", "and stands there, waiting for something.", "After a moment he JUMPS... and falls... ten stories...", "He's about to hit the exit ramp- the van appears- his cape", "POPS OPEN- he SLAMS into the roof, CRUSHING the cab.", "EXT. ROOFTOP, PARKING GARAGE -- MOMENTS LATER", "The Chechen's men are lined up against the wall, bound with", "zip-ties.  So are the fake batmen.  Batman DUMPS Scarecrow", "next to the three \"Batmen\", RIPS his mask off.", "Batman silences Scarecrow with his boot.  Turns to \"Batman\"", "Batman moves towards the Batmobile.", "Batman gets into the Batmobile.", "As the Canopy hisses shut-", "The \"Batman\" looks down at his makeshift costume as the", "Batmobile ROARS past.", "EXT. BANK -- NIGHT", "LIEUTENANT GORDON ducks the barrage of SHOUTED QUESTIONS from", "press and picks his way into the lobby of the bank.", "INT. LOBBY, BANK -- NIGHT", "FORENSIC SPECIALISTS work the room.  Ramirez hands Gordon", "PRINTS- indicates the surveillance cameras.", "Gordon looks at the grainy blow-up of THE JOKER'S FACE:", "sweating clown makeup plastered thick around the mouth.", "Gordon approaches a FORENSIC PHOTOGRAPHER shooting Grumpy's", "body.  Gordon crouches to look at his clown mask.  Batman", "steps from the shadows.  Gordon nods at Ramirez.", "The Forensic team and Ramirez leave.  Gordon hands Batman the", "blow-up of the Joker.", "Batman pulls a DEVICE from his belt- moves to the bundles of", "cash scattered near the clown's body.  The device PINGS.", "Batman picks up a BUNDLE.  Hands it to Gordon.", "Gordon waves the photo.", "Gordon holds up the bundle of banknotes.", "Gordon bags the cash.", "But Batman is already gone.", "INT. WAYNE PENTHOUSE -- MORNING", "Alfred walks past soaring downtown views as he carries a", "breakfast tray through the vast, empty penthouse.  He stops,", "looking at a still-made bed.  Alfred sighs, turns.", "EXT. RAIL YARDS -- MORNING", "Alfred gets out of the Rolls carrying a thermos.  He walks", "towards a RAILWAY BRIDGE, stops at a FREIGHT CONTAINER", "sitting, lopsided, on blocks.  Alfred unlocks the RUSTY", "PADLOCK AND CHAIN.  Steps inside.", "INT. FREIGHT CONTAINER -- CONTINUOUS", "Alfred FUMBLES in the dark- bangs his elbow- A HISS as the", "FLOOR LOWERS... Alfred sinks down into...", "INT. BAT-BUNKER -- CONTINUOUS", "The container floor lowers on a giant PISTON.  Alfred steps", "off into a large, LOW-CEILINGED CONCRETE CHAMBER.  The", "Batmobile sits in the middle.  Machines- 3d printers, power", "tools- dot the high-tech space.  At one end, Wayne sits at a", "bank of monitors watching CCTV footage of the bank robbery.", "Alfred places a cup of coffee in front of Wayne, who is", "STITCHING up a cut on his arm.", "Wayne indicates a monitor: a handsome MAN in a suit.", "Alfred looks at other images- the D.A. at a meeting.", "Campaigning.  Helping someone out of a cab: RACHEL.", "Alfred bites the thread.  Examines his stitches.  Looks at", "the SCARS criss-crossing Wayne's shoulders.", "INT. COURTROOM, SUPERIOR COURT -- DAY", "HARVEY DENT bursts into the courtroom.  Assistant D.A. RACHEL", "DAWES, look up, ANNOYED.", "Rachel leans in to Dent, speaking under her breath.", "Dent pulls a large silver dollar out of his pocket.  Grins.", "Dent FLIPS.  Shows it to Rachel- heads.", "Dent looks across at the defendant- SAL MARONI.", "The BAILIFFS lead a THIN MAN into the witness box.  ROSSI.", "INT. COURTROOM, SUPERIOR COURT -- DAY", "Rossi takes a SIP of water.  Dent works the room.", "Dent turns to Maroni, who is poker-faced.  Dent smiles.", "Dent's smile disappears.  He turns back to Rossi.", "LAUGHS from the gallery.  Dent turns to the JUDGE.", "Rossi JUMPS UP, points a GUN at Dent's face.  SCREAMS from", "the gallery.  Rossi PULLS the TRIGGER- the gun MISFIRES with", "a POP.  Dent steps forward, grabs the GUN- DECKS Rossi with a", "RIGHT CROSS- unloads the GUN and sets it down in front of", "Maroni.", "Everyone STARES, open-mouthed, as Dent adjusts his tie.  The", "Bailiffs are wrestling Rossi from the box-", "INT. LOBBY, DENT'S OFFICE, DA'S -- DAY", "Rachel, excited, leads Dent through the lobby.", "Rachel turns to Dent.  Smooths his lapels.", "INT. DENT'S OFFICE -- DAY", "Gordon stands as Dent enters.  The two men shake.", "Dent picks up a bundle of bills from the heist.", "Dent tosses the bills back onto his desk.  Annoyed.", "Dent looks at Gordon.  Considering how to proceed.", "Gordon smiles.", "INT. BOARDROOM, WAYNE ENTERPRISES -- DAY", "LUCIUS FOX, CEO of Wayne Enterprises, and the board listen to", "LAU, 40s, CEO of L.S.I. Holdings.", "The Chinese look to the head of the table: Wayne, ASLEEP.", "INT. HALLWAY, WAYNE ENTERPRISES -- DAY", "Fox shows Lau to the elevator.  He's joined by, REESE, 30s,", "an ambitious M and A consultant lawyer.", "The elevator doors close.  Reese frowns.", "Fox heads for his office, Reese in tow.", "INT. BOARDROOM, WAYNE ENTERPRISES -- CONTINUOUS", "Wayne is standing by the window.", "Fox looks at Wayne.  Wry.", "Wayne pulls some diagrams.  Fox looks them over.", "INT. RESTAURANT -- NIGHT", "Rachel and Dent at a table.  Dent looks a little intimidated", "by the surroundings.", "Rachel smiles.  Then, over Dent's shoulder, she sees Wayne", "enter, accompanied by a beautiful woman.", "An extra table arrives.", "INT. SAME -- LATER", "They finish up dinner.", "Rachel gives Dent a withering look.", "Wayne watches Dent.  Sees his passion.", "Natascha reaches up and covers the top half of Dent's face.", "Dent takes Rachel's hand.  Rachel glances at Wayne.  Awkward.", "EXT. BACK ALLEY, HOTEL, DOWNTOWN -- DAY", "A line of high-end AUTOS dispenses well dressed GANGSTERS.", "INT. KITCHEN, HOTEL -- DAY", "The Chechen walks through a METAL DETECTOR manned by two", "CHINESE.  A lean, African-American man, 50's, is being", "wanded.  This is GAMBOL.  He nods at the Chechen, wary.", "INT. CONFERENCE ROOM, HOTEL -- CONTINUOUS", "Gotham's most notorious GANGSTERS.  A door opens, and two", "BURLY CHINESE enter, carrying a TV.  They set it down on the", "end of the table.", "The screen flickers to life: Lau.  The room ERUPTS.", "Murmurs of surprise.", "Everyone starts SHOUTING at once.", "EXT. VARIOUS DOWNTOWN BANKS -- CONTINUOUS", "Gordon sits in a SWAT van outside a bank.  Stephens is", "outside another.  Ramirez a third...", "SWAT teams CHECK WEAPONS and prepare move...", "INT. SOCIAL CLUB, DOWNTOWN -- CONTINUOUS", "Lau waits for the noise to subside.", "From the back of the room comes LAUGHTER.  It grows and", "grows, until it fills the room.  All eyes turn:", "The Joker.  Sweaty clown makeup obscuring the AWFUL SCARS", "which widen his mouth into a PERMANENT, GHOULISH SMILE.", "The Joker pulls out a freshly sharpened pencil.", "The Joker SLAMS the pencil into the table, leaving it", "UPRIGHT.", "Gambol nods.  His BODYGUARD MOVES at the Joker- who SIDESTEPS-", "GRIPS his head- SLAMS it, FACE DOWN, onto the table...", "The Bodyguard goes LIMP and slides off of the table.  The", "PENCIL is gone.  MAGIC.  The Joker BOWS.  Grins at Gambol.", "Gambol STANDS, furious.  The Chechen stops him.", "The Joker nods his thanks.  Rises.", "Laughs.  Which the Joker tries to ignore.", "Jeers.  Laughter.", "Laughter.  The Joker shrugs.  Rises.", "Gambol gets up, MOVING at the Joker, who casually opens his", "coat, revealing EXPLOSIVES wired to his chest.  Gambol stops.", "Gambol stares at the Joker.  Hard.", "The Joker shrugs.  Turns to the assembled.", "The Joker strolls out.  Maroni turns to Lau.", "EXT. VARIOUS BANKS DOWNTOWN -- CONTINUOUS", "Gordon hurries up the steps to a bank.  SWAT teams rush the", "various banks.", "EXT. UNDERPASS, GOTHAM -- CONTINUOUS", "A CHINESE MAN finishes loading a TRACTOR TRAILER with cash", "boxes.  The truck pulls out into a CONVOY.", "INT. BANK VAULT -- CONTINUOUS", "Gordon stands in an almost empty bank vault.  Furious.", "INT. SOCIAL CLUB, DOWNTOWN -- CONTINUOUS", "The shot of Lau on the TV widens...", "He is already on his private jet.", "IN THE SKY: THE BAT SIGNAL.", "EXT. ROOF, POLICE STATION -- NIGHT", "Batman emerges from the shadows.  The man next to the glowing", "spotlight turns: DENT.", "Gordon BURSTS onto the rooftop, weapon drawn.  Sees Dent.", "Dent turns to Batman.", "Batman is gone.  Dent looks around, startled.  Gordon smirks.", "INT. FOX'S OFFICE, WAYNE INDUSTRIES -- DAY", "Fox gets up from behind his desk.", "Fox opens the door to a private elevator.", "INT. PRIVATE ELEVATOR -- CONTINUOUS", "Fox turns a key.", "INT. APPLIED SCIENCES DIVISION -- CONTINUOUS", "Fox leads Wayne off the elevator and into the vast space.", "Lucius stops at a cabinet, pulls open a drawer and hauls out", "an oxygen tank and ribbed rubber hosing.", "He shuts the drawer.  Moves off, thinking.", "Fox opens a cabinet to reveal COMPONENTS OF A NEW BAT-SUIT.", "ARMORED PLATING secured to mesh.  Wayne lifts an arm.", "Wayne examines DOUBLE BLADE SCALLOPS on the gauntlet...", "Wayne flinches as the BLADES FIRE, SPINNING LIKE THROWING", "STARS, NARROWLY MISSING his ear, embedding themselves in a", "filing cabinet.  Fox looks at him.", "Fox picks up the chest, demonstrating its flexibility.", "Fox looks at him quizzically.", "INT. BAT-BUNKER -- DAY", "Wayne examines a parachute harness.  Alfred unfolds a diagram", "of a NAVY CARGO PLANE with a giant \"V\" mounted on the front.", "Alfred looks quite pleased with himself.", "EXT. BALLET -- NIGHT", "Rachel and Dent arrive to find the box office SHUTTERED.  A", "sign:'PERFORMANCE CANCELED.'  A newspaper story is taped to", "the glass.  Over a picture of BRUCE WAYNE ON A YACHT:", "LOVE BOAT- Billionaire absconds with entire Moscow ballet.", "EXT. DECK, WAYNE'S YACHT, THE CARIBBEAN -- DAY", "Alfred, picks his way over twelve SUNBATHING BALLERINAS.", "Wayne looks up from a newspaper.  Alfred points to a SEA-", "PLANE gently touching down across the bay.", "A Ballerina rolls over- waves the suntan lotion at Alfred.", "Wayne tosses a large, waterproof kit bag into the water and", "JUMPS in after it.  Begins swimming over to the sea-plane.", "INT. POOL HALL -- NIGHT", "Gambol racks up.  A bodyguard steps into the room.", "Gambol looks to the back- three rough customers are waiting.", "The bodyguards FLOP a BODY wrapped in garbage bags onto the", "table.  The BOUNTY HUNTERS wait in the corner.  Gambol pulls", "back one of the garbage bags, revealing the Joker's bloodied", "face.  Gambol spits.  Turns to face the bounty hunters.", "Behind Gambol, the Joker SITS UP- THRUSTS knives into the", "bodyguards' chests.  Gambol spins to see a crazy grin on the", "Joker's spit-dribbled face-", "The Joker gets a switchblade in Gambol's mouth- SHARP METAL", "PULLING THE CHEEK TAUT.  The Bounty Hunters subdue the", "remaining bodyguards.", "The Joker TUGS Gambols cheek with the blade.", "The Joker looks up at the ASHEN FACES of the remaining Body", "Guards.  Smiles.", "The Joker FLICKS his wrist- the Body Guards flinch as Gambol", "goes down.  The Joker turns to them.", "The three bodyguards all nod.  The Joker SNAPS a pool cue.", "The Joker drops the broken cue in the middle of the men.", "The men stare at each other.  Then at the jagged pool cue.", "EXT.PENINSULA HOTEL, HONG KONG -- DAY", "A HELICOPTER touches down on one of the hotel's twin", "helipads.  Two L.S.I. VPs approach, heads ducked.  Fox gets", "out- they shake hands, shouting over the engine-", "INT. LOBBY, L.S.I.HOLDINGS -- DAY", "The VPs usher Fox towards security.", "Lucius hands his phone to a SECURITY GUARD, who puts the", "phone in a box underneath his station.", "INT. L.S.I.HOLDINGS -- DAY", "Fox and Lau eat lunch in a dining room overlooking the city.", "A CELL PHONE rings.  Fox pulls out a second, identical,", "phone.  Fox presses the off switch and places the phone by", "his plate.", "Lau stares at Fox.  Clearly furious.  Fox smiles.", "Lau gets up.  Silent.  Fox retrieves his phone.  Stands.", "INT. LOBBY, L.S.I.HOLDINGS -- DAY", "Lucius walks back through security.  Nods at the VP, who", "bows, offering Lucius his cell phone.  Lucius shakes his", "head, holds up the IDENTICAL PHONE.  The VP smiles, nods,", "puts the phone back into the tray with several others.", "INT. HOLD, C-130 CARGO HAULER -- DAWN", "Two SMUGGLERS steal glances at Wayne, crouched at the rear in", "balaclava and flight suit.  The COPILOT signals Wayne, who", "pulls on his oxygen mask and stands up.  The rear of the", "plane OPENS.  Wayne steps to the edge, then JUMPS.", "EXT. SKIES ABOVE HONG KONG -- DAWN", "Moving across the water towards Hong Kong harbor...", "A tiny figure DROPS into frame, PLUMMETING towards the water-", "SPEEDING past the highest floors of skyscrapers, seconds from", "impact.  Wayne PULLS the chute- DROPS into the water...", "EXT. BENEATH FREEWAY, HONG KONG HARBOR -- DAY", "Wayne pulls himself out of the water, dragging up his pack.", "EXT. CENTRAL ESCALATORS -- DAY", "Wayne stops halfway up the crowded commuter escalator.  He", "takes a camera and lines up a shot like any tourist.", "Wayne turns to find Fox standing there, street map out.", "Fox shows Wayne the phone.  The display: a 3-d map of Lau's", "office suite.  Wayne takes the phone, impressed.", "Wayne nods, moves away.", "EXT. HONG KONG -- NIGHT", "Moving towards the tallest building in the glittering skyline", "to find Wayne, crouched on the roof.  The blades of his", "gauntlets CLICK into place.  He dons the helmet-like cowl.", "His \"cape\" is in the form of a hard faceted PACK.", "He stands- pulls two black boxes from his belt, CLICKS them", "together and UNFOLDS them into a RIFLE-LIKE DEVICE.  Batman", "SCOPES a second, lower building.  Adjust a setting and FIRES-", "four times...", "Four small STICKY BOMBS SLAP onto the glass of the lower", "building.  They have visible timers which are COUNTING DOWN.", "INT. LOBBY, L.S.I.HOLDINGS -- NIGHT", "Lucius' cell phone GLOWS in the box under the Security", "Guard's desk.  CHARACTERS race across the screen.", "Then the monitor FLICKERS off, the lights DIM and all of the", "security doors in the front of the building OPEN at once.", "The Guard grabs his radio- CALLS FOR HELP...", "EXT. ROOFTOP OVERLOOKING L.S.I.HOLDINGS", "Batman LAUNCHES into the glittering night, DROPPING from the", "tall tower... his pack BURSTS OPEN, becoming his BAT WINGS-he", "GLIDES down to the lower building, STREAKING around it,", "BANKING HARD to line up with a window in the rear...", "INT. LAU'S OFFICE, L.S.I.HOLDINGS -- NIGHT", "Lau is talking on the phone, staring at a profit projection", "on a flat screen monitor.  Suddenly the room goes dark.", "EXT. L.S.I.HOLDINGS -- CONTINUOUS", "As Batman HURTLES towards the glass he COLLAPSES his wings,", "WRAPPING his cape around himself and CANNONBALLING THROUGH", "THE GLASS-", "INT. LAU'S OFFICE SUITE, L.S.I.HOLDINGS -- NIGHT", "-ROLLING across the floor in a flurry of broken glass...", "INT. LAU'S OFFICE, TOP FLOOR, L.S.I.HOLDINGS -- NIGHT", "Lau pulls out a HANDGUN.", "INT. HALLWAY, L.S.I.HOLDINGS -- NIGHT", "Lau steps into the hallway.  His BODYGUARDS are waiting for", "him, carrying FLASHLIGHTS.", "They head for the stairwell.", "EXT. L.S.I.HOLDINGS -- NIGHT", "A small ARMY of Hong Kong police lead by a HONG KONG", "DETECTIVE descends on the building.", "INT. MEZZANINE LEVEL, L.S.I.HOLDINGS -- NIGHT", "Lau and his men make their way out onto the mezzanine.", "Across the room, something makes a CRASHING SOUND.  Lau's men", "fan out, trying to cover the room with their flashlights.", "Suddenly, one of the flashlights goes DARK.  Then another.", "Someone SCREAMS.", "Lau FIRES.  Then FIRES again.  The muzzle flash from his", "weapon STROBES the room.", "EXT. L.S.I.HOLDINGS, HONG KONG -- NIGHT", "Cops SWARM into the building.  A LOBBY SECURITY GUARD directs", "the Hong Kong Detective where to go...", "INT. OFFICE, L.S.I.HOLDINGS -- NIGHT", "Lau LOCKS the door.  RELOADS.  The door is KICKED open.  Lau", "FIRES.  No one is there.", "Lau stares, finger restless on the trigger.  From his right-", "a NOISE.  He turns and FIRES.", "In the muzzle FLASH: Batman, bearing down on him like a", "demon.", "Lau FIRES, and FIRES again as Batman TACKLES him.  Batman", "pulls out a SMALL PACK- STRAPS it onto Lau-", "The COUNTER on the sticky bombs hits 0-", "The Hong Kong Detective and the Cops BURST into the room- the", "WALL AND CEILING BEHIND BATMAN AND LAU EXPLODES- revealing", "the dawn sky above Hong Kong.", "The Detective looks around as he hears a LOW RUMBLE...", "Batman JERKS the RIPCORD on Lau's pack.  Cops cower as a", "WEATHER BALLOON EXPLODES out of the pack, unreeling high-test", "nylon.  The Cops cock their weapons.", "Lau looks up.  Bemused.  The weather balloon is two hundred", "feet up, swaying gently.  The RUMBLE BUILDS...", "Suddenly, a MASSIVE C-130 ROARS over.  The large V on the", "front of the plane SNAGS the line- Lau and BATMAN are YANKED", "THROUGH THE HOLE IN THE CEILING-", "Lau SCREAMS as he and Batman SOAR UP INTO THE DAWN SKY...", "The Detective looks up.  Batman and Lau are gone.", "INT. GORDON'S OFFICE, MCU, GOTHAM CENTRAL -- DAY", "Gordon is looking through case files.  Ramirez walks in.", "EXT. MCU -- DAY", "Gordon follows Ramirez through a CROWD of excited cops.  On", "the ground, trussed like a chicken- Lau.  A sign taped to his", "chest: 'Please deliver to Lieutenant Gordon.'", "INT. INTERROGATION ROOM, MCU, GOTHAM CENTRAL -- DAY", "Lau sits next to his sleazy lawyer, EVANS.  Rachel walks in.", "Rachel leans forward, speaking softly.  Clearly.", "INT. OBSERVATION ROOM, MCU, GOTHAM CENTRAL -- DAY", "Dent hits a buzzer.  Turns to Gordon.", "Rachel enters.", "Dent nods at Rachel, excited.", "INT. INTERROGATION ROOM, MCU, GOTHAM CENTRAL -- DAY", "Rachel comes back in.", "INT. OBSERVATION ROOM, MCU, GOTHAM CENTRAL -- CONTINUOUS", "Dent and Gordon watch Lau.", "EXT. CITY HALL -- DAY", "Dent stands in front of a small crowd of reporters.", "INT. RESTAURANT -- CONTINUOUS", "Dent's press conference plays on a TV in the corner.", "Maroni and the Chechen are watching the TV.", "Maroni shakes his head.  Spots Gordon walking over dangling a", "pair of handcuffs.  Nods at the TV.", "Gordon points out the window to a PRISON BUS.", "EXT. VARIOUS DOWNTOWN AND OUTLYING LOCATIONS -- DAY", "Prison buses in every neighborhood.  COPS load them with", "CRIMINALS.  Stephens puts Crime Boss in a prison bus.", "INT. COURTROOM A, GOTHAM MUNICIPAL COURTHOUSE -- DAY", "JUDGE SURRILLO reads the list of charges.", "Judge Surrillo turns the page.  A PLAYING CARD sits there.  A", "Joker.  He glances at it, curious,  puts it to one side.", "An ARMY of DEFENSE LAWYERS jostle YELLING ALL AT ONCE.  The", "STENOGRAPHER looks up, helpless.", "INT. MAYOR'S OFFICE -- DAY", "The MAYOR, COMMISSIONER LOEB, and Gordon look up as Dent", "enters.", "Gordon nods at Dent, approving.  Dent grins back.", "The Mayor waves Gordon and Loeb out.", "The Mayor turns to look out of the window.  Quiet.", "BANG!  A DARK SHAPE CRACKS THE GLASS in front of the Mayor's", "nose.  Dent rushes to the window, looks out...", "EXT. CITY HALL -- CONTINUOUS", "PEDESTRIANS look up, someone SCREAMS, someone POINTS- five", "stories up... SWINGING from a FLAGPOLE...", "BATMAN.  HANGING BY HIS NECK.  DEAD.  His mouth roughly", "painted in a DEMONIC CLOWN SMILE.", "EXT. CITY HALL -- MOMENTS LATER", "\"Batman\" is lowered from the flagpole.  The same fake Batman", "we saw earlier.  Pinned to his chest by a KNIFE, a PLAYING", "CARD.  A Joker.  Gordon moves closer to the body.  The card", "has writing on it: WILL THE REAL BATMAN PLEASE STAND UP?", "INT. WAYNE PENTHOUSE -- DAY", "Wayne comes into the living room, excited.  Alfred is", "supervising party arrangements.", "Wayne trails off as he spots something on the television: the", "Batman HANGING as from a NEWS CAMERA, framed by a graphic", "that reads 'BATMAN DEAD?'.  Image cuts to Engel in the", "studio.", "The image cuts to a BLINDFOLDED MAN, wearing a makeshift", "Batman costume- face bruised and bloody.  In some kind of", "bright, fluorescent-lit room.", "Brian nods uncertainly...", "LOOK AT ME!", "Brian looks up- the camera swings into the face of the Joker,", "in CHALK-WHITE makeup, RED SMEAR of lipstick on his SCARS.", "The tape cuts to STATIC.", "Wayne turns to Alfred.  Silent.", "INT. WAYNE PENTHOUSE -- EVENING", "Dent and Rachel get off the lift.  Dent stands in awe of the", "penthouse and its guests.", "Rachel spots someone and darts off-", "Dent turns to see Alfred with drinks on a silver tray.", "Alfred leaves Dent standing there, puzzled.  The crowd REACTS", "as a LOUD ROAR drowns conversation... Dent looks out-", "EXT. HELIPAD, WAYNE PENTHOUSE -- CONTINUOUS", "Wayne's CHOPPER touches down.  He spills out with a clutch of", "SUPERMODELS...", "INT. WAYNE PENTHOUSE -- CONTINUOUS", "Wayne and the supermodels come out of the helipad elevator-", "Rachel cringes slightly.  Wayne spots her.", "Laughter.  Dent shifts, embarrassed.", "Dent smiles accepting the toast.", "INT. CORRIDOR, MCU -- EVENING", "Ramirez catches up to Gordon, holding paperwork.", "Gordon STOPS.  Turns to face her.", "EXT. DECK, WAYNE'S PENTHOUSE -- EVENING", "Wayne walks out to the edge of the balcony and looks over", "Gotham.  Hears someone behind him- Rachel.", "Wayne moves closer to Rachel.  Takes her arm.", "Rachel looks at Wayne.  Conflicted.  He moves closer.", "Wayne takes Rachel's arms, looking at her, excited.", "Rachel glances back at Wayne as she moves to Dent.  Wayne", "watches them head inside.", "EXT. STREET, GOTHAM HEIGHTS -- EVENING", "Two MEN in suits knock at a Brownstone.  The door is opened", "by Judge Surrillo.  The two Men hold up BADGES.", "EXT. CITY HALL -- EVENING", "Gordon enters through a tight police presence at the doors.", "INT. POLICE COMMISSIONER'S OFFICE -- EVENING", "Gordon enters to find Loeb, flanked by armed cops.", "Gordon checks the window.  Turns to his men.", "Loeb pulls a bottle of whisky and a tumbler from a drawer.", "EXT. STREET, GOTHAM HEIGHTS -- EVENING", "The second man is waiting by the Judge's car.", "He hands Surrillo a sealed envelope.  Opens the car door.", "Surrillo climbs in.  Watches them drive away.  She opens the", "envelope- pulls out a sheet of paper.  One word on it:", "'UP'.", "Surrillo's car EXPLODES, heaving the car upwards on a", "FIREBALL.", "A PASSERBY is thrown to the ground.  After a moment, BURNING", "DEBRIS flutters down on him.  PLAYING CARDS.  JOKERS.", "INT. POLICE COMMISSIONER'S OFFICE -- CONTINUOUS", "Loeb pours himself a glass of whisky.", "A bang at the door.  Gordon pulls his weapon, then opens it.", "Gordon looks at Stephens's list.", "Gordon, realizing, spins around-", "But Loeb is already CHOKING- he DROPS his tumbler onto the", "desk- the spilled whiskey is SMOKING, eating into the wood.", "Loeb COLLAPSES.", "INT. KITCHEN, WAYNE PENTHOUSE -- EVENING", "Dent pulls Rachel into the kitchen, away from the crowd.", "Rachel looks at Dent.  Smiles.", "Rachel looks at him.", "INT.LIVING ROOM, PENTHOUSE -- NIGHT", "Half the guests are on their cell phones.  An ASSISTANT DA", "turns to his COLLEAGUE.", "There is a KNOCK at the front door.  Alfred opens it it find", "Detective Wuertz, who holds up his badge.  Alfred beckons him", "in- there is a SHOTGUN at the back of his head held by-", "The Joker- purple suit, make up.  With friends.  The Joker", "SMASHES Wuertz over the head- steps over him, RACKING the", "shotgun.", "INT. KITCHEN, WAYNE PENTHOUSE -- NIGHT", "Rachel is looking at Dent.  Torn.", "Wayne is moving up behind him.  Fast-", "Rachel's eyes go wide as Wayne puts Dent in a SLEEPER HOLD-", "Dent SLUMPS, unconscious in Wayne's arms.", "From the main room- A SHOTGUN BLAST followed by SCREAMS.", "Wayne stuffs Dent in a closet- puts a mop through the", "handles.  Rushes past Rachel-", "INT. LIVING ROOM, WAYNE'S PENTHOUSE -- NIGHT", "The Joker and his THUGS pour into the room, weapons raised.", "INT. HALLWAY, WAYNE PENTHOUSE -- NIGHT", "A THUG appears in front of Wayne, toting a shotgun.", "Wayne FLIPS the shotgun around in the man's hands- uses it as", "a fulcrum to SNAP his forearm- SMASHES him in the jaw with", "the stock without breaking step, field stripping the shotgun", "and tossing the pieces in different directions.", "INT. LIVING ROOM, WAYNE'S PENTHOUSE -- NIGHT", "The Joker moves through the terrified guests.  Smiling.", "A distinguished Gentleman steps into the Joker's path.", "The Joker stops.  Stares at the man.  SMILES AFFECTIONATELY.", "The Joker has his blade in the Gentleman's mouth.", "The Joker drops the Gentleman.  Turns to Rachel.", "INT. MASTER BEDROOM, WAYNE PENTHOUSE -- NIGHT", "Wayne walks in.  A COUPLE are hastily putting themselves back", "together, alerted by the noise.", "Wayne doesn't answer.  He walks into a closet and pulls at a", "FALSE WALL.  Wayne steps into the safe room.", "The door SLAMS shut and seals with a HISS.", "INT. LIVING ROOM, WAYNE'S PENTHOUSE -- NIGHT", "The Joker raises his knife from Rachel's cheek.  She SLUGS", "him.  He smiles.", "The Joker turns.  Batman catches him with a BLOW, spins him", "down and DISARMS him- the Joker's men jump him- Batman takes", "them out two at a time-  DISARMING thugs- BREAKING forearms-", "the Joker CLICKS a BLADE from the toe of his shoe and KICKS-", "JABBING BETWEEN THE PLATES OF ARMOR covering Batman's ribcage-", "Batman HURLS the Joker across the room.  One of the Joker's", "men LUNGES- Batman lays him out cold.", "The Joker has another knife pressed to Rachel's neck.", "Rachel shakes her head at Batman.  The Joker raises his", "shotgun to the side and BLOWS OUT the pane of glass next to", "him.  The Joker dangles Rachel out the window.", "He lets her DROP-  Rachel falls onto a SLOPING GLASS ROOF-", "sliding towards the edge Batman DIVES after her-", "EXT. BUILDING -- NIGHT", "They DROP- Batman FIRES his grapple, SNAGGING Rachel's ankle-", "activates one wing of his cape- They SPIN and SLOW- Batman", "envelopes Rachel- they SLAM into the hood of a passing taxi.", "INT. TAXI -- CONTINUOUS", "The DRIVER SCREAMS as Batman and Rachel hit the roof- ROLL", "down the windshield- onto the pavement.  Alive.", "INT. CAR -- CONTINUOUS", "The Joker looks back as his car SPEEDS away.  He's breathing", "hard, EXHILARATED.  He touches the blood running down his", "sweaty white makeup.  SMACKS the back of the driver's seat-", "EXT. TAXI -- CONTINUOUS", "Rachel opens her eyes.", "Rachel lies back, breathing.  Looks up at Batman.", "INT. MAJOR CRIMES UNIT, GOTHAM CENTRAL -- DAY", "STEPHENS is talking to Gordon, subdued.", "The door BURSTS OPEN.  Dent.  Fire in his eyes.", "Gordon looks at Dent.  Impressed.", "INT. SPECIAL HOLDING AREA, MCU, GOTHAM CENTRAL -- DAY", "Lau looks up as Dent walks in, holding a bullet proof vest.", "Dent THROWS the heavy vest at Lau.", "INT. BAT-BUNKER -- DAY", "Wayne sits at his video screens- they all play the Joker's", "video with different IMAGE TREATMENTS and SOUND TUNINGS.", "Wayne turns to Alfred.  Indicates the screens.", "Wayne gets up from his monitors, raises the bat-cabinet.", "Wayne stares at Alfred.  Reaches for the bat-suit.", "EXT. SKYLINE OF GOTHAM -- DAWN", "MOVING over the city we hear myriad RADIO CALLS going out", "over the ether.  CLOSE IN on a lonely figure on top of a", "skyscraper.  The Batman.  Listening with his million dollar", "earpieces.  From the babble, ONE VOICE EMERGES.", "EXT. 8TH STREET AT ORCHARD -- DAWN", "An UNMARKED and a SQUAD CAR screech to a halt.  Gordon and", "Ramirez get out, lead two UNIFORMS into the building.", "INT. APARTMENT, EIGHT AVE. -- CONTINUOUS", "The door SMASHES OPEN, Gordon- gun drawn- takes in the scene.", "TWO DEAD MEN sitting at the kitchen table.  They each have a", "HAND OF CARDS, as if in the middle of a game.  ALL JOKERS.", "Gordon and Ramirez STARE at the CRUDE LEERS carved into their", "faces.  Their DRIVERS LICENSES are pinned to their chests.", "She stands down.  Batman moves past the bodies to the wall.", "Finds an embedded stray bullet.  He pulls a SAWING DEVICE", "from his belt- THRUSTS it into the wall and starts cutting", "around the bullet.", "Ramirez looks at Gordon.  Is he serious?  Gordon points-", "Batman looks- a campaign poster: RE-ELECT MAYOR GARCIA.  The", "Mayor's image has a MANIC CLOWN'S GRIN and \"HA,HA,HA\".", "INT. FOX'S OFFICE, WAYNE ENTERPRISES -- DAY", "Fox is at his desk.  Reese enters.", "He pulls out a folded blueprint.  Slides it across the desk.", "Fox picks up the piece of paper.  Unfolds it.  It's an old", "BLUEPRINT.  The image is unmistakable: THE TUMBLER.", "Reese points to the approval box in the corner of the page.", "Fox looks at him.  Even.  Folds up the blueprint.", "Reese stares at Fox.  Who smiles.  And slides the blueprint", "across the desk.", "Reese looks at it.  Then at Fox.  Swallows.  Slides it back.", "INT. BAT-BUNKER -- DAY", "Wayne hands Alfred a  RIFLE BULLET scribed with a GRID.  He", "slots it into a clip, then loads it into a COMPUTER", "CONTROLLED GATTLING GUN.  He puts on ear protectors.  Hits a", "button.", "The rifle WHIRS to life- dollying sideways, BLASTING BULLETS", "into a series of identical BRICK WALL SAMPLES.", "As the wall samples still smoke, Wayne steps up, carrying the", "sample from the crime scene. Comparing its spread to the new", "samples, he selects two and carries them to an X-RAY SCANNER.", "The machine gives the samples a 3-axis scan- HI-RES 3-D", "IMAGES of the bullet fragment arrays come up on the screen...", "INT. APPLIED SCIENCES DIVISION -- DAY", "The same image of the bullet fragment on a screen.  Fox hits", "a key and the computer 'reassembles' the bullets according to", "the identifying grid on each fragment.", "A bullet fragment array pops on screen.", "Fox hits a button and the unmarked bullet fragments are", "reassembled.  Wayne spins the roughly-shaped bullet puzzle-", "Fox looks at the screen, impressed.  Thinks.", "Fox looks at Wayne as he leaves.  Uneasy.", "INT. BAT-BUNKER -- CONTINUOUS -- INTERCUT", "Wayne examines the fingerprint-", "Wayne gets up to let Alfred sit.", "Wayne opens a HYDRAULIC DOOR, revealing a gleaming MV AUGUSTA", "BRUTALE.  As he moves the bike onto the lift...", "Wayne and the bike rise on the lift.", "EXT. PARKSIDE AVENUE -- DAY", "The avenue has been blocked off.  Onlookers line the", "sidewalks.  POLICE march past in dress uniform.  Engel does a", "stand-up on the sidewalk.", "On the buildings above, POLICE SNIPERS scan the crowd.", "Gordon keys his radio-", "Gordon looks up at the myriad buildings overlooking the", "podium.", "EXT. GOTHAM STREETS -- CONTINUOUS", "Wayne maneuvers the Ducati through the traffic.  He pulls up", "near a parade barricade- dismounts and slips into an alley.", "INT. TENEMENT -- CONTINUOUS", "Some of the building's hard-luck TENANTS eye Wayne as he", "counts doors down the hallway.  He finds 1502...", "EXT. PARKSIDE AVENUE -- LATER", "A SEA OF POLICE fills the Avenue.  In the center, three", "grieving families and an HONOR GUARD.  The Mayor at the", "podium.  Gordon behind.  Dent is seated with Rachel.", "INT. TENEMENT -- CONTINUOUS", "Wayne enters: EIGHT MEN IN UNDERSHIRTS, bound, gagged,", "blindfolded.  A SNIPER SCOPE on a tripod at the window.", "Wayne moves to the first man, RIPS the tape from his mouth.", "EXT. PARKSIDE AVENUE -- CONTINUOUS", "Gordon scans the crowd.  The Mayor wraps up- the Honor Guard", "steps forward, raises weapons...", "EXT. ROOFTOP OVERLOOKING PARKSIDE -- CONTINUOUS", "A POLICE SNIPER scans the windows of the tenement...", "INT. TENEMENT -- CONTINUOUS", "Wayne RACES to the window, looks through the SCOPE to see:", "EXT. STATE STREET -- CONTINUOUS", "THE HONOR GUARD TURN THEIR WEAPONS ON THE MAYOR.  One SMILES,", "flesh-colored makeup over his scars.  THE JOKER.", "Gordon LEAPS FORWARD- they FIRE- GORDON TAKES SHOTS TO THE", "BACK as he SLAMS the Mayor to the ground-", "EXT. ROOFTOP OVERLOOKING PARKSIDE -- CONTINUOUS", "The Police Sniper SPOTS Wayne at the window- SHOOTS-", "INT. TENEMENT -- CONTINUOUS", "Wayne DUCKS as SHOTS erupt around the window-", "EXT. PARKSIDE -- CONTINUOUS", "PANDEMONIUM erupts-One of the honor guard is TAGGED IN THE", "LEG- GOES DOWN.  The others MELT into the CHAOS.", "On the podium, Stephens rolls Gordon over... he is not", "moving.", "EXT. SIDE STREET OFF PARKSIDE -- MOMENTS LATER", "CHAOS.  Dent approaches an ambulance sitting in the alley.", "Two cops jump out and run over to their commander.  Dent", "steps up into the back.", "INT. AMBULANCE -- CONTINUOUS", "The Joker's thug sits there.  Handcuffed.  A PARAMEDIC", "bandages his leg.  Cops run past, barking orders.", "The Joker's thug looks at Dent.  Smirks.  Dent looks down.", "Exasperated.  Looks back up at the Joker's Thug.  Spots", "something- moves closer- the man's uniform... his name tag...", "OFFICER RACHEL DAWES.", "Dent, breathing hard, looks around: the paramedic jumps out,", "rushing to help a FALLEN OFFICER.  Dent spies the keys in the", "ignition.  Jumps into the driver's seat...", "EXT. GORDON'S HOUSE -- DUSK", "Barbara Gordon stands in the doorway, scared.  Stephens and a", "UNIFORMED OFFICER stand in front of her.", "James Gordon pushes past his mother to look at Stephens.", "Barbara tries to push him back inside.", "James stays just inside the door.", "Barbara stares at Stephens.  Then looks past him.", "James spots something- Batman, perched in the shadows.", "She collapses into Stephens's arms.  Batman hangs his head.", "EXT. ROOF, MCU -- NIGHT", "Detectives from MCU stand around the lit bat-signal.", "INT. NIGHTCLUB -- NIGHT", "Strobe lights.  Pounding music.  Maroni is in a booth at the", "side with his MISTRESS.  His bodyguards are around the table.", "One of Maroni's Bodyguards DROPS- Maroni looks over- in the", "strobe lights- Batman SAVAGES his bodyguards- people RUN,", "TERRIFIED.  Maroni starts to get out of his seat- Batman", "LANDS like a panther on the table in front of him-", "INT. MCU -- NIGHT", "Rachel moves through the chaotic bullpen at MCU-", "EYEWITNESSES, civilian and cop are being questioned.", "Rachel's phone rings.", "INTERCUT with Dent in an INDISTINCT interior setting.", "Rachel looks around the bullpen.  Eyeing the detectives.", "Wider shows us we are-", "INT. BASEMENT, CONDEMNED BUILDING -- CONTINUOUS", "Dent hangs up the phone.  TAPED to a chair in front of Dent-", "the Joker's Thug, blindfolded.  Dent RIPS off the", "blindfold...", "EXT. FIRE ESCAPE -- NIGHT", "Maroni opens his eyes.  Batman is holding him by the collar.", "Batman lets go.  Maroni FALLS.  And SCREAMS.", "EXT. SIDEWALK -- NIGHT", "Maroni NAILS the pavement.  CLUTCHES at his leg, which is", "badly broken.  Batman FLIES down, landing over him- hauls him", "up.  Maroni HOLLERS in pain.", "Maroni looks up at Batman.  Sneering.", "Batman DROPS Maroni.", "INT. BASEMENT, CONDEMNED BUILDING -- NIGHT", "Dent shows the Joker's Thug a GUN.  Bullets.  Loads the gun.", "SHOVES it in his face-", "Dent PUSHES the gun against the thug's head with REAL MALICE.", "Pulls it away and FIRES.  The Thug FLINCHES.  Dent puts the", "gun barrel against the thug's temple-", "And pulls his lucky coin out of his pocket.", "The Thug, scared, says nothing.  Dent FLICKS the coin into", "the air.  SLAPS it onto the back of his gun hand (aiming with", "wrist horizontal).  Dent shows him the coin.  Heads.  The", "Thug exhales, SHAKING.", "Dent tosses the coin again.  This time IT DOESN'T LAND.  Dent", "looks up.  Batman is there.", "Batman moves away from Schiff.", "Dent is shivering with frustration.", "Batman hands Dent his lucky coin.", "But Batman is gone.", "INT. BEDROOM, WAYNE PENTHOUSE -- NIGHT", "Rachel watches Gotham through the window.  Wayne enters.", "Rachel looks at Wayne.  She cannot help him.", "Wayne moves towards her.", "Wayne takes her in his arms.", "They kiss.  Then separate.  She looks sadly into his eyes.", "Wayne nods.  Leaves.  She watches him go.", "INT. BAT-BUNKER -- DAWN", "Alfred shovels DOCUMENTS into an incinerator- blueprints,", "designs, files.  He pauses, looking down at a book.", "Alfred tosses the book onto the fire.  STARES at Wayne.", "Alfred looks into Wayne's eyes with a fearsome gaze.", "Wayne shakes his head.", "Wayne sinks the Bat-suit, Alfred closes the incinerator.", "They head for the lift.", "They power down, leaving the Bat-bunker in darkness.", "INT. PRESS ROOM, SUPERIOR COURT -- DAY", "A capacity crowd of REPORTERS, COPS, and PUBLIC.  Dent is at", "the podium.  Wayne sits in the crowd.", "The crowd REACTS-", "The crowd noisily assents.  Dent calmly motions quiet.", "INT. WAYNE PENTHOUSE -- CONTINUOUS", "Rachel is watching the press conference on TV.", "INT. PRESS ROOM, SUPERIOR COURT -- CONTINUOUS", "Wayne looks at the Heckler.  At the angry crowd.  Dent leans", "over the podium.  Impassioned.", "The crowd seems moved by his words, then, a CHANT-", "Appreciative noise.", "People take up the chant.  Dent has lost them.  He knows it.", "At this, a HUSH DESCENDS.  Wayne is sitting towards the back.", "Hungry eyes scan the room.  Wayne starts to rise...  DENT", "OFFERS HIS OWN WRISTS TO THE OFFICERS-", "A beat.  Wayne stares.", "INT. WAYNE PENTHOUSE -- CONTINUOUS", "Rachel STARES as Dent is arrested on TV.  Appalled.", "INT. WAYNE PENTHOUSE -- DAY", "Rachel comes up to Alfred.  Upset.", "Rachel holds out an ENVELOPE.", "Alfred takes the envelope.  Rachel gives him a kiss.", "INT. CELL, MCU -- EVENING", "A Detective unlocks the cell and lets Rachel inside.", "The Detective knocks.  Dent rises.", "EXT. COURTYARD MCU -- EVENING", "Detectives stare at Dent as he is led, shackled, to the", "waiting CONVOY.  Stephens begins CLAPPING- a handful join in,", "but most remain silent.  Rachel follows him to the back of an", "armored vehicle.", "Dent kisses her.  Pulls out his LUCKY COIN-", "Dent tosses it at her- Rachel catches it.  Looks.  Heads.", "She turns it over: IT IS DOUBLE-HEADED.  She looks up- the", "DOORS CLOSE on his smile.  She shakes her head.  Torn.", "As SWATS file into the back of the support vehicles-", "INT. ARMORED CAR -- CONTINUOUS", "A Swat with a shotgun climbs into the cab.  Pulls on his", "mask.  Looks over at the DRIVER, who's already wearing his.", "EXT. TENTH AVENUE, DOWNTOWN -- CONTINUOUS", "The convoy ROCKETS past a roadblock.", "INT. ARMORED CAR -- CONTINUOUS", "The Swats are staring at Dent, fascinated.  He smiles.", "EXT. INTERSECTION -- CONTINUOUS", "An Officer holding up traffic.  A TRUCK pulls up.", "A SHOTGUN BLAST sends the Officer flying.  A second blast", "illuminates the shooter's face: the Joker.", "INT. LEAD PATROL CAR, CONVOY -- CONTINUOUS", "The SWAT behind the wheel of the lead black-and-white slows", "as he sees something burning in the intersection ahead.", "EXT. AVENUE -- CONTINUOUS", "Overhead, a police HELICOPTER checks the route, hovering", "above a burning FIRE TRUCK, BLOCKING the road.", "INT. ARMORED CAR -- CONTINUOUS", "The Driver is all business.  The radio CRACKLES.", "EXT. SURFACE STREETS -- CONTINUOUS", "The convoy disappears down the exit ramp.", "EXT. LOWER FIFTH AVENUE -- NIGHT", "The convoy rolls through the subterranean streets.  A GARBAGE", "TRUCK pulls up behind and casually SWIPES the rear vehicles", "of the convoy off the road...", "INT. ARMORED CAR -- CONTINUOUS", "The Driver NAILS the gas-", "EXT. LOWER FIFTH -- CONTINUOUS", "The Garbage Truck pushes hard on the armored car, ramming its", "rear bumper, FORCING it forward.", "INT. ARMORED CAR -- NIGHT", "The Driver watches the Truck fill his rear view.  Shotgun", "Swat picks up the radio.", "EXT. LOWER FIFTH AVENUE -- NIGHT", "A SECOND TRUCK SMASHES into the SWAT van at the head of the", "convoy, SMASHING it through the concrete barriers and INTO", "THE RIVER.  The truck is branded \"LAUGHTER\" but and \"S\" has", "been spayed at the front to make \"SLAUGHTER\" with \"HA, HA,", "HA\" all over the side...", "The Joker's Truck DODGES between the support columns and into", "the oncoming lane- pulls alongside the armored car.", "The Driver looks over.  The cargo door on the truck slides", "open.  Inside, the Joker, holding a machine gun.", "The armored car LOCKS up its brakes, but the garbage truck", "pushes it forward as the Joker fires- BULLETS slamming into", "the side of the vehicle-", "INT. REAR CABIN, ARMORED CAR -- CONTINUOUS", "Dent is calm as the SWATS FLINCH from the bullet indentations-", "INT. UP FRONT, ARMORED CAR -- CONTINUOUS", "Shotgun SWAT STARES at the Joker.", "INT. REAR TRAILER OF TRUCK -- NIGHT", "The Joker drops his machine gun and picks up and RPG.  He", "stops- SEES something up ahead, racing towards the second", "truck- the BATMOBILE.  The Joker stares, fascinated, as-", "EXT. LOWER FIFTH -- CONTINUOUS", "-THE BATMOBILE PLOWS STRAIGHT INTO THE SECOND TRUCK- the low-", "profile car sending the truck UP INTO THE CONCRETE CEILING-", "the Batmobile carries on through, as the TRUCK DISINTEGRATES.", "INT. TRUCK -- NIGHT", "The Joker looks back to the batmobile, amused.", "The Joker lines up his RPG and prepares to fire-", "INT. ARMORED CAR -- CONTINUOUS", "Shotgun SWAT's eyes go wide at the Joker's weapon- the Driver", "JAMS the brakes-", "EXT. LOWER FIFTH -- CONTINUOUS", "The Armored Car CRASHES BACK against the Garbage Truck,", "BRAKING, SCRAPING, SLOWING just enough- the RPG SLAMS into", "the SQUAD CAR in front of them and EXPLODES- the armored car", "BURSTS through the fireball and continues.", "EXT. LOWER FIFTH -- CONTINUOUS", "The Batmobile SPINS around to rejoin the pursuit.", "INT. JOKER'S TRUCK -- NIGHT", "The Joker turns his men to RELOAD his RPG-", "Turns back- levels his RPG out the window.  Aims.", "INT. BATMOBILE -- NIGHT", "Batman watches as the Joker prepares to fire.  Several rows", "of cars separate them.  He toggles the afterburner.", "INT. PASSENGER CAR -- NIGHT", "Two small children in the back of the car watch as the", "Batmobile ROCKETS overhead.", "EXT. LOWER LEVEL STREET -- NIGHT", "The Joker steadies the RPG and FIRES- the Batmobile CRASHES", "down into the open space between the two vehicles- taking the", "hit from the RPG which EXPLODES-", "The rear of the Batmobile EXPLODES- SPINNING the FLAMING car-", "INT. ARMORED CAR -- NIGHT", "SWATS react to the EXPLOSION.  Dent is calm.", "INT. CAB OF JOKER'S TRUCK -- CONTINUOUS", "The Driver takes a DEBRIS HIT to the head-", "INT. TRUCK -- CONTINUOUS", "The Joker CACKLES with delight as he is THROWN AROUND the", "rear of the trailer-", "INT. BATMOBILE -- CONTINUOUS", "Batman WRESTLES the pod controls, SPINNING on the GYRO-", "EXT. LOWER LEVEL STREET -- CONTINUOUS", "The Batmobile flips over to come to rest in a smoking heap-", "the front end intact, rear wheels scattered across the", "roadway.  A small crowd gathers.", "EXT. LOWER LEVEL STREET -- CONTINUOUS", "The Joker JUMPS down from the truck, still giggling like a", "kid- looks back at the Batmobile's destruction-", "The Joker YANKS his dead driver out of the cab, JUMPS over", "him to take the wheel and pull back onto the roadway.", "EXT. LOWER LEVEL STREET -- CONTINUOUS", "The armored car pulls ahead, the Joker's truck in hot", "pursuit.", "INT. ARMORED CAR -- CONTINUOUS", "Shotgun SWAT glances in the rear view mirror, slaps the dash-", "EXT. LOWER LEVEL STREET -- CONTINUOUS", "The armored car PULLS onto a RAMP, heading up.  The Joker's", "Truck follows.", "EXT. LOWER LEVEL STREET -- CONTINUOUS", "People stare at the smoking wreck, inching closer...", "INT. BATMOBILE -- CONTINUOUS", "Batman adjusts his position.  Hits a button-", "Arm guards GRAB Batman's forearms as EXPLOSIVE BOLTS FIRE all", "around the pod...", "EXT. LOWER LEVEL STREET -- CONTINUOUS", "The crowd JUMPS- PANELS of the front of the car BLOW OUT-", "The crowd stares, OPEN-MOUTHED, as Batman EMERGES, HOISTED UP", "AND OUT of the flaming car by the FRONT POD- LEVERING OVER", "the FRONT WHEEL... the pod PUSHES the OTHER WHEEL IN FRONT to", "form a type of MOTORCYCLE-", "The BAT-POD SHOOTS FORWARD, bursting free as the Batmobile", "DETONATES, DYING in a MASSIVE FIREBALL...  Batman's cape", "SUCKS TOGETHER, forming a TIGHT PACK on his shoulders, clear", "of the CHURNING REAR TIRE of the bat-pod...", "EXT. PARKSIDE -- CONTINUOUS", "The armored car races down the street- the CHOPPER dips low.", "INT. POLICE CHOPPER -- CONTINUOUS", "A Cop pulls out an ASSAULT RIFLE.  COCKS it-", "INT. CAB OF JOKER'S TRUCK -- CONTINUOUS", "The Joker FIGHTS with the truck's gearbox, turns to his Thug-", "The Thug GRABS his radio.", "EXT. FIRE ESCAPE -- CONTINUOUS", "A Joker Thug in clown mask loads up the cable gun seen in the", "bank heist.", "EXT. SECOND FIRE ESCAPE -- CONTINUOUS", "Another thug loads his own cable gun...", "INT. PASSENGER CAR, LOWER LEVEL STREET -- NIGHT", "A motorist stares through his rear-view mirror, transfixed,", "as the bat-pod TEARS past.  He YELPS as the bat-pod SMASHES", "the wing mirror from his car.", "EXT. LOWER LEVEL STREET -- NIGHT", "Batman accelerates, oblivious to the STACCATO of CLEAVED wing", "mirrors as the bat-pod RAZORS through traffic- CROSSES a BUSY", "INTERSECTION-  The bat-pod CUTS off the crowded lower level", "street, ROARING over into the PARKING LANES-", "Batman squeezes his triggers- BLASTING at PARKED CARS,", "BLOWING them out of the way, literally CANNONING A PATH for", "the pod...", "EXT. TRAIN STATION -- CONTINUOUS", "The Bat-Pod CANNONS through the glass doors and RACES through", "the station/mall- COMMUTERS screaming and diving out of the", "way-", "The Bat-Pod races up the stairs and onto the upper street-", "EXT. PARKSIDE -- CONTINUOUS", "The Joker's Thugs FIRE THE CABLES ACROSS THE STREET AT", "SEVENTH FLOOR LEVEL... they pull TAUT as the Chopper", "approaches, unawares... the Chopper CATCHES on the cables,", "GOING DOWN in a FIERY BALL that BARRELS along the street", "towards the armored car...", "INT. ARMORED CAR -- CONTINUOUS", "The Driver steers around the flaming wreckage as the Shotgun", "SWAT SHUTS HIS EYES-", "EXT. NARROW ALLEY -- CONTINUOUS", "The Bat-pod TEARS down a narrow alley blocked with DUMPSTERS-", "CANNONS the dumpsters to make a path-", "INT. CAB OF JOKER'S TRUCK -- NIGHT", "The Joker hands the wheel to his man- takes a submachine gun-", "The Joker looks ahead to see the Bat-pod emerge from the", "alley in a cloud of fire, SKIDDING SIDEWAYS IMPOSSIBLY- it", "RACES TOWARDS THEM-", "EXT. PARKSIDE -- NIGHT", "The Bat-pod RACES straight at the Joker's truck- FIRES A", "HARPOON at the Joker's truck- it IMPACTS low, below the", "bumper-", "INT. TRUCK -- CONTINUOUS", "The Joker's Thug DUCKS, then comes back up, beaming.", "EXT. PARKSIDE -- CONTINUOUS", "Batman SWERVES past the Joker's truck, SLALOMS, wrapping the", "CABLES around a LAMP POST, SPINNING to a halt to watch...", "EXT. PARKSIDE -- CONTINUOUS", "The cable goes TAUT, RIPPING one post from its foundation-", "the TRUCK'S FRONT WHEELS CATCH, FLIPPING IT END OVER END...", "The Joker crawls from the wreckage.  He jumps over the median", "and starts waving his pistol at oncoming traffic.  Batman", "GUNS the bat-pod and rides it up and over the median.", "INT. ARMORED CAR -- NIGHT", "The Driver slows the car, pulls to the side.", "EXT. PARKSIDE -- NIGHT", "The Joker walks towards the Bat-pod, which SPEEDS towards", "him.  He is FIRING his gun RANDOMLY at the oncoming traffic.", "Batman watches as the Joker holds out his arms.  Waiting for", "impact.  There is no room to go around him.", "Batman LOCKS UP THE BRAKES.", "The Joker watches as Batman DUMPS the bike, rather than", "smashing into him.  Batman SLAMS into the wall.", "The Joker's thug reach Batman first.  He is unconscious.  The", "first Thug pulls at the mask.  An ELECTRIC SHOCK from the bat-", "suit THROWS him back.  The Joker LAUGHS.  Flicks his", "switchblade.  Crouches-", "The gun is COCKED.  The Joker drops the knife.  Sits.  Looks", "back.  Behind them is the armored car.  The man standing over", "him is the Driver.  He pulls off his helmet.", "It's JIM GORDON.  Back from the dead.", "INT. ARMORED CAR -- MOMENTS LATER", "Dent looks up as the door swings open to reveal Gordon.  Dent", "GRINS.", "Dent nods.  Respect in his eyes.  They shake hands.", "EXT. PARKSIDE -- NIGHT", "A small army of cops have sealed off the roadway.  Gordon", "pulls away in the squad car containing the Joker.", "REPORTERS clamor for an interview with Dent, who is being", "helped out of the van by the SWATS.  Ramirez pushes through", "the pack, shoving reporters aside.", "Dent follows Ramirez to a squad car- Wuertz is in the", "driver's seat.  Dent smiles at Ramirez as she opens the rear", "door.", "Ramirez shuts the door on Dent.  Signals Wuertz to pull out.", "INT. HOLDING, MCU, GOTHAM CENTRAL -- NIGHT", "The Joker sits in a holding cage.  His makeup has run, his", "clothes a mess- but his calm lends him an odd dignity.  COPS", "SMASH their night sticks against the bars near the Joker's", "head.  The Joker does not flinch.", "The Mayor walks in.  Shakes Gordon's hand.", "The Mayor looks over at the Joker in his cage.", "The cops in M.C.U. start CHEERING.", "EXT. GORDON HOME -- NIGHT", "Gordon rings the bell.  Barbara answers it, dressed in black.", "She SLAPS Gordon.  He grabs her, holds her tight as she sobs.", "INT. HOLDING, MCU, GOTHAM CENTRAL -- NIGHT", "The Joker's men are processed.  In the harsh light, the men", "look a little ridiculous in their clown make-up.  DETECTIVE", "MURPHY turns to Stephens.", "One of the men, walks over, clutching at his belly.", "Alone in his cage, the Joker smiles at this.", "INT. KIDS' BEDROOM, GORDON HOME -- NIGHT", "Gordon crouches by his son's beside.  He reaches out to touch", "James Jr's cheek.  James's eyes open.  Staring at his dad as", "if still dreaming.", "Gordon looks at his son.  A little pride seeps in.", "Gordon's phone rings-", "INT. MAJOR CRIMES UNIT, GOTHAM CENTRAL -- NIGHT", "Gordon PUSHES through the swarm of detectives crowded into", "the observation room.  The Joker can be seen through the", "glass, as well as on a large MONITOR.  Sitting there.  Calm.", "Ramirez shakes her head.  Gordon PUSHES through a door...", "INT. INTERROGATION, MCU, GOTHAM CENTRAL -- NIGHT", "The Joker, in near darkness.  Gordon walks in.  Sits.", "Gordon can't help glancing at the mounted CAMERA.", "Gordon stands.  Moves to the Joker.  Undoes his handcuffs.", "Gordon pauses, hand on the doorknob.", "Gordon steps out.  The overhead lights COME ON.  BATMAN IS", "BEHIND HIM.  The Joker BLINKS in the HARSH WHITE LIGHT.", "WHAM!  The Joker's face HITS the table- comes up for air-", "CRACK!  CRACK!  To the head.  Batman is in front of him.  The", "Joker stares, fascinated.  Bleeding.", "CRACK!  Batman's fist SMACKS down on the Joker's fingers.", "The Joker starts LAUGHING.  After a moment he's laughing so", "hard it sounds like SOBBING.", "He regards Batman with something approaching pity.", "The Joker looks into Batman's eyes.  Searching.", "Batman GRABS the Joker and pulls him upright.", "INT. OBSERVATION ROOM, MCU, GOTHAM CENTRAL -- NIGHT", "One of the Detectives moves for the door.  Gordon stops him.", "INT. INTERROGATION ROOM, MCU, GOTHAM CENTRAL -- NIGHT", "Batman HOISTS the Joker up by the neck.", "Batman leans in to the Joker.", "Batman DROPS the Joker- RIPS up a bolted-down chair-", "INT. OBSERVATION ROOM, MCU, GOTHAM CENTRAL -- NIGHT", "Gordon MOVES for the door-", "INT. OBSERVATION ROOM, MCU -- CONTINUOUS", "Batman JAMS the chair under the doorknob- PICKS up the Joker", "and HURLS him into the two-way glass.  The glass SPIDERS.", "INT. INTERROGATION ROOM, MCU, GOTHAM CENTRAL -- NIGHT", "The Joker, bleeding from nose and mouth, LAUGHS at Batman.", "The Joker SMASHES into the wall- SLIDES to the floor.  Batman", "stands over him, a man possessed-", "He GRABS the Joker, holding him close-", "Batman PUNCHES the Joker across the face.  HARD.", "The Joker FEEDS off Batman's anger.  Loving it.", "Batman PUNCHES the Joker again.  The Joker LAUGHS.", "The Batman stares at the Joker...", "Batman DROPS him.", "INT. OBSERVATION ROOM, MCU, GOTHAM CENTRAL -- NIGHT", "Batman RACES past Gordon.", "Gordon looks back- the Joker is bloody, but grinning.", "EXT. MCU, GOTHAM CENTRAL -- NIGHT", "Several cops see Batman climb onto the bat-pod and TEAR off.", "EXT. STREETS, GOTHAM -- NIGHT", "Batman SWERVES into oncoming traffic, CHAOS in his wake.", "EXT. GOTHAM CENTRAL -- NIGHT", "Gordon and his men SCRAMBLE into their cars...", "INT. BASEMENT APARTMENT -- NIGHT", "Black.", "Harvey Dent opens his eyes.  He's bound to a chair in a", "dingy, unfurnished basement apartment.", "Her voice is coming from a speakerphone on the floor.", "He looks around.  Behind him, metal BARRELS, hooked up to a", "car battery, with a TIMER counting down: five minutes.", "INT. INTERROGATION ROOM, MCU, GOTHAM CENTRAL -- NIGHT", "The Joker sits, smiling, content.  Stephens guards the door.", "INT. HOLDING AREA, MCU, GOTHAM CENTRAL -- NIGHT", "The Fat Thug shuffles to the bars, where a COP stands guard.", "The Fat Thug COLLAPSES.  The Cop grabs his radio.", "INT. WAREHOUSE -- NIGHT", "Rachel is bound to a chair.  Behind her are barrels identical", "to the ones behind Dent.", "The timer connected to the bomb reads 2.47... 2.46...", "INT. BASEMENT APARTMENT -- NIGHT", "Dent DRAGS his chair, inching closer to the barrels.", "The chair JAMS against a ridge in the floor.  Dent STRAINS to", "reach the timer.  Inches shy.", "Dent strains...  THE CHAIR, AND DENT, TOPPLE OVER- KNOCKING", "OVER A BARREL.", "Dent, one side of his face pressed against the bare floor,", "watches the open barrel SPEW DIESEL FUEL around him-", "Dent contorts his head to keep from swallowing any.", "EXT. STREETS, GOTHAM -- NIGHT", "The bat-pod SKIDS SIDEWAYS, WHEELS FLIPPING as the gyro keeps", "Batman upright on the tumbling bike- it comes to rest- guns", "lined up with a fire exit- BLOWS the door off its hinges-", "JUMPS off the bike-", "EXT. 52ND STREET, GOTHAM -- NIGHT", "Gridlock.  Gordon SWERVES onto the sidewalk.  People SCATTER.", "INT. INTERROGATION ROOM, MCU, GOTHAM CENTRAL -- NIGHT", "The Joker sits like a kid kept after class.  He smiles.", "Stephens tries hard to ignore him.  It isn't working.", "Stephens PUNCHES the Joker in the gut.", "INT. BASEMENT APARTMENT -- NIGHT", "Dent is half submerged in diesel fuel.", "Dent CHOKES, his emotions overwhelming him.", "INT. WAREHOUSE -- NIGHT", "Rachel looks at the timer.  Ten seconds left.", "INT. HOLDING AREA, MCU, GOTHAM CENTRAL -- NIGHT", "A MEDIC CUTS away the Fat Thug's shirt- his belly has large", "INCISION, which has been closed with crude looking STITCHES-", "A RECTANGULAR SHAPE is visible under the skin above his", "navel.", "INT. DETECTIVE'S ROOM, MCU, GOTHAM CENTRAL -- NIGHT", "Stephens shuffles out into the room, a piece of BROKEN GLASS", "held to his THROAT by the Joker.  Cops draw their weapons.", "The Detectives look at each other.  One of them pulls out his", "cell phone.  TOSSES it to the Joker, who begins to dial.", "INT. HOLDING AREA, MCU, GOTHAM CENTRAL -- NIGHT", "The Medic gingerly PRESSES the rectangle.  It illuminates, a", "soft blue light visible through the skin.", "INT. DETECTIVE'S ROOM, MCU, GOTHAM CENTRAL -- NIGHT", "The Joker presses SEND.  At the end of the room, the door to", "the holding area EXPLODES-", "INT. HALLWAY, TENEMENT -- NIGHT", "Batman SPRINTS down the hall- stops at a door- KICKS it-", "EXT. 52ND STREET, GOTHAM -- NIGHT", "Cars PULL UP- Gordon gets out, carrying a fire ax-", "INT. HALLWAY, TENEMENT -- NIGHT", "Batman KICKS- the door gives- Batman SMASHES it open-", "INT. BASEMENT APARTMENT -- NIGHT", "...Batman BURSTS through the door- Dent looks up in horror-", "Batman STARES at Dent.  The Joker lied.  The counter hits 5", "seconds.  Batman DRAGS Dent out- Dent FIGHTS to stay-", "EXT. 52ND STREET, GOTHAM -- NIGHT", "Gordon, axe in hand, RUNS towards the entrance-", "INT. WAREHOUSE -- NIGHT", "Rachel can hear Dent.  The counter runs out.", "AN EXPLOSION.  ALL-CONSUMING.", "EXT. 52ND STREET, GOTHAM -- NIGHT", "The BLAST HURLS Gordon backward onto the hood of his car- THE", "ENTIRE WAREHOUSE IS AN ENORMOUS EXPLOSION-", "INT. BASEMENT APARTMENT -- NIGHT", "Batman wraps his cape around Dent and hurls them both through", "the door.  Dent is SCREAMING-", "EXT. 52ND STREET, GOTHAM -- NIGHT", "Gordon picks himself up.  The warehouse is an inferno.  He", "heads for it anyway.  Five of his men have to RESTRAIN HIM.", "EXT. ALLEYWAY, GOTHAM -- NIGHT", "A SECOND EXPLOSION- Batman COVERS Dent as the FIREBALL HITS", "them- IGNITING the diesel soaking Dent's left side- he starts", "BURNING.  And stops screaming.  Batman ROLLS Dent on the wet", "pavement...  Dent SIZZLES.  Silent.", "INT. SPECIAL HOLDING AREA, MCU, GOTHAM CENTRAL -- NIGHT", "The Joker walks to the bars of another cell.  Grins.", "In his cell.  Terrified.  Lau.", "EXT. AMBULANCE -- CONTINUOUS", "Dent is wheeled into an ambulance, bandages held to his face.", "His one visible eye STARES BLANKLY, oblivious to the panic-", "EXT. 52ND STREET -- CONTINUOUS", "Gordon watches the fire.  DEBRIS blows across the asphalt.", "Gordon picks up two pieces: SINGED JOKER CARDS.  In place of", "the Joker's face is a PHOTO OF LAU.  A POLICE SERGEANT", "approaches.", "EXT. STREET, DOWNTOWN GOTHAM -- DAWN", "A squad car BLAZES down the street.  The Joker sticks his", "head out the window like a dog, feeling the wind...", "INT. KITCHEN, WAYNE PENTHOUSE -- DAWN", "Alfred sits at a table reading the letter from Rachel.", "EXT. 52ND STREET -- DAWN", "Water.  Smoldering blackness.  The FIRE CREWS extinguish the", "last flames of the devastated building.  A FIREMAN nudges his", "COLLEAGUE, pointing out something in the devastation...", "INT. INTENSIVE CARE UNIT -- DAWN", "Glimpses of Dent's damaged face as SURGEONS surround him.", "EXT. 52ND STREET -- DAWN", "The Firemen watch a statue-like figure amidst the charred", "ruins.  The Batman.", "INT. MCU, GOTHAM CENTRAL -- DAY", "Gordon surveys the wreckage of MCU.  The bodies.", "EXT. 52ND STREET -- DAWN", "Batman bends to the ground on one knee, his black glove", "spread against the smoldering debris.", "He spots something.  DENT'S TWO-HEADED COIN.  Blackened,", "SCARRED.  Batman turns it over.  The other side is PRISTINE.", "INT. KITCHEN, WAYNE PENTHOUSE -- DAWN", "Alfred reads.", "INT. HOSPITAL ROOM -- DAWN", "Dent, heavily bandaged, hooked up to various machines.", "Batman stands at the foot of his bed.  Watching.", "Batman puts DENT'S DAMAGED COIN on the bedside table.", "INT. KITCHEN, WAYNE PENTHOUSE -- CONTINUOUS", "Alfred finishes the letter.  Tears in his eyes, he folds it", "back into its envelope.  Places it on the breakfast tray.", "INT. WAYNE PENTHOUSE -- DAWN", "Alfred moves through the silent space, stepping past the cowl", "and gauntlets lying on the cold marble.  He approaches Wayne,", "half-undressed, slumped in a chair watching Gotham.", "Nothing.  Alfred sets down the tray.  The envelope is propped", "against the silver teapot.", "Wayne turns, a desperate look in his eye.", "Wayne looks up at Alfred.  Alfred picks up the cowl.", "Alfred hands him the cowl.  Wayne looks at him.", "Alfred glances at the envelope.  Takes it off the tray.", "Alfred puts the envelope in his pocket.", "EXT. DOWNTOWN GOTHAM -- DAY", "A national guard helicopter ROARS over Gotham General.", "INT. HOSPITAL ROOM -- DAY", "Dent.  Bandaged.  Sedated.  Coming up for air.  Sees", "something on the table: his coin.  He fumbles for it,", "marvelling at its shiny face.  Remembering.", "INSERT CUT: RACHEL CATCHES THE COIN.", "Dent turns the coin over.  The other side is devastated.  He", "STARES at the scarred face.  Starts ripping his bandages.", "INT. WAYNE PENTHOUSE -- DAY", "Alfred comes up to Wayne.  Points him to the TV.", "On screen: Engel, in his studio, addresses the camera.", "The shot cuts to REESE, nodding.", "INT. HOSPITAL ROOM -- CONTINUOUS", "Gordon ENTERS.  Dent STARES to one side.  He looks normal.", "Dent's anger makes Gordon flinch.  He looks away.  Ashamed.", "Dent turns to face Gordon- the left side of Dent's face is", "DESTROYED- skin blackened and shriveled.  Molars visible.", "The eye a ball and socket.  Dent manages a small smile with", "the good side of his face.", "Dent looks at Gordon.  Cold.", "Gordon takes a last look at Dent.  Then leaves.", "INT. CORRIDOR, HOSPITAL -- CONTINUOUS", "Gordon steps out.  Someone is there.  Maroni.  On crutches.", "Gordon stares at him.  Cold.  Maroni shifts, awkward.", "EXT. ABANDONED DOCKS -- DAY", "The Chechen gets out of his SUV.  Looks at a RUSTED HULK.", "The Chechen, bodyguards, and dogs, head up the gangplank.", "INT. RUSTED HULK -- CONTINUOUS", "They pass into a huge hold.  In the middle: A BILLION", "DOLLARS.  The pile is thirty feet high.  Standing on top- the", "Joker.  At his feet, bound, is Lau.  The Chechen laughs.", "The Joker jumps from the top, slides down the pile.", "The Chechen shrugs.  Pulls out a cigar.  Lights it.", "The Joker GRABS a can of GASOLINE from his thug.", "He is SPLASHING gasoline onto the money.", "The Chechen, FURIOUS, steps forwards.  The Joker turns.  JABS", "his gun in the Chechen's face.  The Chechen's bodyguards", "REACT.  The Joker's men DRAW on them.", "The Joker PLUCKS the cigar from the Chechen's lips.", "The Joker tosses the cigar at the pile.", "The Chechen watches the money catch fire.", "The Joker crouches down to the Chechen's dogs.  They GROWL.", "The Joker takes out a knife.  Tosses it to his man.", "The Joker's men GRAB the Chechen.", "The Joker watches the towering FLAMES.  Lau screams.", "The Joker pulls out a phone...", "INT. TELEVISION STUDIO -- DAY", "Reese has a confident air.  Engel is taking calls.", "INT. MAJOR CRIMES UNIT, GOTHAM CENTRAL -- CONTINUOUS", "Gordon and his men are gearing up to take down the Joker.  A", "Detective turns up the TV in the bullpen-", "Reese looks around, twitching.  Sweating.", "The line rings off.  Engel is speechless.", "Gordon turns to the uniform COPS.", "The Uniforms SPRINT off.  Gordon turns to his Detectives.", "On screen: Reese is a deer in the headlights.", "INT. WAYNE PENTHOUSE -- DAY", "Wayne and Alfred move to the elevator.", "EXT. GOTHAM STREETS -- DAY", "Wayne's Lamborghini TEARS through downtown.", "INT. HOSPITAL -- CONTINUOUS", "CHAOS.  PATIENTS and STAFF running around.  COPS and TRAFFIC", "WARDENS try to manage the evacuation.  The COPS stationed", "outside Dent's room, look around, unsure-", "Two Cops move to help wheel gurneys around the corner.", "INT. LOBBY, TELEVISION STUDIO -- DAY", "Gordon and his men escort Reese out of the elevator- Engel", "follows with a camera crew.  As they approach the glass doors", "Gordon looks out at an angry crowd.", "Gordon SPOTS an OLD MAN raising a PISTOL- Gordon THROWS Reese", "to the ground as SHOTS SHATTER the laminated glass of the", "lobby.  The Crowd SURGES in all directions-", "Gordon hauls Reese to the stairwell.", "INT. LAMBORGHINI -- CONTINUOUS", "Wayne SLOWS past the chaos outside the television station.", "INT. BAT-BUNKER -- CONTINUOUS", "Alfred types at the computer station.", "INT. STAIRWELL, TELEVISION STUDIO -- CONTINUOUS", "Gordon pulls the shaken Reese down the stairs...", "...and into a police VAN...", "INT. POLICE VAN -- CONTINUOUS", "Gordon throws Reese in the back.  Smiles.", "The van PEELS out.  Heads onto the streets.", "EXT. HOSPITAL -- CONTINUOUS", "Cops load patients onto BUSES.  A TV van pulls up, Engel and", "his Cameraman jump out.  One of Dent's guards, POLK, looks", "into a SCHOOL BUS.  Turns to the Cop loading it.", "Polk heads back towards the hospital, against the flow.", "INT. LAMBORGHINI -- CONTINUOUS", "Wayne trails the police van from a distance.", "INT. POLICE VAN -- CONTINUOUS", "Gordon's phone BEEPS.  He looks at a text: WATCH OUT.  COPS", "WITH RELATIVES IN GOTHAM HOSPITALS- BURKE, RAMIREZ, TILL...", "INT. DENT'S HOSPITAL ROOM -- CONTINUOUS", "Polk enters the room.  No Davis.  Just a REDHEADED NURSE,", "back towards him, reading Dent's chart.", "The Redhead TURNS- it is the Joker, silenced pistol in hand.", "He FIRES.", "EXT. GOTHAM STREETS -- CONTINUOUS", "The Lamborghini zips around a car to get closer to the van.", "INT. POLICE VAN -- CONTINUOUS", "Gordon is reading his phone: ERIKSON, BERG.  Gordon looks up", "sharply.  Considers the uniformed cop nervously fingering his", "shotgun.", "The young cop, BERG, looks up.  Sweating.", "Berg nods.  Looks at his watch.", "INT. HOSPITAL ROOM -- DAY", "The Joker draws closer to Dent's bed.  Dent STRAINS at the", "leather cuffs binding him to the bed.", "The Joker loosens Dent's restraints.", "Dent's hand is TREMBLING.", "Hands him the pistol.  Dent holds it to the Joker's head.", "EXT. INTERSECTION, GOTHAM STREETS -- CONTINUOUS", "Wayne ROARS past a line of traffic to settle in a few cars", "back from the police van, sitting at a red light.", "INT. LAMBORGHINI -- CONTINUOUS", "Wayne studies the intersection- spots a PICKUP jostling for", "position on the cross street.", "INT. POLICE VAN -- CONTINUOUS", "Gordon watches Berg, mentally tracing the trajectory of his", "shotgun barrel as Berg fiddles with his gun.  Gordon starts", "trying to subtly unholster his own weapon.", "Berg looks at Gordon.", "INT. LAMBORGHINI -- CONTINUOUS", "Wayne watches the driver of the pickup staring intently at", "the police van.  Lining it up.", "INT. POLICE VAN -- CONTINUOUS", "Reese looks from Berg to Gordon.  Berg looks at Gordon,", "trembling, the barrel of his gun inching lower in the car.", "INT. DENT'S HOSPITAL ROOM -- CONTINUOUS", "The Joker leans in, pressing his head to the gun's barrel.", "Dent looks into the Joker's eyes.  Finding meaning.", "Dent looks down at the coin in his hands.  Turns it over,", "feels it's comforting weight.  Shows the Joker the good side.", "He turns the coin over.  The flip side is deeply SCARRED.", "The Joker looks at the coin.  Looks at Dent, admiringly.", "Dent FLICKS the coin into the air.  Catches it.  Looks.", "EXT. INTERSECTION, GOTHAM STREETS -- CONTINUOUS", "The light turns GREEN.  The police van pulls into the", "intersection- the pickup GUNS IT, RACING AT IT...", "INT. LAMBORGHINI -- CONTINUOUS", "Wayne FLOORS it, YANKS the wheel to pull up onto the sidewalk-", "INT. POLICE VAN -- CONTINUOUS", "Berg licks his lips, nervous.", "EXT. INTERSECTION, GOTHAM STREETS -- CONTINUOUS", "The pickup BARRELS at the van, FULL TILT- at the last second", "Wayne's Lamborghini SLIPS alongside the van- the pickup", "SMASHES INTO THE LAMBORGHINI-", "INT. POLICE VAN -- CONTINUOUS", "As the van JOLTS with the impact Gordon LEAPS forward,", "PUSHING UP Berg's shotgun barrel, which FIRES into the roof-", "Gordon SMASHES Berg on the head with his sidearm.", "EXT. INTERSECTION, GOTHAM STREETS -- CONTINUOUS", "Gordon's men pull the pickup driver from his cab- Gordon", "crouches down to the Lamborghini wreck to help pull Wayne", "from the car.  Gordon recognizes him as he pulls him free.", "Wayne looks at him, woozy.  Sits on the curb.", "Wayne turns- sees the police van as if for the first time.", "Reese steps down, dazed.", "Reese locks eyes with Wayne.  Nods.  Gordon sizes up Bruce", "Wayne and his crushed sports car.", "INT. CORRIDOR, HOSPITAL -- CONTINUOUS", "The Joker walks calmly through the mostly deserted building.", "As he walks he pulls a DETONATOR from his pocket.  Strolling", "along he PUSHES THE BUTTON... STAGGERED EXPLOSIONS BURST INTO", "THE CORRIDOR BEHIND HIM LIKE DEMOLITION BLASTS... the Joker", "just walks out the door...", "EXT. HOSPITAL -- CONTINUOUS", "The Joker STROLLS down the steps- WINDOWS BLOW OUT IN SERIES-", "People DIVE for cover- Engel PILES into a school bus-", "The Joker walks across the parking lot- THE BUILDING", "COLLAPSING BEHIND HIM...", "EXT. INTERSECTION, GOTHAM STREETS -- CONTINUOUS", "Gordon hears the EXPLOSION.", "EXT. HOSPITAL -- CONTINUOUS", "The Cop cowers as DEBRIS and SMOKE BLAST across the street-", "INT. SCHOOL BUS -- CONTINUOUS", "The Joker gets onto the bus.  Nods at his man at the wheel.", "EXT. HOSPITAL -- CONTINUOUS", "All eyes are on the collapsed building.  One school bus pulls", "out from the line of other buses.  Heads down the street.", "INT. BAR, GOTHAM HEIGHTS -- DAY", "An empty neighborhood dive, the local DRUNK passed out at the", "bar, BARTENDER, watching BREAKING NEWS on the TV.", "Detective Wuertz, at a booth looks up at the TV, bored.", "The Bartender shuts the register.", "The Bartender steps out.  The back door OPENS again.", "He TRAILS off as someone sticks a gun in his face: Harvey", "Dent.  Standing in shadow.  He sits.", "Dent leans into the light.  The left side of his face is", "HIDEOUSLY BURNED, cheek gone, blackened teeth and gums.", "Dent picks up Wuertz's drink.  Takes a SIP.  Wuertz watches", "the bare muscles RETRACT as Dent SWALLOWS.", "Dent SLAMS the glass back on the table- Wuertz FLINCHES.", "Dent pulls his coin from his pocket.  FLIPS it.  Wuertz", "watches it SPIN.  It lands on the table.  Scarred side up.", "The drunk at the bar STIRS at the GUNSHOT.", "EXT. GOTHAM GENERAL -- DAY", "Gordon, manic, surveys the scene with a Cop-", "The cop says nothing.", "INT. FOX'S OFFICE WAYNE INDUSTRIES -- DAY", "Fox is watching the news.  His intercom buzzes.", "INT. CORRIDOR OUTSIDE RESEARCH AND DEVELOPMENT -- DAY", "Fox watches two security men force the door.  He enters", "alone.", "INT. LAB, RESEARCH AND DEVELOPMENT -- DAY", "Fox enters the dimly-lit room.  At one end is an", "extraordinary array of thousands of tiny monitors.  Fox", "approaches, fascinated, as they quietly display architectural", "patterns individually and in concert.  The images become a", "MAP.", "Fox nods, staring at the monitors as Batman approaches.", "Lucius presses a key.  The BABBLE of a MILLION CONVERSATIONS", "at once fills the room.  Every cell phone in the city.", "Lucius looks at Batman.  Hard.", "Batman points to a TV screen.  Fox turns.  ON SCREEN: the", "Joker shakes his head above a graphic \"LATEST THREAT\"...", "EXT. SITUATION TENT AT GOTHAM GENERAL -- CONTINUOUS", "Gordon watches a screen.  Grave.", "INT. BAR, DOWNTOWN -- CONTINUOUS", "The bar, packed with business people watches the TV.  SILENT.", "Bar patrons start moving... The Joker reaches for the camera-", "CUT TO STATIC. The bar patrons look around, confused.", "INT. LAB, RESEARCH AND DEVELOPMENT -- CONTINUOUS", "Fox turns from the TV to look at Batman.", "Fox stares at Batman.", "He plugs a USB dongle into the console.  A sample of the", "Joker's voice from the call-in news program plays.", "Lucius toggles a menu.  The city is an open book- People", "working, eating, sleeping.  Lucius shakes his head.", "Lucius sits at the console.  Batman moves off-", "Batman turns.  Fox looks at him, serious.", "EXT. VARIOUS LOCATIONS -- DUSK", "Gothamites POUR out of the city, on foot and by car...  the", "BRIDGES and TUNNELS are deserted, but for BOMB SQUAD search", "teams.", "INT. CITY HALL -- CONTINUOUS", "Gordon briefs the Mayor.", "EXT. FERRY TERMINAL -- DUSK", "At the ferry terminal, National Guardsman watch over the", "THIRTY THOUSAND jostling, scared people waiting to board the", "two MASSIVE FERRIES to Seven Sisters.  Grumbles turn to YELLS", "as 800 PRISONERS are loaded onto a ferry by shotgun-toting", "CORRECTIONS OFFICERS.", "EXT. BROWNSTONE -- DUSK", "Maroni climbs into the back of a limo.", "INT. LIMO -- DUSK", "Maroni settles back into his seat.  The car pulls away.", "Maroni STARTS.  Someone is in here with him.  Harvey Dent-", "Two Face- leans forward, clutching a pistol.", "Maroni looks at Dent.  Worried.", "Pulls out his coin.  Dent cocks the pistol...", "Dent FLIPS it.  Looks: good side.  He shrugs.", "Maroni looks confused.  Dent FLIPS the coin again.  Looks", "down at the coin.  Shakes his head.", "Dent smiles.  PUTS HIS SEAT BELT ON.", "Dent presses the barrel of the revolver behind the shadow of", "the driver.  Maroni LUNGES, SCREAMING.  Dent FIRES.", "EXT. BRIDGE -- DUSK", "The Limo SWERVES off of the bridge, SOARS out over the canal,", "and PANCAKES into the RETAINING WALL.", "EXT. FERRY TERMINAL -- DUSK", "CIVILIANS CRAM their way onto one ferry.  Finally, the", "COMMANDER of the National Guard unit SIGNALS to his men to", "STOP BOARDING and CAST OFF.", "The two FERRIES set off across the river, heading for the", "lights of the distant shore of the mainland.", "INT. BRIDGE, PRISONER FERRY -- NIGHT", "The FIRST MATE looks out the window, at the second ferry.  It", "is DEAD in the WATER.  He turns to the PILOT [PRISON FERRY].", "Suddenly, the control panel FLICKERS and DIES.", "INT. PASSENGER LOUNGE, PRISONER FERRY -- NIGHT", "The First Mate skirts around the PRISONERS and CORRECTIONS", "OFFICERS...", "INT. ACCESS CORRIDOR, PRISONER FERRY -- NIGHT", "The First Mate opens the door to the engine room.  STOPS.", "HUNDREDS OF BARRELS OF DIESEL FUEL.  And a small, wrapped", "PRESENT, topped with a BOW.", "INT. BRIDGE, PRISONER FERRY -- NIGHT", "The Pilot [Prison Ferry] is holding the small present.  His", "radio CRACKLES.", "EXT. ELEVATED ROADWAY, DOWTOWN GOTHAM -- CONTINUOUS", "Batman sits on the bat-pod, cape blowing.  Listening.", "INT. PASSENGER LOUNGE, COMMUTER FERRY -- NIGHT", "As cold scared Families watch, the NATIONAL GUARD COMMANDER", "UNWRAPS that ferry's present.  Inside, he finds a crude", "REMOTE DETONATOR.", "Up in the wiring at the ceiling, a CELL PHONE taped in to the", "P.A. rings and answers.", "ON BOTH FERRIES: CIVILIANS, PRISONERS, CREW, AND NATIONAL", "GUARDSMEN ALL LISTEN AS THE JOKER'S VOICE RINGS OUT.", "INT. LAB, WAYNE ENTERPRISES -- NIGHT", "Lucius Fox looks up as the console CHIMES.", "EXT. ROOFTOPS ABOVE GOTHAM -- NIGHT", "Batman looks out, across the entire city skyline.", "Batman FIRES UP the bat-pod- his cape SHRINKS into its pack", "form as he PEELS OUT, ROARING into the night.", "INT. GORDON HOME -- CONTINUOUS", "Barbara Gordon answers the phone.", "EXT. MCU -- CONTINUOUS", "Ramirez is holding the phone.", "Dent is holding a gun at Ramirez's head.  She hangs up.", "Ramirez nods.", "Dent FLIPS his coin.", "Dent looks at his coin.  Good side.", "Dent CRACKS her on the head with his gun.", "INT. BRIDGE, PRISONER FERRY -- NIGHT", "The Pilot [Prison Ferry] tries the radio.  It's DEAD.", "EXT. PENTHOUSE, PREWITT BUILDING -- NIGHT", "The Joker stares out over the harbor, at the ferries.", "Talking into a cell phone.  Holding a detonator, with TWO", "BUTTONS.", "INT. PASSENGER LOUNGE, PRISONER FERRY -- NIGHT", "The Prisoners and Corrections Officers listen.  Appalled.", "The Joker HANGS UP.  The Pilot [Prisoner Ferry] looks down at", "the remote in his hands.  Prisoners begin YELLING and", "PUSHING.  The WARDEN takes the remote from the Pilot- COCKS", "his shotgun.  His men level their weapons at the crowd.", "EXT. FERRY TERMINAL -- CONTINUOUS", "Gordon looks out at the ferries.  His phone rings.", "EXT. GOTHAM STREETS -- CONTINUOUS", "Batman ROARS along on the bat-pod.", "INT. PASSENGER LOUNGE, COMMUTER FERRY -- NIGHT", "The National Guard Commander is holding the remote.  Several", "passengers take a step towards him.  He PULLS his weapon.", "A BUSINESSMAN clutching his briefcase speaks up.", "Other passengers agree.  A MOTHER with two KIDS speaks up.", "INT. PASSENGER LOUNGE, PRISONER FERRY -- NIGHT", "As the Prisoners grow angrier, a CORRECTIONS OFFICER FIRES", "his shotgun into the air.  The Prisoners back off.  Slightly.", "INT. PASSENGER LOUNGE, COMMUTER FERRY -- NIGHT", "A GUARDSMAN on this boat passes around a hat.  People drop", "CHITS into it.  Passengers filling out chits eye each other.", "People on their phones say goodbye to loved ones.", "The Pilot [Passenger Ferry] looks out across the water to the", "other Ferry.  Looks up at the clock.  Ten to midnight...", "STARES down at his blank chit.", "EXT. ROOFTOP OVERLOOKING PREWITT BUILDING -- NIGHT", "Gordon and his SWAT team leaders set up SNIPER and SCOPE", "positions on the balustrade.", "INT. GARAGE, PREWITT BUILDING -- CONTINUOUS", "A SWAT stands beside the empty school bus.", "EXT. ROOFTOP OVERLOOKING PREWITT BUILDING -- CONTINUOUS", "Gordon looks at the SWAT LEADER.", "They look across at the large windows of the Prewitt", "Building.  The Joker's men, in crude, homemade CLOWN MASKS", "are clearly visible, automatic weapons in hand.", "They look through his scope.  Crouched deeper in the room,", "PATIENTS, DOCTORS, and NURSES, huddled.", "Batman gestures towards the view of the ferries.", "Batman turns.", "Gordon pulls his gun.  Batman turns back.  The SWATS watch.", "Batman LEAPS from the building, OPENS his cape- SOARS across", "the gulf between the two buildings- Gordon puts his weapon", "away.  Curses softly.  Turns to the SWAT leader.", "EXT. PREWITT BUILDING -- CONTINUOUS", "Batman LANDS against the glass two floors below-", "INT. LAB, RESEARCH AND DEVELOPMENT -- CONTINUOUS", "Fox hits some keys-", "EXT. PREWITT BUILDING -- CONTINUOUS", "SMOKED GLASS EYEPIECES slip down over Batman's eye holes.", "Batman's SONAR P.O.V.: the layers of the building dissolve,", "levels of TRANSPARENCY PULSING rhythmically... Batman can see", "the people inside the building...", "INT. PENTHOUSE, PREWITT BUILDING -- NIGHT", "The Joker is standing by the window, looking out at his", "handiwork.  The Chechen's DOGS start BARKING.  He SMILES.", "EXT. PENTHOUSE, PREWITT BUILDING -- CONTINUOUS", "Batman reaches into his utility belt, SPRAYS PLASTIC onto the", "glass- lets it harden- PUNCHES the window-which BREAKS", "QUIETLY as the pieces stick to the laminate- he slips inside-", "INT. PENTHOUSE, PREWITT BUILDING -- CONTINUOUS", "Batman's eyes glow white as he uses his sonar to look THROUGH", "the corner: AN ARMED CLOWN IS LEANING AGAINST THE CORNER...", "EXT. ROOFTOP, PREWITT BUILDING -- CONTINUOUS", "A six man SWAT team prepares to rappel from the roof.", "INT. STAIRWELL, PREWITT BUILDING -- CONTINUOUS", "A SWAT team moves up the stairs.", "EXT. ROOFTOP OVERLOOKING PREWITT BUILDING -- CONTINUOUS", "Gordon's phone rings.", "Gordon looks across at the Prewitt penthouse...", "Click.  Gordon looks at the SWAT leader.  Pale.", "Gordon moves to the door off the roof.", "INT. PENTHOUSE, PREWITT BUILDING -- CONTINUOUS", "Batman GRABS the Armed Clown, drops him, silently.  He goes", "to disarm him- THE WEAPON IS DUCT-TAPED TO THE CLOWN'S HANDS.", "Batman RIPS off the clown mask:", "STARING, FRIGHTENED EYES- MOUTH DUCT-TAPED SHUT... it's", "ENGEL.", "Batman looks up: Four more clowns line the windows, weapons", "duct-taped to their hands.  On SONAR: he looks into where the", "hostages are crouched... the \"PATIENTS\" and \"DOCTORS\" are", "carrying weapons- these are the Joker's men... Above them", "SWATS RAPPEL FROM THE ROOFTOP.", "teams prepping.", "Engel nods, terrified.", "EXT. ROOFTOP OVERLOOKING PREWITT BUILDING -- CONTINUOUS", "The SWATS line up the clowns in their sights...", "INT. STAIRWELL, PREWITT BUILDING -- CONTINUOUS", "The SWAT team arrives at the penthouse fire exit.  They", "spread CHARGES across the inner wall-", "EXT. ROOFTOP OVERLOOKING PREWITT BUILDING -- CONTINUOUS", "The SWAT Leader checks his watch.", "A SWAT Sniper zeroes in on a clown- the clown DISAPPEARS- the", "Sniper looks up, confused-", "INT. PENTHOUSE, PREWITT BUILDING -- CONTINUOUS", "Batman yanks the clown along the floor using his grapple gun-", "the clown takes down the two next to him- Batman leaps for", "the nearest two as SHOTS SHATTER the glass-", "EXT. PREWITT BUILDING -- CONTINUOUS", "The SWATS rappel down the building- SWING in through the", "broken windows-", "INT. PENTHOUSE, PREWITT BUILDING -- CONTINUOUS", "The \"hostages\" reel from the BLAST- The SWATS SWOOP in-", "aiming weapons at the clowns, throwing PERCUSSION GRENADES-", "Batman takes out the SWATS with fists and BATARANGS-", "The last SWAT aims at BATMAN- behind him a \"DOCTOR\" raises a", "shotgun... behind the \"Doctor\" Batman can see through the", "wall at SWATS preparing to breach... Batman VAULTS over the", "SWAT into a two-foot kick into the \"Doctor's\" chest-", "INT. STAIRWELL, PREWITT BUILDING -- CONTINUOUS", "The Swats BLAST OUT THE WALL- the team leader steps up to the", "hole... the BAT-GRAPPLE FIRES out-lodging in his kevlar", "vest... he is YANKED, SCREAMING, through the door.  The rest", "of his team look at each other.  Steel themselves.  Move in", "through the hole...", "INT. PENTHOUSE, PREWITT BUILDING -- CONTINUOUS", "As the SWATS race in they find Engel, terrified, next to a", "pile of unconscious \"hostages\", and their team leader, one", "end of an absailing rope tied around his waist.  Batman is on", "them, weaving KICKING, PUNCHING, and, with one hand, clipping", "carabinners looped to the absailing rope onto their webbing", "of vests.", "Batman steps back- picks up the team leader- SWAT weapons aim", "at him- he hurls the Team Leader out the window... the SWATS", "watch him go... the rope pays out... one by one they are", "YANKED out of the window...", "EXT. ROOFTOP OVERLOOKING PREWITT BUILDING -- CONTINUOUS", "A SNIPER watches through his scope as the six man SWAT team", "soars out of the window and drops.  The line snaps taut and", "they hang, like a mountaineering team in crisis.  Batman,", "crouched in the broken window, secures the line.", "Batman looks right at the sniper-  Raises his grapple gun-", "BAM.  The bat grapple smashes into the Sniper's scope- the", "rifle is YANKED out of his hands.", "INT. PREWITT BUILDING -- CONTINUOUS", "Batman races past a dazed Engel...", "...into the main office.  The Joker is there.", "The Dogs LEAP at Batman- SMASH him to the ground...", "INT. PASSENGER LOUNGE, COMMUTER FERRY -- NIGHT", "The Pilot [Passenger Ferry] finishes counting the votes.", "Reads the verdict.", "The passengers avoid eye contact with each other.", "INT. PASSENGER LOUNGE, PRISONER FERRY -- NIGHT", "The Corrections Officers are in a phalanx in the corner,", "facing off against hundreds of menacing Prisoners.", "The Warden and his men look at each other.  At the clock.", "INT. PENTHOUSE, PREWITT BUILDING -- NIGHT", "Batman WRESTLES with the Rotweilers- a blinding mass of", "Batman, black fur and bared teeth-", "The Joker POPS a switchblade.  Moves in to the mass- Batman", "KICKS OFF the last of the dogs- the Joker JABS his knife into", "Batman's RIBS-", "Batman recoils in pain.  The Joker BUTTS him- KNEES him-", "ENERGY explodes from his lean frame- he KICKS the injured", "Batman back towards the glass...", "INT. PASSENGER LOUNGE, COMMUTER FERRY -- NIGHT", "The Pilot [Passenger Ferry] looks at the remote in his hands.", "Someone calls out from the back.", "He sets the remote down on a bench in the front of the", "lounge.  The other passengers and guardsmen stare at it...", "INT. PASSENGER LOUNGE, PRISONER FERRY -- NIGHT", "A HUGE, TATTOOED PRISONER pushes his way to the front.  He", "walks towards the Warden, who is sweating, looking at the", "remote.", "The Warden looks at the remote.  At the clock.", "INT. PASSENGER LOUNGE, COMMUTER FERRY -- NIGHT", "Everyone stares at the remote.  One minute left.  The", "Businessman stands.  Walks over and picks it up.", "He looks at the other passengers.  No one makes eye contact.", "INT. PASSENGER LOUNGE, PRISONER FERRY -- NIGHT", "The Warden slowly hands him the REMOTE.  The Prisoner looks", "at it.  He looks the Warden in the eye...", "Then TOSSES the remote out the window.", "Warden, prisoners and officers are stunned.", "EXT. PENTHOUSE, PREWITT BUILDING -- NIGHT", "Batman FLIES backwards THROUGH THE WINDOW- glass flying- the", "Joker KICKS out a wooden brace holding up the STEEL FRAME-", "Batman's arms fly up as it comes crashing down onto his neck-", "saved by his protective gauntlets.  Batman GRUNTS as the", "Joker STEPS onto the steel beam...", "Batman STRUGGLES to keep the beam from CRUSHING his neck...", "INT. PASSENGER LOUNGE, COMMUTER FERRY -- NIGHT", "The Businessman stares at the remote in his hands.  Finally,", "he puts it down.  Sits down.  Waits to die.", "The clock strikes MIDNIGHT.", "EXT. PENTHOUSE, PREWITT BUILDING -- NIGHT", "Batman indicates the clock...  twelve o'clock.", "The Joker looks at the clock...", "INT. BOTH FERRIES -- CONTINUOUS", "The Passengers brace.  Look at the clock.  Confused...", "INT. PREWITT BUILDING -- CONTINUOUS", "The smile disappears from the Joker's face.", "The Joker CROUCHES down, hovering above Batman's face and", "arms.  Shows him the remote.", "The Joker ARMS the remote...", "Batman looks up at him.", "Batman's SCALLOP BLADES FIRE OUT OF HIS GAUNTLET, nailing the", "Joker in the chest and arm- he STAGGERS back- Batman, freed,", "leaps forward- KICKS HIM OVER THE EDGE- GRABS the remote-", "The Joker GIGGLES as he FALLS, enjoying the ride.  Something", "SLAMS into his leg, and he JERKS to a stop- BATMAN'S GRAPPLE.", "The Joker HOLLERS in pain as Batman HAULS him up.", "Batman secures the Joker UPSIDE DOWN.  The Joker is LAUGHING.", "The Joker looks up at him.  A twinkle in his eye.", "Batman hauls the Joker up, nose to nose.", "Joker laughs.  Batman leaves him to the SWATS.", "EXT. BURNT WAREHOUSE, 52ND STREET -- NIGHT", "Gordon gets out of his car, gun drawn.  Makes his way into", "the blackened wreck of a building...", "INT. BURNT WAREHOUSE, 52ND STREET -- NIGHT", "Gordon peers into the darkness.", "No reply.  Gordon makes his way deeper.  Up the stairs.", "INT. SECOND FLOOR, BURNT WAREHOUSE -- NIGHT", "Gordon spots Barbara and their two children huddled together.", "He moves towards them- Barbara is shaking her head-", "WHAM!  Dent cracks Gordon over the head with his gun.  Dent", "disarms Gordon, rolls him over.  He turns to look at the", "ENORMOUS hole in the floor.  From this side, in the", "moonlight, Dent looks completely normal.", "Dent TURNS, revealing his dark side.", "Dent MOVES towards Gordon.", "Dent turns- steps over to Barbara- puts the gun to her temple-", "Dent moves the gun to point at Gordon's little girl.", "Dent moves to James Gordon.  Brushes the hair out of the", "boy's eyes with the muzzle.  Gordon SNAPS.", "Dent pulls the boy away from his mother.", "Dent walks James past Gordon to the edge of the burnt floor.", "He touches the raw wood at the edge of the floor.", "SIRENS.", "EXT. BURNT WAREHOUSE, 52ND STREET -- CONTINUOUS", "Cop cars descend on the warehouse.", "INT. SECOND FLOOR, BURNT WAREHOUSE -- CONTINUOUS", "Dent looks at Gordon, FURIOUS.", "Dent indicates his face.  His suffering.", "Dent chuckles.  A macabre sight.", "Dent squeezes the gun a little tighter against the little", "boy's neck.  The boy WHIMPERS.", "Dent turns.  Batman steps from the shadows.", "Batman steps closer, desperate, trying to reach Dent.", "Dent looks at Batman.  Pleading.", "Batman looks into Dent's eyes.  Emotional.", "Dent is listening, the wheels in his deranged mind turning.", "Dent eases his grip on the boy.", "He points the gun at Batman.  FLIPS the coin.  TAILS.  He", "SHOOTS.  Batman COLLAPSES to the ground, clutching his gut.", "He points the gun at his own head.  FLIPS the coin.  HEADS.", "He looks a little disappointed.", "Finally, he points the gun back at Gordon's son.", "Gordon looks up.  Pained.  Locks eyes with his son.", "Dent FLIPS the coin.  High.  Dent's eyes FOLLOW the coin up-", "Batman HURLS himself at Dent and the boy.", "All three of them VANISH over the edge.  A TERRIBLE CRASH-", "then silence, but for the sound of DENT'S COIN, SPINNING on", "the floor at the edge of the hole.", "Gordon, horrified, RUNS to the edge- peers down-", "Dent lies at the bottom of the hole, his neck broken.  DEAD.", "The coin stops spinning, GOOD SIDE UP.", "Gordon's son swings into view, HANGING from Batman, who is", "holding onto a JOIST with all his strength...", "Gordon reaches down to GRAB his son- HAULS him up...", "Batman FALLS..., dropping and dropping, SMASHING THROUGH", "protruding WOOD and PIPES... He lands HARD near Dent.", "EXT. BURNT WAREHOUSE, 52ND STREET -- CONTINUOUS", "The cops prepare to STORM the front door.", "INT. BURNT WAREHOUSE, 52ND STREET -- CONTINUOUS", "Gordon races down the stairs.  Rushes over to Batman.", "Gordon crouches at Batman's side.  The Batman GRASPS Gordon's", "arm.  STAGGERS to his feet.", "Gordon and Batman stare down at Dent's body.  Grave.", "Gordon stares down at SCARRED SIDE of Harvey Dent.", "Batman crouches to Dent's body.", "Gently, he turns Dent's head so the good side of his face is", "up.  Gordon looks from Dent's face to Batman.  Understanding.", "Batman stands.  Faces Gordon.", "Batman hands Gordon his police radio.", "INSERT CUT: GORDON STANDS AT A PODIUM AT DENT'S FUNERAL.", "BEHIND HIM IS A LARGE PHOTOGRAPH OF DENT SMILING.", "INSERT CUT: GORDON, ON THE ROOF OF GOTHAM CENTRAL, AXE IN", "HAND, WATCHED BY AN ASSORTMENT OF COPS AND REPORTERS...", "GORDON TAKES THE AXE TO THE BAT SYMBOL- SPARKING, SMASHING...", "INSERT CUT: ALFRED HOLDS THE LETTER FROM RACHEL.  THINKING.", "INSERT CUT: ALFRED BURNS THE ENVELOPE FROM RACHEL.", "INSERT CUT: LUCIUS FOX TYPES HIS NAME INTO THE SONAR MACHINE.", "INSERT CUT: FOX HITS THE \"X\".  THE MACHINE FLASHES RED \"SELF-", "DESTRUCT WARNINGS\".  THEN DIES.  FOX SMILES TO HIMSELF.", "Batman hurries off.  LIMPING into the shadows.", "James RUNS down the stairs to join father-", "Gordon stares after Batman.", "EXT. WAREHOUSE -- CONTINUOUS", "As Cops race into the buildings the DOGS get the scent and", "pull away from the doorway, following the SHADOW into the", "stacks of shipping containers...", "INT. WAREHOUSE -- CONTINUOUS", "James looks at his father, confused.", "Gordon stares after the Batman.  The sound of the dogs", "becoming louder and more ferocious.", "EXT. DOCKSIDE ROOFTOPS -- CONTINUOUS", "The Batman LURCHES between shipping containers.  STUMBLING.", "BLEEDING.  He makes it to the bat-pod...", "The bat-pod streaks through Gotham's underground streets, the", "Batman's cape fluttering behind.  A wraith...", "The Batman races up a ramp into a blinding light-", "CUT TO BLACK.", "CREDITS.", "END."]}