{"scenarios": ["INT -- CABIN -- NIGHT (1946)", "A dark, empty room.", "The door bursts open. A MAN and WOMAN enter, drunk and", "giggling, horny as hell. No sooner is the door shut than", "they're all over each other, ripping at clothes, pawing at", "flesh, mouths locked together.", "He gropes for a lamp, tries to turn it on, knocks it over", "instead. Hell with it. He's got more urgent things to do,", "like getting her blouse open and his hands on her breasts.", "She arches, moaning, fumbling with his fly. He slams her", "against the wall, ripping her skirt. We hear fabric tear.", "He enters her right then and there, roughly, up against the", "wall. She cries out, hitting her head against the wall but", "not caring, grinding against him, clawing his back,", "shivering with the sensations running through her. He", "carries her across the room with her legs wrapped around", "him. They fall onto the bed.", "CAMERA PULLS BACK, exiting through the window, traveling", "smoothly outside...", "EXT -- CABIN -- NIGHT (1946)", "...to reveal the bungalow, remote in a wooded area, the", "lovers' cries spilling into the night", "...and we drift down a wooded path, the sounds of rutting", "passion growing fainter, mingling now with the night sounds", "of crickets and hoot owls", "...and we begin to hear FAINT MUSIC in the woods, tinny and", "incongruous, and still we keep PULLING BACK until", "...a car is revealed. A 1946 Plymouth. Parked in a clearing.", "INT -- PLYMOUTH -- NIGHT (1946)", "ANDY DUFRESNE, mid-20's, wire rim glasses, three-piece suit.", "Under normal circumstances a respectable, solid citizen;", "hardly dangerous, perhaps even meek. But these circumstances", "are far from normal. He is disheveled, unshaven, and very", "drunk. A cigarette smolders in his mouth. His eyes, flinty", "and hard, are riveted to the bungalow up the path.", "He can hear them fucking from here.", "He raises a bottle of bourbon and knocks it back. The radio", "plays softly, painfully romantic, taunting him:", "You stepped out of a dream... You are too wonderful... To be", "what you seem...", "He opens the glove compartment, pulls out an object wrapped", "in a rag. He lays it in his lap and unwraps it carefully --", "-- revealing a .38 revolver. Oily, black, evil.", "He grabs a box of bullets. Spills them everywhere, all over", "the seats and floor. Clumsy. He picks bullets off his lap,", "loading them into the gun, one by one, methodical and grim.", "Six in the chamber. His gaze goes back to the bungalow.", "He shuts off the radio. Abrupt silence, except for the", "distant lovers' moans. He takes another shot of bourbon", "courage, then opens the door and steps from the car.", "EXT -- PLYMOUTH -- NIGHT (1946)", "His wingtip shoes crunch on gravel. Loose bullets scatter to", "the ground. The bourbon bottle drops and shatters.", "He starts up the path, unsteady on his feet. The closer he", "gets, the louder the lovemaking becomes. Louder and more", "frenzied. The lovers are reaching a climax, their sounds of", "passion degenerating into rhythmic gasps and grunts.", "Andy lurches to a stop, listening. The woman cries out in", "orgasm. The sound slams into Andy's brain like an icepick.", "He shuts his eyes tightly, wishing the sound would stop.", "It finally does, dying away like a siren until all that's", "left is the shallow gasping and panting of post-coitus. We", "hear languorous laughter, moans of satisfaction.", "Andy just stands and listens, devastated. He doesn't look", "like much of a killer now; he's just a sad little man on a", "dirt path in the woods, tears streaming down his face, a", "loaded gun held loosely at his side. A pathetic figure,", "really.", "INT -- COURTROOM -- DAY (1946)", "THE JURY listens like a gallery of mannequins on display,", "pale-faced and stupefied.", "INT -- COURTROOM -- DAY (1946)", "The D.A. holds the jury spellbound with his closing", "summation:", "He gestures to Andy sitting quietly with his ATTORNEY.", "He picks up a revolver, spins the cylinder before their eyes", "like a carnival barker spinning a wheel of fortune.", "FADE TO BLACK: 6TH TITLE UP", "INT -- JURY ROOM -- DAY (1946)", "CAMERA TRACKS down a long table, moving from one JUROR to", "the next. These decent, God-fearing Christians are chowing", "down on a nice fried chicken dinner provided them by the", "county, smacking greasy lips and gnawing cobbettes of corn.", "We find the FOREMAN at the head of the table, sorting votes.", "FADE TO BLACK: 7TH TITLE UP", "INT -- COURTROOM -- DAY (1946)", "Andy stands before the dias. THE JUDGE peers down, framed by", "a carved frieze of blind Lady Justice on the wall.", "He raps his gavel as we", "CRASH TO BLACK: LAST TITLE UP.", "AN IRON-BARRED DOOR", "slides open with an enormous CLANG. A stark room waits", "beyond. CAMERA PUSHES through. SEVEN HUMORLESS MEN sit side", "by side at a long table. An empty chair faces them. We are", "now in:", "INT -- SHAWSHANK HEARINGS ROOM -- DAY (1947)", "RED enters, removes his cap and waits by the chair.", "Red sits, tries not to slouch. The chair is uncomfortable.", "The men just stare at him. One stifles a yawn.", "CLOSEUP -- PAROLE FORM", "A big rubber stamp slams down: \"REJECTED\" in red ink.", "EXT -- EXERCISE YARD -- SHAWSHANK PRISON -- DUSK (1947)", "High stone walls topped with snaky concertina wire, set off", "at intervals by looming guard towers. Over a hundred CONS", "are in the yard. Playing catch, shooting craps, jawing at", "each other, making deals. Exercise period.", "RED emerges into fading daylight, slouches low-key through", "the activity, worn cap on his head, exchanging hellos and", "doing minor business. He's an important man here.", "He slips somebody a pack of smokes, smooth sleight-of-hand.", "TWO SHORT SIREN BLASTS issue from the main tower, drawing", "everybody's attention to the loading dock. The outer gate", "swings open...revealing a gray prison bus outside.", "Red is joined by HEYWOOD, SKEET, FLOYD, JIGGER, ERNIE,", "SNOOZE. Most cons crowd to the fence to gawk and jeer, but", "Red and his group mount the bleachers and settle in", "comfortably.", "INT -- PRISON BUS -- DUSK (1947)", "Andy sits in back, wearing steel collar and chains.", "The bus lurches forward, RUMBLES through the gates. Andy", "gazes around, swallowed by prison walls.", "GUARDS approach the bus with carbines. The door jerks open.", "The new fish disembark, chained together single-file,", "blinking sourly at their surroundings. Andy stumbles against", "the MAN in front of him, almost drags him down.", "BYRON HADLEY, captain of the guard, slams his baton into", "Andy's back. Andy goes to his knees, gasping in pain. JEERS", "and SHOUTS from the spectators.", "ON THE BLEACHERS", "Other hands go up. Red jots the names.", "More hands go up. Andy and the others are paraded along,", "forced by their chains to take tiny baby steps, flinching", "under the barrage of jeers and shouts. The old-timers are", "shaking the fence, trying to make the newcomers shit their", "pants. Some of the new fish shout back, but mostly they look", "terrified. Especially Andy.", "Red pockets his notepad. A VOICE comes over the P.A.", "speakers:", "INT -- ADMITTING AREA -- DUSK (1947)", "The new fish are marched in. Guards unlock the shackles. The", "chains drop away, rattling to the stone floor.", "WARDEN SAMUEL NORTON strolls forth, a colorless man in a", "gray suit and a church pin in his lapel. He looks like he", "could piss ice water. He appraises the newcomers with flinty", "eyes.", "Cued by Norton's glance, Hadley steps up to the con and", "screams right in his face:", "Hadley rams the tip of his club into the con's belly. The", "man falls to his knees, gasping and clutching himself.", "Hadley takes his place at Norton's side again. Softly:", "The men shed their clothes. Within seconds, all stand naked.", "Hadley shoves the FIRST CON into a steel cage open at the", "front. TWO GUARDS open up with a fire hose. The con is", "slammed against the back of the cage, sputtering and", "hollering. Seconds later, the water is cut and the con", "yanked out.", "The con gets a huge scoop of white delousing powder thrown", "all over him. Gasping and coughing, blinking powder from his", "eyes, he gets shoved to a trustee's cage. The TRUSTEE slides", "a short stack of items through the slot -- prison clothes", "and a Bible. All the men are processed quickly -- a blast of", "water, powder, clothes and a Bible...", "INT -- INFIRMARY -- NIGHT (1947)", "A naked CON steps before a DOCTOR and gets a cursory exam. A", "penlight is shined in his eyes, ears, nose, and throat.", "The con does. A GUARD with a penlight in his teeth spreads", "his cheeks, peers up his ass, and nods. Andy is next up. He", "gets the same treatment.", "INT -- PRISON CHAPEL -- NIGHT (1947)", "CAMERA TRACKS the naked newcomers shivering on hard wooden", "chairs, clothes on their laps, Bibles open.", "INT -- CELLBLOCK FIVE -- NIGHT (1947)", "Three tiers to a side, concrete and steel, gray and", "imposing. Andy and the others are marched in, still naked,", "carrying their clothes and Bibles.", "The CONS in their cells greet them with TAUNTS, JEERS, and", "LAUGHTER. One by one, the new men are shown to their cells", "and locked in with a CLANG OF STEEL.", "Red watches from his cell, arms slung over the crossbars,", "cigarette dangling from his fingers.", "Red listens to the CLANGING below. He watches Andy and a few", "others being brought up to the 2nd tier.", "Andy is led past and given a cell at the end of the tier.", "INT -- ANDY'S CELL -- NIGHT (1947)", "The bars slam home. Andy is alone in his cell, clutching his", "clothes. He gazes around at his new surroundings, taking it", "in. He slowly begins to dress himself...", "EXT -- SHAWSHANK PRISON -- NIGHT (1947)", "A malignant stone growth on the Maine landscape. The moon", "hangs low and baleful in a dead sky. The headlight of a", "PASSING TRAIN cuts through the night.", "INT -- RED'S CELL -- NIGHT (1947)", "Red lies on his bunk below us, tossing his baseball toward", "the ceiling and catching it again. He pauses, listening.", "FOOTSTEPS approach below, unhurried, echoing hollowly on", "stone.", "INT -- CELLBLOCK FIVE -- NIGHT (1947)", "LOW ANGLE. A CELLBLOCK GUARD strolls into frame.", "The lights bump off in sequence. The guard exits, footsteps", "echoing away. Darkness now. Silence. CAMERA CRANES UP the", "tiers toward Red's cell.", "Red looms from the darkness, leans on the bars. Listens.", "Waits. From somewhere below comes faint, ghastly tittering.", "VOICES drift through the cellblock, taunting:", "The VOICES keep on, sly and creepy in the dark...", "INT -- VARIOUS CELLS -- NIGHT (1947)", "thru thru 25 ...while the new cons go quietly crazy in their", "cells. One man paces like a caged animal...another sits", "gnawing his cuticles bloody...a third is weeping", "silently...a fourth is dry-heaving into the toilet...", "INT -- RED'S CELL -- NIGHT (1947)", "Red waits at the bars. Smoking. Listening. He cranes his", "head, peers down toward Andy's cell. Nothing. Not a peep.", "INT -- FAT-ASS' CELL -- NIGHT (1947)", "Fat-Ass is crying, trying not to hyperventilate.", "And that's it. Fat-Ass lets out a LOUD WAIL of despair:", "INT -- HEYWOOD'S CELL -- NIGHT (1947)", "INT -- CELLBLOCK -- NIGHT (1947)", "The place goes nuts. Fat-Ass throws himself screaming", "against the bars. The entire block starts CHANTING:", "The lights bump on. GUARDS pour in, led by Hadley himself.", "Hadley arrives at Fat-Ass' cell, bellowing through the bars:", "Fat-Ass keeps blubbering and wailing. Total freak-out.", "Hadley draws his baton, gestures to his men. Open it.", "A GUARD unlocks the cell. Hadley pulls Fat-Ass out and", "starts beating him with the baton, brutally raining blows.", "Fat-Ass falls, tries to crawl.", "The place goes dead silent. All we hear now is the dull", "THWACK-THWACK-THWACK of the baton. Fat-ass passes out.", "Hadley gets in a few more licks and finally stops.", "The guards wrestle Fat-Ass onto a stretcher and carry him", "off. FOOTSTEPS echo away. Lights off. Darkness again.", "Silence.", "INT -- RED'S CELL -- NIGHT (1947)", "Red stares through the bars at the main floor below, eyes", "riveted to the small puddle of blood where Fat-Ass went", "down.", "INT -- CELLBLOCK FIVE -- MORNING (1947)", "LOUD BUZZER. The master locks are thrown -- KA-THUMP! The", "cons step from their cells, lining the tiers. The GUARDS", "holler their head-counts to the HEAD BULL, who jots on a", "clipboard. Red peers at Andy, checking him out. Andy stands", "in line, collar buttoned, hair combed.", "INT -- MESS HALL -- MORNING (1947)", "Andy goes through the breakfast line, gets a scoop of glop", "on his tray. WE PAN ANDY through the noise and", "confusion...and discover BOGS DIAMOND and ROOSTER MacBRIDE", "watching Andy go by. Bogs sizes Andy up with a salacious", "gleam in his eye, mutters something to Rooster. Rooster", "laughs.", "Andy finds a table occupied by Red and his regulars, chooses", "a spot at the end where nobody is sitting. Ignoring their", "stares, he picks up his spoon -- and pauses, seeing", "something in his food. He carefully fishes it out with his", "fingers.", "It's a squirming maggot. Andy grimaces, unsure what to do", "with it. BROOKS HATLEN is sitting closest to Andy. At age", "65, he's a senior citizen, a long-standing resident.", "Andy passes the maggot to Brooks. Brooks examines it,", "rolling it between his fingertips like a man checking out a", "fine cigar. Andy is riveted with apprehension.", "Andy can't bear to watch. Brooks opens up his sweater and", "feeds the maggot to a baby crow nestled in an inside pocket.", "Andy breathes a sigh of relief.", "Andy nods, proceeds to eat. Carefully. Heywood approaches.", "Heywood plops his tray down, sits. The men start pulling out", "cigarettes and handing them down.", "An impressive pile forms. Heywood bends down and inhales", "deeply, smelling the aroma. Rapture.", "He shakes his head, turns back to his food. The silence", "mounts. Heywood glances around. Men resume eating. Softly:", "INT -- PRISON LAUNDRY -- DAY (1947)", "A DEAFENING NOISE of industrial washers and presses. Andy", "works the laundry line. A nightmarish job. He's new at it.", "BOB, the con foreman, elbows him aside and shows him how", "it's done.", "INT -- SHOWERS -- DAY (1947)", "Shower heads mounted in bare concrete. Andy showers with a", "dozen or more men. No modesty here. At least the water is", "good and hot, soothing his tortured muscles.", "Bogs looms from the billowing steam, smiling, checking Andy", "up and down. Rooster and PETE appear from the sides. The", "Sisters.", "Andy tries to step past them. He gets shoved around, nothing", "serious, just some slap and tickle. Jackals sizing up prey.", "Andy breaks free, flushed and shaking. He hurries off,", "leaving the three Sisters laughing.", "INT -- ANDY'S CELL -- NIGHT (1947)", "Andy lies staring at the darkness, unable to sleep.", "EXT -- EXERCISE YARD -- DAY (1947)", "Exercise period. Red plays catch with Heywood and Jigger,", "lazily tossing a baseball around. Red notices Andy off to", "the side. Nods hello. Andy takes this as a cue to amble", "over. Heywood and Jigger pause, watching.", "Red glances at the hand, ignores it. The game continues.", "Red gives Andy a look. See?", "Heywood nudges Jigger. Watch this. He winds up and throws", "the ball hard -- right at Andy's head.", "Andy sees it coming out of the corner of his eye, whirls and", "catches it. Beat. He sends the ball right back, zinging it", "into Heywood's hands. Heywood drops the ball and grimaces,", "wringing his stung hands.", "Andy squats, motions Red to join him. Andy grabs a handful", "of dirt and sifts it through his hands. He finds a pebble", "and rubs it clean. It has a nice milky glow. He tosses it to", "Red.", "Red flicks his gaze past Andy. Bogs is watching them.", "They shake. Andy strolls off. Red watches him go.", "INT -- MESS HALL -- DAY (1947)", "Red gets his breakfast and heads for a table. Andy falls in", "step, slips him a tightly-folded square of paper.", "INT -- RED'S CELL -- NIGHT (1947)", "Lying on his bunk, Red unfolds the square. A ten dollar", "bill.", "EXT -- LOADING DOCK -- DAY (1947)", "Under watchful supervision, CONS are off-loading bags of", "dirty laundry from an \"Eliot Nursing Home\" truck.", "A certain bag hits the ground. The TRUCK DRIVER shoots a", "look at a black con, LEONARD, then ambles over to a GUARD to", "shoot the shit. Leonard loads the bag onto a cart...", "INT -- PRISON LAUNDRY -- DAY (1947)", "Bags are being unloaded. We find Leonard working the line.", "Leonard slips a small paper-wrapped package out of the", "laundry bag, hides it under his apron, and keeps sorting...", "INT -- PRISON LAUNDRY EXCHANGE -- DAY (1947)", "Red deposits his dirty bundle and moves down the line to", "where the clean sheets are being handed out.", "Leonard catches Red's eye, turns and grabs a specific stack", "of clean sheets. He hands it across to Red --", "TIGHT ANGLE", "-- and more than clean laundry changes hands. Two packs of", "cigarettes slide out of Red's hand into Leonard's.", "INT -- RED'S CELL -- DAY (1947)", "Red slips the package out of his sheets, carefully checks to", "make sure nobody's coming, then rips it open. He pulls out", "the rock-hammer. It's just as Andy described. Red laughs", "softly.", "INT -- CELLBLOCK FIVE -- 2ND TIER -- NIGHT (1947)", "Brooks Hatlen pushes a cart of books from cell to cell. The", "rolling library. He finds Red waiting for him. Red slips the", "rock-hammer, wrapped in a towel, through the bars and onto", "the cart. Next comes six cigarettes to pay for postage.", "Brooks nods, never missing a beat. He rolls his cart to", "Andy's cell, mutters through the bars:", "Andy's hand snakes through the bars and makes the object", "disappear. The hand comes back and deposits a small slip of", "folded paper along with more cigarettes.", "Brooks turns his cart around and goes back. He pauses,", "sorting his books long enough for Red to snag the slip of", "paper. Brooks continues on, scooping the cigarettes off the", "cart and into his pocket.", "INT -- RED'S CELL -- NIGHT (1947)", "Red unfolds the slip of paper. Penciled neatly on it is a", "single word: \"Thanks.\"", "INT -- PRISON LAUNDRY -- DAY (1947)", "We are assaulted by the deafening noise of the laundry line.", "Andy is doing his job, getting good at it.", "Andy nods. He leaves the line, weaving his way through the", "laundry room and into --", "INT -- BACK ROOMS/STOCK AREA -- DAY (1947)", "-- a dark, tangled maze of rooms and corridors, boilers and", "furnaces, sump pumps, old washing machines, pallets of", "cleaning supplies and detergents, you name it. Andy hefts a", "cardboard drum of Hexlite off the stack, turns around --", "-- and finds Bogs Diamond in the aisle. blocking his way.", "Rooster looms from the shadows to his right, Pete Verness on", "the left. A frozen beat. Andy slams the Hexlite to the", "floor, rips off the top, and scoops out a double handful.", "Andy backs up, holding them at bay, trying to maneuver", "through the maze. The Sisters keep coming, tense and", "guarded, eyes riveted and gauging his every move, trying to", "outflank him. Andy trips on some old gaint sugglies. That's", "all it takes. They're on him in an instant, kicking and", "stomping.", "Andy gets yanked to his feet. Bogs applies a chokehold from", "behind. They propel him across the room and slam him against", "an old four-pocket machine, bending him over it. Rooster", "jams a rag into Andy's mouth and secures it with a steel", "pipe, like a horse bit.", "Andy kicks and struggles, but Rooster and Pete have his arms", "firmly pinned. Bogs whispers in Andy's ear:", "Andy starts screaming, muffled by the rag. CAMERA PULLS", "BACK, SLOWLY WIDENING. The big Washex blocks our view. All", "we see is Andy's screaming face and the men holding him", "down", "...and CAMERA DRIFTS FROM THE ROOM, leaving the dark place", "and the dingy act behind...MOVING up empty corridors, past", "concrete walls and steel pipes...", "WE EMERGE into the prison laundry past a guard, WIDENING for", "a final view of the line. The giant steel \"mangler\" is", "slapping down in brutal rhythm. The sound is deafening.", "PRISON MONTAGE: (1947 THROUGH 1949)", "ANDY PLODS THROUGH HIS DAYS. WORKING. EATING. CHIPPING AND", "shaping his rocks after lights-out...", "ANDY WALKS THE YARD, FACE SWOLLEN AND BRUISED.", "ANDY EATS BREAKFAST. A FEW TABLES OVER, BOGS BLOWS HIM A", "KISS", "ANDY BACKS INTO A CORNER IN SOME DINGY PART OF THE PRISON,", "wildly swinging a rake at his tormentors.", "The rake connects, snapping off over somebody's skull. They", "beat the hell out of him.", "INT -- SOLITARY CONFINEMENT (\"THE HOLE\") -- NIGHT (1949)", "A stone closet. No bed, sink, or lights. Just a toilet with", "no seat. Andy sits on bare concrete, bruised face lit by a", "faint ray of light falling through the tiny slit in the", "steel door.", "INT -- PRISON LAUNDRY -- DAY (1949)", "Andy is working the line.", "EXT -- PRISON YARD -- DAY (1949)", "Warden Norton addresses the assembled cons via bullhorn:", "Red glances around at his friends. Andy also catches his", "eye.", "EXT -- PRISON YARD -- DAY (1949)", "Cons shuffle past, dropping slips of paper into a bucket.", "Red saunters to a guard named TIM YOUNGBLOOD, mutters", "discreetly in his ear.", "EXT -- PRISON YARD -- DAY (1949)", "Youngblood is pulling names and reading them off. Red", "exchanges grins with Andy and the others.", "INT -- PRISON CORRIDOR -- NIGHT (1949)", "Red slips Youngblood six packs of cigarettes.", "EXT -- LICENSE PLATE FACTORY -- DAY (1949)", "A tar-cooker bubbles and smokes. TWO CONS dip up a bucket of", "tar and tie a rope to the handle. The rope goes taught.", "CAMERA FOLLOWS the bucket of tar up the side of the building", "to --", "THE ROOF", "-- where it is relayed to the work detail. the men are", "dipping big Padd brushes and spreading the tar. ANGLZ OVER", "to Byron Hadley bitching sourly to his fellow guards:", "The prisoners keep spreading tar, eyes on their work.", "Red glances over -- and is shocked to see Andy standing up,", "listening to the guards talk.", "Andy tosses his Padd in the bucket and strolls toward", "Hadley.", "The guards stiffen at Andy's approach. Youngblood's hand", "goes to his holster. The tower guards CLICK-CLACK their", "rifle bolts. Hadley turns, stupefied to find Andy there.", "Hadley grabs Andy's collar and propels him violently toward", "the edge of the roof. The cons furiously keep spreading tar.", "Hadley abruptly jerks Andy to a stop right at the edge. In", "fact, Andy's past the edge, beyond his balance, shoetips", "scraping the roof. The only thing between him and an ugly", "drop to the concrete is Hadley's grip on the front of his", "shirt.", "The cons are pausing work, stunned by this business", "discussion.", "Hadley freezes him with a look. Andy presses on:", "The convicts stand gaping, all pretense of work gone. They", "look like they've been pole-axed. Hadley shoots them a look.", "EXT -- LICENSE PLATE FACTORY -- DAY (1949)", "As before, an object is hauled up the side of the building", "by rope -- only this time, it's a cooler of beer and ice.", "EXT -- ROOF -- SHORTLY LATER (1949)", "The cons are taking the sun and drinking beer.", "Red knocks back another sip, enjoying the bitter cold on his", "tongue and the warm sun on face.", "roof of one of our own houses. We were the Lords of all", "Creation.", "He glances over to Andy squatting apart from the others.", "Heywood drifts back to others, giving them a look.", "EXT -- PRISON YARD -- THE BLEACHERS -- DAY (1949)", "Andy and Red play checkers. Red makes his move.", "Red takes this as a gentle rebuff, keeps playing.", "INT -- ANDY'S CELL -- NIGHT (1949)", "Andy lies in his bunk after lights out, polishing a fragment", "of quartz by the light of the moon. He pauses, glancing at", "all the names scratched in the wall. He rises, makes sure", "the coast is clear, and starts scratching his name into the", "cement with his rock-hammer, adding to the record.", "RAY MILLAND", "fills the screen in glorious (and scratchy) black & white,", "suffering a bad case of DT's...", "INT -- PRISON AUDITORIUM -- NIGHT (1949)", "...while a CONVICT AUDIENCE hoots and catcalls, talking back", "to the screen. We find Red slouched in a folding chair,", "watching the movie. Andy enters, backlit by the flickering", "glare of the projector, and takes a seat next to him.", "Ray Milland starts SCREAMING. The entire audience SCREAMS", "with him, high-pitched and hysterical. Andy fidgets.", "Andy nods, embarrassed. He gets up and hurries out. Red", "grins, turns back to the movie.", "INT -- AUDITORIUM CORRIDOR -- NIGHT (1949)", "Andy exits the theater and freezes in his tracks. Two dark", "figures loom in the corridor, blocking his path. Rooster and", "Pete. Andy turns back -- and runs right into Bogs. Instant", "bear hug. The Sisters are on him like a flash. They kick a", "door open and drag him into --", "THE PROJECTION BOOTH", "-- where they confront the startled PROJECTIONIST, an old", "con blinking at them through thick bifocals.", "Terrified, the old man darts past and out the door. Pete", "slams and locks it. Bogs shoves Andy to the center of the", "room.", "Ray Milland starts SCREAMING. The entire audience SCREAMS", "witt him, high-pitched and hysterical. Andy fidgets.", "Andy nods, embarrassed. He gets up and hurries out. Red", "grins, turns back to the movie.", "INT -- AUDITORIUM CORRIDOR -- NIGHT (1949)", "Andy exits the theater and freezes in his tracks. Two dark", "figures loom in the corridor, blocking his path. Rooster and", "Pete. Andy turns back -- and runs right into Bogs. Instant", "bear hug. The Sisters are on him like a flash. They kick a", "door open and drag him into --", "THE PROJECTION BOOTH", "-- where they confront the startled PROJECTIONIST, an old", "con blinking at them through thick bifocals.", "Terrified, the old man darts past and out the door. Pete", "slams and locks it. Bogs shoves Andy to the center of the", "room.", "Andy sighs, cocks his head at the projector.", "Seemingly resigned, Andy turns around, leans on the rewind", "bench -- and curls his fingers around a full 1.000 foot reel", "of 35mm film. Rooster licks his lips, pushes past the", "others.", "Andy whips the reel of film around in a vicious arc,", "smashing it into Rooster's face and bouncing him off the", "wall.", "Andy fights like hell, but is soon overpowered and forced to", "his knees. Bogs steps to Andy, pulls out an awl with a", "vicious eight-inch spike, gives him a good long look at it.", "The Sisters consider this carefully. The film runs out of", "the projector, flapping on the reel. The screen goes white.", "Andy gets a bootheel in the face. The Sisters start kicking", "and beating the living shit out of him with anything they", "can get their hands on. In the theater, the convicts are", "CHANTING AND CLAPPING for the movie to come back on.", "INT -- INFIRMARY -- DAY (1949)", "Andy lies wrapped in bandages.", "INT -- SOLITARY CONFINEMENT -- DAY (1949)", "Bogs sits on bare concrete. The steel door slides open.", "INT -- CELLBLOCK FIVE -- 3RD TIER -- DUSK (1949)", "Bogs comes up the stairs, smoking a cigarette. Not many cons", "around; the place is virtually deserted. A VOICE echoes", "dimly over the P.A. system:", "Bogs enters his cell. Dark in here. He fumbles for the light", "cord, yanks it. The sudden light reveals Captain Hadley six", "inches from his face, waiting for him. Mert steps in behind", "Bogs. hemming him.", "Before Bogs can even open his mouth to say \"what the fuck,\"", "Hadley rams the tip of his baton brutally into his solar", "plexus. Bogs doubles over, gagging his wind out.", "GROUND FLOOR", "Ernie comes slowly around the corner, rolling a steel mop", "cart loaded with supplies.", "2ND TIER", "Red is darning a sock in his open cell. He pauses, frowning,", "hearing strange THUMPING sounds. What the hell is that?", "3RD TIER", "It's Hadley and Mert methodically and brutally pulping Bogs", "with their batons, and kicking the shit out of him for good", "measure. He feebly tries to ward them off.", "2ND TIER", "Puzzled, Red steps from his cell, following the sound. It", "dawns on him that it's coming from above. He moves to the", "railing and leans out, craning around to look up --", "RED'S POV", "-- just as Bogs flips over the railing and comes sailing", "directly toward us, eyes bugging out, SCREAMING as he falls.", "RED (SLOW MOTION)", "jumps back as Bogs plummets past, missing him by inches,", "arms swimming and trying to grab the railing (but missing", "that too), SCREAMING aaaaalll the way down --", "GROUND FLOOR", "-- and impacting on Ernie's gassing mop cart in an enormous", "eruption of solvents and cleansers. The cart is squashed", "flat, shooting out from under Bogs and skidding across the", "cellblock floor like a tiddly wink, kicking up sparks for", "thirty yards. Ernie is left gaping in shock at Bogs and all", "the Bogs-related wreckage at his feet.", "2ND TIER", "Red is stunned. He very tentatively leans out and looks up.", "Above him, Hadley and Mert lean on the 3rd tier railing.", "Hadley tilts the cap back on his head, shakes his head.", "A tiny drop of blood drips off the toe of Hadley's shoe and", "splashes across Red's upturned cheek. He wipes it off, then", "looks down at Bogs. Cons and guards are racing to the scene.", "EXT -- PRISON YARD/LOADING DOCK -- DAY (1949)", "Bogs, wheelchair-bound and wearing a neck brace, is loaded", "onto an ambulance for transport. Behind the fence stand Red", "and his friends, watching.", "EXT -- FIELD -- DAY (1949)", "A HUNDRED CONS at work. Hoes rise and fall in long waves.", "GUARDS patrol on horseback. Heywood turns up a rocky chunk,", "quickly shoves it down his pants. He maneuvers to Red and", "the others, pulls out the chunk and shows it to them.", "Cackling, the men go back to work. Heywood stares at the", "rock. He crumbles it in his hands.", "INT -- PRISON LAUNDRY -- BACK ROOM -- DAY (1949)", "A huge detergent box is filled with rocks, hidden in the", "shadows behind a boiler furnace.", "ANGLE SHIFTS to Red as he plops a bag of \"laundry\" on the", "floor. Leonard and Bob toss a few more down. Red starts", "pulling out contraband, giving them their commissions.", "INT -- CELLBLOCK FIVE -- NIGHT (1949)", "Andy, limping a bit, returns from the infirmary. Red watches", "from his cell as Andy is brought up and locked away.", "INT -- ANDY'S CELL -- NIGHT (1949)", "Andy finds the cardboard tube lying on his bunk.", "The lights go off. Andy opens the tube and pulls out a large", "rolled poster. He lets it uncurl to the floor. A small scrap", "of paper flutters out, landing at his feet. The poster is", "the famous Rita Hayworth pin-up -- one hand behind her head,", "eyes half closed, sulky lips parted. Andy picks up the scrap", "of paper. It reads: \"No charge. Welcome back.\" Alone in the", "dark, Andy smiles.", "INT -- CELLBLOCK FIVE -- MORNING (1949)", "The BUZZER SOUNDS, the cells SLAM OPEN. Cons step from their", "cells. Andy catches Red's eye, nods his thanks. As the men", "shuffle down to breakfast, Red glances into Andy's cell --", "RED'S POV -- DOLLYING PAST", "-- and sees Rita in her new place of honor on Andy's wall.", "Sunlight casts a harsh barred shadow across her lovely face.", "INT -- CELLBLOCK FIVE -- NIGHT (1949)", "Ernie is mopping the floor. He glances back and sees Warden", "Norton approach the cellblock with an entourage of a DOZEN", "GUARDS. Still mopping, Ernie mutters to the nearest cell:", "Word travels fast from cell to cell. Cons scramble to tidy", "up and hide things. Norton enters, nods to his men. The", "guards pair off in all directions, making their choices at", "random.", "Cells are opened, occupants displaced, items scattered,", "mattresses overturned. Whatever contraband is found gets", "tossed out onto the cellblock floor. Mostly harmless stuff.", "A GUARD pulls a sharpened screwdriver out of a mattress,", "shoots a nasty look at the CON responsible.", "The man is taken away. Norton's gaze goes up.", "2ND TIER", "Norton arrives, makes a thin show of picking a cell at", "random. He motions at Andy on his bunk, reading his Bible.", "The door is unlocked. Norton enters, trailed by his men.", "Andy rises.", "Norton gives a curt nod. Hadley and Trout start tossing the", "cell in a thorough search. Norton keeps his eyes on Andy,", "looking for a wrong glance or nervous blink. He takes the", "Bible out of Andy's hand.", "Andy glances over. Hadley is holding up a rock blanket, a", "polishing cloth roughly the size of an oven mitt.", "Hadley glances at the rocks lining the window sill, turns to", "Norton.", "Norton nods, strolls to the poster of Rita.", "Norton exits, the guards follow. The cell door is slammed", "and locked. Norton pauses, turns back.", "He reaches through the bars and returns the Bible to Andy.", "Norton and his men walk away.", "INT -- PRISON LAUNDRY -- DAY (1949)", "Andy is working the line. Hadley enters and confers briefly", "with Bob. Bob nods, crosses to Andy, taps him. Andy turns,", "removes an earplug. Bob shouts over the machine noise:", "INT -- WARDEN NORTON'S OFFICE -- DAY (1949)", "Andy is led in. Norton is at his desk doing paperwork.", "Andy's eyes go to a framed needle-point sampler on the wall", "behind him that reads: \"HIS JUDGMENT COMETH AND THAT RIGHT", "SOON.\"", "INT -- MAIN BUILDING -- STORAGE ROOMS -- DAY (1949)", "A series of bleak rooms stacked high with unused filing", "cabinets, desks, paint supplies, etc. Andy enters. He hears", "a FLUTTER OF WINGS. An adult crow lands on a filing cabinet", "and struts back and forth, checking him out. Andy smiles.", "Brooks Hatlen pokes his head out of the back room.", "INT -- SHAWSHANK PRISON LIBRARY -- DAY (1949)", "Brooks leads Andy into the bleakest back room of all. Rough", "plank shelves are lined with books. Brooks' private domain.", "Andy pauses. Something about this doesn't make any sense.", "ANDY STEPS BACK INTO THE OUTER ROOMS AND FINDS HADLEY WITH", "another GUARD, a huge fellow named DEKINS.", "Hadley exits. Dekins approaches Andy ominously. Andy stands", "his ground, waiting for whatever comes next. Finally:", "Andy covers his surprise. Glances at Brooks. Brooks smiles.", "Andy and Dekins grab a desk standing on end and tilt it to", "the floor. They find chairs and settle in. Brooks returns", "with a tablet of paper and a pen, slides them before Andy.", "INT -- MESS HALL -- DAY (1949)", "LAUGHTER all around. Andy blinks at them.", "INT -- MAIN BUILDING HALLWAY -- DAY (1949)", "DOLLYING Norton and Andy up the hall:", "INT -- ANDY'S CELL -- NIGHT (1949)", "Andy is on his bunk, writing a letter.", "INT -- GUARD DESK/NORTON'S OUTER OFFICE -- DAY (1949)", "Andy pops his head in. The GUARD shakes his head.", "INT -- PRISON LIBRARY/ANDY'S OFFICE -- DAY (1950)", "Andy is doing taxes. Mert Entwhistle is seated across from", "him. Other off-duty guards are waiting their turn.", "INT -- PRISON LIBRARY -- ONE YEAR LATER (1951)", "Tax time again. Even more guards are waiting.", "EXT -- BASEBALL DIAMOND -- DAY (1952)", "A BATTER in a \"Noresby Marauders\" baseball uniform WHACKS", "the ball high into left field and races for first.", "INT -- PRISON LIBRARY/ANDY'S OFFICE -- DAY (1952)", "The Batter sits across from Andy. The line winds out the", "door.", "ANGLE SHIFTS to reveal Red and Brooks doing filing chores.", "INT -- GUARD DESK/NORTON'S OUTER OFFICE -- DAY (1953)", "Andy enters and drops a letter on the outgoing stack.", "INT -- ANDY'S CELL -- NIGHT (1953)", "Dark. Andy's in his bunk, polishing a four-inch length of", "quartz. It's a beautifully-crafted chess piece in the shape", "of a horse's head, poise and nobility captured in gleaming", "stone.", "He puts the knight on a chess board by his bed, adding it to", "four pieces already there: a king, a queen, and two bishops.", "He turns to Rita. Moonlight casts bars across her face.", "EXT -- EXERCISE YARD -- DAY (1954)", "Floyd runs into the yard, scared and winded. He finds Andy", "and Red on the bleachers.", "INT -- PRISON LIBRARY/ANDY'S OFFICE -- DAY (1954)", "Floyd rushes in with Andy and Red at his heels. They find", "Jigger and Snooze trying to calm Brooks, who has Heywood in", "a chokehold and a knife to his throat. Heywood is terrified.", "He kicks a table over. Tax files explode through the air.", "Andy steps forward, rivets Brooks with a gaze. Softly:", "Brooks bursts into tears. The storm is over. Heywood", "staggers free, gasping for air. Andy takes the knife, passes", "it to Red. Brooks dissolves into Andy's arms with great", "heaving sobs.", "Red and Andy exchange a surprised look. Andy wants to", "understand. Red just motions to let it be for now. He puts", "his arm around Brooks, who sobs inconsolably. Softly:", "EXT -- PRISON YARD BLEACHERS -- DUSK (1954)", "EXT -- SHAWSHANK PRISON -- DAWN (1954)", "The sun rises over gray stone.", "INT -- ANDY'S CELL -- DAWN (1954)", "ANGLE ON RITA POSTER. Sexy as ever. The rising sun sends", "fingers of rosy light creeping across her face.", "INT -- LIBRARY -- DAWN (1954)", "Brooks stands on a chair, poised at the bars of a window,", "cradling Jake in his hands.", "He tosses Jake through the bars. The crow flaps away.", "EXT -- SHAWSHANK PRISON -- MAIN GATE -- DAY (1954)", "TWO SHORT SIREN BLASTS herald the opening of the gate. It", "swings hugely open, revealing Brooks standing in his cheap", "suit, carrying a cheap bag, wearing a cheap hat.", "Brooks walks out, tears streaming down his face. He looks", "back. Red, Andy, and others stand at the inner fence, seeing", "him off. The massive gate closes, wiping them from view.", "INT -- BUS -- DAY (1954)", "Brooks is riding the bus, clutching the seat before him,", "gripped by terror of speed and motion.", "EXT -- STREET -- PORTLAND, MAINE -- DAY (1954)", "Brooks looks like a kid trying to cross the street without", "his parents. People and traffic a blur.", "EXT -- BREWSTER HOTEL -- DAY (1954)", "Brooks comes trudging up the sidewalk. He glances up as a", "prop-driven airliner streaks in low overhead.", "He arrives at the Brewster. It ain't much to look at.", "INT -- BREWSTER HOTEL -- DAY (1954)", "A WOMAN leads Brooks up the stairs toward the top floor. He", "has trouble climbing so many stairs.", "INT -- BROOKS' ROOM -- DAY (1954)", "Brooks enters. The room is small, old, dingy. Heavy wooden", "beams cross the ceiling. An arched window affords a view of", "Congress Street. Traffic noise drifts in. Brooks sets his", "bag down. He doesn't quite know what to do. He just stands", "there, like a man waiting for a bus.", "INT -- FOODWAY MARKET -- DAY (1954)", "Loud. Jangling with PEOPLE and NOISE. Brooks is bagging", "groceries. Registers are humming, kids are shrieking.", "EXT -- PARK -- DAY (1954)", "Brooks sits alone on a bench, feeding pigeons.", "INT -- BROOKS' ROOM -- NIGHT (1954)", "Dark. Traffic outside. Brooks wakes up. Disoriented. Afraid.", "Somewhere in the night, a LOUD ARGUMENT is taking place.", "INT -- FOODWAY -- DAY (1954)", "INT -- BROOKS' ROOM -- DAY (1954)", "Brooks is packing his worldly possessions into the carry", "bag. Undershirts, socks, etc.", "INT -- BROOKS' ROOM -- SHORTLY LATER (1954)", "Brooks is dressed in his suit. He finishes knotting his tie,", "puts his hat on his head. The letter lies on the desk,", "stampe3 and ready for mailing. His bag is by the door.", "He takes one last look around. Only one thing left to do. He", "steps to a wooden chair in the center of the room, pulls out", "s pocketknife, and glances up at the ceiling beam.", "He steps up onto the chair. It wobbles queasily. Now facing", "the beam, he carves a message into the wood: \"Brooks Hatlen", "was here.\" He smiles with a sort of inner peace.", "TIGHT ON CHAIR", "His weight shifts on the wobbly chair -- and it goes out", "from under him. His feet remain where they are, kicking", "feebly in mid-air. His hat falls to the floor.", "ANGLE WIDENS. Brooks has hanged himself. He swings gently,", "facing the open window. Traffic noise floats up from below.", "EXT -- EXERCISE YARD -- SHAWSHANK -- DAY (1954)", "Andy reads the letter to Red and the others:", "A long silence. Andy folds the letter, puts it away. Softly:", "INT -- PRISON LIBRARY -- DAY (1954)", "Andy is sorting books on the cart. He replaces a stack on", "the shelf -- and pauses, noticing a line of ants crawling up", "the wood. He glances up. The ants disappear over the top. He", "pulls a chair over and stands on it, peers cautiously over.", "Red steps in with an armload of files. Andy gingerly reaches", "in, grabs a black feathered wing, and pulls out a dead crow.", "INT -- WOOD SHOP -- DAY (1954)", "Red is making something at his bench, sanding and planing.", "EXT -- FIELDS -- DAY (1954)", "Low hilly terrain all around. A HUNDRED CONS are at work in", "the fields. GUARDS patrol with carbines, keeping a sharp", "eye. We find Andy, Red, and the boys working with picks and", "shovels. They glance over to the pickup truck. Hadley's", "chewing the fat with Mert and Youngblood. A WHISTLE BLOWS.", "The work stops. Cons head for the pickup truck, where water", "is dispensed with dipper and pail. Red and the boys look to", "Andy. Andy nods. Now's the time. The group moves off through", "the confusion, using it as cover. They head up the slope of", "a nearby hill and quickly decide on a suitable spot. The", "guards haven't noticed.", "Jigger and Floyd start swinging picks into the soft earth,", "quickly ripping out a hole. Red reaches into his jacket and", "pulls out a beautiful wooden box, carefully stained and", "varnished. He shows it around to nods of approval.", "Heywood jumps in and starts spading out the hole.", "BY THE TRUCK", "Youngblood glances up and sees the men on the slope.", "Suddenly, other cons start breaking away in groups, dozens", "of them heading toward the slope. The guards look around.", "ON THE SLOPE", "Andy pulls a towel-wrapped bundle from his jacket and", "unfolds it. Jake. Andy lays him in the box, followed by", "Brook's letter. Red places the casket in the hole. A moment", "of silence. Andy gives Red with an encouraging nod.", "Muttered \"amens\" all around. The boys shovel dirt onto the", "small grave and tamp it down.", "INT -- SHAWSHANK CORRIDORS -- DAY (1955)", "RAPID DOLLY with Hadley. He's striding, pissed-off, a man on", "e mission. He straight-arms a door and emerges onto --", "EXT -- SHAWSHANK PRISON WALL -- DAY (1955)", "-- the wall overlooking the exercise yard. He leans on the", "railing, scans the yard, sees Andy chatting with Red.", "Andy shoots a worried look at Red, then heads off.", "INT -- GUARD DESK/WARDEN'S OUTER OFFICE -- DAY (1955)", "Dozens of parcel boxes litter the floor. WILEY, the duty", "guard, picks through them. Hadley enters, trailed by Andy.", "Wiley thrusts an envelope at Andy. Andy just stares at it.", "Andy takes the envelope, pulls out a letter, reads:", "Wiley grins. Hadley glares at him. The grin vanishes.", "Andy gazes around at the boxes. The riches of the world lay", "at his feet. His eyes mist with emotion at the sight.", "Hadley exits. Andy touches the boxes like a love-struck man", "touching a beautiful woman. Wiley grins.", "Andy nods. Wiley disappears into the toilet, Jughead Comix", "in hand. Alone now, Andy starts going through the boxes like", "a starving man exploring packages of food. He doesn't know", "where to turn first. He gets giddy, ripping boxes open and", "pulling out books, touching them, smelling them.", "He rips open another box. This one contains an old", "phonograph player, industrial gray and green, the words", "\"Portland Public School District\" stenciled on the side. The", "box also contains stacks and stacks of used record albums.", "Andy reverently slips a stack from the box and starts", "flipping through them. Used Nat King Coles, Bing Crosbys,", "etc. He comes across a certain album -- Mozart's \"Le Nozze", "de Figaro.\" He pulls it from the stack, gazing upon it as a", "man transfixed. It is a thing of beauty. It is the Grail.", "INT -- BATHROOM -- DAY (1955)", "Wiley sits in one of the stalls, Jughead comic on his knees.", "INT -- GUARD STATION/OUTER OFFICE -- DAY (1955)", "Andy wrestles the phonograph player onto the guards' desk,", "sweeping things onto the floor in his haste. He plugs the", "machine in. A red light warms up. The platter starts", "spinning.", "He slides the Mozart album from its sleeve, lays it on the", "platter, and lowers the tone arm to his favorite cut. The", "needle HISSES in the groove...and the MUSIC begins, lilting", "and gorgeous. Andy sinks into Wiley's chair, overcome by its", "beauty. It is \"Deutino: Che soave zeffiretto,\" a duet sung", "by", "Susanna and the Contessa.", "INT -- BATHROOM -- DAY (1955)", "Wiley pauses reading, puzzled. He thinks he hears music.", "INT -- GUARD STATION/OUTER OFFICE -- DAY (1955)", "Andy shoots a look at the bathroom...and smiles. Go for", "broke. He lunges to his feet and barricades the front door,", "then the bathroom. He returns to the desk and positions the", "P.A. microphone. He works up his courage, then flicks all", "the toggles to \"on.\" A SQUEAL OF FEEDBACK echoes briefly...", "INT/EXT -- VARIOUS P.A. SPEAKERS -- DAY (1955)", "...and the Mozart is suddenly broadcast all over the prison.", "INT -- BATHROOM -- DAY (1955)", "Wiley lunges to his feet, pants tangling around his ankles.", "INT/EXT -- SHAWSHANK PRISON -- VARIOUS LOCATIONS -- DAY", "(1955)", "Cons all over the prison stop whatever they're doing,", "freezing in mid-step to listen, gazing up at the speakers.", "THE STAMPING MACHINES IN THE PLATE SHOP ARE SHUT DOWN...", "THE LAUNDRY LINE GOES SILENT, GRINDING TO A HALT...", "THE WOOD SHOP MACHINES ARE TURNED OFF, BUZZING TO A STOP...", "THE MOTOR POOL...THE KITCHEN...THE LOADING DOCK...THE", "EXERCISE", "thru yard...the numbing routine of prison life itself...all", "grinds thru", "TO A STUTTERING HALT. NOBODY MOVES, NOBODY SPEAKS. EVERYBODY", "just stands in place, listening to the MUSIC, hypnotized.", "INT -- GUARD STATION -- DAY (1955)", "Andy is reclined in the chair, transported, arms fluidly", "conducting the music. Ecstasy and rapture. Shawshank no", "longer exists. It has been banished from the mind of men.", "EXT -- EXERCISE YARD -- DAY (1955)", "CAMERA TRACKS along groups of men, all riveted.", "CAMERA brings us to Red.", "INT -- PRISON CORRIDOR -- DAY (1955)", "FAST DOLLY with Norton striding up the hallway with Hadley.", "INT -- GUARD STATION/OUTER OFFICE -- DAY (1955)", "Norton and Hadley break the door in. Andy looks up with a", "sublime smile. We hear Wiley POUNDING on the bathroom door:", "INT -- SOLITARY WING -- DAY (1955)", "LOW ANGLE SLOW PUSH IN on the massive, rust-streaked steel", "door. God, this is a terrible place to be.", "INT -- SOLITARY CONFINEMENT -- DAY (1955)", "Andy doesn't seem to mind. His arms sweep to the music still", "playing in his head. We hear a FAINT ECHO of the soaring", "duet.", "INT -- MESS HALL -- DAY (1955)", "AN IRON-BARRED DOOR", "slides open with an enormous CLANG. A stark room beyond.", "CAMERA PUSHES through. SEVEN HUMORLESS MEN sit at a long", "table. An empty chair faces them. We are again in:", "INT -- SHAWSHANK HEARINGS ROOM -- DAY (1957)", "Red enters, ten years older than when we first saw him at a", "parole hearing. He removes his cap and sits.", "MAN #l It says here you've served thirty years of a life", "sentence.", "CLOSEUP -- PAROLE FORM", "A big rubber stamp slams down: \"REJECTED.\"", "EXT -- PRISON YARD -- DUSK (1957)", "Red emerges into fading daylight. Andy's waiting for him.", "Red nods, solemn. They settle in on the bleachers. Andy", "pulls a small box from his sweater, hands it to Red.", "Red does. Inside the box, on a thin layer of cotton, is a", "shiny new harmonica, bright aluminum and circus-red.", "INT -- CELLBLOCK FIVE/ANDY'S CELL -- NIGHT (1957)", "Men line the tiers as the evening count is completed. The", "convicts step into their cells. The master switch is thrown", "and all the doors slam shut -- KA-THUMP! Andy finds a", "cardboard tube on his bunk. The note reads: \"A new girl for", "your 10 year anniversary. From your pal. Red.\"", "INT -- ANDY'S CELL -- LATER (1957)", "Marilyn Monroe's face fills the screen. SLOW PULL BACK", "reveals the new poster: the famous shot from \"The Seven Year", "Itch,\" on the subway grate with skirt billowing up. Andy", "sits gazing at her as lights-out commences...", "INT -- RED'S CELL -- NIGHT (1957)", "...and we find Red gazing blankly as darkness takes the", "cellblock. Adding up the months, weeks, days...", "He regards the harmonica like a man confronted with a", "Martian artifact. He considers trying it out -- even holds", "it briefly to his lips, almost embarrassed -- but puts it", "back in its box untested. And there the harmonica will", "stay...", "WE HOLD IN BLACKNESS as THUMPING SOUNDS grow louder...", "...and the BLACKNESS disintegrates as a wall tumbles before", "our eyes, revealing a WORK CREW with picks and", "sledgehammers, faces obscured outlaw-style with kerchiefs", "against the dust. Behind them are GUARDS overseeing the", "work.", "Andy yanks his kerchief down, grinning in exhilaration. Red", "and the others follow suit. They step through the hole in", "the wall, exploring what used to be a sealed-off storage", "room.", "INT -- PRISON LIBRARY -- DAY (1960)", "TRACKING the construction. Walls have been knocked down. Men", "are painting, plastering, hammering. Lots of shelves going", "up. Red is head carpenter. We find him discussing plans with", "Andy.", "INT -- PRISON LIBRARY -- DAY (1960)", "Red and the boys are opening boxes, pulling out books.", "Floyd tries to take the book. Heywood yanks it back. I saw", "it first. Red shoots Andy a look.", "INT -- WOOD SHOP -- DAY (1961)", "Red is making a sign, carefully routing letters into a long", "plank of wood. It turns out to be --", "INT -- PRISON LIBRARY -- DAY (1963)", "-- the varnished wood sign over the archway: \"Brooks Hatlen", "Memorial Library.\" TILT DOWN to reveal the library in all", "its completed glory: shelves lined with books, tables and", "chairs, even a few potted plants. Heywood is wearing", "headphones, listening to Hank Williams on the record player.", "EXT -- SHAWSHANK PRISON -- DAY (1963)", "FLASHBULBS POP as Norton addresses MEMBERS OF THE PRESS:", "ANGLE TO Red and the boys listening from behind the fence.", "EXT -- HIGHWAY CONSTRUCTION SITE -- DAY (1963)", "A ROAD-GANG is grading a culvert with picks. There's dust", "and the smell of sweat in the air. GUARDS patrol with sniper", "rifles, A pushy WOMAN REPORTER in an ugly hat bustles up the", "grade, trailed by a PHOTOGRAPHER.", "She turns, motioning her photographer up the grade. Heywood", "glances around at the other men.", "Heywood unzips his pants, reaches inside. The others do", "likewise. The woman turns back and is greeted by the sight", "of a dozen men displaying their penises and smiling", "brightly. Her legs go wobbly and she sits heavily down on", "the dirt grade.", "INT -- SOLITARY CONFINZMENT -- NIGHT (1963)", "Heywood sits alone in the dark. He sighs.", "EXT -- WOODED FIELDS -- DAY (1965)", "A ROAD-GANG is pulling stumps, bogged down in mud.", "Norton strolls into view with NED GRIMES at his heels.", "Norton opens the box. Alongside the pie is an envelope. He", "runs his thumb across the thick stack of cash it contains.", "IN THE BACKGROUND, a winch cable SNAPS and whips through the", "air, damn near severing a man's leg. He goes down, screaming", "in mud and blood, pinned by a fallen tree stump. Men rush", "over to help him. Norton barely takes notice.", "INT -- NORTON'S OFFICE -- NIGHT (1965)", "ANGLE on Maisie's pie. Several pieces gone.", "TILT UP to Andy at the desk, munching thoughtfully as he", "totals up figures on an adding machine.", "Andy finishes preparing two bank deposits. Norton hovers", "near the desk, keeping a watchful eye.", "Norton pockets the envelopes. Andy crosses to the wall safe", "and shoves the ledger and sundry files inside. Norton locks", "the safe, swings his wife's framed sampler back into place.", "He cocks his thumb at some laundry and two suits in the", "corner.", "INT -- PRISON CORRIDOR -- NIGHT (1965)", "Andy trudges down the corridor with Norton's laundry, the", "pie box under his arm.", "INT -- LIBRARY -- DAY (1965)", "TILT UP FROM PIE to find Red munching away as he helps Andy", "sort books on the shelves.", "EXT -- PRISON YARD -- DUSK (1965)", "TWO SIREN BLASTS draw their attention to the main gate. It", "swings open, revealing a prison bus waiting outside.", "INT -- PRISON BUS -- DUSK (1965)", "Among those on board is TOMMY WILLIAMS, a damn good-looking", "kid in his mid-20's. The bus RUMBLES through the gate.", "EXT -- PRISON YARD -- DUSK (1965)", "The new fish disembark, chained together single-file. The", "old- timers holler and shake the fence. A deafening", "gauntlet.", "INT -- CELLBLOCK EIGHT -- NIGHT (1965)", "Tommy and the others are marched in naked and shivering,", "covered with delousing powder, greeted by TAUNTS and JEERS.", "INT -- TOMMY'S CELL -- NIGHT (1965)", "The bars slam with a STEEL CLANG. Tommy and his new CELLMATE", "take in their new surroundings.", "INT -- PRISON CORRIDOR -- DAY (1965)", "DOLLYING Tommy as he struts along, combing his ducktail,", "cigarette behind his ear. (We definitely need The Coasters", "or Del Vikings on the soundtrack here. Maybe Jerry Lee", "Lewis.)", "INT -- WOOD SHOP -- DAY (1965)", "A SHRIEKING BUZZSAW slices ten-foot lengths of wood. Red", "runs the machine while some other OLD-TIMERS feed the wood.", "Tommy is hauling the cut wood off the conveyor and stacking", "it, It's a ball-busting job, but the kid's a blur.", "The old guys just grin and shake their heads.", "INT -- MESS HALL -- DAY (1965)", "Tommy regales the old boys with his exploits:", "The whole table falls about laughing.", "INT -- LIBRARY -- DAY (1965)", "Poker game in progress. Tommy, Andy, Red and the boys.", "The tension breaks. Everyone laughs.", "INT -- VISITOR'S ROOM -- DAY (1965)", "CAMERA TRAVELS the room. Chaotic. CONS are waiting their", "turn or talking to visitors through a thick plexi shield.", "Tommy's at the end of the row, phone to his ear. Other side", "of the glass is BETH, near tears, fussing with a BABY on her", "lap.", "PUSH IN on Tommy's face as he listens.", "the streets...or his child growing up not knowing her", "daddy...", "INT -- LIBRARY -- DAY (1965)", "Tommy enters, the strut gone from his step. A little scared.", "He finds Andy filing library cards.", "Tommy thinks about it, nods.", "INT -- LIBRARY -- DAY (1965)", "We find Andy giving an impassioned reading:", "Andy slaps the book shut, immensely pleased with himself.", "INT -- LIBRARY -- DAY (1965)", "Tommy tries to read as Andy looks on:", "Andy shakes his head. Not exactly.", "INT -- LIBRARY -- DAY (1965)", "Andy chalks the alphabet on a blackboard.", "INT -- MESS HALL -- DAY (1965)", "TRACK the table to Tommy and Andy. Discussing a book.", "EXT -- EXERCISE YARD BLEACHERS -- DAY (1965)", "INT -- WOOD SHOP -- DAY (1965)", "Tommy intent on a paperback, mouthing the words. Behind him,", "wood is piling up on the conveyor belt.", "Tommy shoves the book in his back pocket and hurries over.", "INT -- LIBRARY -- DAY (1965)", "Tommy writes a sentence on the blackboard. Andy steps in,", "shows him how to reconstruct it.", "INT -- ANDY'S CELL -- NIGHT (1966)", "TIGHT ANGLE on chessboard. Most of the pieces complete. PAN", "TO Andy lying in his bunk, carefully polishing...", "...and we keep going past Andy in a SLOW PAN of the cell.", "Sink. Toilet. Books. Outside the window bars, we hear", "another TRAIN passing in the night...", "...STILL PANNING, past a chair, a sweater on a hook...and", "finally to the place of honor on the wall...", "...where the latest poster turns out to be Racquel Welch ins", "fur bikini. Gorgeous. \"One Million Years, B. C. \" SLOW PUSH", "IN,", "INT -- LIBRARY -- DAY (1966)", "Tommy's taking the big test. Andy's monitoring the time.", "Deep silence, save for Tommy's pencil-scribbling. A few old-", "timers are browsing the shelves, sneaking looks their way.", "Tommy tries to ignore them. Concentrate.", "Andy clears his throat. Time's up. Tommy puts his pencil", "down,", "Tommy grabs the test, wads it, slam-dunks it into the trash.", "Tommy is gone. Red and others stare. Andy gets up, pulls the", "test from the trash, smoothes it out on the desk.", "INT -- WOOD SHOP -- DAY (1966)", "Rest break. Tommy and Red sipping Cokes.", "SMASH! Red turns back. Tommy's Coke has slipped from his", "hand and shattered on the floor. The kid's gone white as a", "sheet.", "INT -- LIBRARY -- DAY (1966)", "Tommy sits before Andy and Red:", "He throws his head back and ROARS with laughter.", "INT -- PRISON LIBRARY -- DAY (1966)", "Silence. Tommy has finished his story. Red is stunned...but", "Andy looks like he's been smacked with a two by four.", "Andy says nothing. Walks stiffly away. Doesn't look back.", "INT -- NORTON'S OFFICE -- DAY (1966)", "Andy gets dragged away, kicking and screaming:", "EXT -- PRISON YARD -- DAY (1966)", "Mail call. Men crowd around as names are called out. Red and", "the boys are parked on the bleachers.", "Tommy raises his hand. The envelope gets tossed to him. He", "stares at it. Red peers over his shoulder.", "He gets hemmed in by the older men. Red snatches the letter.", "Red rips it open, scans the letter. Expressionless.", "INT -- VISITOR'S ROOM -- DAY (1966)", "Tommy makes his way through the chaos, finds Beth and the", "baby waiting behind the thick plexi shield. He sits, doesn't", "pick up the phone. Just stares at Beth. She doesn't know", "what to make of it.", "He presses a piece of paper against the glass. A high school", "diploma. Her face lights up, blinking back tears.", "INT -- SOLITARY WING -- NIGHT (1966)", "LOW ANGLE on steel door. Somewhere behind it, unseen, is", "Andy, A rat scurries along the wall. FOOTSTEPS approach", "slowly.", "INT -- SOLITARY -- NIGHT (1966)", "Andy listens in darkness. The FOOTSTEPS pause outside his", "door. The slot opens. An ELDERLY GUARD peers in.", "The slot closes. The FOOTSTEPS recede. Andy smiles.", "INT -- PRISON CORRIDOR -- NIGHT (1966)", "We find Tommy on evening work detail, mopping the floors", "with bucket and pail. Mert Entwhistle comes into view.", "EXT -- PRISON -- NIGHT (1966)", "A steel door rattles open. Mert leads Tommy outside to a", "gate, unlocks it. Tommy looks around.", "Mert swings the gate open, sends Tommy through, turns and", "heads back inside. Tommy proceeds out across a loading-dock", "access for the shops and mills. Some vehicles parked. The", "place is deserted. He stops, sensing a presence.", "Norton steps into the light.", "Norton pulls a pack of cigarettes, offers Tommy a smoke.", "Tommy takes one. Norton lights both cigarettes, pockets his", "lighter.", "Norton drops his cigarette. Crushes it out with the toe of", "his shoe. Glances up toward the plate shop roof as --", "HIGH ANGLE FROM PLATE SHOP ROOF (SNIPER POV)", "-- a rifle scope pops up into frame, jumping Tommy's image", "into startling magnification, framed in the crosshairs.", "THE SNIPER", "rapid-fires a carbine -- BLAM!BLAM!BLAM!BLAM! -- his face", "lit up by the muzzle flashes. Captain Hadley.", "TOMMY 201", "gets chewed to pieces by the gunfire. He smacks the ground", "in a twitching, thrashing heap. Eyes wide and staring. Dead.", "Surprise still stamped on his face. Silence now. Norton", "turns, strolls into darkness.", "INT -- SOLITARY WING -- DAY (1966)", "GUARDS approach Andy's cell. The door is unlocked. Andy", "emerges slowly, blinking painfully at the light.", "INT/EXT -- PRISON -- DAY (1966)", "Andy is marched along. Convicts stop to stare.", "INT -- NORTON'S OFFICE -- DAY (1966)", "Andy is led in. The door is closed. Alone with Norton.", "Softly,", "Norton lunges to his feet, eyes sparkling with rage.", "SLOW PUSH IN on Andy's face. Eyes hollow. His beaten", "expression says it all...", "EXT -- PRISON YARD -- DAY (1966)", "Red finds Andy sitting in the shadow of the high stone wall,", "poking listlessly through the dust for small pebbles.", "Red waits for some acknowledgment. Andy doesn't even look", "up. Red hunkers down and joins him. Nothing is said for the", "longest time. And then, softly:", "Andy finally glances to Red, seeking a reaction. Silence.", "Andy smiles faintly in spite of himself. Red gives his", "shoulder a squeeze.", "Red stares at Andy, laughs.", "Red snaps a look. What the hell does that mean? Andy rises", "and walks away. Red lunges to his feet.", "Andy turns and walks away.", "INT -- MESS HALL -- DAY (1966)", "They all look to Red.", "EXT -- PRISON YARD -- ANGLE ON P.A. -- DUSK (1966)", "BOOM DOWN to Red and the boys. Convicts drift past them.", "YOU MEN! YOU HEAR THAT ANNOUNCEMENT", "OR ZUST TOO STUPID TO UNDERSTAND?", "INT -- NORTON'S OFFICE -- NIGHT (1966)", "Andy's working away. Norton pokes his head in.", "We follow Norton to his wife's sampler. He swings it aside,", "works the combination dial, opens the wall safe. Andy moves", "up, shoves in the black ledger and files. Norton shuts the", "safe.", "Andy hands him the envelopes. Norton heads for the door.", "Norton exits. Andy turns to the laundry. He opens the", "shoebox. Nice pair of dress shoes inside. He sighs, glances", "down at the old ragged pair of work shoes on his own feet.", "INT -- NORTON'S OFFICE -- NIGHT (1966)", "Andy is diligently shining Norton's shoes.", "INT -- PRISON CORRIDOR -- NIGHT (1966)", "Andy trudges down the hallway, laundry slung over his", "shoulder,", "INT -- CELLBLOCK FIVE -- NIGHT (1966)", "Andy nods to the GUARD. The guard BUZZES him through.", "INT -- RED'S CELL -- NIGHT (1966)", "Red hears Andy coming, moves to the bars. He watches Andy", "come up to the second tier and pause before his cell.", "Andy gazes directly at Red. A beat of eye contact. Red", "shakes his head. Don't do it. Andy smiles, eerily calm...and", "enters his cell. The door closes. KA-THUMP! We hold on Red's", "face.", "INT -- ANDY'S CELL -- NIGHT (1966)", "Andy is polishing a chess piece.", "The lights bump off. He finishes polishing, holds up the", "piece to admire. A pawn. He sets it down with the others --", "and we realize it's the final glance for the board. A full", "set.", "He gazes up at Racquel and smiles. Pulls a six foot length", "of rope from under his pillow. Lets it uncoil to the floor.", "INT -- RED'S CELL -- NIGHT (1966)", "Red sits in the dark, a bundle of nerves, trying to hold", "himself still. He feels like he might scream or shake to", "pieces. The seconds tick by, each an eternity.", "A FLASH OF LIGHTNING outside his window sends harsh barred", "shadows jittering across the cell. A storm breaking.", "INT -- CELLBLOCK FIVE -- MORNING (1966)", "KA-THUMP! The master lock is thrown. The cons emerge from", "their cells and the headcount begins. Red looks back to see", "if Andy's in line. He's not. Suddenly the count stalls:", "The head bull, HAIG, checks his list:", "Still no answer. Glaring, Haig stalks down the tier,", "clipboard in hand. His men fall in behind.", "They arrive at bars. Their faces go slack. Stunned. Softly:", "REVERSE ANGLE", "reveals the cell is empty. Everything neat and tidy. Even", "the bunk is stowed. They wrench the door open and rush in,", "tossing the cell in a panic as if Andy might be lurking", "under the Kleenex or the toothpaste.", "CAMERA ROCKETS IN on Haig as he spins toward us, bellowing", "at the top of his lungs:", "INT -- NORTON'S OFFICE -- MORNING (1966)", "Norton is kicking back with the morning paper. He notices ha", "dingy his shoes are. He glances at the shoebox on the desk.", "kicks his shoes off, opens the box -- and gulls out Andy's o", "grimy work shoes. He stares blankly. What the fuck indeed.", "An ALARM STARTS BLARING throughout the prison. He looks up.", "EXT -- PRISON -- DAY (1966)", "Norton and Hadley stride across the grounds, ALARM BLARING.", "INT -- CELLBLOCK FIVE -- RED'S CELL -- DAY (1966)", "Red watches as Norton storms up with an entourage of guards.", "Red's eyes widen. Guards yank him from his cell.", "INT -- ANDY'S CELL -- DAY (1966)", "Norton steps to the center of the room, working himself up", "into a fine rage:", "Norton grabs the clipboard and thrusts it at Hadley.", "Haig scurries out, gathering men. Norton spins to Red.", "Norton spreads his arms evangelist-style, spins slowly", "around.", "Red exchanges looks with the guards. Even they're nervous.", "Norton scoops a handful rocks off the sill. He hurls them at", "the wall one at a time, shattering them, punctuating his", "words:", "He sends the last rock whizzing right at Racquel. No smash.", "It takes a moment for this to sink in. All eyes go to her.", "The rock went through her. There's a small hole in the", "poster where her navel used to be.", "You could hear a pin drop. Norton reaches up, sinks his", "finger into the hole. He keeps pushing...and his entire hand", "disappears into the wall.", "ANGLE FROM BEHIND POSTER", "as Norton rips the poster from before our eyes. Stunned", "faces peer in. CAMERA PULLS SLOWLY BACK...to reveal the long", "crumbling tunnel in the wall.", "INT -- ANDY'S CELL -- MINUTES LATER (1966)", "RORY TREMONT, a guard barely out of his teens, tries not to", "look nervous as they lash a rope around his chest. He's", "getting instructions from six different people at once.", "INT -- TUNNEL -- DAY (1966)", "Rory squeezes down the tunnel on his belly.", "INT -- VERTICAL SHAFT -- DAY (1966)", "Dark as midnight. Concrete walls rise on both sides. If you", "imagine them as two huge slices of bread, the meat of this", "particular sandwich is about three feet of airspace and a", "dark tangle of pipes between the cellblocks.", "Rory's appears, shining his flashlight down the shaft.", "Somewhere, a rat SQUEAKS.", "Looking none too happy about it, Rory squeezes from the", "tunnel and dangles into the shaft. He gets lowered, shining", "his light, smothered by darkness. Not having a good time.", "His feet touch the ground -- or what he assumed was the", "ground. It's not. In fact, it's just what it smells like. He", "sinks in past his ankles. He slips and sits heavily in it.", "INT -- ANDY'S CELL -- DAY (1966)", "Red and others listen to violent barfing from below.", "That's it for Red. He starts laughing. Laughing, hell, he's", "bellowing laughter, laughing so hard he has to hold himself,", "laughing so hard tears are pouring down his cheeks. The look", "of rage on Norton's face makes him laugh all the harder.", "INT -- SOLITARY WING -- NIGHT (1966)", "Abrupt silence. LOW ANGLE on steel door.", "INT -- SOLITARY -- NIGHT (1966)", "He starts laughing all over again, fit to split.", "EXT -- SHAWSHANK PRISON -- WIDE SHOT -- DAY (1966)", "Virgin landscape. Charming rural road. Suddenly, State", "Police cruisers rocket up the road with SIRENS AND LIGHTS.", "EXT -- FIELD -- DAY (1966)", "Shawshank is half a mile distant. WE TRACK ALONG a muddy", "creel as STATE TROOPERS and PRISON GUARDS scour the brush. A", "TROOPEE fishes a prison uniform out of the creek with a long", "stick.", "TROOPER g2 pulls the rock-hammer from the weeds. SWISH PAN", "to a POLICE PHOTOGRAPHER. His FLASHBULB GLARE produces:", "A BLACK AND WHITE STILL PHOTO", "of the hapless cops posing with Andy's reeking uniform and", "the worn rock-hammer. PUSH IN on the hammer.", "INT -- ANDY'S CELL -- NIGHT (1949)", "Once again, we see Andy using the rock-hammer to scratch his", "name into the cement. Suddenly, a palm-sized chunk of cement", "pops free and hits the floor. He stares down at it.", "INT -- ANDY'S CELL -- NIGHT (1949)", "Andy lies in the dark, studying the chunk of concrete in his", "hands. Considering the possibilities. Wrestling with hope.", "INT -- ANDY'S CELL -- NIGHT (1949)", "Andy stands peering at the small hole left by the fallen", "chunk. Carefully runs his fingertip over it.", "INT -- ANDY'S CELL -- NIGHT (1951)", "Rita is now on the wall, hanging down over Andy's back.", "TRACK IN to reveal Andy scraping patiently at the concrete.", "He hears FOOTSTEPS approaching. He smoothes the poster down", "and dives into bed. A GUARD strolls by a moment later,", "shining his flashlight into the cell.", "EXT -- PRISON YARD -- DAY (1953)", "Andy strolls along, whistling softly, hands in both pockets.", "TILT DOWN to his pantleg. Concrete grit trickles out.", "INT -- 2ND TIER -- NIGHT (1962)", "A GUARD strolls the tier, shining his flashlight into the", "cells. He pauses at Andy's bars, playing the beam over the", "sleeping form huddled under the blankets.", "p37 REVERSE ANGLE (FROM INS1DE ANDY'S CELL)", "We see what the guard doesn't: instead of Andy's head under", "the blanket, it's a wadded-up pillow. The flashlight plays", "across the cell, pinning Marilyn Monroe in a circle of", "light.", "ANGLE FROM BEHIND POSTER", "The light illuminates her face through the paper. WIDEN to", "reveal Andy lying in his tunnel, holding his breath. The", "light clicks off. The FOOTSTEPS move on. He gets back to", "work.", "INT -- SHAFT -- NIGHT (1965)", "BOOMING SLOWLY UP the shaft. Rats scurry the pipes.", "Suddenly, r piece of concrete the size of a quarter jumps", "free and plummets down the shaft as the rock-hammer pushes", "through. The pick withdraws, replaced by Andy's peering eye.", "A SERIES OF DISSOLVES (1965 through 1966)", "takes us through the widening of the hole. First as big as a", "tea cup. Then a saucer. Then a dinner plate.", "Andy finally gets his head through, scraping his ears. He's", "got a penlight clenched in his teeth. He peers down into the", "shaft. At the very bottom, maybe 20 feet down, a big ceramic", "pipe runs the length of the cellblock. Beneath its coat of", "grime and dust, the word \"SEWER\" is stenciled.", "EXT -- LOADING DOCK ACCESS -- NIGHT (1966)", "ANGLE LOOKING STRAIGHT DOWN. Below us, Tommy Williams lies", "facedown at Norton's feet. Blood is spreading, fanning out", "oa the pavement. Norton turns, strolls out of frame.", "Again we see: Andy working. Norton pokes his head in.", "Norton crosses to the wall safe and works the dial, his back", "turned. This time, though, we stay on Andy:", "He pulls up his sweater, yanks out a large black book and a", "stack of files, lays them on the desk. He then grabs the", "real ledger and files, jams them down his pants and smoothes", "his sweater down. He picks up the bogus stack, crosses to", "Norton, and shoves everything in.", "INT -- HALLWAY -- NIGHT (1966)", "Norton exits his office and strolls off whistling. PUSH IN", "on the open door. We see Andy at the guard's desk, pulling", "Norton's dress shoes from their box.", "INT -- NORTON'S OFFICE -- MINUTES LATER (1966)", "Andy sorts through Norton's three suits. He pauses, checking", "the gray pinstripe. Nice.", "INT -- CELLBLOCK FIVE -- NIGHT (1966)", "The guard BUZZES Andy through. Andy walks toward us.", "TILT DOWN as he passes by. Yep, he's wearing Norton's shoes.", "INT -- ANDY'S CELL -- NIGHT (1966)", "The lights go out. Andy places the last chess piece. Gazes", "up at Racquel. Smiles. Pulls the rope from under his pillow.", "He stands and unbuttons his prison shirt, revealing Norton's", "gray pinstripe suit underneath. A FLASH OF LIGHTNING floods", "the cell, throwing wild shadows.", "INT -- ANDY'S CELL -- NIGHT (1966)", "The storm rages. Andy, naked, carefully slips Norton's", "folded suit into a large industrial Zip-Lock bag. Next to go", "in are the shoes, chess pieces (already in a smaller bag),", "black ledger en files. Last but not least, a bar of soap", "wrapped in a towel.", "INT -- TUNNEL -- NIGHT (1966)", "Andy, again wearing prison clothes, inches down the tunnel.", "INT -- SHAFT -- NIGHT (1966)", "Andy squeezes through the hole head-first, emerges to the", "waist, He reaches for the opposite wall, manages to snag a", "steel conduit with his fingers.", "Suddenly, a huge rat darts for his hand. Andy yanks away and", "almost plummets head-first down the shaft. He dangles wildly", "upside-down for a moment, arms windmilling, then gets his", "hands pressed firmly against the opposite wall. The rat", "scurries off, pissed.", "Andy snags the conduit again. He contorts out of the hole", "and dangles into the shaft. We now see the purpose for the", "rope: the plastic bag hangs from his ankle with about two", "feet of slack,", "He kicks his legs across the shaft, gets his feet braced.", "Wit3 his back against one wall and feet against the other,", "he starts down the shaft. Sliding dangerously. Using pipes", "for handholds.", "Flinching as rats dart this way and that, scurrying in the", "shadows. He drops the last few feet to the bottom.", "He approaches the ceramic sewer pipe and kneels before it.", "Pulls out the rock-hammer and says a quick silent prayer.", "Raises the rock-hammer high and swings it down with all his", "might. Once, twice -- third time lucky. An enormous eruption", "of sewage cascades into the air as if rocket-propelled, the", "Mount St. Helens of shit. Andy is instantly coated black. He", "turns away and heaves his guts out. The shit keeps coming.", "INT -- SEWER PIPE -- NIGHT (1966)", "Andy peers down through the hole, playing his penlight", "around, The inside diameter is no more than two feet. Tight", "squeeze. Coated with crud. It seems to go on for miles.", "No turning back. He wriggles into the pipe and starts", "crawling, plastic bag dragging behind.", "EXT -- FIELD -- NIGHT (1966)", "Rain is falling in solid sheets. Shawshank is half a mile", "distant. BOOM DOWN to reveal the creek...and PUSH IN toward", "the mouth of the sewer pipe that feeds into it.", "Fingers appear, thrusting through the heavy-gauge wire mesh", "covering the mouth of the pipe. Andy's face looms from the", "darkness, peering out at freedom. He wrenches the mesh", "loose, pushes himself out, and plunges head-first into the", "creek. He comes up sputtering for breath. The water is waist-", "deep.", "He wades upstream, ripping his clothes from his body. He", "gets his shirt off, spins it through the air over his head,", "flings the shirt away. He raises his arms to the sky,", "turning slowly, feeling the rain washing him clean.", "Exultant. Triumphant. A FLASH OF LIGHTNING arcs from horizon", "to horizon.", "INT -- ANDY'S TUNNEL -- DAY (1966)", "Once again, we see stunned faces as CAMERA PULLS BACK.", "INT -- CASCO BANK OF PORTLAND -- MORNING (1966)", "The door opens. Spit-shined shoes enter. DOLLY the shoes to", "the counter.", "TILT UP to Andy. Smiling in Norton's gray pinstripe suit.", "INT -- BANK -- SHORTLY LATER (1966)", "The teller is cutting a cashier's check while the MANAGER", "carefully examines Mr. Stevens' various I.D.s.", "He hands her a package, stamped and addressed. Gives them a", "pleasant smile. Turns and strolls from the bank.", "INT -- OFFICE -- DAY (1966)", "A MAN in shirtsleeves is going through the mail on his desk.", "He finds Andy's package, rips it open. Pulls out the black", "ledger and files. Scans a cover letter. Holy shit. He dashes", "to his door and yanks it open, revealing the words on the", "glass: \"PORTLAND DAILY BUGLE -- Editor In Chief.\"", "INT -- SHAWSHANK PRISON -- DAY (1966)", "Norton walks slowly toward his office. Dazed. The morning", "paper in his hand. He goes wordlessly past the DUTY GUARD", "into his office. Shuts the door. Lays the paper on his desk.", "The headline reads: \"CORRUPTION AND MURDER AT SHAWSHANK.\"", "Below that, the sub-headline: \"D.A. Has Ledger. Indictments", "Expected.\" Norton looks up as SIRENS SWELL in the distance.", "EXT -- SHAWSHANK PRISON -- WIDE SHOT -- DAY (1966)", "For the second time, State Police cruisers go rocketing up", "the road with SIRENS AND LIGHTS.", "INT -- NORTON'S OFFICE -- DAY (1966)", "Norton opens his safe and pulls out the \"ledger\" -- it's", "Andy's Bible. The title page is inscribed by hand: \"Dear", "Warden. You were right. Salvation lay within.\" Norton flips", "to the center of the book -- and finds the pages hollowed", "out in the shape of a rock-hammer.", "EXT -- PRISON -- DAY (1966)", "Police cruisers everywhere. A media circus. REPORTERS jostle", "for position. A colorless DISTRICT ATTORNEY steps forward", "into CLOSEUP, flanked by a contingent of S.ATE TROOPERS.", "ANGLE SHIFTS to reveal Captain Hadley. Staring. Waiting.", "TROOPERS move in, cuffing Hadley's hands behind his back.", "The D.A. drones on. FLASHBULBS POP. Hadley says nothing. His", "face scrunches up. He begins to cry.", "Hadley sobs all the way to the car. The D.A. snaps a gaze up", "toward Norton's window, motions his men to follow.", "INT -- NORTON'S OFFICE -- DAY (1966)", "Norton is staring out the window as they approach the", "building. He goes to his desk, opens a drawer. Inside lies a", "revolver and a box of shells.", "INT -- PRISON CORRIDORS -- DAY (1966)", "The D.A. marches along amidst a phalanx of TROOPERS.", "INT -- NORTON'S OFFICE -- DAY (1966)", "Norton sits blankly at his desk, revolver before him. The", "doorknob rattles, a VOICE is heard:", "The POUNDING starts. Norton dumps the box of bullets out on", "thr desk. He starts sorting them to see which ones he likes.", "OUTSIDE HIS OFFICE", "Troopers hustle the hapless duty guard to Norton's door as", "he fumbles nervously with a huge key ring.", "He starts trying keys in the lock. And as the keys go", "sliding in one after another...", "INT -- NORTON'S OFFICE -- DAY (1966)", "...so do the bullets. Norton is riveted to the door. For", "every key, he loads another bullet. Methodical and grim. He", "gets the final bullet in just as the right key slams home.", "The door bursts open. Men muscle in. Somebody SHOUTS.", "Troopers dive in all directions as Norton raises the gun --", "-- and jams it under his chin. His head snaps back as the", "wall goes red. His swivel chair does a slow half-turn and", "creaks to a final stop. Troopers rise slowly, gazing in", "horror.", "PUSH SLOWLY to the wall to reveal Mrs. Norton's framed", "sampler trickling blood and brains...and we get our final", "Bible lesson for today: \"HIS JUDGMENT COMETH AND THAT RIGHT", "SOON.\"", "EXT -- PRISON YARD -- DAY (1966)", "Mail call. Red hears his name. They pass him a postcard.", "INT -- LIBRARY -- DAY (1966)", "Red sits with an atlas, tracing his finger down the page.", "EXT -- MEXICO -- HIGHWAY -- DAY (1966)", "A red convertible rips along with Andy at the wheel, cigar", "jutting from his grin, warm wind fluttering his tie.", "INT -- MESS HALL -- DAY (1966)", "Heywood is regaling the table with some anecdote about Andy.", "A wild burst of laughter. PUSH IN on Red. Feeling", "melancholy.", "EXT -- FIELDS -- LATE DAY (1966)", "Convicts hoe the fields. Guards patrol on horseback.", "A DISTANT RUMBLE OF THUNDER. Red pauses, gazes off. Storm", "clouds coming in, backlit by the sun. A light drizzle", "begins.", "INT -- PRISON CELL -- NIGHT (1966)", "Red is sleeping. He wakes with a start.", "He senses a presence, looks over his shoulder. There's a", "Rita Hayworth poster on his wall. He gets out of bed. Rita", "just keeps smiling, inscrutable. As Red watches, a brilliant", "round glow builds behind the poster, shining from the", "tunnel. The poster rips free, charred to ash in the blink of", "an eye as a shaft of holy white light stabs into the cell.", "Sunlight. Red staggers back against the glare.", "A whirlwind kicks up, whipping everything into the air. The", "hole in the wall is like a giant vacuum cleaner -- papers,", "book, toiletries, bedding -- if it ain't nailed down, it", "gets sucked down the hole toward the light. Red fights it,", "but the suction drags him closer and closer...", "RED'S POV", "...and CAMERA rockets into the hole, getting sucked down an", "endless tunnel at impossible speed, the ROAR of air mixing", "with his drawn-out SCREAM, closer and closer to the light", "...and erupting out the other side into total silence and a", "beautiful white beach. The Pacific Ocean before us.", "Enormous. Mind-blowing. Beautiful beyond description. All we", "hear now are the gentle sound of waves.", "A lone figure stands at water's edge. CAMERA KEEPS MOVING,", "coming up behind him and TRACKING AROUND to reveal -- Red.", "AERIAL SHOT", "Nothing for a million miles but beach, sky, and water. Red", "is a tiny speck at water's edge. Just another grain of sand.", "INT -- RED'S CELL -- NIGHT (1966)", "Red wakes from the nightmare. He gets out of bed. Moves to", "the barred window of his cell. Peers up at the stars.", "AN IRON-BARRED DOOR", "slides open with an enormous CLANG. A stark room beyond.", "CAMERA PUSHES through. SIX MEN AND ONE WOMAN sit at a long", "table. An empty chair faces them. We are again in:", "INT -- SHAWSHANK HEARINGS ROOM -- DAY (1967)", "Red enters, sits. 20 years older than when we first saw him.", "Red doesn't answer. Just stares off. Seconds tick by. The", "parole board exchanges glances. Somebody clears his throat.", "The parole board just stares. Red sits drumming his fingers.", "CLOSEUP -- PAROLE FORM", "A big rubber stamp SLAMS down -- and lifts away to reveal", "the word \"APPROVED\" in red ink.", "EXT -- SHAWSHANK PRISON -- DAY", "TWO SHORT SIREN BLASTS herald the opening of the main gate.", "It swings hugely open, revealing Red standing in his cheap", "suit, carrying a cheap bag, wearing a cheap hat. He walks", "out, still looking stunned.", "INT -- BUS -- DAY", "Red rides the bus, clutching the seat before him, gripped by", "terror of speed and motion.", "EXT -- BREWSTER HOTEL -- LATE AFTERNOON", "Red arrives at the Brewster, three stories high and even", "less to look at than it used to be.", "INT -- BREWSTER -- LATE DAY", "A BLACK WOMAN leads Red up the stairs toward the top floor.", "INT -- RED'S ROOM -- LATE DAY", "Small, old, dingy. An arched window with a view of Congress", "Street. Traffic noise floats up. Red enters and pauses,", "staring up at the ceiling beam. Carved into the wood are the", "words: \"Brooks Hatlen was here.\"", "INT -- FOODWAY MARKET -- DAY", "Loud. Jangling with PEOPLE and NOISE. We find Red bagging", "groceries. Registers are humming, kids are shrieking. Red", "calls to the STORE MANAGER:", "INT -- EMPLOYEE RESTROOM -- DAY", "Red steps to the urinal, stares at himself in the wall", "mirror.", "A strange east Indian guitar-whine begins. The Beatles.", "George Harrison's \"Within You Without You...\"", "EXT -- STREET -- DAY", "...which carries through as Red walks. People and traffic.", "He keeps looking at the women. An alien species.", "TWO YOUNG WOMEN stroll by in cut-offs and t-shirts.", "EXT -- PARK -- DUSK", "Red finds the park filled with HIPPIES. Hanging out.", "Happening. Here's the source of the music: a radio. A HIPPIE", "GIRL gyrates to the Beatles, stoned, in her own world.", "INT -- PAROLE OFFICE -- DAY", "Red sits across from his PAROLE OFFICER. The P.O. is filling", "out his report.", "INT -- FOODWAY -- DAY", "Bagging groceries. CHILDREN underfoot. One points a toy gun", "at Red, pumping the trigger. Red focuses on the gun,", "listening to it CLICKETY-CLACK. Sparky wheel grinding.", "The kids get swept off by MOM. Red starts bagging the next", "customer. SLOW PUSH IN on Red. Surrounded by MOTION and", "NOISE. Feeling like the eye of a hurricane. People", "everywhere, whipping around him like a gale. Strange. Loud.", "Dizzying. It gets distorted and weird, slow and thick,", "pressing in on him from all sides. The noise level", "intensifies. The hollering of children deepens and distends", "into LOW EERIE HOWLS.", "He's in the grip of a major anxiety attack. Tries to shake", "himself out of it. Can't. Fumbles the final items into the", "bag. Walks away. Trying not to panic. Trying not to run.", "He makes his way through the store. Blinking sweat. He bumps", "into a lady's cart, mumbles an apology, keeps going. Breaks", "into a trot.", "Down the aisle, cut to the left, through the door into the", "back rooms, faster and faster, running now, slamming through", "a door marked \"Employees Only\" into --", "INT -- EMPLOYEE RESTROOM -- DAY", "-- where he slams the door and leans heavily against it,", "shutting everything out, breathing heavily. Alone now.", "He goes to the sink, splashes his face, tries to calm down.", "He can still hear them out there. They won't go away. He", "glances around the restroom. Small. Not small enough.", "He enters a stall. Locks the door. Puts the toilet lid down", "and sits on the john. Better. He can actually reach out and", "touch the walls now. They're close. Safe. Almost small", "enough. He draws his feet up so he can't be seen if somebody", "walks in.", "He'll just sit here for a while. Until he calms down.", "EXT -- STREET -- DUSK", "Red is walking home.", "He pauses at a pawnshop window. An array of handguns.", "The SHOPKEEPER appears at the glass, locking the door and", "flipping the sign: CLOSED.", "INT -- RED'S ROOM -- NIGHT", "Red lies smoking in bed. Unable to sleep.", "He glances up at the ceiling beam. \"Brooks Hatlen was here.\"", "EXT -- COUNTRY ROAD -- MORNING", "A pickup truck rattles up the road trailing dust and pulls", "to a stop. Red hops off the back, waves his thanks. The", "truck", "drives on. Red starts walking. PAN TO a roadside sign:", "BUXTON.", "EXT -- MAINE COUNTRYSIDE -- DAY", "High white clouds in a blazing blue sky. The trees fiery", "with autumn color. Red walks the fields and back-roads,", "cheap compass in hand. Looking for a certain hayfield.", "EXT -- COUNTRYSIDE -- DAY", "Walking. Searching. The day turning late. Red finds himself", "staring at a distant field. There's a long rock wall, like", "something out o f a Robert Frost poem. Big oak tree. Red", "checks his compass. North end. He crosses a dirt road into", "the field.", "EXT -- HAYFIELD -- DAY", "Red walks the long rock wall, nearing the tree. A squirrel", "scolds him from a low branch, scurries up higher. Red", "studies the base of the wall. Nothing unusual here. Just a", "bunch of rocks set in stone. He sighs. Fool's errand. Turns", "to go.", "Something catches his eye. He walks back, squats, peering", "closer. Wets a fingertip and rubs a stone. A layer of dust", "comes off. Volcanic glass. Gleaming black. He tries to get", "the rock out, anticipation growing. It won't come; it's too", "smooth. He pulls a pocketknife and levers the rock free. It", "tumbles at his feet, leaving a ragged hole.", "Red leans down and solves the mystery at last, staring at", "the object buried under the rock. Stunned. It's an envelope", "wrapped in plastic. Written on it is a single word: \"Red.\"", "Red pulls the envelope out and rises. He just stares at it", "for a while, almost afraid to open it. But open it he does.", "Inside is a smaller envelope and a letter. Red begins to", "read:", "By now, tears are spilling silently down Red's cheeks. He", "opens the other envelope and fans out a stack of new fifty-", "dollar bills. Twenty of them. A thousand dollars.", "INT -- RED'S ROOM -- DAY (1967)", "Red is dressed in his suit. He finishes knotting his tie,", "puts his hat on. His bag is by the door. He takes one last", "look around. Only one thing left to do. He pulls a wooden", "chair to the center of the room and gazes up at the ceiling", "beam.", "He steps up on the chair. It wobbles under his weight.", "INT -- BREWSTER -- RED'S DOOR -- DAY (1967)", "The door opens. Red exits with his bag and heads down the", "stairs, leaving the door open. CAMERA PUSHES through,", "BOOMING UP to the ceiling beam which reads: \"Brooks Hatlen", "was here.\"", "A new message has been carved alongside the old: \"So was", "Red.\"", "INT -- GREYHOUND BUS STATION -- DAY (1967)", "TRACKING SHOT reveals a long line of people at the counter.", "CAMERA brings us to Red, next in line, bag by his feet.", "EXT -- TRAVELING SHOT -- DAY (1967)", "A gorgeous New England landscape whizzes by, fields and", "trees a blur of motion. ANGLE SHIFTS to reveal a Greyhound", "Sceni- Cruiser barreling up the road, pulling abreast of us.", "CAMERA TRAVELS from window to window, passing faces. We", "finally come to Red gazing out at the passing landscape.", "THE BUS", "ROARS past camera, dwindling to a mere speck on the horizon.", "EXT -- BEACH -- WIDE PANORAMIC SHOT -- DAY (1967)", "A distant boat lies on its side in the sand like an old", "wreck that's been left to rot in the sun. There's someone", "out there.", "CLOSER ON BOAT", "A MAN is meticulously stripping the old paint and varnish by", "hand, face hidden with goggles and kerchief mask.", "Red appears b.g., a distant figure walking out across the", "sand, wearing his cheap suit and carrying his cheap bag.", "The man on the boat pauses. Turns slowly around. Red arrives", "with a smile as wide as the horizon. The other man raises", "his goggles and pulls down his mask. Andy, of course.", "Red shrugs off his jacket and picks up a sander. Together,", "they start sanding the hull as we"]}