{"GRUMPY": [" Three of a kind.  Let's do this.", " There's two on the roof.  Every guy is an extra share.  Five shares is plenty.", " Yeah?  He thinks he can sit it out and still take a slice then I get why they call him the Joker.", " Obviously, we don't want you doing anything with your hands other than holding on for dear life.", " He's got three left?", " Where'd you learn to count?!", " A mob bank.  Guess the Joker's as crazy as they say.", " Where's the alarm guy?", " Funny, he told me something similar...", " C'mon, there's a lot to carry...", " If this guy was so smart he would have had us bring a bigger car.", " I'm betting the Joker told you to kill me soon as we loaded the cash.", " Bus driver?  What bus-"], "CHUCKLES": [" That's it?  Three guys?", " Six shares.  Don't forget the guy who planned the job."], "HAPPY": [" Why do they call him the Joker?", " Make-up?", " Is it a problem?", " They wired this thing up with 5,000 volts.  What kind of bank does that?", " Boss told me when the guy was done I should take him out.  One less share."], "DOPEY": [" I heard he wears make-up.", " Yeah.  To scare people.  War paint.", " Here comes the silent alarm. And there it goes.  That's funny.  It didn't dial out to 911-  it was trying to reach a private number.", " No, no.  I'm done here."], "BANK MANAGER": [" You have any idea who you're stealing from?  You and your friends are dead.", " Think you're smart, huh?  Well, the guy who hired you's just do the same to you...", " Sure he will.  Criminals in this town used to believe in things...", " Honor.  Respect.  What do you believe, huh?  What do you bel-"], "BOZO": [" No.  I kill the bus driver."], "THE JOKER": [" I believe that what doesn't kill you...", " ...simply makes you stranger.", " I thought I told bad jokes.", " How about a magic trick?", " A year ago these cops and lawyers wouldn't dare cross any of you.  What happened?  Did your balls drop off? See, a guy like me-", " A guy like me... I know why you're holding your little group therapy session in broad daylight.  I know why you're afraid to go out at night. Batman.  He's shown Gotham your true colors.  And Dent's just the beginning. And as for his so-called plan- Batman has no jurisdiction.  He'll find him and make him squeal. I can tell the squealers every time.", " It's simple.  Kill the Batman.", " Like my mother used to tell me- if you're good at something, never do it for free.", " Half.", " Let's not blow this out of all proportion.", " Let me know when you change your minds.", " How about alive?", " Wanna know how I got these scars?  My father was a drinker and a fiend. He'd beat mommy right in front of me. One night he goes off crazier than usual, mommy gets the kitchen knife to defend herself.  He doesn't like that.  Not.  One.  Bit.", " So, me watching, he takes the knife to her, laughing while he does it. Turns to me and says 'why so serious?'  Comes at me with the knife- 'why so serious?'  Sticks the blade in my mouth- 'Let's put a smile on that face' and...", " Why so serious?", " Now, our organization is small, but we've got a lot of potential for aggressive expansion... so which of you fine gentlemen would like to join our team?", " Only one slot open right now- so we're going to have try-outs.", " Make it fast.", " This is how crazy Batman's made Gotham.  You want order in Gotham? Batman has to go.  So... Batman must take off his mask, and turn himself in.", " Good evening.  We're the entertainment.", " I only have one question: where is Harvey Dent? I'll settle for his loved ones...", " You know, you remind me of my father. I hated my father.", " Hello, beautiful.  You must be Harvey's squeeze. And you are beautiful.  You look nervous- it's the scars isn't it? Wanna know how I got them?  I had a wife,  beautiful like you.  Who tells me I worry too much.  Who says I need to smile more.  Who gambles.  And gets in deep with the sharks.  One day they carve her face, and we've got no money for surgeries.  She can't take it. I just want to see her smile again. I just want her to know I don't care about the scars.  So I put a razor in my mouth and do this to myself... And you know what? She can't stand the sight of me... She leaves!  See, now I see the funny side.  Now I'm always smiling.", " A little fight in you.  I like that.", " Sure.  Just take off your mask and show us all who you are...", " Very poor choice of words...", " I'm a man of my word.", " Anyone could be driving that thing- stay on Dent.", " Do me up-", " Whoever he was... he ain't now.", " Tee 'em up.", " Guess it was him.", " Hit me.  Come on.  Hit me.", " Just give me a second.", " Evening, Commissioner.", " Of course not.", " Me?  I was right here.  Who did you leave him with?  Your people? Assuming, of course, that they are your people not Maroni's... Does it depress you, Lieutenant, to know how alone you are?", " Does it make you feel responsible for Harvey Dent's current predicament?", " What time is it?", " Depending on the time, he might be in one spot. Or several.", " The good cop, bad cop routine?", " Never start with the head... victim gets fuzzy.  Can't feel the next-", " See?", " I wanted to see what you'd do.  And you didn't disappoint... You let five people die.", " Those mob fools want you gone so they can get back to the way things were. But I know the truth- there's no going back.  You've changed things. Forever.", " Kill you?  I don't want to kill you. What would I do without you?  Go back to ripping off Mob dealers?  No you... You.  Complete.  Me.", " Don't talk like one of them- you're not, even if you'd like to be.  To them you're a freak like me... they just need you right now.", " But as soon as they don't, they'll cast you out like a leper.", " Their morals, their code... it's a bad joke.  Dropped at the first sign of trouble.  They're only as good as the world allows them to be.  You'll see- I'll show you... when the chips are down, these civilized people... they'll eat each other. See, I'm not a monster... I'm just ahead of the curve.", " You have these rules.  And you think they'll save you.", " Then that's the one you'll have to break.  To know the truth.", " The only sensible way to live in this world is without rules.  Tonight you're going to break your one rule...", " There are just minutes left- so, you'll have to play my little game if you want to save... ...one of them.", " For a while I thought you really were Dent, the way you threw yourself after her-", " Look at you go... does Harvey know about you and his-?", " Killing is making a choice...", " ...you choose one life over the other.  Your friend, the district attorney.  Or his blushing bride-to- be.", " You have nothing.  Nothing to threaten me with.  Nothing to do with all your strength... But don't worry, I'm going to tell you where they are.  Both of them, and that's the point- you'll have to choose.", " He's at 250 52nd Boulevard.  And she's on avenue X at Cicero.", " I want my phone call.", " How many of your friends have I killed?", " You know why I use a knife, Detective?  Guns are too quick.  You don't get to savor all the little emotions.  See, in their last moments, people show you who they really are...", " So, in a way, I knew your friends better than you ever did. Would you like to know which of them were really cowards?", " I want my phone call.", " Hello there.", " I told you- I'm a man of my word. Where's the Italian?", " I'm a man of simple tastes.  I like gunpowder.  Dynamite...", " ...gasoline...", " And you know what they have in common?  They're cheap.", " I am.", " I'm only burning my half.", " All you care about is money.  This city deserves a better class of criminal, and I'm going to give it to them.  This is my town now.  Tell your men they work for me.", " Cut him up and offer him to his little Princes.  Let's show him just how loyal a hungry dog is.", " It's not about money.  It's about sending a message...", " Everything.  Burns.", " I don't want there to be any hard feelings between us, Harvey.", " When you and Rachel were being abducted I was sitting in Gordon's cage.  I didn't rig those charges-", " Do I really look like a guy with a plan, Harvey?  I don't have a plan...The mob has plans, the cops have plans.  You know what I am, Harvey?", " I'm a dog chasing cars... I wouldn't know what to do with one if I caught it.  I just do things.  I'm just the wrench in the gears.  I hate plans. Yours, theirs, everyone's.  Maroni has plans.  Gordon has plans. Schemers trying to control their worlds.  I'm not a schemer, I show the schemers how pathetic their attempts to control things really are.  So when I say that you and your girlfriend was nothing personal, you know I'm telling the truth...", " It's the schemers who put you where you are.  You were a schemer.  You had plans.  Look where it got you.  I just did what I do best- I took your plan, and I turned it on itself. Look what I've done to this city with a few drums of gas and a couple of bullets.  Nobody panics when the expected people get killed.  Nobody panics when things go according to plan, even if the plan is horrifying. If I tell the press that tomorrow a gangbanger will get shot, or a truckload of soldiers will be blown up, nobody panics.  Because it's all part of the plan.  But when I say that one little old mayor will die, everybody loses their minds! Introduce a little anarchy, you upset the established order and everything becomes chaos.  I'm an agent of chaos.  And you know the thing about chaos, Harvey?", " It's fair.", " Now you're talking.", " What does it take to make you people want to join in..?", " You failed to kill the lawyer... I've got to get you off the bench and into the game.  So, here it is...", " Come nightfall, this city is mine, and anyone left here plays by my rules.  If you don't want to be in the game, get out now.", " But the bridge-and-tunnel crowd are in for a surprise.", " Each of you has a remote to blow up the other boat.", " You came.  I'm touched.", " All the old familiar places.", " If we don't stop fighting, we're going to miss the fireworks.", " Can't rely on anyone these days.", " Have to do everything yourself.  I always have- and it's not always easy...", " Just couldn't let me go, could you? I guess this is what happens when an unstoppable force meets an immovable object.  You truly are incorruptible, aren't you?", " You won't kill me out of some misplaced sense of self- righteousness... and I won't kill you because you're too much fun.  We're going to do this forever.", " Maybe we can share it.  They'll need to double up, the rate this city's inhabitants are losing their minds...", " Till their spirit breaks completely. Until they find out what I did with the best of them.  Until they get a good look at the real Harvey Dent, and all the heroic things he's done. Then those criminals will be straight back onto the streets and Gotham will understand the true nature of heroism.", " I took Gotham's white knight.  And I brought him down to my level.  It wasn't hard- madness is like gravity. All it takes is a little push."], "DEALER": [" No, man.  I don't like it tonight."], "BUYER": [" What're you, superstitious?  You got more chance of winning the powerball than running into him..."], "ENGEL": [" Mr Mayor, you were elected on a campaign to clean up the city... when are you going to start?", " Like this so-called Batman- a lot of people say he's doing some good that criminals are running scared... but I say NO.  What kind of hero needs to wear a mask?  You don't let vigilantes run around breaking the law... where does it end?", " ...Police released video footage found concealed on the body. Sensitive viewers be aware: it is disturbing.", " With no word from the Batman- even as they mourn Commissioner Loeb, these cops have to be wondering if the Joker is going to make good on his threat to kill the Mayor today...", " ...he's a credible source- an A and M lawyer for a prestigious consultancy. He says he's waited as long as he can for the Batman to do the right thing...", " Now he's taking matters into his own hands.  We'll be live at five with the true identity of the Batman, stay with us...", " Caller, you're on the air.", " Guy's got a point- Dent didn't want Batman to give himself up, is this the right thing to do?", " And we wish him a speedy recovery. God knows we need him, now.  Let's take another call-", " Who is this?", " Commissioner?!  You really think someone would try to-", " Thanks."], "MAYOR": [" Well, Mike-", " I'm told our men in the Major Crimes Unit are close to an arrest.", " DENT!  What was that circus?!", " 549 criminals at once?!  How did you convince Surrillo to hear this farce?", " Even if you blow enough smoke to get convictions out of Surrillo, you'll set a new record at appeals for quickest kick in the ass.", " The public likes you, Dent.  That's the only reason this might fly.", " Followed swiftly by you and me-", " Back from the dead.", " What do we got?", " Go home, Gordon.  The clown'll keep till morning.  Get some rest- you're going to need it.  Tomorrow, you take the big job. You don't have any say in the matter. Commissioner Gordon.", " Land routes East?", " The men you and Dent put away?  Those aren't people I'm worried about."], "(MORE)": ["", "", "", "", "", "", "", "", "", "", ""], "ENGEL (cont'd)": [" Yet, we hear rumors that instead of trying to arrest him the cops are using him to do their dirty work."], "RAMIREZ": [" Hey, Wuertz- the Mayor says you're closing in on the Batman.", " Ever intending to see your wife again, Lieutenant?", " They checked her back into hospital.", " Least there she's got someone round the clock.  Unlike your wife. He hasn't shown?", " Why wouldn't he come?", " He can't resist showing us his face.", " Give us a minute, please, people!", " You're gonna want to see this.", " That Joker card pinned to the body? Forensics found three sets of D.N.A..", " All three.", " The D.N.A. belongs to Judge Surrillo, Harvey Dent and Commissioner Loeb.", " City hall.", " Harvey Dent.", " Us contaminate it?  It's because of you that these guys are dead in the first place-", " Let him be!  He's been through enough-", " I figured, counselor.", " 250, 52nd street.  Leave as soon as the patrol car pulls out.", " I didn't know-", " I'm sorry- they got me early on.  My mother's medical bills and my-", " I took a little from them- once they've got you, they keep you.  I'm sorry."], "WUERTZ": [" The investigation is ongoing.", " It's my day off.", " What?  You need me to shake it for-", " Dent, I thought you was...dead...", " It must've been Maroni's men-", " I don't know- he'd never tell me. I swear to God, I didn't know what they were gonna do to you-"], "GORDON": [" I thought you had to go look after your mother, detective.", " I'm sorry.", " Often doesn't.  But I like reminding everybody that he's out there.", " Hopefully...  Because he's busy.", " Put this out, by morning we can put a big top over central holding and sell tickets.  What's he hiding under that makeup?", " Another bunch of small timers.", " My detectives have been making drug buys with them for weeks.  This bank was another drop for the mob.  That makes five banks- we've found the bulk of their dirty cash.", " What about this Joker guy?", " We'll have to hit all banks simultaneously.  SWAT teams, backup.", " When the new DA gets wind of this, he'll want in.", " Be hard to keep him out.", " I hear he's as stubborn as you.", " Word is you've got a hell of a right cross.  Shame Sal's going to walk.", " We liaise with various agencies-", " Official policy is to arrest the vigilante known as Batman on sight.", " If you have any concerns about... malfunctioning equipment... take them up with maintenance, counselor.", " In this town, the fewer people know something, the safer the operation.", " If I didn't work with cops you'd investigated while you were making your name at I.A.- I'd be working alone.  I don't get political points for being an idealist- I have to do the best I can with what I have.", " I can give you the names of the banks.", " You don't have to sell me, Dent.  We all know you're Gotham's white knight.", " Yeah?  All that was left in the vaults were the marked bills- they knew we were coming!  As soon as your office got involved, there's a leak-", " Don't try to cloud the fact that clearly Maroni's got people in your office, Dent.", " We're going after the mob's life savings.  Things will get ugly.", " He does that.", " Charge them with what?", " He can't go to County.  I'll keep him here in the holding cells.", " You trust them over at County?", " Lau stays.", " I am, counselor.", " Our boy looks good on the tube.", " Don't worry, they're coming, too.", " Forty-nine, sir.", " Any matches?", " The Joker's telling us who he's targeting- get a unit to Surrillo's house, tell Wuertz to find Dent- get them both into protective custody. Where's the Commissioner?", " Seal the building.  No one in or out till I get there.", " We're secure.  I want a floor-by- floor search of the entire building. I'm sorry, sir.  We believe the Joker has made a threat against your life.", " Sir, the Joker card had a trace of your D.N.A. on it-", " Somebody with access to your house or office must've lifted a tissue or a glass...", " Wait-", " Get a medic!", " As long as they don't get to Lau, we've cut off their funds.", " What about Dent?", " Patrick Harvey.  Richard Dent...", " Ramirez.", " That's brick- you're gonna try and take ballistics off a shattered bullet?", " Whatever you're gonna do, do it fast, 'cos we know his next target...", " How's it looking up top?", " We got you, you son of a bitch.", " We got him, Harvey.", " Stand away!  All of you.  I don't want anything for his mob lawyer to use, understand?  Handle this guy like he's made of glass.", " I couldn't chance my family's safety.", " Nothing.  No matches on prints, DNA, dental.  Clothing is custom, no labels.  Nothing in his pockets but knives and lint.  No name, no other alias... nothing.", " I couldn't tell you.  I couldn't risk-", " Actually, this time I saved him.", " Has he said anything, yet?", " Harvey Dent never made it home.", " What have you done with him?", " Where is he?", " What difference does that make?", " If we're going to play games, I'm going to need a cup of coffee.", " Not exactly.", " He's in control.", " Which one are you-", " With Lau? The Joker planned to be caught.  He wanted me to lock him up in M.C.U..", " I'm sorry about Rachel. The Doctor says you're in agonizing pain but you won't accept medication. That you're refusing skin grafts-", " Harvey, I can't-", " Two-face.  Harvey two-face.", " I... I know you tried to warn me. I'm sorry.  Wuertz picked you up- was he working for them? Do you know who picked up Rachel? Harvey, I need to know which of my men I can trust.", " I'm sorry, Harvey.", " You should have thought of that before you let the clown out of the box.", " Call in every officer- tell them to head to their nearest hospital and start evac and search.  Call the transit authority, school board, prisons- get every available bus down to a hospital- the priority is Gotham General- wheel everybody out of that place right now- my hunch is that's where the bomb is.", " That's where Harvey Dent is.", " To get Reese.", " Get the cars around back!", " Well, maybe Batman will save you.", " Berg, isn't it?", " You okay, son?", " I'm gonna need your weapon, son.", " Yeah.  That would be why.", " You okay, Mr.Wayne?", " That was a brave thing, you did.", " You weren't protecting the van?", " You don't watch a whole lot of news, do you, Mr.Wayne?", " Not today, I wouldn't.", " Gotham general... Did you get Dent out?", " You must know how many were inside- you've got patient lists, roll calls-", " Yeah?  What's your guess about where Harvey Dent is?", " Keep looking.  Keep it to yourself.", " My officers are going over every inch of the tunnels and bridges, but with the Joker's threat they're not and option.", " Backed up for hours.  Which leaves the ferries with thirty thousand waiting to board.  Plus, corrections are at capacity, so I want to use a ferry to take some prisoners off the island.", " You should be- they're the people you least want to be stuck with in an emergency.  Whatever the Joker's planning, it's a good bet that Harvey's prisoners might be involved. I want 'em out of here.", " Then we have a hostage situation.", " It's a shooting gallery.  Why'd he choose a spot with such big windows?", " Let's do it.", " What's simple, is that every second we don't take him, those people on the ferries get closer to blowing each other up!", " Then he'll blow them both up! There's no time- we have to go in now-", " That's why we can't wait- we can't play his games-", " No.  There's no time.  We have clear shots.", " Dent's in there with them.  We have to save Dent!  I have to save Dent! Get ready-", " Two minutes.  Then you breach.", " Hello?  Barbara, calm down-", " Harvey?  What the hell's going on?", " Dent?", " I know.  I was here.  Trying to save her.", " I couldn't.", " I was trying to fight the mob-", " Harvey.  Put the gun down.  You're not going to hurt my family.", " Put the gun down.", " Please, Harvey...", " Goddamit.  Stop pointing that gun at my family, Dent.", " I'm sorry, Harvey.  For everything. But, please.  Please don't hurt him.", " All they know is there's a situation. They don't know who, or what. They're just creating a perimeter.", " No one needs to escape, because no one's done anything wrong.  And nobody has to.", " You're right, Harvey.  Rachel's death was my fault.  But punish me-", " It's going to be all right, son.", " Thank-you.", " Yes, I do.", " The Joker won.", " Harvey's prosecution, everything he fought for, everything Rachel died for.  Undone.  Whatever chance Gotham had of fixing itself... whatever chance you gave us of fixing our city...  dies with Harvey's reputation.  We bet it all on him. The Joker took the best of us and tore him down.  People will lose all hope.", " Five dead?  Two of them cops?  We can't sweep that under-", " You?  You can't-", " No, you can't!  You're not!", " ...a hero.  Not the hero we deserved- the hero we needed.  Nothing less than a knight.  Shining...", " Because we have to chase him...", " Because..."], "CHECHEN": [" That's why we bring dogs.", " My little princes... The Batman's invisible to you fools... but my little princes... they can find human meat in complete darkness.", " Look!  Look what your drugs did to my customers!", " My business is repeat customers.", " Come on, sonofbitch- my dogs are hungry, pity there's only one of you...", " How you know?", " Who's stupid enough steal from us?", " Who the hell is that?", " You promised safe, clean money launder-", " What stops them getting to you?", " Sit.  I wanna hear proposition.", " What you propose?", " How much you want?", " I put word out.  We hire the clown. He was right.  We have to fix real problem.  Batman.", " Like I say- not so crazy as you look.", " More for us.  What you do with all your money, Mr.Joker?", " You said you were a man of your word.", " They won't work for a freak."], "JUNKIE": [" No!  No get 'em off me!  Off me!"], "VOICE (O.S.)": [" Buyer beware...", " 8th at orchard.  You'll find Harvey Dent there.", " Mr.Fox?  Security is showing a break- in at the R and D department."], "SCARECROW": [" I told your man my compound would take you places.  I never said they'd be places you wanted to go.", " If you don't like what I have to offer, buy from someone else. Assuming Batman left anyone else to buy from.", " Not the real thing.", " We're old friends.", " That's more like it.", " Not my diagnosis."], "BODYGUARD": [" He's here.", " Somebody here for you.", " They say they've killed the Joker. They've come for the reward.", " They say they've brought the body.", " Coming."], "CHECHEN (CONT’D)": [" Loose the dogs!"], "\"BATMAN\"": [" We're trying to help you!", " You need us!  There's only one of you- it's war out here!", " What gives you the right?!  What's the difference between you and me?!"], "BATMAN": [" I don't need help.", " Don't let me find you out here again.", " I'm not wearing hockey pads.", " Him again.  Who are the others?", " Some of the marked bills I gave you.", " Time to move in.", " One man or the entire mob?  He can wait.", " Do you trust him?", " If I get him to you, can you get him to talk?", " Then you're going to love me.", " Drop the knife.", " Let her go.", " Are you alright?", " He's safe.", " I need ten minutes with the scene before your men contaminate it.", " No.  Fingerprints.", " I want the Joker.", " I'm counting on it.", " Where is he?", " He must have friends.", " Someone knows where he is.", " You'd leave a man's life to chance?", " His name's Schiff, Thomas.  He's a paranoid schizophrenic, a former patient at Arkham.  The kind of mind the Joker attracts.", " What do expect to learn from him?", " You're the symbol of hope that I could never be.  Your stand against organized crime is the first legitimate ray of light in Gotham for decades.  If anyone saw this, everything would be undone- all the criminals you got off the streets would be released.  And Jim Gordon will have died for nothing.", " You're going to call a press conference.  Tomorrow morning.", " No one else will die because of me. Gotham is in your hands, now.", " You wanted me.  Here I am.", " Where's Dent?", " Then why do you want to kill me?", " You're garbage who kills for money.", " Where's Dent?", " I have one rule.", " Which is?", " I'm considering it.", " Them?", " WHERE ARE THEY?!", " WHERE ARE THEY?!", " Dent knew the risks.", " I'm sorry, Harvey.", " Beautiful.  Isn't it?", " And high frequency generator/receiver.", " I've got to find this man, Lucius.", " The database is null-key encrypted. It can only be accessed by one person.", " Trust me.", " This is the audio sample.", " If he talks within range of any phone in the city, you'll be able to triangulate his position.", " When you've finished, type your name to switch it off.", " Fox?  There's something going on on the ferries...", " Do you have a location on the Joker?", " I have the Joker's location-", " Prewitt building.  Assemble on the building opposite.", " He likes the view.", " It's not that simple.  With the Joker, it never is.", " That won't happen.", " There's always a catch with him-", " I need five minutes.  Alone-", " Fox.  I need picture.", " Don't.  Move.", " Where's the detonator?", " There won't be any fireworks.", " What were you hoping to prove?  That deep down, we're all as ugly as you?", " You're alone.", " No.  But I know how you get these-", " You'll be in a padded cell, forever.", " This city just showed you it's full of people ready to believe in good.", " What did you do?", " Lucius.  Find Harvey Dent.", " You don't want to hurt the boy, Dent.", " Nothing fair ever came out of the barrel of a gun, Dent.", " What happened to Rachel wasn't chance.  We decided to act.  We three.  We knew the risks and we acted as one.  We are all responsible for the consequences.", " It wasn't.", " Because you were the best of us.  He wanted to prove that even someone as good as you could fall.", " But your fooling yourself if you think you're letting chance decide. You're the one pointing the gun, Harvey.  So point it at the people who were responsible.  We all acted as one.  Gordon.  Me.  And you.", " You don't have to-", " No.  They won't. They can never know what he did.", " No.  But the Joker cannot win.", " Gotham needs its true hero.", " Yes, I can.", " You either die a hero or live long enough to see yourself become the villain. I can do those things because I'm not a hero, like Dent.  I killed those people.  That's what I can be.", " I'm whatever Gotham needs me to be."], "ALFRED": [" Be nice when Wayne Manor's rebuilt and you can swap not sleeping in a penthouse for not sleeping in a mansion.", " You ought to be pretty knowledgeable by now, then.", " I'm sure Mr.Fox can oblige. Did you get mauled by a tiger?", " Perhaps you could hire some of them and take weekends off.", " I know.  But things are improving. Look at the new District Attorney...", " Are you interested in his character... or his social circle?", " Well, I trust you're not following me on my day off.", " Know your limits, Master Wayne.", " Well, you do, sir.", " And what happens the day you find out?", " That day, Master Wayne, even I won't want to.  Probably.", " I found one.  In Arizona.  Very nice man says it will take him a week to get it running.  And he takes cash. What about a flight crew?", " Oh, yes.", " I believe your plane is here.", " If you can tell me the Russian for 'apply your own bloody suntan lotion.’", " I think your fundraiser will be a great success, sir.", " I assumed it was your usual reason for socialising beyond myself and the scum of Gotham's underbelly: to try and impress Miss Dawes.", " A little liquid courage, Mr.Dent?", " Yes, sir.", " Not yet, sir.", " Oh, you have no idea.", " You crossed it first, sir.  You've hammered them, squeezed them to the point of desperation.  And now, in their desperation they've turned to a man they don't fully understand.", " Respectfully, Master Wayne, perhaps this is a man you don't fully understand, either.", " I was in Burma.  A long time ago.  My friends and I were working for the local government.  They were trying to buy the loyalty of tribal leaders, bribing them with precious stones. But their caravans were being raided in a forest north of Rangoon by a bandit.  We were asked to take care of the problem,  so we started looking for the stones.  But after six months, we couldn't find anyone who had traded with him.", " One day I found a child playing with a ruby as big as a tangerine. The bandit had been throwing the stones away.", " Because he thought it was good sport. Because some men aren't looking for anything logical, like money... they can't be bought, bullied, reasoned or negotiated with. Some men just want to watch the world burn.", " I'm not sure you made it loud enough, sir.", " Got one.  Melvin White, aggravated assault, moved to Arkham twice- 1502 Randolph Apartments, just off State-", " Even the logs?", " Endure, Master Wayne.  Take it. They'll hate you for it, but that's the point of Batman... he can be the outcast.  He can make the choice no one else can face.  The right choice.", " Today, I don't want to. Although I did bloody tell you.", " I suppose they'll lock me up as well. Your accomplice.", " I don't know.  He went down to the press conference-", " Perhaps both Bruce and Mr.Dent believe that Batman stands for something more important than a terrorist's whims, Miss Dawes, even if everyone hates him for it.", " How will I know?", " Goodbye, Rachel.", " I prepared a little breakfast.", " Very well.", " Yes, Master Wayne?", " You have inspired good.  But you spat in the face of Gotham's criminals- didn't you think there might be casualties?  Things were always going to have to get worse before they got better.", " Rachel believed in what you stood for.  What we stand for.", " Gotham needs you.", " Which is why for now, they'll have to make do with you.", " It can wait.", " We burned the forest down.", " You need to see this.", " Looking for?", " Will you be taking the batpod, sir?", " The Lamborghini then. Much more subtle.", " Nothing on them.  No immediate family members admitted to a Gotham hospital.", " Burns is clean... Zachary..."], "ALFRED (CONT’D)": [" When you stitch yourself up you make a bloody mess."], "WAYNE": [" But I learn from my mistakes.", " My armor... I'm carrying too much weight- I need to be faster.", " A dog. A big dog.  There were more copycats last night, Alfred.  With guns.", " This wasn't exactly what I had in mind when I said I wanted to inspire people.", " I am.  Closely.  I need to know if he can be trusted.", " Who Rachel spends her time with is her business.", " If you ever took one, I might.", " Batman has no limits.", " I can't afford to know them.", " We all know how much you like to say 'I told you so'.", " OK.  Cancel the deal.", " I needed a closer look at their books.", " I need a new suit.", " I'm not talking about fashion, Mr.Fox, so much as function.", " Sure make backing out of the driveway easier.", " Rachel!  Fancy that.", " Rachel, Natascha.  Natascha, Rachel.", " I certainly hope not.", " Let's put a couple tables together.", " They should!  I own the place.", " How'd you know?", " Prima ballerina for the Moscow Ballet.", " You're into ballet, Harvey?", " I was raised here.  I turned out OK.", " The Palisades?  Sure.  You know, as our new D.A. you might want to figure out where your jurisdiction ends.", " Exactly.  Who appointed the Batman?", " Well, you've sold me, Dent.  I'm gonna throw you a fundraiser.", " I don't think you understand.  One fundraiser with my pals, you'll never need another cent.", " I'm sure you've always wanted to go to Hong Kong.", " I think Mr.Lau deserves a more personal touch.", " How about getting back into the plane?", " Without it landing.", " Sorry.", " We wouldn't want things getting too easy, would we? How will it hold up against dogs?", " South Korean smugglers.  They run flights into Pyongyang, below radar the whole way.  Did you think of an alibi?", " You look tired, Alfred.  Will you be all right without me?", " How's the view from L.S.I.Holdings?", " What's this?", " Sonar.  Just like a b-", " And the other device?", " How's it going?", " And why do you think I wanted to hold a party for Harvey Dent?", " Very droll.  But very wrong. Actually it's Dent.  You see-", " Sorry, I'm late- glad you started without me!  Where's Rachel?!", " Rachel Dawes- my oldest friend.  When she told me she was dating Harvey Dent, I had one thing to say...  the guy from those god-awful campaign commercials?", " 'I Believe in Harvey Dent.'  Nice slogan, Harvey.  Certainly caught Rachel's attention.  But then I started paying attention to Harvey, and all he's been doing as our new D.A., and you know what?  I believe in Harvey Dent.  On his watch, Gotham can feel a little safer.  A little more optimistic.  So get out your checkbooks and let's make sure that he stays right where all of Gotham wants him... All except Gotham's criminals, of course.  To the face of Gotham's bright future- Harvey Dent.", " I meant every word.", " The day you once told me about, the day when Gotham no longer needs Batman.  It's coming.", " It's happening now- Harvey is that hero.  He locked up half the city's criminals, and he did it without wearing a mask.  Gotham needs a hero with a face.", " They've come for him.", " Stay hidden.", " Targeting me won't get their money back.  I knew the mob wouldn't go down without a fight, but this is different.  They've crossed a line.", " Criminals aren't complicated, Alfred. We just have to figure out what he's after.", " What were you missing?", " So why was he stealing them?", " And here's a thumb print.", " Yes.  Government telecommunications project.", " Lucius.  I'm playing this one pretty close to the chest.", " I've run it through all the databases and came up with four possibles.", " Overlooking the parade.", " I have no choice.", " Perhaps not.  But I've got enough blood on my hands.  I've seen, now, what I would have to become to stop men like him.", " You once told me that if the day came when I was finished...", " We'd be together.", " But did you mean it?", " Anything that could lead back to Lucius or Rachel.", " People are dying, Alfred.  What would you have me do?", " Today I've found out what Batman can't do.  He can't endure this. Today you get to say 'I told you so'.", " Accomplice?  I'm going to tell them the whole thing was your idea.", " Alfred?", " Did I bring this on us?  On her?  I thought I would inspire good, not madness-", " But Rachel, Alfred...", " Gotham needs its hero.  And I let the Joker blow him half to hell-", " She was going to wait for me.  Dent doesn't know.  He can never know...", " What's that?", " That bandit, in the forest in Burma...  Did you catch him? How?", " I need you plugged in, checking Gordon's men and their families.", " Hospital admissions.", " In the middle of the day?  Not very subtle, Alfred.", " I saw O'Brien and Richards...", " I saw Burns and Zachary... and a patrolman I don't know.", " There's at least one I don't know- send the information to Gordon-", " Call me Bruce.  I think so.", " Trying to catch the light?", " Why?  Who's in it?", " It can get a little intense.  Think I should go to hospital?", " That's why I gave it to you.  Only you can use it."], "DENT": [" Sorry I'm late, folks.", " Worried you'd have to step up?", " Well, then, fair's fair: heads, I'll take it.  Tails, he's all yours.", " My father's lucky coin.  As I recall, it got me my first date with you.", " I don't. I make my own luck.", " Tee-off's 1:30.  More than enough time to put you away for life, Sally.", " With Carmine Falcone in Arkham, someone must've stepped up to run the so-called family. Is this man in the courtroom today? Could you identify him for us, please?", " I've got a sworn statement from you that this man, Salvatore Maroni, is the new head of the Falcone crime family.", " Permission to treat the witness as hostile?", " Ceramic 28 caliber.  Made in China. If you want to kill a public servant, Mr. Maroni, I recommend you buy American.", " Glad you're so pleased, Rachel.  I'm fine by the way.", " Can't.  I dragged the head of the Major Crimes Unit down here.", " Well, good thing about the mob is they keep giving you second chances.", " Lightly irradiated bills.  Fancy stuff for a city cop.  Have help?", " Save it, Gordon.  I want to meet him.", " And that flood light on top of M.C.U.?", " I've put every known money launderer in Gotham behind bars.  But the mob is still getting its money out.  I think you and your \"friend\" have found the last game in town and you're trying to hit 'em where it hurts: their wallets.  Bold.  You gonna count me in?", " Gordon, I don't like that you've got your own special unit, and I don't like that it's full of cops I investigated at internal affairs.", " You want me to back warrants for search and seizure on five banks without telling me who we're after?", " Well, that's a start.  I'll get you your warrants.  But I want your trust.", " I hear they've got a different nickname for me down at M.C.U..", " It took three weeks to get a reservation and I had to tell them I worked for the government.", " This city health inspector's not afraid to pull strings.", " What?", " The famous Bruce Wayne.  Rachel's told me everything about you.", " I don't know if they'll let us-", " Is Wayne Manor in the city limits?", " Gotham's proud of an ordinary man standing up for what's right.", " We did.  All of us who stood by and let scum take control of our city.", " When their enemies were at the gate, the Romans would suspend democracy and appoint one man to protect the city.  It wasn't considered an honor. It was considered public service.", " Well, I guess you either die a hero or you live long enough to see yourself become the villain.  Look, whoever the Batman is, he doesn't want to spend the rest of his life doing this.  How could he?", " Maybe.  If I'm up to it.", " If I were sneaking out every night someone would've noticed by now.", " That's nice of you, Bruce, but I'm not up for reelection for three years.  That stuff won't start for-", " You're a hard man to reach.", " Lau's halfway to Hong Kong- if you'd asked, I could have taken his passport- I told you to keep me in the loop.", " My office?!  You're sitting down here with scum like Wuertz and Ramirez... Oh, yeah, Gordon- I almost had your rookie cold on a racketeering beef.", " We need Lau back, but the Chinese won't extradite a national under any circumstances.", " I'll get him to sing.", " I knew the risks when I took this job, lieutenant.  Same as you. How will you get him back, anyway?", " I've got it.  RICO.  If their money was pooled we can charge all of them as one criminal conspiracy.", " In a RICO case if we can charge any of the conspirators with a felony-", " What is this Gordon, your fortress?", " I don't trust them here.", " It's your call, Lieutenant.  Be right.", " I don't know about Mr. Lau's travel arrangements...", " ...but I'm sure glad he's back.", " I asked Gordon to make some arrests.", " She shares my enthusiasm for justice. After all, she is a judge.", " It won't matter.  The head guys make bail, sure... but the mid-level guys, they can't, and they can't afford to be off the streets long enough for trial and appeal.  They'll cut deals that include some jail time.  Think of all you could do with 18 months of clean streets.", " Rachel-", " Thanks.  Alfred, right?", " Rachel talks about you all the time. You've known her her whole life?", " Any psychotic ex-boyfriends I should be aware of?", " You can throw a party, Wayne, I'll give you that.  Thanks again.  Mind if I borrow Rachel?", " You cannot leave me on my own with these people.", " Compared to this, the mob doesn't scare me.  Although, I will say: them gunning for you makes you see things clearly.", " Yeah.  It makes you think about what you couldn't stand losing.  And who you want to spend the rest of your life with...", " Not if the mob has their way.", " Okay.  Let's be serious.  What's your answer?", " I guess no answer isn't \"no\".", " It's someone else, isn't it?", " Just tell me it's not Wayne.  The guy's a complete-", " So where do you keep your trash?", " You're due in court- I need you alive long enough to get you on the record.", " Refuse to cooperate on the stand- you won't be coming back here- you'll go to county.  How long do you calculate you'll last in there?", " Tell me what you know about the Joker.", " Where are you?", " Rachel, listen to me.  You're not safe there.", " Gordon's gone, Rachel.", " And he's gone.  The Joker's named you next.", " Rachel, I can't let anything happen to you.  I love you too much.", " Rachel, I know he's your friend but-", " Okay.  Go straight there.  Don't tell anyone where you're going.  I'll find you there.", " I love you.", " You wanna play games?", " No.  I wouldn't.  That's why I'm not going to leave it up to me. Heads- you get to keep your head. Tails... not so lucky.  So, you want to tell me about the Joker?", " Go again?", " You're not playing the odds, friend.", " Not exactly.", " The Joker killed Gordon- and, and Loeb.  He's going to kill Rachel...", " Why?", " You can't!  You can't give in!", " Ladies and Gentlemen, thank you for coming.  I've called this press conference for two reasons.  Firstly, to assure the citizens of Gotham that everything that can be done over the Joker killing is being done. Secondly, because the Batman has offered to turn himself in-", " But first.  Let's consider the situation: should we give in to this terrorist's demands?  Do we really think that-", " The Batman is an outlaw...", " Yes.  They are.  But the night is darkest just before the dawn.", " So be it. Take the Batman into custody.", " I am the Batman.", " I'm sorry, I didn't have time to talk this through with you.", " They're transferring me to central holding.  This is the Joker's chance, and when he attacks, Batman will take him down.", " How do you know what he's thinking?", " Heads I go through with it.", " I'm not.", " Lieutenant, you do like to play it pretty close to the chest...", " Thanks, detective- I've got a date with a pretty upset fiancée.", " Rachel?  Rachel is that you?", " It's OK, Rachel.  Everything's going to be just fine.", " Can you move your chair?", " Look for something to free yourself.", " Nothing.  I'm trying to...", " Don't think like that, Rachel. They're coming for you.", " NO!  Not me... Why did you come for me?!", " RACHEL!", " RACHEL!!!", " Remember the name you all had for me when I was at Internal Affairs?  What was it, Gordon?", " SAY IT!", " Why should I hide who I am?", " Why would you listen to me now?", " No.  No you're not.  Not yet.", " Your men.  Your plan.", " You live.", " You die.", " Hello.", " Half.", " Who picked up Rachel, Wuertz?", " You, of all people, are gonna protect the other traitor in Gordon's unit?", " Funny, I don't know what's going to happen to you, either.", " Going to join your wife?", " You love her?", " Can you imagine what it would be like to listen to her die?", " The Joker's just a mad dog.  I want whoever let him off the leash.", " I took care of Wuertz, but who was your other man inside Gordon's unit? Who picked up Rachel?  It must've been someone she trusted.", " It can't hurt your chances.", " I said it couldn't hurt your chances.", " Lucky guy.", " But he's not.", " Your driver.", " She believe you?", " She trusts you.  Just like Rachel did.", " 'What they were gonna do'?  You're the second cop to say that to me. What, exactly, did you think they were going to do?", " Don't!", " Live to fight another day, officer.", " Where my family died.", " This is where they brought her, Gordon.  After your people handed her over.  This is where they bound her. This is where she suffered.  This is where she died.", " But you didn't, did you?", " Yes, you could.", " If you'd listened to me- if you'd stood up against corruption instead of doing your deal with the devil.", " You wouldn't dare try to justify yourself if you knew what I'd lost. Have you ever had to talk to the person you love most, wondering if you're about to listen to them die? You ever had to lie to that person? Tell them it's going to be all right, when you know it's not?  Well, you're about to find out what that feels like.  Then you'll be able to look me in the eye and tell me you're sorry.", " No, just the person you need most. So is it your wife?", " We have a winner.", " You brought your cops?", " You think I want to escape?!  There's no escape from this-", " I've done plenty wrong, Gordon.  Just not quite enough.  Yet.", " It's not about what I want.  It's about what's fair. You thought we could be decent men in an indecent world.  You thought we could lead by example.  You thought the rules could be bent but not break... you were wrong.  The world is cruel. And the only morality in a cruel world is chance.  Unbiased. Unprejudiced.  Fair.", " His boy's got the same chance she had.  Fifty-fifty.", " Then why was it only me who lost everything?", " The Joker chose me!", " And he was right.", " Fair enough.", " You first.", " My turn.", " Your turn, Gordon.", " I'm about to.  Tell your son it's going to be all right, Gordon.  Lie. Like I lied."], "RACHEL": [" Where were you?", " I know the briefs backwards.", " You're flipping coins to see who leads?", " I'm serious, Harvey, you don't leave things like this to chance.", " We'll never link the gun to Maroni, so we can't charge him, but I'll tell you one thing- the fact they tried to kill you means we're getting to them.", " Harvey, you're Gotham's D.A.- if you're not getting shot at, you're not doing your job. 'Course if you said you were rattled we could take the rest of the day...", " Jim Gordon?  He's a friend- try to be nice.", " Really?", " Yes, Bruce.  Fancy that.", " Bruce, this is Harvey Dent.", " For how long?  About three weeks?", " Natascha, aren't you...?", " Harvey's taking me next week.", " No.  He knows I am.", " And the last man they asked to protect the republic was named Caesar.  He never gave up that power.", " Give us the money and we'll deal.", " You mean when they hear that you've helped us they're going to kill you?", " No, I'm just assuming your client's cooperation with this investigation. As will everyone. Enjoy your stay in County, Mr.Lau.", " You were a glorified accountant- what could you have on all of them that we could charge?", " We can charge all of them with it.", " Mr.Lau, do you have details of this communal fund?  Ledgers, notebooks...?", " Once you've testified in open court. So with your clients locked up, what happens to all that money?", " Now I've seen it all: Harvey Dent, scourge of the underworld, scared stiff by the trust fund brigade.", " Harvey may not know you well enough to understand when you're making fun of him.  But I do.", " You can't ask me to wait for that.", " The whole mob's after you and you're worried about these guys?", " Oh, yeah?", " The rest of your life, huh?  That's a pretty big commitment.", " Don't.", " I don't have an answer.", " I'm sorry, Harvey.  I just...", " What are you doing?!", " Stop!", " Let's not do that again, okay? Is Harvey-?", " Thank you.", " Harvey, where are you?!", " Where you should be- at Major Crimes trying to sort through all the-", " This is Gordon's unit, Harvey-", " He vouched for these men-", " Bruce.  We can trust Bruce Wayne.", " Trust me, Harvey, Bruce's penthouse is now the safest place in the city.", " Harvey called.  He says Batman is going to turn himself in.", " You honestly think it's going to stop the Joker from killing?", " Bruce, don't make me your one hope for a normal life-", " Yes.", " But they won't let us be together after you turn yourself in.", " Why is he letting Harvey do this, Alfred?", " And just stood by?!", " Well, you're right about one thing- letting Harvey take the fall is not heroic.", " You know Bruce best, Alfred...  give it to him when the time is right.", " It's not sealed.", " Goodbye, Alfred.", " Don't offer yourself as bait, Harvey.", " No.  This is too dangerous-", " He's using you as bait- but he doesn't know if he can get the Joker- he's failed so far.", " I just do, okay?  Harvey, this isn't just about you, what about all the people counting on you to turn this city around?  Tell everyone the truth-", " This is your life... you don't leave something like this to chance...", " You make your own luck.", " Can anyone hear me?", " Harvey.  You're OK.  I thought...", " No.  Harvey, we don't have much time-", " They said only one of us was going to make it.  That they'd let our... Our friends choose...", " Harvey?  What's happening?", " Harvey, in case... I want you to know something...", " I know, but I don't want them to...", " I don't want to live without you. Because I do have an answer, and my answer is yes...", " Harvey?  Harvey, it's okay...", " Somewhere-"], "MARONI": [" I thought the DA just played golf with the Mayor, things like that.", " Two-bit whack-job wears a cheap purple suit and make-up.  He's not the problem- he's a nobody. The problem is our money being tracked by the cops.", " So what are you proposing?", " If it's so easy why haven't you done it already?", " How soon can you move the money?", " You sure you want to embarrass me in front of my friends, Lieutenant?", " I don't wanna hear you talk.", " From one professional to another-if you're trying to scare someone, pick a better spot.  From this height the fall wouldn't kill me.", " I don't know, he found us-", " Friends?  You met this guy?", " No one's gonna tell you anything- they're wise to your act- you got rules... the Joker, he's got no rules.  No one's gonna cross him for you.  You want this guy, you got one way.  And you already know what that is.  Just take off that mask and let him come find you.", " Or you want to let a couple more people get killed while you make up your mind?", " This craziness.  This is too much.", " You want him, I can tell you where he'll be this afternoon.", " Don't stop for lights, cops, nothing.", " Yes.", " Take it up with the Joker.  He killed your woman.  Made you... like this...", " If I tell you, will you let me go?", " It was Ramirez.", " But you said-", " Who?"], "ROSSI": [" You win, counselor.  It was me.", " Maroni?  He's a fall guy.  I'm the brains of the organization.", " Hostile?  I'll show you hostile."], "DENT (CONT’D)": [" But, your honor, I'm not done..."], "LAU": [" In China L.S.I. Holdings stands for dynamic new growth.  A joint Chinese venture with Wayne Enterprises will be a powerhouse.", " It's OK, Mr.Fox.  Everyone knows who really runs Wayne Enterprises.", " I'm told the man who arranged the heist calls himself Joker.", " Thanks to Mr.Maroni's well-placed sources we know that police have indeed identified our banks using marked bills and are planning to seize your funds today-", " With the investigation ongoing, none of you can risk hanging on to your own proceeds.  And since the enthusiastic new D.A. has put all my competitors out of business, I'm your only option.", " Moving all deposits to one secure location.  Not a bank.", " Obviously, no one can know but me. If the police were to gain leverage over one of you everyone's money would be at stake.", " As the money is moved I go to Hong Kong.  Far from Dent's jurisdiction. And the Chinese will not extradite one of their own.", " I already have...", " For obvious reasons I couldn't wait for your permission...", " Rest assured, your money is safe.", " I must apologize for leaving Gotham in the middle of our negotiations. This misunderstanding with the Gotham police force...  I couldn't let such a thing threaten my company.  A businessman of your stature will understand.  But with you here... we can continue.", " We do not allow cell phones in-", " I think, Mr.Fox, that a simple phone call might have sufficed.", " Just accidentally wasting it.", " Where the hell are the cops?", " What the hell am I paying them for?", " The money is the only reason I'm still alive.", " Wait. I won't give you the money, but I'll give you my clients.  All of them.", " I'm good with calculation- I handled all their investments.  One big pot.", " Immunity, protection and a chartered plane back to Hong Kong.", " Like I said- I'm good with calculation.", " No way.  You can't protect me- you can't even protect yourselves."], "FOX": [" Well, Mr.Lau, I speak for the rest of the board, and Mr.Wayne, in expressing our own excitement...", " We'll be in touch as soon as our people have wrapped up the diligence.", " You worry about the diligence, Mr. Reese.  I'll worry about Bruce Wayne.", " Do it again.  Wouldn't want the trust fund to run out, would we?", " Another long night? This joint venture was your idea, and the consultants love it, but I'm not convinced.  L.S.I.'s grown 8 percent annually, like clockwork.  They must have a revenue stream that's off the books.  Maybe even illegal.", " You already knew.", " Anything else you can trouble me for?", " Three buttons is a little nineties.", " You want to be able to turn your head?", " I'll see what I can do.", " Our Chinese friend left town before I could tell him the deal is off.", " What's wrong with a phone call?", " For high altitude jumps, you need oxygen and stabilizers.  I must say- compared to your usual requests, jumping out of an airplane is pretty straightforward.", " I can recommend a good travel agent.", " That's more like it, Mr.Wayne.", " I don't think I have anything here. The CIA had a program in the '60s for getting their people out of hot spots.  Called Sky Hook.  Now-", " Hardened kevlar plates on a titanium- dipped fiber tri-weave for flexibility...", " You'll be lighter, faster, more agile...", " Perhaps you should read the instructions, first.", " Now, there's a trade-off...  the spread of the plates gives you weak spots.  You'll be more vulnerable to gunfire and knives.", " You talking chihuahuas or rotweilers? It should do fine against cats.", " I understand!", " Well, it was good of you to bring me out here in such style, Mr.Lau.  But I've actually come...", " Sorry.  Forgot I had it.  So, I've come to explain why we're going to have to put our deal on hold...", " We can't afford to be seen to do business with... well, whatever it is you're accused of being.  A businessman of your stature will understand.", " Well, I do love Chinese food.  And Mr.Wayne didn't want you to think we'd been deliberately wasting your time.", " That's very good- \"accidentally\". Very good.  I'll be sure and tell Mr.Wayne that he was wrong about you not having a sense of humor.", " Restricted.  Lau's holed up in there good and tight.  Here...", " I had R and D work it up- it sends out high frequencies and records the response time to map an environment.", " Submarine.  Like a submarine.", " In place.", " Mr.Wayne? Good luck.", " What can I do for you, Mr. Reese?", " Their CEO is in police custody.", " Let me get this straight.  You think that your client, one of the wealthiest and most powerful men in the world, is secretly a vigilante who spends his nights beating criminals to a pulp with his bare hands... And now your plan is to blackmail this person?", " Good luck.", " Here's your original scan...", " Here's it reverse-engineered...", " I'll make you a copy. Mr.Wayne, did you reassign R and D?", " I wasn't aware we had any new government contracts.  Can you-", " Fair enough.", " Beautiful.  Unethical.  Dangerous. You've turned every phone in the city into a microphone...", " Like the phone I gave you in Hong Kong.  You took my sonar concept and applied it to everybody's phone in the City.  With half the city feeding you sonar you can image all of Gotham. This is wrong.", " But at what cost?", " No one should have that kind of power.", " Spying on thirty million people wasn't in my job description.", " I'll help you this one time...", " But consider this my resignation.", " As long as this machine is at Wayne Industries, I won't be.", " I'm zeroing in.", " His voice is on the ferry, but that's not the source...", " It's west...", " You've got p.o.v. on alpha channel, omni on beta-"], "REESE": [" Sir, I know Mr.Wayne's curious how his trust fund gets replenished but frankly... it's embarrassing.", " It's done- the numbers are solid.", " You asked me to do the diligence on the L.S.I.Holdings deal again.  I found irregularities.", " Not with their numbers.  With yours. A whole division of Wayne Industries disappeared, overnight.  So I went down to the archives and started pulling old files.", " My kids love the Batman.  I thought he was pretty cool, too.  Out there, kicking some ass.", " Changes things when you know it's just a rich kid playing dress up.", " Your project.  Don't tell me you didn't recognize your baby pancaking cop cars on the evening news.  Now you're getting sloppy.  Applied Sciences was a small, dead department- who'd notice?", " That's simply not why I'm doing this.", " If we could talk to Dent now he might feel differently-", " I guess it would depend on the life.", " Of course not.", " They're trying to kill me."], "NATASCHA": [" Hello.", " No, come on- how could you want to raise children in a city like this?", " I'm talking about the kind of city that idolizes a masked vigilante...", " Gotham needs heroes like you- elected officials, not a man who thinks he's above the law.", " But this is a democracy, Harvey.", " Someone like you, Mr.Dent?", " But what if Harvey Dent is the caped crusader?"], "DENT (cont'd)": [" ~Batman's looking for someone to take up his mantle.", " Is there someone, anyone in this city we can trust?", " And I promise you, the dawn is coming. One day, the Batman will have to answer for the laws he's broken- but to us, not to this madman."], "CRIME BOSS": [" The hell is this...?"], "LAU (ON T.V.)": [" Gentlemen, please. As you're all aware, one of our deposits was stolen.  A relatively small amount: 68 million."], "GAMBOL": [" Where, then?", " Give me one reason I shouldn't have my boy here pull your head off.", " A freak.", " Enough from the clown.", " You think you can steal from us and just walk away?  I'm putting the word out- 5 hundred grand for this clown dead.  A million alive, so I get to teach him some manners, first.", " They bring proof?", " So.  Dead you get five hundred-"], "THE JOKER (CONT’D)": [" I'll make this pencil disappear.", " And by the way, the suit wasn't cheap.  You should know.  You bought it.", " You don't deal with this now, soon Gambol won't even be able to get a nickel for his grandma-"], "VP": [" Welcome to Hong Kong, Mr.Fox!  Mr.Lau regrets he is unable to meet you in person.  But with his current legal difficulties...!", " I'm afraid for security reasons I have to ask for your mobile phone."], "FOX (O.S.)": [" There's a better view from the peak tram."], "EVANS": [" Are you threatening my client?"], "REPORTER": [" The Chinese government claim their international rights have been broken.", " You'd rather protect an outlaw vigilante than the lives of citizens?!", " WHERE IS THE BATMAN?"], "JUDGE SURRILLO": [" ...849 counts racketeering, 246 counts fraud, 87 counts conspiracy murder...", " ...how do the defendants plead?"], "LOEB": [" Five hundred and-", " Gordon, you're unlikely to discover this for yourself, so take my word- the Police Commissioner earns a lot of threats...", " I found the appropriate response to these situations a long time ago...", " You get to explain to my wife why I'm late for dinner, Lieutenant.", " How'd they get my D.N.A.?"], "MAYOR (cont'd)": [" But that means it's on you.  They're all coming after you, now.  Not just the mob... politicians, journalists, cops- anyone whose wallet's about to get lighter.  Are you up to it? You better be.  They get anything on you... those criminals will be back on the streets..."], "VOICE": [" Tell them your name.", " Are you the real Batman?", " Why do you dress up like him?", " But you do, Brian.  You really do. You think the Batman's helped Gotham?", " Look at me.", " Check the names.", " Drop it."], "MAN": [" Brian Douglas.", " No.", " He's a symbol... that we don't have to be afraid of scum like you...", " Took... they took our guns, our uniforms..."], "THE JOKER (cont'd)": [" Every day he doesn't... people will die.  Starting tonight.  I'm a man of my word.", " Then you let Dent take your place. Even to a guy like me... that's cold-", " You know how I got these scars?", " You didn't think I'd risk losing the battle for the soul of Gotham in a fist fight with you?  You've got to have an ace in the hole.  Mine's Harvey."], "COMMISSIONER LOEB": [" Gordon, what are you playing at?"], "SURRILLO": [" Gordon wants me to go right now?"], "MAN 1": [" These are dangerous people, Judge. Even we don't know where you're going."], "MAN 2": [" Get in, then open the envelope. It'll tell you where you're headed."], "STEPHENS": [" Just the normal number of bad guys in the building- and they're all city employees.  Here's a list.", " Jim, it's over.", " But the prosecution's over.", " No-one's standing up in front of a Judge while judges and police commissioners are getting blown away.", " If he's got any sense, Dent's halfway to Mexico by now.", " I'm sorry, Barbara.", " I'm sorry.", " Switch it off- he ain't coming. He doesn't want to talk to us.  God help whoever he does want to talk to-", " That's nice.", " I'm a twenty year man.  I can tell the difference between punks who need a little lesson in manners, and the freaks like you who would just enjoy it. And you killed six of my friends.", " I know you're going to enjoy this. But I'm going to enjoy it more.", " This is my own damn fault.  Just shoot him."], "ASSISTANT DA": [" Surrillo and Loeb?"], "THUG": [" Hands up, pretty boy.", " Boss?"], "GENTLEMAN": [" We're not intimidated by thugs."], "MALE GUEST": [" What's going on out there, Wayne?", " Wait!  You can't-"], "FEMALE GUEST": [" Thank god- you've got a panic room.", " You've got to be kidding me."], "DRIVER": [" What do we do about Dent?"], "DISPATCH (O.S.)": [" Your name, sir.  Please state-"], "REESE (cont'd)": [" But now you've got the entire R and D department burning cash, claiming it's related to cell phones for the army.  What are you building him now? A rocket ship? I want ten million a year.  For the rest of my life."], "WAYNE (CONT’D)": [" Cross-reference the addresses. Look for Parkside and around."], "POLICE SNIPER": [" We're tight.  But frankly... there's a lot of windows up here."], "THE MAYOR": [" ...and as we recognize the sacrifice of these officers, we must remember that vigilance is the price of safety."], "BARBARA": [" Jimmy, go play with your sister...", " Are you out there?!  Are you?!", " You brought this on us!  This craziness!  You did!  You brought this...!", " Hi, Anna-", " But the units outside-", " But where-", " No!  Jim stop him!  Don't let him!"], "MISTRESS": [" Can't we go someplace quieter!  We can't hear each other talk!", " What?!"], "JOKER'S THUG": [" You wouldn't...", " I don't know anything!", " Is that him-?", " He missed!"], "HECKLER": [" So where is he?!", " Things are worse than ever!"], "DENT (O.S.)": [" But that's not why we're demanding he turn himself in.  We're doing it because we're scared.  We've been happy to let Batman clean up our streets for us until now-", " Hello, Jim.", " You're about to know what my suffering is really like..."], "COP HECKLER": [" NO MORE DEAD COPS!!"], "ALFRED (cont'd)": [" That's the sacrifice he's making- to not be a hero.  To be something more."], "ACTING COMISSIONER": [" We get this guy to County and he's their problem.  The streets along your route will be cleared.  The convoy stops FOR NO REASON..."], "SHOTGUN SWAT": [" Hope you've got some moves.", " Lower 5th?  We'll be like ducks in a barrel down there.", " Get us out of here!", " We've got company back here-", " Let's get topside- we need that air support!", " What the hell are you doing?"], "OFFICER": [" You wait like everybody else, pal."], "RADIO": [" All units, be advised.  All units will exit down Cheviot west and proceed north on lower 5th avenue."], "BATMOBILE VOICE": [" Damage catastrophic.  Initiate eject and self-destruct.", " Goodbye."], "PILOT": [" We're back on point- and ready to give some of their own medicine-"], "DETECTIVE MURPHY": [" Look at these ugly bastards.", " You're a cop killer.  You're lucky to be feeling anything below the neck.", " What do you want?", " Why?"], "FAT THUG": [" I don't feel good.", " Please.  My insides hurt.", " The boss said he would make the voices go away.  He said he would go inside and replace them with bright lights.  Like Christmas."], "JAMES": [" Did Batman save you, dad?", " Dad, is he okay?", " Batman?!", " He didn't do anything wrong!"], "COP": [" Step away from the bars.", " That's great.  Please step-", " Is that a... phone?", " Sir!  Sir.  Take a look at what we're dealing with.  Cops, National Guard- We're showing 50 missing- but that building was clear.  These buses are heading off to other hospitals- my guess is we missed one."], "MEDIC": [" He's got some kind of... contusion..."], "SERGEANT": [" Dent's alive, Jim.  Just.  But back at M.C.U"], "RACHEL (V.O.)": [" Dear Bruce, I need to explain...", " ...I need to be honest and clear. I'm going to marry Harvey Dent...", " I love him, I want to spend the rest of my life with him...", " When I told you that if Gotham no longer needed Batman we could be together, I meant it...", " But I'm not sure the day will come...", " ...when you no longer need Batman.  I hope it does, and if it does I will be there...", " ...but as your friend.  I'm sorry to let you down...", " If you lose your faith in me, please keep your faith in people...", " Love, now and always, Rachel."], "CALLER 1 (O.S.)": [" I wanna how much they're gonna pay you to say who Batman really is."], "CALLER 2 (O.S.)": [" Harvey dent didn't want us to give in to this maniac- you think you know better than him?"], "OLD LADY (O.S.)": [" Mr.Reese, what's more valuable: one life, or a hundred?", " OK.  Let's say it's your life.  Is it worth more than the lives of several hundred others?", " I'm glad you feel that way.  Because I've put a bomb in one of the city's hospitals.  It's going off in sixty minutes unless someone kills you."], "OLD": [" Just a concerned citizen- -and regular guy..."], "THE JOKER (O.S.)": [" I had a vision.  Of a world without Batman.  The mob ground out a little profit and the police tried to shut them down, one block at a time... and it was so... boring.  I've had a change of heart.  I don't want Mr.Reese spoiling everything, but why should I have all the fun?  Let's give someone else a chance...", " If Coleman Reese isn't dead in sixty minutes, then I blow up a hospital. Of course, you could always kill yourself, Mr.Reese.  But that would be the noble thing to do.  And you're a lawyer.", " Tonight, you're all going to be part of a social experiment.", " Through the magic of diesel fuel and ammonium nitrate, I'm ready right now to blow you all sky high.  Anyone attempts to get off their boat, you all die...", " But we're going to make things a little more interesting than that. Tonight, we're going to learn a little bit about ourselves...", " There's no need for all of you to die.  That would be a waste.  So I've left you both a little present.", " At midnight, I blow you all up.  If, however, one of you presses the button, I'll let that boat live.  You choose.  So who's it going to be- Harvey Dent's most wanted scumbag collection... or the sweet innocent civilians? Oh, and you might want to decide quickly, because the people on the other boat may not be quite so noble."], "UNIFORMED COP": [" Where are we going, sir?"], "NURSE": [" Sir, are you going to help?!"], "POLK": [" Okay, don't put anyone else on. Davis, I got space, bring him out. Davis?", " Ma'am, we're going to have to move him, now. Ma'am?"], "BERG": [" Commissioner?", " What?", " Why?  Because my wife's in hospital?", " Mr.Reese?"], "COP (O.S.)": [" I think so-"], "BARTENDER": [" Sweet Jesus.  D'you see this, Mike? They blew up a hospital...", " Shouldn't you be out there, you know, doing something?", " I gotta take a leak, keep an eye on things, will ya?"], "CIVILIAN": [" That ain't right!  We should be on that boat."], "NATIONAL GUARDSMAN": [" You want to ride across with them, be my guest."], "FIRST MATE": [" They've lost their engines."], "PILOT [PRISON FERRY]": [" Get on the radio and tell 'em we'll come back for them once we dump these scumbags-", " Get down to the engine room.", " He killed the radio."], "PILOT [PASSENGER FERRY] (O.S.)": [" Same thing over here- enough diesel to blow us sky high.  And a present."], "NATIONAL GUARD COMMANDER": [" Why would they give us the detonator to our own bomb?", " Stay back.", " We're not talking about this..."], "RAMIREZ (O.S.)": [" Barbara, it's Anna Ramirez-", " Listen carefully, there's no time. Jim needs you to pack up and get the kids in the car right away.", " Barbara, those cops can't be trusted. Jim needs you away from them as soon as possible.  I'll call them off for 10 minutes, you'll have to move fast-", " I'm going to give you an address- Jim will meet you there..."], "BUSINESSMAN": [" Who are you to decide?  We ought to talk it over, at least.", " No one wants to get their hands dirty.  Fine.  I'll do it.  Those men on that boat made their choices. They chose to murder and steal.  It makes no sense for us to die, too."], "MOTHER": [" We don't all have to die.  Why should my babies die?  Those men had their chance-"], "PASSENGER 1": [" They're talking over the same exact thing on the other boat."], "PASSENGER 2": [" If they're even bothering to talk. Let's put it to a vote."], "SWAT": [" We've found our missing bus."], "SWAT SNIPER": [" I got hostages!"], "SWAT LEADER": [" We have clear shots on five clowns. Snipers take them out, smash the windows- a team rappels in, a team moves in by the stairwells. or three casualties, max.", " Red Team.  Go!", " Go!  Go!  Go!"], "GORDON (O.S.)": [" Where are you?  Where's my family?!"], "SNIPER": [" What the hell's he doing?"], "PILOT [PASSENGER FERRY]": [" The tally is 196 votes against. And 340 votes for.", " I voted for it.  Same as most of you. Doesn't seem right that we should all die...", " I didn't say I'd do it.  Don't forget.  We're still here.  Which means they haven't killed us, yet, either."], "PRISONER 1": [" Do you wanna die!"], "PASSENGER 3": [" So do it!"], "TATTOOED PRISONER": [" You don't wanna die.  But you don't know how to take a life.  Give it to me.", " These men will kill you and take it, anyway.  Give it to me, you can tell people I took it by force... give it to me and I'll do what you should have done ten minutes ago."], "GORDON (V.O.)": [" They'll hunt you.", " ...he's the hero Gotham deserves... but not the one it needs right now. So we'll hunt him, because he can take it.  Because he's not our hero...", " ...he's a silent guardian, a watchful protector... a dark knight."], "BATMAN (V.O.)": [" You'll hunt me."], "BATMAN (V.O.)(CONT’D)": [" You'll condemn me, set the dogs on me...", " ...because it's what needs to happen.", " Because sometimes the truth isn't good enough..."], "BATMAN (V.O.) (CONT’D)": [" ...sometimes, people deserve more."], "JAMES (CONT’D)": [" Why's he running, Dad?!", " Why, dad?  Why?!"]}