{"scenarios": ["Transcribed to PDF from:", "\"The Dark Knight Trilogy - The", "Complete Screenplays\"", "Published July 2012 by Faber &", "Faber Ltd. (UK)", "In memory of the victims of", "the tragedy in Aurora, CO, on", "July 20, 2012.", "FOR EDUCATIONAL PURPOSES ONLY", "T  H  E", "BLACK SCREEN.", "The sound of cracking. Splintering. A shape appears, in", "The shape of a BAT. The ice disintegrates...", "EXT. GOTHAM STREET - DAY", "Gordon stands before a massive picture of Harvey Dent.", "Gordon, choked with emotion, gathers the papers of his", "eulogy.", "And we FADE TO BLACK.", "Racing along a cratered dirt road, and we are -", "INT. LAND CRUISER JOSTLING OVER UNEVEN TERRAIN - DAY", "Three Hooded Men guarded by East European Militia. A third", "Militia drives. Next to him is a nervous, bespectacled man.", "EXT. AIRSTRIP, EASTERN EUROPE - DAY", "An airstrip overlooking a grey city rocked by artillery", "fire. A bland CIA Operative, flanked by Special Forces Men,", "stands in front of a commuter plane. CIA Man watches the", "Land Cruiser pull up, hard. The Militia Men jump out of the", "vehicle.", "The Driver shoves the bespectacled man in front of the CIA", "Man.", "Dr. Pavel nods, nervous. CIA Man hands the Driver", "briefcase.", "CIA Man,", "Pavel.", "The", "EXT. SKIES OVER MOUNTAIN RANGE - DAY", "The commuter plane struggles over snow-capped", "INT. MAIN CABIN, COMMUTER PLANE - CONTINUOUS", "The three Hooded Men kneel by the cargo door,", "CIA Man grabs Hooded Man 1.", "Hooded Man 1 says nothing. CIA Man pulls out a handgun.", "CIA Man opens the cargo door. Special Forces hang Hooded Man", "1 out into the howling wind - CIA Man shouts above the wind.", "Nothing. CIA Man fires out the open door and the Special", "Forces yank Hooded Man 1 back in, clubbing him quiet.", "The Soldiers grab Hooded Man 2, hang him out the door.", "The prisoner says nothing. CIA Man presses the", "man’s hood - he cocks the gun...nothing.", "CIA Man turns to the Third Prisoner. Shuts the", "CIA Man, wary, approaches the Third Prisoner -", "hood, revealing a dark mask with a breathing apparatus. The", "eyes behind it are cold. Still. This is Bane.", "CIA", "tone is", "EXT. SKIES OVER MOUNTAIN RANGE - CONTINUOUS", "The commuter plane is dwarfed by a massive transport plane", "looming over it, dangerously close...", "INT. MAIN CABIN, COMMUTER PLANE - CONTINUOUS", "The plane lurches. The noise is building.", "EXT. MOUNTAINS - CONTINUOUS", "The ramp of the transport opens... Four men leap out on", "tethers - dropping towards the commuter plane, two each", "side...", "INT. MAIN CABIN, COMMUTER PLANE - CONTINUOUS", "The Spacial Forces react to the turbulence from the plane", "above. CIA Man looks at Bane.", "A Special Forces soldier spins around - an Armed Man is", "outside the window. Bang -", "EXT. SKIES OVER MOUNTAIN RANGE - CONTINUOUS", "Two men shoot through the windows, the other two attach", "grapples to the fuselage - give the thumbs up - hoists start", "to pull and the tail of the commuter plane is lifted,", "unnaturally.", "INT. COCKPIT, COMMUTER PLANE - CONTINUOUS", "The Pilots battle the controls as the plane tilts forward.", "INT. MAIN CABIN, COMMUTER PLANE - CONTINUOUS", "Like lightning, Bane has the CIA Man is his handcuffed arms,", "legs wrapped around a seat back, The entire cabin upends.", "Tumbling chaos - Soldiers falling - Bane cracks CIA Man’s", "neck and drops him onto the Sergeant - they tumble down the", "plane, smashing into the cockpit door with a terminal thud.", "Dr. Pavel, strapped in, pushes against the seat in front of", "him - the plane vibrates, trying to tear itself apart.", "EXT. ATLAS MOUNTAINS - CONTINUOUS", "The men climb the tail of the smaller plane as it dangles", "helplessly above the mountains. Its wings shear off.", "INT. MAIN CABIN, COMMUTER PLANE - CONTINUOUS", "Bane breaks his handcuffs as if they were plastic, then", "opens his legs and drops down the cabin, somersaulting", "gracefully and using his arms to stop himself halfway down,", "by Dr. Pavel.", "EXT. SKIES OVER MOUNTAIN RANGE - CONTINUOUS", "The men attach explosives to the tail, then jump away,", "swinging out as the tail explodes.", "INT. MAIN CABIN, COMMUTER PLANE - CONTINUOUS", "An explosion takes off the rear door of the cabin - the", "Armed Men drop through the smoke on cables.", "A body bag is lowered into the cabin. Bane lies it on the", "seat backs next to Dr. Pavel and unzips it to reveal a body", "the same age and build as Dr. Pavel.", "Bane rips Dr. Pavel’s sleeve - pulls out a length of", "surgical tubing - pushes a needle into Dr. Pavel’s arm -", "runs the tube to the body’s arm... Dr. Pavel watches,", "horrified, as Bane starts compressions on the body’s chest,", "drawing Dr. Pavel’s blood across the tube and into the", "body...", "An Armed Man pulls Hooded Man 1 up through the cabin and", "out. Bane stops Hooded Man 2.", "The man nods, unhooks himself, takes Bane’s arm.", "Hooded Man 2 hands Bane his line. Bane clips it around Dr.", "Pavel, takes out a knife and cuts Dr. Pavel’s seat belt. Dr.", "Pavel panics, flails. Bane takes his arms. Gentle.", "Bane slides Dr. Pavel out of his seat. They hang in the", "vertical, windblown cabin. Bane takes out a detonator.", "Bane presses the detonator - the cabin drops from around", "them, revealing the terrifying drop to the peaks below. Dr.", "Pavel screams as they are hoisted up towards the transport,", "and we -", "EXT. GOTHAM - EVENING", "Drifting over the vast city...", "...moving past the enormous Gotham Bridge...", "...over the Gotham river to the Palisades on the far side...", "...finding a party in the grounds of Wayne Manor.", "addresses the wealthy and powerful of Gotham.", "Enthusiastic applause as the Mayor wraps up.", "High above, on a darkened balcony, a lone figure.", "Down below at the bar, Commissioner Gordon examines some", "sheets of densely written paper. A Congressman muscles in.", "Gordon shakes his head. Gordon’s Deputy Commissioner, Foley,", "cuts in.", "The Congressman watches a tray of canapés breeze past,", "grabs the ass of the maid carrying them. She freezes.", "The Congressman grabs two. The Maid moves off.", "Congressman glances down at Gordon’s papers.", "Applause. Gordon approaches the mike. Looks down at", "speech. Thinks.", "INSERT CUT: Harvey Dent, face half destroyed, threatens", "Gordon’s son with a handgun.", "Gordon surveys the audience. Deciding.", "Gordon folds up his speech.", "Gordon stuffs the papers inside his jacket. The Congressman", "mutters under his breath.", "The figure on the balcony turns back into the", "People clap as Gordon leaves the mike. Gordon", "Foley.", "Gordon heads for the line of town cars in the", "INT. KITCHENS, WAYNE MANOR - MOMENTS LATER", "Our Maid dives into the bustle of Wayne Manor", "Caterers and Maids, Wait Staff. She overhears", "The other Maids signal her to be quiet. All the chatter has", "died. Alfred has entered the kitchen.", "Alfred places a glass of water on a tray next to a covered", "plate. Picks up the tray, looks around the chaotic kitchen.", "Alfred looks at the Maid. Hands her a key and the tray.", "The Maid nods. Takes the tray.", "INT. HALL, WAYNE MANOR - MOMENTS LATER", "Following the Maid through the empty house. She comes to the", "large oak door to the East Wing. Unlocks it...", "INT. DRAWING ROOM, EAST WING, WAYNE MANOR - CONTINUOUS", "The room is dark, quiet. The Maid places the tray on the", "table. She looks at the inner door opposite. It is ajar...", "INT. HALL, WAYNE MANOR - CONTINUOUS", "Alfred talks to an elegant woman, thirties, Miranda", "Her accent is European. Hard to place.", "They turn to see a man in his fifties. Daggett.", "Alfred turns and walks off. Daggett smiles, glib.", "She walks away. Daggett watches her go.", "INT. DRAWING ROOM, EAST WING, WAYNE MANOR - CONTINUOUS", "Close on the dinner tray. We hear a labored step approach.", "Bruce Wayne appears, leaning on a cane. Gaunt. Grey temples.", "He lifts the lid of his dinner, then freezes, hearing", "something. He slowly limps into the next room...", "INT. SITTING ROOM, EAST WING, WAYNE MANOR, CONTINUOUS", "The Maid looks at framed photographs of Rachel, Thomas and", "Martha Wayne. Some are half-burned. She notices an archery", "target, arrows stuck in it. She reaches out. WHAM! An arrow", "sticks into the target - the Maid spins around, flustered.", "Wayne, at the other end of the long room, lowers a composite", "bow. Picks up his cane.", "Wayne nods, gently. Limps towards her.", "She trails off, embarrassed. Coy. She seems very young.", "Wayne approaches slowly. He nods at her pearl necklace.", "He reaches out with his cane to press open a panel", "bureau, revealing a safe door...", "...which swings open with an awkward creak.", "The Maid suddenly seems more confident. Older.", "She smiles at him. Moves towards him.", "She kicks his cane from under him, smashes him", "The Maid vaults onto the bureau and up to a high window.", "She flips backwards through the window. Wayne smiles, then", "rocks forward on his good leg and rises with athletic grace.", "He looks at the safe, notices something. Powder...", "EXT. DRIVE, WAYNE MANOR - CONTINUOUS", "Moving toward the line of town cars, the Maid pulls off her", "white apron, cuffs and collar, leaving a black dress and", "pearls. A Valet hurries to open a car door for her - she", "slips into a town car...beside the Congressman.", "The Congressman, a little tipsy, looks at her hungrily.", "INT. EAST WING, WAYNE MANOR - LATER", "Alfred", "EXT. ROOFTOP, MAJOR CRIMES UNIT - CONTINUOUS", "Gordon brings a stack of files against the air duct,", "to read. Next to him is a rusty, broken searchlight.", "A", "Gordon", "Blake", "Gordon turns to look at the broken searchlight.", "his fingers across its rusted shell.", "Gordon walks past Blake, heading for the stairs.", "INT. EAST WING, WAYNE MANOR - MORNING", "Alfred takes his tray into the bedroom. The bed is empty.", "Alfred’s voice echoes through the vast mansion. No reply.", "INT. STUDY, WAYNE MANOR - MOMENTS LATER", "Alfred hits three notes on the piano. The bookcase opens.", "INT. ELEVATOR SHAFT - CONTINUOUS", "Alfred descends into the caverns beneath Wayne Manor.", "INT. BATCAVE - CONTINUOUS", "Alfred walks through the arches as the stone floor starts to", "lower, becoming a ramp. At the bottom, Alfred is level with", "a series of dark slate obelisks - a bridge over the water", "where Wayne sits at a computer atop a massive slate cube.", "Wayne pulls up a mug shot - a fat, male armed-robbery", "suspect.", "Wayne hits a key. A photograph of the Maid appears.", "Newspaper headlines appear -", "THE CAT", "HEIST.", "Wayne says nothing.", "Wayne looks at Alfred. Not understanding.", "INSERT CUT: Alfred seated in a café sipping his", "INSERT CUT: Alfred spots a couple at another table and looks", "closer, hopeful. But they are strangers.", "Alfred leaves Wayne to his cave. His bats.", "EXT. WATER TREATMENT FACILITY - DAY", "Blake and his partner, Ross, get out of their patrol car. A", "DWP Man leads them down a long concrete trough.", "They come out by the catchment basin. Above the grille lies", "a body - a teenage boy. Blake looks down at him.", "EXT. ST. SWITHIN’S HOME FOR BOYS - DAY", "Blake looks up at the shabby building.", "INT. ST.", "Blake", "EXT. PLAYGROUND, ST. SWITHIN’S - MOMENTS LATER", "Father Reilly watches as Blake sits with Mark", "Mark nods slowly. Staring straight ahead.", "Blake considers this. Troubled.", "INT. DIVE BAR - NIGHT", "Selina Kyle, in a little black dress, walks in", "in a Hawaiian shirt. She sits him on a bar stool - walks", "over to a table where a neatly dressed man, Stryver, sits.", "Selina glances around. Things scattered throughout the bar.", "Jumpy. Selina hands an envelope to Stryver.", "Stryver slides a transparency out of the envelope. Holds it", "up to the light. Four perfect fingerprint transfers.", "He pockets the envelope.", "Stryver signals a Thug who locks the door. Another", "joins them at the table. Selina smiles.", "As Stryver checks the envelope again -", "The Second Thug puts a gun to Selina’s head.", "Selina looks in his eyes. The Thug cocks his gun.", "blinks.", "She reaches for her purse. The Thug stops her, reaches", "himself - pulls out a cellphone. Slides it across the table.", "Stryver looks at the phone. Hits ’send’. Selina sizes up her", "options. A knock on the door. Second Thug hides his gun. The", "door opens - a young woman, Jen. She enters, cheerful, spots", "Selina. Pulls out an envelope, looks around.", "Jen", "Stryver looks at Selina’s ’date’ drooling into", "nuts at the bar - he looks familiar...", "Across the bar, the TV on mute -", "MANHUNT FOR MISSING CONGRESSMAN.", "Stryver looks at Selina.", "Stryver glances down at the cell phone as - SCREECH -", "Thugs look out the window at cop cars and SWAT units", "descending on the bar. Stryver glances at the window and -", "SMASH - Selina CRACKS his head against the table, grabs", "Second Thug’s gun hand, flips over the table, firing at the", "other Thugs, who drop. The SWATs batter down the door.", "Selina crouches, cowering, screaming.", "The SWATs barrel past, chasing the remaining Thugs back", "through the bar and out into the back alley. Selina smiles.", "EXT. ALLEY BEHIND BAR - CONTINUOUS", "The Thugs turn and open up on the SWATs with automatic", "weapons.", "INT. DIVE BAR - CONTINUOUS", "Selina moves to the door. Spots the Congressman under the", "bar, clutching his bleeding leg.", "She adjusts her dress in the broken mirror behind the bar.", "Moves for the door.", "EXT. DIVE BAR - CONTINUOUS", "Selina waltzes out - right into Blake. She feigns panic.", "Blake helps Selina down onto the tailgate of a SWAT truck.", "He heads into the bar, weapon drawn. Selina slips behind the", "truck and into the night.", "INT. DIVE BAR - CONTINUOUS", "Blake enters, gun drawn. Spots the Congressman.", "EXT. ALLEY BEHIND BAR - CONTINUOUS", "The SWATs return fire. The Thugs lay down cover fire, then", "race around a corner into a smaller passage.", "A cop car pulls up, blocking the mouth of the alley - Gordon", "jumps out, gun drawn.", "The SWATs approach the passage, massing on both corners", "tactically. The two corner SWATs exchange hand signals,", "counting down... They round the corner, aiming low and high.", "The passage is empty.", "The SWATs cover a fire escape, but Gordon spots at once -", "He races to the manhole cover - SWATs wrench off the cover,", "Gordon grabs a flashlight from the nearest SWAT.", "Gordon starts climbing down the ladder...", "INT. SEWERS - CONTINUOUS", "Gordon moves down the tunnel, flashlight low. Three SWATs", "fall in behind...", "EXT. ALLEY BEHIND BAR - CONTINUOUS", "Blake comes into the alley. Cops surround the manhole.", "INT. SEWERS - CONTINUOUS", "Gordon hears a noise up ahead - pushes forward, rounds the", "corner. BANG! GUNFIRE. SWATs return fire, shots sparking off", "the concrete walls, then - BOOM - behind him the tunnel", "ERUPTS IN FIRE, blasting the SWATs. Gordon races forward,", "tearing through the tunnels.", "EXT. ALLEY BEHIND BAR - CONTINUOUS", "Blake jumps back as a fireball bursts out of the manhole.", "INT. SEWERS - CONTINUOUS", "Gordon races around a corner, gun drawn. A noise makes him", "turn - WHACK, he is clobbered from behind by a Thug.", "EXT. ALLEY BEHIND BAR - CONTINUOUS", "Blake pushes forward.", "Blake backs off. Gets an idea - goes for his patrol car.", "INT. SEWERS - CONTINUOUS", "Thug 1 flips Gordon onto his back.", "The two Thugs drag Gordon down through the maze of tunnels.", "As they descend deeper they encounter work crews of muscular", "men wielding large drills and jackhammers, working the walls", "and ceiling of the larger tunnels. Some of the men are armed", "Mercenaries, overseeing gangs of homeless street kids. They", "stare as Gordon is dragged past. The Thugs drag Gordon", "between two waterfalls, into -", "INT. BANE’S LAIR, SEWERS - CONTINUOUS (NIGHT)", "They approach a figure, turned away, crouched in the", "firelight. Bare-chested, muscular, masked. Bane. A crooked", "line of scar tissue runs the length of his spine...", "The Thugs drop Gordon at Bane’s feet.", "Bane slowly turns to the Thugs.", "Bane flips the Thug’s chin up and to the side with a crack.", "Thug 1 drops. Bane turns to Thug 2.", "The Thug, terrified, pulls out Gordon’s badge, wallet,", "gun...and the folded papers of the speech he did not read.", "Bane takes these one by one with quick glances. He stops at", "the papers. Unfolds them...", "As he reads, Gordon rolls off the steps, dropping into the", "rushing flow of water - gunshots ring out...", "Thug 2 trails off as Bane looks up from the papers...", "Bane turns to the Lead Mercenary.", "Lead Mercenary hands him a GPS - Bane tucks it into Thug 2’s", "jacket, zips it up like a mother sending her kid to school.", "Bane shoots Thug 2, kicks him into the water. Turns to Lead", "Mercenary.", "EXT. WATER TREATMENT FACILITY - NIGHT", "Blake comes out to the catchment basin. He spots something", "stuck up against the grille, thrusts his hand into the", "raging waters - Gordon is there, alive. Just. Blake pulls", "him up onto the concrete, hoists him up, hurrying...", "INT. FRONT HALL, WAYNE MANOR - DAY", "Alfred opens the door to reveal Blake in his dirty", "INT. STUDY, WAYNE MANOR - MOMENTS LATER", "Blake is sitting, drumming his leg, nervous. Wayne", "Wayne", "Blake", "INT. HALL, WAYNE MANOR - MOMENTS LATER", "Wayne and Alfred watch Blake drive away.", "Alfred", "Alfred", "EXT. WAYNE ENTERPRISES - DAY", "Moving towards the tall skyscraper downtown.", "INT. BOARDROOM, WAYNE ENTERPRISES - CONTINUOUS", "Miranda is talking to Lucius Fox at the table.", "Miranda", "Miranda", "Wayne rises, pushing hard on his cane.", "Fox", "elevator.", "INT. APPLIED SCIENCES - MOMENTS LATER", "Fox leads Wayne into the vast, gadget-filled space. They", "pass", "Wayne", "Fox opens a door - we glimpse a sleek vehicle.", "light up.", "Wayne", "Wayne", "INT. EXAMINATION ROOM, GOTHAM GENERAL HOSPITAL - NIGHT", "Wayne listens, distracted, while a Doctor examines an X-ray.", "Wayne smiles. The Doctor leaves. Wayne pulls on a ski mask,", "steps to the window, hops up, pulls a wire from his cane,", "which he clips to his belt. He props his cane behind the", "frame - jumps out. The wire unspools from the cane as -", "EXT. TENTH FLOOR, GOTHAM GENERAL HOSPITAL - CONTINUOUS", "Wayne drops three floors...", "INT. PRIVATE ROOM, GOTHAM GENERAL - CONTINUOUS", "Gordon lies in his bed, hooked up to machines. Wayne, in ski", "mask, stands over him. Gordon’s eyes flutter open. He tries", "to speak with a weak, hoarse voice...", "INT./EXT. LAMBORGHINI ON GOTHAM STREETS - NIGHT", "Wayne pulls up in front of a row of shabby subdivided town", "houses. Checks a tracking device. Jon, provocatively", "dressed, leads a Yuppie Banker-type in through a front door.", "INT. SELINA’S APARTMENT - CONTINUOUS", "Selina sits in a small room getting ready to go out. She", "picks up the pearls - hears a disturbance in the hall.", "INT. STAIRWELL OUTSIDE SELINA’S APARTMENT - CONTINUOUS", "The Yuppie has Jen against the wall - he reaches back to hit", "her with an expensive wristwatch-clad arm. But Selina has", "grabbed his wrist with a powerful grip.", "Selina twists his arm behind him in a blinding move.", "She releases the Yuppie, who moves off down the stairs.", "Selina turns to Jen. Who is examining a wallet.", "Selina opens her hand and gives Jen the Yuppie’s Rolex.", "EXT. SELINA’S BUILDING, OLD TOWN, GOTHAM - LATER", "Selina exits and hails a cab. Wayne watches her go. Then", "pulls out. Checking his tracker.", "EXT. MUSEUM, GOTHAM - LATER", "Town cars dispense Gotham society in tasteful masquerade.", "Wayne pulls up to the Valet. Paparazzi line the entrance.", "Wayne uses his cane to get out of his Lamborghini...", "Lenses swing onto Wayne, who pushes a button on his key fob", "- a pulse. The cameras die. Wayne heads to the door.", "INT. MUSEUM - CONTINUOUS", "A lavish ball - the expressively attired dance under falling", "confetti... Even Bruce Wayne is struck by the ostentation.", "He spots Selina dancing with a deeply smitten Rich Twit. She", "wears a small, velvet pair of cat ears. And", "Wayne turns to find Miranda Tate, amazed, a", "only", "Wayne looks at Miranda. Intrigued.", "Wayne watches Miranda glide away. Then turns to Selina.", "Rich Twit", "Selina", "Wayne", "Wayne rolls her into his shoulder - reaches up to the back", "of her neck, unclasps the necklace.", "The pearls slide off her neck into his other hand. Selina", "looks at him. Angry. Then kisses him, hard, and disappears", "into the crowd. Wayne’s cane reappears.", "EXT. MUSEUM - MOMENTS LATER", "Wayne approaches the Valet. Pats down his pockets.", "INT./EXT. LAMBORGHINI RACING DOWN STREETS - CONTINUOUS", "Selina permits herself a little smile as she guns the", "engine.", "INT. ROLLS ROYCE - LATER", "Alfred watches in the mirror as Wayne climbs into the back.", "Wayne gives him a withering glare.", "Wayne dials his phone.", "Up front, Alfred listens. Concerned.", "INT. BATCAVE - DAY", "Wayne pushes a button on a hi-tech carbon fiber", "strapped to his good knee - the brace tones. As", "moving his knee, bending, stretching, Alfred puts down a", "Thermos.", "Wayne swaps the brace to his bad knee. Puts his weight on it", "- the knee bends, kicks. He sits again. Cautious.", "Wayne gingerly pushes a button - the brace starts to shrink", "tight to his leg, digging in. Wayne grits his teeth.", "Wayne shouts as the brace clicks home. He gets to his feet.", "Wayne executes a perfect roundhouse, knocking out a", "Alfred picks up the brick. Considers it. Uneasy.", "Wayne", "Wayne", "The", "Wayne looks at Alfred. Then turns to examine the", "INT. STOCK EXCHANGE - EVENING", "A frenzy of trading on the packed floor...", "Two Traders sit on a shoeshine stand in the lobby.", "Near the front entrance: a Food Delivery Guy is standing", "there negotiating with a Trader.", "Trader 3 spots bad news on a screen.", "He thrusts Food Guy a tip and grabs the bag, distracted...", "At the rear secure entrance: a Motorcycle Courier enters,", "wearing his helmet - a Female Security Guard gets in his", "face.", "In the rest room: a Janitor mops the floor, shifting out of", "the way of two Traders who rush in to pee.", "At the shoeshine stand, Trader 1 waves a bill down at the", "man shining his shoes without a glance. Shoeshine Man takes", "the bill, then, as the Traders step off, he reaches into a", "gym bag and checks an automatic weapon. He clicks the slide", "home, then hoists the gym bag and heads for the trading", "floor.", "At the secure entrance: the Courier pulls off his helmet.", "The Female Security Guard’s eyes go wide.", "In the rest room: the Janitor reaches into his bucket and", "pulls out a machine pistol in a Ziploc bag.", "Near the front entrance: Food Guy pulls an automatic pistol", "- clubs Trader 3 with it, pastrami flying. Shoeshine Man", "moves onto the floor, pulls out his weapon.", "Under the Courier’s helmet - a mask. Bane. He grabs the", "Female Security Guard and throws her into her colleagues,", "lashing out in four directions with rapidfire lethality.", "Shoeshine Man fires into the large trading screens. The", "floor erupts into a different frenzy - traders hit the deck,", "screaming. Bane moves onto the floor...", "He dries up as Bane stops. Turns to him...", "Bane grabs Trader 1 by the throat and drags him across the", "floor to an online automated trades terminal... He puts the", "man’s thumb onto the print reader - the screen lights up.", "Trader 1, terrified, types in his password. Outside, sirens.", "Shoeshine man pulls out a USB drive with an antenna - plugs", "it into the computer - figures race across the screen...", "EXT. STOCK EXCHANGE - CONTINUOUS", "Police vehicles screech into the narrow street -", "construction vehicles are blocking. Blake argues with a", "burly Construction Worker.", "Blake points - but SWAT vehicles pile in, blocking.", "Foley and the SWAT Commander, Allen, approach", "The", "INT.", "Shoeshine Man looks up from the laptop.", "Shoeshine Man picks up the laptop, slips it into his pack...", "EXT. STOCK EXCHANGE - CONTINUOUS", "Allen shouts at his men.", "Steel wedge-shaped barriers rise up at the mouth of the", "street. A Sniper watches the doors through a thermal scope.", "Six large heat signatures bloom, too big for people...", "The door explodes. SWATs duck, six sportbikes race out and", "leap the ramp-like barricades, sending SWATs scattering.", "Cops scramble to pull their vehicles out to give chase.", "EXT. GOTHAM STREET - CONTINUOUS", "The bikes weave through traffic, Traders strapped to the", "back, facing backwards - screaming, ties flying in the wind.", "A cruiser falls in behind.", "A Veteran Cop sights a shot, but the Traders are in the way.", "EXT. STOCK EXCHANGE - CONTINUOUS", "Foley is barking into his radio.", "INT./EXT. CRUISER ON GOTHAM STREETS - CONTINUOUS", "The cruiser follows the bike into a large tunnel. A Rookie", "Cop looks up into his rear-view.", "The Veteran Cop looks back - streetlights and headlights are", "dying one after another. The darkness is chasing them - the", "darkness hits them. Their lights, sirens, and engine die...", "And, out of the silence, a dark shape roars past -", "EXT. HIGHWAY - CONTINUOUS", "Food Guy drives the rear bike. He looks back - sees", "streetlights explode behind him - darkness catching him up.", "The engine chokes and dies. The Trader jumps off, shouting", "for the cops. Food Guy turns, pulling his gun. SMASH! - Food", "Guy is thrown backwards off his bike by a dark wing as", "BATMAN races by on the Bat-Pod.", "EXT. STOCK EXCHANGE - CONTINUOUS", "Foley rushes to Blake’s cruiser.", "EXT. HIGHWAY INTERSECTION - CONTINUOUS", "The remaining bikes split up as they reach a high overpass.", "EXT. HIGH OVERPASS - CONTINUOUS", "Batman pulls up, overlooking the intersection - pulls a", "rifle-shaped device. A tone builds - he aims it at the bike", "and fires.", "EXT. HIGHWAY OFF-RAMP - CONTINUOUS", "Janitor’s bike sparks and dies. Sirens as Cops move in,", "Another bike splutters and dies - the Hostage breaks for", "cover.", "EXT. HIGH OVERPASS - CONTINUOUS", "Batman sees the last two bikes disappear beneath an", "overpass. He holsters his EMP rifle and guns the Bat-Pod.", "INT. BLAKE’S CRUISER - CONTINUOUS", "Foley, in the back, is using the cruiser as a", "station.", "Foley looks out at Gotham rushing by.", "Foley ignores him.", "EXT. GOTHAM - CONTINUOUS", "All around the city, cops mobilize - cars, vans, choppers...", "EXT. HIGHWAY - CONTINUOUS", "Bane pulls up at speed alongside Shoeshine Man. Shoeshine", "Man glances inside his pack - signals ’2’. Bane turns, sees", "darkness approaching, reaches back and grabs his Hostage,", "lifting him onto the back of Shoeshine Man’s bike.", "peels off - Batman stays on Shoeshine Man.", "INT. CHOPPER - CONTINUOUS", "A Spotter watches Bane peel off, hits the radio.", "INT. BLAKE’S CRUISER - CONTINUOUS", "Foley listens to the radio, hungry -", "INT. DAGGETT’S PENTHOUSE - CONTINUOUS", "Coverage of the pursuit blares from all the", "and Stryver watch. Tense.", "INT. INNER OFFICE, DAGGETT’S PENTHOUSE - CONTINUOUS", "Moving in on a shadow, crouched in front of Daggett’s safe,", "working the dial... The shadow slides up a pair of goggles", "onto the top of its head creating the silhouette of cat", "ears. It is Catwoman. She turns to the TV, watching the", "pursuit.", "Catwoman opens the safe. Nothing inside. She frowns.", "EXT. GOTHAM STREETS - CONTINUOUS", "Bane slips between two cruisers who tear after the Batman.", "He jumps up onto a concrete barrier, then down to the mouth", "of an outflow pipe. He glances at the entire Gotham Police", "Department descending on one man. Disappears into the pipe.", "EXT. GOTHAM STREETS - CONTINUOUS", "Shoeshine Man glances into his pack - the program beeps,", "finished. He looks back to see the Bat-Pod racing at him,", "ducks as it comes alongside...riderless. Shoeshine Man looks", "up, confused. WHUMP! His hostage is ripped off the bike by a", "low-flying dark shape.", "Shoeshine Man lays down the bike in a shower of sparks,", "rolls off dazed. Batman grabs him.", "Shoeshine Man stares. Unafraid. Batman rips the computer", "from his pack. The screen reads:", "APPLICATION COMPLETE", "Blinding light and noise as police choppers descend - sirens", "everywhere. Batman grabs the USB drive from the laptop. He", "jumps on the Bat-Pod - pauses, taking in the sight of", "thousands of police, cars, choppers, dogs, closing in.", "Batman looks at the line of stopped traffic. An empty car", "transporter is below the on-ramp... Batman fires the cannons", "at the transporter, the near ramp crashes down, and Batman", "roars towards it - mounts it and jumps onto the on-ramp...", "INT. DAGGETT’S PENTHOUSE - CONTINUOUS", "Daggett angrily grabs some ice cubes for his", "Daggett watches, intrigued.", "INT. BLAKE’S CRUISER - CONTINUOUS", "Foley shouts down the phone.", "EXT. GOTHAM STREETS - CONTINUOUS", "Thousands of police jockey to pursue the Batman as he races", "back into the downtown area.", "EXT. DOWNTOWN STREET - CONTINUOUS", "The Bat-Pod tears along, pursued by a phalanx of cruisers,", "choppers overhead. More cops appear at the far end of the", "boulevard.", "The Bat-Pod executes a ninety-degree turn, flipping over as", "it goes, then guns into the darkness of a large blind alley.", "Cruisers and choppers block the mouth of the alley. Blake", "arrives last, his cruiser sealing the bottleneck. Foley", "swaggers out.", "Foley reaches for a loudhailer. VARRROOOOM!! A noise from", "the alley that none of the cops have heard before...", "Spotlights smash on and a massive dark cyclone roars out of", "the alley, spinning the choppers sideways, dual rotor", "downdraft forcing all the cops to the ground.", "The Bat, now black, thunders up and over the entire Gotham", "PD. Blake slides up to Foley. Dry.", "Foley looks at Blake. Thrusts the loudhailer at him.", "INT. HOSPITAL ROOM - CONTINUOUS", "Gordon, still hooked up to machines, watches TV. He smiles.", "INT. DAGGETT’S PENTHOUSE - NIGHT", "Daggett watches the TV coverage, concerned. Stryver enters.", "Daggett gets to his feet, relieved, moves to his inner", "office.", "INT. INNER OFFICE, DAGGETT’S PENTHOUSE - CONTINUOUS", "Daggett comes through the door, calling back.", "Catwoman grabs him, throws him across the room. His back", "slams against the wall - he draws a gun, but - WHACK! -", "Catwoman pins his wrist to the wall at shoulder height using", "the high heel of her boot. He whimpers as she leans in.", "She plucks the gun from his trembling hand.", "Click - Stryver has a gun to her head.", "Stryver looks appreciatively at Catwoman as she", "leg...", "Catwoman", "Catwoman", "The Bodyguard bursts in, gun drawn. Catwoman, holding", "Daggett, spins, kicking the window with the point of her", "heel. The glass shatters. She pulls Daggett through the", "window. He screams - they drop...", "EXT. WINDOW-CLEANING PLATFORM - CONTINUOUS", "...ten feet onto the window-cleaning platform. Catwoman uses", "her bladed heel to cut a rope - the platform plunges down", "the side of the building.", "EXT. FLAT ROOF - MOMENTS LATER", "Catwoman dumps Daggett onto the roof, towering over him.", "Catwoman leans back from Daggett, taking this in... Shapes", "drop onto the rooftop. Emerge from fire exits. They’re not", "Daggett’s bodyguards, these are Bane’s men... Catwoman holds", "Daggett by the throat, threatening him.", "They continue to approach. One of them screws a silencer", "onto his gun.", "All eyes search for the source of the voice. Catwoman spots", "it - a dark shape, crouched on the roof above: Batman.", "As the Mercenary with the silencer looks up, Catwoman leaps", "forward, grabs his gun. Batman drops into the middle of the", "fray, fighting back Mercenaries at Catwoman’s back - she", "fires at one, clipping him, he drops. She spins aiming at", "another’s head - Batman yanks her arm down, forcing her to", "miss the Mercenary. Batman takes him out with a kick.", "As more mercenaries come out onto the roof, Batman runs for", "the far edge.", "Catwoman follows, confused, as Batman leaps off the roof.", "She gets to the edge, pauses to look down into the alley -", "sees the black angular roof of the Bat, cockpit open.", "Shots impact around her - she leaps, landing hard, but", "gracefully on the back of the vehicle, slides into the", "cockpit. As the engines thunder into life, and the canopy", "hisses shut, taking bullets from above.", "Catwoman flinches as the Bat thunders into the sky,", "downdraft forcing the Mercenaries down onto the roof, all", "but one, who walks slowly across the roof, strong against", "the wind...Bane. He watches the Bat roar off into the night.", "EXT. ROOFTOP, SKYSCRAPER, GOTHAM - MOMENTS LATER", "The Bat lands - the canopy opens. Catwoman jumps out.", "Batman steps down after her.", "Catwoman", "Batman considers this. A police chopper sweeps", "searching. Batman turns to it. Then turns back.", "But she is gone.", "INT. BATCAVE - NIGHT", "Alfred is studying security camera footage of Bane killing", "at the stock exchange. A roar builds - the waterfall glows", "brighter until...SMASH! The Bat breaches, downdraft spraying", "water. Two cubes rise - the Bat lands, Batman jumps out.", "Alfred brushes water off his suit.", "Alfred", "Alfred looks at him. Puts down the cape and cowl.", "Alfred points to the monitor - Wayne sees Bane killing...", "Wayne", "hand.", "Wayne", "The screen blanks, a thumb print appears.", "Wayne pulls out the USB, rises.", "Alfred looks at Wayne. Takes the USB.", "INT. HALL, WAYNE MANOR - CONTINUOUS (NIGHT)", "As Wayne hits the bottom of the stairs, Alfred", "Waynne", "Alfred", "Wayne", "Wayne", "Wayne", "Wayne looks at Alfred. Furious. Summons the worst", "say and says it quietly and calmly.", "Wayne mounts the stairs...Alfred watches him go. Turns.", "INT. MASTER BEDROOM, WAYNE MANOR - MORNING", "Wayne is woken by the doorbell.", "INT. STAIRCASE, WAYNE MANOR - MOMENTS LATER", "As Wayne moves through the empty house, tying his dressing", "gown, he can’t resist one tentative.", "But Alfred is gone.", "INT. FRONT HALL, WAYNE MANOR - CONTINUOUS", "Wayne opens the front door the find Fox. Fox is surprised.", "Fox hands Wayne a newspaper - the main headline:", "BATMAN BACK TO FOIL OR MASTERMIND STOCK RAID...", "Wayne", "WAYNE", "Wayne", "EXT. WAYNE ENTERPRISES RECYCLING PLANT - DAY", "A scrapyard on the Gotham river. Across the water, the", "towers of Gotham. Lucius leads Miranda from her car.", "They arrive at a Portakabin and enter.", "INT. PORTAKABIN - CONTINUOUS", "Miranda looks around the derelict office. Fox smiles at her.", "He hits a button and the floor descends, Miranda is shocked", "as the office becomes an elevator into -", "INT. ELEVATOR, FUSION REACTOR - CONTINUOUS", "They descend diagonally into a massive concrete tunnel...", "Miranda marvels as they step off the elevator. She spots a", "figure deep within: Bruce Wayne.", "Wayne leads Miranda to the core. Two perpendicular rings of", "electromagnets suspend a bowling-ball-sized mass of metal.", "Wayne hits buttons - the ball glows, then dies", "Nothing.", "His", "INT. BOARDROOM, WAYNE ENTERPRISES - DAY", "The Board Members, including Daggett and Miranda,", "seats. Fox at one end of the table, Wayne at the other.", "All eyes go to Wayne. An older member of the board pipes up.", "Wayne", "INT. LOBBY, WAYNE ENTERPRISES - CONTINUOUS", "Wayne exits the building. There is an angry mob", "Shareholders and a pack of hungry Reporters.", "Wayne looks over to see his Lamborghini being towed.", "Wayne turns to see Blake standing by his patrol car. Nods.", "INT. DAGGETT’S PENTHOUSE - DAY", "Daggett", "Daggett", "Bane places a gentle hand on Daggett’s shoulder.", "Daggett", "Daggett", "Bane gently takes the terrified Daggett’s head", "hands...", "Stryver, on the steps outside the living room,", "SCENE OMITTED", "INT./EXT. CRUISER ON GOTHAM STREETS - MOMENTS LATER", "Wayne", "EXT.", "Blake drops Wayne off.", "Blake hands him some bills, watches him cross the street.", "The radio squawks. Blake reacts - drives off.", "INT. SELINA’S APARTMENT - MOMENTS LATER", "Selina is packing a bag. She hears voices in the stairwell.", "INT. STAIRWELL OUTSIDE SELINA’S APARTMENT - CONTINUOUS", "Selina finds Wayne standing there with Jen.", "Jen looks at Selina. At Wayne.", "INT. SELINA’S APARTMENT - MOMENTS LATER", "Wayne looks at the cramped space. Selina shifts,", "embarrassed.", "Wayne", "INT. HOSPITAL CORRIDOR - DAY", "Blake moves through the hospital corridor, looking", "INT. HOSPITAL ROOM - CONTINUOUS", "Blake", "Blake", "Gordon", "Blake tries to conceal his excitement from Foley.", "EXT. WAYNE MANOR - EVENING (END OF DAY)", "Wayne, covering his head with a newspaper, hurries up", "driveway in the rain. Steps into the alcove. Hits the", "Wayne turns to find Miranda there.", "Wayne looks a little helpless all of a sudden.", "She takes his hand.", "INT. GREAT ROOM, WAYNE MANOR - CONTINUOUS (END OF DAY)", "They force the French windows - enter, brushing off the", "rain.", "Wayne sets down the newspaper:", "FROM BILLIONAIRE TO BUM", "Miranda kicks off her shoes. Glances at the", "Then at a photo of Wayne’s parents.", "Miranda picks up a photo of Rachel.", "Wayne looks at her. Can’t find words...", "Miranda puts the photo down. Kisses him. Passionately.", "again. He kisses back. Suddenly the lights go out.", "INT. SAME - LATER (NIGHT)", "Wayne watches as Miranda tends to a roaring fire.", "She returns to him, pulling a blanket around both of them.", "He traces", "She turns", "She pulls", "other, the warm heart at the center of a vast, cold room.", "INT. GREAT ROOM, WAYNE MANOR - NIGHT", "Miranda is sleeping, wrapped in the blanket. Wayne studies", "her for a moment, then slips out...", "INT. BATCAVE - MOMENTS LATER", "Wayne moves to the Batsuit. Picks up the cowl.", "EXT. SKIES ABOVE GOTHAM - NIGHT", "The Bat roars towards downtown. Batman kills the lights and", "main engines - the Bat quietly autorotates into the canyons.", "INT. MIA TUNNEL - LATER", "Catwoman on a wall, watching trains go by. She senses...", "...Batman is there.", "Catwoman", "into a service tunnel...", "INT. SERVICE TUNNEL - CONTINUOUS", "Catwoman speaks over her shoulder as she walks.", "Catwoman swings into a -", "INT. SEWER TUNNEL - CONTINUOUS", "A Mercenary patrols. Catwoman comes up behind.", "Batman hangs upside down behind him.", "Darkness smashes onto the Mercenary. Gunfire in the tunnel.", "Catwoman races along, pursued by a Mercenary. He is yanked", "off his feet by darkness - he screams...", "Batman picks off more and more Mercenaries. Screams echo...", "Batman follows Catwoman through the dark tunnel.", "A grate slams down, separating them - the lights come on.", "is deep inside.", "INT. BANE’S LAIR, SEWERS - CONTINUOUS", "Mercenaries look down on him from above. Catwoman turns.", "Batman turns. Bane emerges from behind the waterfalls.", "Catwoman hears the name. Less sure of what she’s done.", "Batman moves at Bane - strikes powerful blows - Bane catches", "his fist.", "Bane SMASHES Batman back - kicks him off the catwalk -", "Batman drops, uses his cape to land. Bane climbs down on a", "chain - his men watch in disciplined silence - Batman hurls", "flashbangs at Bane, who doesn’t flinch.", "Batman lashes out at Bane - Bane counters - they separate.", "Batman hurls himself at bane, throwing his into the", "waterfall, where he smashes his fists and gauntlets into", "Bane’s mask again and again, water cascading over them.", "Bane is not moving. Just taking the blows. Batman pauses.", "Bane’s arms SHOOT OUT, SMASHING Batman aside - Bane RISES...", "Batman hits a switch on his belt - the lights go out - Bane", "turns slowly addressing all the shadows at once.", "In the shadows, Batman circles, looking to strike...", "Bane lunges backwards into the darkness - Batman’s throat in", "his grasp.", "Bane SMASHES him into the ground, POUNDING, pounding,", "pounding the hard cowl with his bare fists until it CRACKS.", "Bane RISES from Batman, gestures to the ceiling of the", "chamber - explosive charges have been drilled into holes...", "A Mercenary tosses Bane a detonator - Batman watches through", "cracked cowl - Bane hits the detonator - explosions BURST", "over his head as the ceiling CRUMBLES revealing:", "Applied Sciences - Bane has dropped the bottom out of Fox’s", "weapons store...a camouflage Tumbler rests in the rubble.", "INT. APPLIED SCIENCES - CONTINUOUS", "Mercenaries race through the stacks of equipment...", "INT. BANE’S LAIR, SEWERS - CONTINUOUS", "Batman climbs to his feet, swaying. Bane approaches.", "Batman SWINGS at him - misses - Bane GRABS him, lifts him", "HIGH.", "Bane brings Batman down onto his knee, BREAKING his back", "with a horrific CRACK.", "In the shadows, Catwoman looks on. Shocked. Bane crouches to", "pull the broken cowl off the broken Wayne. Mercenaries lift", "Wayne’s body and carry him off... Bane stares into the", "hollow eyes of his trophy...", "Catwoman slinks back into the shadows, and we -", "EXT. WAYNE MANOR - DAY", "Blake’s cruiser pulls up. He noses up to the windows.", "Nothing.", "EXT. SELINA’S BUILDING, OLD TOWN, GOTHAM - DAY", "Blake sits in his cruiser. Selina exits, wide-brimmed hat,", "bags. Blake recognizes her. She hails a cab.", "Blake pulls out to follow.", "INT. TERMINAL, GOTHAM INTERNATIONAL AIRPORT - DAY", "Selina moves through the terminal. She clocks a Uniform", "staring at her - ducks down a service hallway.", "INT. SERVICE HALLWAY, AIRPORT - CONTINUOUS", "The Uniform rounds the corner to find Selina applying", "make-up.", "Selina, surprised, fumbles with her purse.", "She hands the Uniform her had - punches him through the", "brim, stuffs him in a closet - plants her mangled hat", "head.", "INT. JETWAY, AIRPORT - MOMENTS LATER", "Selina makes her way down the jetway - spots Security", "far end - turns - Blake smiles at her. Badge in hand.", "INT. INTERROGATION ROOM, AIRPORT - DAY", "Selina, now in cuffs, looks up as Blake walks", "Blake", "Selina looks at him with contempt. Blake shrugs, switches", "off the tape, moves to the door.", "Selina turns to look at Blake. His eyes plead with her.", "And we -", "BLACK SCREEN. Sounds: screaming, laughing, CRYING. Sights:", "LIGHT, bodies FALLING, a DARK SKULL... And we are -", "INT. STONE CELL - DAWN", "Wayne opens his eyes. Unshaven. Filthy. Someone else is in", "the cell - Wayne cannot move to look - even the attempt is", "painful...the skull drifts into his sight. Bane. Squatting", "at Wayne’s bedside, muscled shoulders curving into his mask.", "Wayne exhales. Eyes losing focus from sheer pain.", "Wayne’s eyes dart about: filthy stone walls, distant", "sunlight from above, iron bars: an underground prison.", "Bane steps to the bars - looks up at a bright opening five", "hundred feet above. Like being at the bottom of a", "well...", "Bane", "Bane", "EXT.", "A van pulls through the gate. Selina, inside the van, looks", "up at the formidable grey building.", "INT. BLACKGATE PRISON - CONTINUOUS", "Guards lead Selina down the cells. Whistles and catcalls.", "Selina passes a Huge Inmate who strains through the bars...", "Without breaking step, she slips his outstretched hands", "between her handcuffed ones and cartwheels, snapping", "arms - he screams in agony - she keeps walking...", "INT. WAYNE ENTERPRISES - DAY", "Fox comes out of the elevator with Miranda.", "Fox swings the doors to the boardroom open...", "INT. BOARDROOM, WAYNE ENTERPRISES - CONTINUOUS", "The board is there. Scared. At the head of the", "Fox and Miranda freeze. Staring at the mask.", "The dignified older board member gets to his feet.", "Mercernaries round the three up.", "INT. HOSPITAL ROOM - DAY", "Gordon, with a Nurse’s help, pulls himself to a seated", "position as Blake watches.", "Gordon takes this in...Foley bursts in, agitated.", "Foley", "Foley", "Blake", "INT. STONE CELL, UNDERGROUND PRISON - DAY", "Wayne lies, weak, feverish. A Prisoner drips", "parched lips. An elderly Blind Prisoner squatting by the", "wall in the next cell rasps something in an ancient tongue.", "The Prisoner puts bread to Wayne’s lips.", "A chant gets Wayne’s attention. He rolls his head painfully", "to watch a Tattooed Prisoner hand a thick rope to a Strong", "Man, who ties it around his chest, watched by other", "Prisoners.", "String Man starts scaling the wall. The Prisoners’ chant", "grows stronger as he climbs towards the light.", "Above: Strong Man stops, perched on a ledge, a twelve-foot", "leap from the rest of the climb... The chanting peaks as", "Strong Man leaps...misses...falls. The rope catches - he", "swings into the rock face. Prisoners fall silent as Strong", "Man is lowered, broken, bloody, to the prison floor.", "The Blind Prisoner barks at him.", "INSERT CUT: a child of about ten looks up towards", "The Prisoner leaves Wayne’s cell - switches on the TV.", "INT. BANE’S LAIR, SEWERS - DAY", "Bane’s men lead Fox, Miranda and Fredericks through the", "debris. Fox stares at Mercenaries working on his old", "inventions...", "EXT. LOCATIONS AROUND GOTHAM - EVENING", "SWATs and Cops mass around entrances to sewers, tunnels...", "INT. MASSIVE TUNNEL - CONTINUOUS", "Bane leads Fox and the others to where Mercenaries plant", "charges on a hewn wall. Dr. Pavel is here. Waiting. Bane", "nods at his men. The wall blows.", "EXT. LOCATIONS AROUND GOTHAM - CONTINUOUS", "A SWAT team about to enter a sewer pipe hear a low echoing", "boom. They look at each other, then head in. Thousands of", "Police head into manholes, tunnel entrances, checking", "weapons, using flashlights...", "INT. MASSIVE TUNNEL - CONTINUOUS", "Bane leads the way over rubble into the REACTOR. Dr. Pavel", "follows. Bane approaches the machine. Turns to Fox.", "Fox shakes his head. Bane holds his gun to Fredericks’ head.", "Fredericks trembles. Bane cocks the weapon.", "She walks up to the scanner. Places her hand on it. It", "beeps. She turns to Fox. Quietly pleading.", "Fox reluctantly puts his hand on the scanner. Then", "Fredericks. The core glows brighter and brighter. Dr. Pavel", "is transfixed.", "Bane turns to his men. Gestures at the hostages.", "Fox, Miranda and Fredericks are led back into the rubble.", "EXT. GOTHAM STADIUM - DAY", "The Mayor, flanked by Security, talks to a crowd of", "Reporters.", "The Mayor heads into the stadium with the crowds...", "INT. SEWERS - CONTINUOUS", "Hundreds of SWATs wade, flashlights swinging, heading", "towards the center... Teams are converging from different", "entry points...", "INT./EXT. CRUISER ON GOTHAM STREETS - CONTINUOUS", "Blake is on the phone.", "Blake glances at a large map - dots mark pouring locations.", "Blake pulls up in front of a cement plant.", "INT. REACTOR PLANT - CONTINUOUS", "Dr.", "Dr.", "core...", "EXT. CEMENT PLANT - CONTINUOUS", "Blake is led through a fence by a Worker.", "Blake walks past cement mixers. Spots someone.", "The Driver turns.", "Behind Blake the Worker puts his hand is his", "Blake spins, drawing his weapon. The Worker lunges with", "knife, Blake smashes his hand to one side and shoots him.", "The Driver grabs him from behind. Blake wrestles, but the", "Driver is string, trained. Blake can’t aim his gun, he fires", "behind, into a steel mixer - the bullets ricochet, one", "catches the Driver in the back and he goes down... Blake,", "gasping, kneels beside the Driver.", "The man dies. Blake looks down at his gun. Disgusted. Tosses", "is down. Pulls out his phone. Dials.", "Blake freezes, stooped to pick up his gun. Looking at some", "empty barrels...", "INT./EXT. CRUISER OUTSIDE CEMENT PLANT - MOMENTS LATER", "Blake grabs his carts - scanning the pattern of the", "realizes.", "Blake fires up the cruiser and pulls out, hard.", "INT./EXT. CRUISER ON GOTHAM STREETS - CONTINUOUS", "Blake is driving furiously, shouting into the radio", "EXT. MTA TUNNEL - MOMENTS LATER (DAY)", "Foley, concerned, takes the radio from a colleague.", "Foley looks up with dread at the mouth of the tunnel.", "INT. BOILER ROOM - CONTINUOUS", "Mercenaries rise from a hole in the floor - Bane emerges...", "INT. GOTHAM STADIUM - CONTINUOUS", "The Mayor, in a corporate box, mouths the National Anthem...", "INT. LOCKER ROOM TUNNEL - CONTINUOUS", "The Mercenaries pull out detonators. Bane listens to the", "kickoff like a hunting dog sensing the wind...decides.", "The Mercenaries hit the detonators.", "INT. SEWERS - CONTINUOUS", "SWATs react - the tunnel roof behind collapses... Chunks of", "concrete structure drop - thousands of police throughout", "different tunnels are trapped...", "EXT. GOTHAM STADIUM - CONTINUOUS", "The crowd goes wild as a Receiver catches - starts a run -", "the Mayor looks on, suddenly confused.", "As the Receiver sprints for the end zone, the field behind", "him DROPS away in smoking ruins, swallowing Players...", "The crowd is not cheering but SCREAMING... The Mayor’s box", "EXPLODES...", "The Receiver, nearing the touchdown, glances back - sees", "Armageddon - the entire field is now a smoking mass of", "rubble, but for one strip of turf...Mercenaries pour out of", "the tunnel, creating a gauntlet...", "INT./EXT. CRUISER ON GOTHAM STREETS - CONTINUOUS", "Blake’s cruiser swerves to avoid eruptions of asphalt. An", "eruption TOSSES Blake’s cruiser onto its roof.", "EXT. GOTHAM RIVER - CONTINUOUS", "All bridges, except the Gotham Bridge, suffer controlled", "demolitions.", "INT. LOCKER ROOM TUNNEL - CONTINUOUS", "Bane steps into the smoking stadium, a gladiator walking", "into the arena...TV cameras swing onto him. Passing a dead", "umpire, he takes the men’s headset - surveys the screaming", "crowd, lifts an arm for silence, raises the mike to his", "mask.", "INT./EXT. OVERTURNED CRUISER ON GOTHAM STREET - CONTINUOUS", "Blake squeezes out of his cruiser, reaches in for the radio.", "Blake pulls the shotgun from his cruiser - flags down a car.", "INT. HOSPITAL ROOM - CONTINUOUS", "Gordon’s heart-rate monitor alarms. Gordon wakes, groggy...", "INT. HOSPITAL LOBBY - CONTINUOUS", "Patients and Doctors crowd the entrance. mercenaries with", "automatic weapons force their way in - hit the stairwell.", "INT./EXT. CAR GOTHAM STREETS - CONTINUOUS", "Blake drives, swerving around dazed and terrified people.", "Flames and smoke billow from the sewers.", "EXT. GOTHAM HOSPITAL - CONTINUOUS", "Blake races up to the hospital entrance.", "INT. CORRIDOR, GOTHAM HOSPITAL - CONTINUOUS", "Two Mercenaries move room to room, searching.", "INT. HOSPITAL ROOM - CONTINUOUS", "Gordon pulls himself out of his bed, wheeling his IV.", "INT. CORRIDOR, HOSPITAL - CONTINUOUS", "Blake jumps into the corridor, gun raised. Shots echo", "the hall - Blake sprints.", "INT. HOSPITAL ROOM - CONTINUOUS", "Blake leaps into the room, gun high - freezes as warm", "touches the base of his skull.", "Blake turns. Gordon holds his service weapon. The", "Mercenaries are on the ground, dead.", "EXT. GOTHAM STADIUM - CONTINUOUS", "Mercenaries pull the glowing core onto the field.", "INT. PENTAGON WAR ROOM - CONTINUOUS", "Analysts and military personnel assess the situation.", "EXT. GOTHAM STADIUM - CONTINUOUS", "The Mercenaries thrust Dr. Pavel to his knees before Bane.", "Bane turns Dr. Pavel’s head for the cameras.", "INT. PENTAGON WAR ROOM - CONTINUOUS", "Armed Forces and Intelligence staff scramble to verify.", "He points to a monitor with a photo of Dr. Pavel. An Air", "Force General rubs his chin, thinking, nervous.", "EXT. SKIES ABOVE GOTHAM - CONTINUOUS", "F-22’s streak over the river, sizing up the", "EXT.", "Bane", "Bane", "Bane", "INT.", "The General breaks the silence.", "EXT. GOTHAM BRIDGE - SUNSET", "Mercenaries hold the bridge. A tank rolls across from the", "mainland,", "bullhorn.", "A Captain", "The Captain considers this. Troubled.", "EXT. SKIES ABOVE GOTHAM - CONTINUOUS", "As night falls the F-22’s peel away from the fire-ringed", "city. The voice of the President echoes across the", "airwaves...", "INT. STONE CELL, UNDERGROUND PRISON - CONTINUOUS", "Wayne stares at the old TV. At his burning city.", "Wayne starts to cry.", "INT. CAR - CONTINUOUS (NIGHT)", "Blake drives the deserted streets. Gordon is slumped", "passenger", "Gordon", "EXT. GOTHAM STREET - DAY", "Three camouflage Tumblers roll down the deserted street.", "EXT. BLACKGATE PRISON - MOMENTS LATER", "A crowd of news crews has gathered. Guards in the towers", "look down, apprehensive. The Tumblers roll up, stopping", "front of the gates. Bane emerges from the lead Tumbler.", "INT. CELLBLOCK, BLACKGATE PRISON - CONTINUOUS", "Prisoners strain to hear Bane’s words. Selina", "EXT. BLACKGATE PRISON - CONTINUOUS", "Bane holds up a photo of Harvey Dent.", "INT. BLAKE’S APARTMENT - CONTINUOUS", "Gordon sits watching Bane’s speech. Blake gathers", "EXT. BLACKGATE PRISON - CONTINUOUS", "Bane sets fire to the picture of Dent...", "INT. CELLBLOCK, BLACKGATE PRISON - CONTINUOUS", "The Prisoners start cheering, shouting.", "EXT.", "Bane", "INT.", "This", "EXT.", "Bane", "INT. BLAKE’S APARTMENT - CONTINUOUS", "Blake stares at the TV, Gordon’s face lowers into his", "hands...", "EXT. BLACKGATE PRISON - CONTINUOUS", "The crowd is silent, stunned, as Bane continues", "Bane folds the papers. Looks out to the stunned", "Individuals in the crows start shouting ’Yes!’", "INT. CELLBLOCK, BLACKGATE PRISON - CONTINUOUS", "Prisoners cheer, pounding against the bars. Selina", "watches...", "EXT. BLACKGATE PRISON - CONTINUOUS", "More and more of the crowd is chanting ’Yes!’", "INT. BLAKE’S APARTMENT - CONTINUOUS", "Blake", "Gordon", "EXT. BLACKGATE PRISON - CONTINUOUS", "Bane signals a Tumbler - its turret turns to the prison", "doors.", "The Tumbler fires, blowing the doors to hell.", "Bane’s men surge through the burning gates...", "INT. BLACKGATE PRISON - CONTINUOUS", "Selina watches as Prisoners stream out of open cell doors.", "She makes her way quietly through the excited throng.", "Mercenaries hand out weapons to escaping Prisoners...", "EXT. PARK BOULEVARD - DAY", "As Mercenaries shoot open locks, people storm into expensive", "apartment buildings overlooking the park...", "INT. BEAUTIFUL OLD GOTHAM APARTMENT - DAY", "People ransack the apartment...", "EXT. PARK BOULEVARD - DAY", "Wealthy people are herded onto the street by Mercenaries...", "INT. STOCK EXCHANGE - DAY", "A kangaroo court is in session, presided over by a Criminal", "we recognize from Blackgate. Bane watches from the", "gallery...", "INT. ELEGANT APARTMENT, PARK BOULEVARD - DAY", "Tough-looking Revellers crack open champagne - spraying it,", "swigging it - Selina amongst them, watching...", "INT. SEWERS - DAY", "Hundreds of Police living underground. Dividing up", "lowered by ropes... Ross opens a pack of supplies.", "EXT. GOTHAM STADIUM - NIGHT", "Moving in on the bright glow of the core...", "Close enough to see the flickering digits of its", "countdown...", "Mercenaries load the core into the back of a black", "INT. STONE CELL, UNDERGROUND PRISON - DAY", "Wayne rolls of his cot. Grunts. The Prisoner realizes Wayne", "is trying to do a push-up. From the next cell, the Blind", "Prisoner says something...", "The Prisoner helps Wayne roll over, painfully.", "The", "INSERT CUT: the Mercenary is dropped at the side of a barren", "road. He starts to walk.", "INSERT CUT: a Woman is lowered into the prison. The", "prisoners below all have their faces covered with muslin", "masks...", "INSERT CUT: the Woman watches as the Doctor, (the Blind", "Prisoner, younger-looking, sighted) examines her small", "child. The Doctor exits, locking the cell...", "INSERT CUT: Prisoners move into the cell towards his mother.", "The child runs at them with a knife...", "INSERT CUT: the Protector, face covered, pulls the Child off", "the attackers. One grabs for the Child - the Protector snaps", "his arm, carries the Child into a corner...", "The Blind Prisoner shouts at the Prisoner. He nods.", "The Prisoner pulls - Wayne screams in pain as he is pulled", "upright. The Prisoner ties him off. Checks his spine.", "The Prisoner punches Wayne in the back, hard. Wayne screams.", "Wayne passes out from the pain and we FADE TO BLACK.", "Wayne is hanging in his cell, delirious.", "Ra’s al Ghul, in his Ducard guise, steps in front of Wayne.", "Wayne looks inward, remembering...", "INSERT CUT: Ra’s at the campfire (from Batman Begins).", "INSERT CUT: the Woman is lowered into the prison...", "Wayne looks at Ra’s.", "INSERT CUT: the Mercenary at the side of the road. Ra’s.", "CUT TO WHITE. And we are -", "EXT. STREET, DOWNTOWN GOTHAM - DAY", "Snow blankets the street. A Tumbler carves tracks as it", "patrols the deserted street. Blake peers from behind a", "parked car - he is crouched, feeding a kite string down a", "storm drain.", "INT. SEWER TUNNEL - CONTINUOUS", "Ross strains to reach a note dangling on a string - he", "grasps it. All around him are dozens of Cops living", "underground...", "EXT. GOTHAM STREET - CONTINUOUS", "Blake winds the string, picks up a jerrycan, hurries off.", "INT. ST. SWITHIN’S HOME FOR BOYS - CONTINUOUS", "The home is packed. People, not just kids, huddle in every", "corner. Blake spots Father Reilly. Hands him the can.", "Blake smiles. Moves to the door.", "Blake nods. Leaves.", "INT. ELEGANT APARTMENT, PARK BOULEVARD - DAWN", "Following Selina through rooms strewn with trash, empty", "bottles and sleeping partygoers. She spots a family", "photograph, glass smashed. A hand lands on her shoulder.", "Selina stares out at a Tumbler rolling by.", "INT. STONE CELL, UNDERGROUND PRISON - DAY", "The Prisoner unties the rope from Wayne’s chest.", "stands. Just. Then walks.", "INT. SAME - LATER", "Wayne does push-ups. Stronger. The Prisoner watches.", "The Prisoner indicates the TV:", "SIEGE OF GOTHAM: DAY 84.", "Wayne ignores this. Focuses on his body...", "INT. STONE CELL, UNDERGROUND PRISON - DAY", "Wayne moves to the wall - takes the rope from the Tattooed", "Prisoner, wraps it around his chest. Curious Prisoners", "gather, the Prisoner at their head. Wayne looks up at the", "light, hundreds of feet above. Starts to climb. Prisoners", "get excited as Wayne RISES - money starts exchanging hands.", "Reaching the precipice, he checks his rope, looks up at the", "next handhold, far away. He takes a breath, then LEAPS.", "His fingers brush the ledge. Wayne DROPS a hundred feet -", "the rope catches, SLAMMING him into the rock face. The", "Prisoners disperse, losing interest as the Tattooed Prisoner", "lowers Wayne on the rope. The Blind Prisoner turns away.", "INSERT CUT: the Protector fights off prisoners as the Child,", "older now, moves to the climbing wall", "INSERT CUT: the Child makes the climb...pauses, looking down", "- making eye-contact with the Protector, who fights off", "Prisoners... They swarm over the Protector, knives drawn.", "INSERT CUT: the Child leaps across the abyss, grabbing a", "handhold on the ledge and swinging up...", "Wayne’s eyes close in despair.", "EXT. CHECKPOINT, GOTHAM BRIDGE - DAY", "Supply trucks await inspection. Mercenaries open an", "18-wheeler - check boxes of rations...wave it on...", "EXT. SUPERMARKET - CONTINUOUS", "The 18-wheeler pulls up. A line of Gothamites waits", "patiently along the sidewalk.", "INT. 18-WHEELER - CONTINUOUS", "Three plain-clothes Special Forces Men emerge from the", "boxes, checking, then concealing weapons. The doors open -", "they exit.", "INT. SUPERMARKET - CONTINUOUS", "The Special Forces Men carry boxes into the store as if", "delivering. The Store Manager leads them into the back", "down into -", "INT. LOWER STOREROOM - CONTINUOUS", "Where they are met by four Cops out of uniform.", "Gordon and Blake emerge from the back of the room.", "EXT.", "Blake scouts with Jones. A rumble makes them turn.", "Two Tumblers lead a massive black truck down the street.", "Captain Jones reaches into his jacket and triggers a Geiger", "counter. Shows Blake the display. Nods. One of the Tumblers", "stops, turns back. Blake leads them down a side", "INT.", "Blake", "EXT. SIDE STREET, DOWNTOWN - CONTINUOUS", "Blake leads them to the door of an empty bank.", "INT. TELLSONS BANK - CONTINUOUS", "They head across the empty lobby to an elevator.", "INT. OFFICES ABOVE TELLSONS - MOMENTS LATER", "Blake leads them into empty offices. Cots and", "furnishings line the offices and corridors.", "Lucius Fox is there, with Miranda Tate.", "Captain", "Captain", "Captain", "INT. TELLSONS BANK - MOMENTS LATER", "Captain Jones exits the elevator, followed by his men and", "Blake. Halfway across the floor, hell breaks loose.", "Mercenaries blast them with machine guns - the lobby becomes", "a devastating ambush. Blake dives back into the elevator.", "INT. OFFICES ABOVE TELLSONS - CONTINUOUS", "Blake flies out of the elevator.", "Fox and Miranda burst into the corridor.", "Blake grabs Miranda, heads for the back stairs. Mercenaries", "jump out of the elevator, firing high.", "Fox freezes. Lowers himself to the ground.", "INT. TELLSONS BANK - CONTINUOUS", "Captain Jones goes down in a hail of bullets. The other", "Special Forces Men are down. Bane enters, midges Jones with", "his toe. He is alive. Barely. Bane leans in close. Jones", "looks up at him, defiant.", "Bane places his hand over Jones’s nose and mouth.", "Bane looks up, disinterested. Jones is dead.", "INT. STONE CELL, UNDERGROUND PRISON - DAY", "Wayne stares at the TV: the Special Forces bodies hang in", "the cables of Gotham Bridge. Wayne throws a stone into the", "screen.", "INT. SAME - LATER", "Wayne does endless push-ups, squats, stretches. The", "Prisoner listens. He speaks in an ancient tongue.", "Wayne throws punches...focused.", "INT. UNDERGROUND PRISON - DAY", "Wayne takes the rope at the foot of the climb.", "look up, but none bother to gather round. Wayne starts", "climbing, determined.", "He FIGHTS the rock face...breathing hard. Grabs at a rock", "it comes away in his hand. He DROPS - SMASHES into the rock", "face. The Blind Prisoner shakes his head.", "A Skinny Prisoner playing cards with the Prisoner looks up", "at Wayne, hanging upside down.", "The Prisoner glances up at Wayne, disdainful.", "As Wayne drifts into unconsciousness we -", "INSERT CUT: Young Bruce lies at the bottom of the well,", "looking up at his father, lowering down to rescue him.", "INT. CAVE PRISON - NIGHT", "Wayne", "Wayne", "Wayne", "INT. CAVE PRISON - MORNING", "Wayne puts some scraps of bread into a rough coat which he", "folds into a makeshift shoulder pack.", "Prisoners nearby laugh. Wayne moves to the cliff face. The", "Prisoner follows, intrigued by Wayne’s new demeanor. The", "Tattooed Prisoner offers him the rope. Wayne refuses. Starts", "to climb. Prisoners gather around as word spreads. Wayne", "makes his way cautiously up the treacherous rock face. Down", "below the Prisoners start a low chant.", "As Wayne hoists himself up onto the precipice something", "EXPLODES from the cliff face. Wayne flinches - BATS... They", "circle up to the opening above...", "Wayne closes his eyes. The chant RISES. Wayne takes a", "breath...opens his eyes...looks down at the drop...up", "again...then he jumps.", "Time skips a beat as the Prisoners stop breathing.", "And Wayne GRABS the ledge above.", "The Prisoners go WILD as Wayne hoists himself up onto the", "ledge. The Blind Prisoner nods. Wayne climbs to FREEDOM.", "EXT. CAVE PRISON, NEAR A FORTRESS - CONTINUOUS", "Wayne climbs out of the hole and into formidable desolation.", "He shoulders his pack - spots a large coil of rope attached", "to the wall. He pushes it into the hole then walks away...", "INT. BASEMENT, ABANDONED STOCK EXCHANGE - DAY", "A mass of huddled Gothamites. Professionals (traders,", "industrialists). In a corner, Fox. Mercenaries come down", "into the chamber, pull out a man, who starts yelling. It is", "Stryver, Daggett’s functionary.", "Fox watches him dragged upstairs...", "INT. ABANDONED STOCK EXCHANGE - MOMENTS LATER", "A kangaroo court. Stryver is dragged before a jeering crowd.", "Stryver turns to look at the ’judge’: Dr. Jonathan Crane.", "Jeers. Pull back to reveal a silent figure, watching.", "Stryver looks around, terrified, as the crowd shouts", "’Death’.", "Mercenaries pull Stryver from the dock...", "EXT. GOTHAM RIVER - DAY", "Stryver, with other wealthy Gothamites, is led down to the", "ice. A Blackgate Inmate undoes his handcuffs, whispering.", "The Blackgate Inmate turns away. Stryver is forced onto the", "ice. He shuffles forward, listening to the creaking...", "Stryver is a hundred yards out when the river swallows him.", "INT. EMPTY OFFICE BUILDING - DAY", "Gordon stands over a map of the city. A handful of Cops", "around the room. Waiting. Gordon looks at his watch.", "The door opens and Blake enters, followed by ten", "Gordon is counting them in. He moves to Blake.", "Blake just looks at him. Gordon checks the faces. Realizes.", "Gordon heads for the door.", "EXT. FOLEY’S BROWNSTONE - DAY", "Gordon hurries up the steps to a brownstone. Stabs", "Gordon, furious, addresses the hallway behind her.", "Foley", "Foley", "Gordon turns to see Miranda, Blake behind her.", "Gordon looks at Blake. Then Miranda. Nods.", "EXT. GOTHAM STREET - DAY", "A Kid sprints down the deserted street, chased by two", "Gangbangers. The Kid slips in the snow - the men are on him.", "They grab the Kid’s backpack, the Gangbanger pulls out an", "apple, moves to hit the Kid when - SMACK! - his hand is", "grabbed, and the apple flies into the air as his arm cracks.", "Selina catches the apple.", "Gangbanger 2 lunges with a knife - she spins him, making", "stab himself in the backside. The Gangbangers run off,", "howling. The Kid eyes her, wary.", "Selina looks at the red apple. Takes one perfect bite.", "She tosses him the apple. He takes it and runs.", "Selina recognizes the voice. Turns to find Wayne - strong,", "but weathered. Beard, work clothes.", "Wayne", "She", "EXT. GOTHAM STREETS - DAY", "Gordon and his Men are in two-man teams. Gordon is walking", "down the street with Miranda. He hands her a Geiger counter.", "Blake is up on a rooftop. Gordon moves down to the other end", "of the block. As the truck rumbles into view, Gordon’s Men", "walk out into the street in front of it as if crossing the", "road. The convoy barely slows. Miranda gives Gordon the", "signal. As the truck comes past, he tosses a magnetic GPS", "locator at the lower part of the truck...", "Gordon regroups with his Men on the corner. Checks his GPS.", "They keep moving, turning down the next street...into an", "ambush. Dozens of Mercenaries, weapons trained.", "Blake, from his vantage point, watches Gordon, Miranda and", "the other Cops being rounded up and led away...", "INT. BASEMENT, ABANDONED STOCK EXCHANGE - DAY", "Miranda comforts a crying Woman in the corner. Thugs come", "down the stairs, laughing, leading a Hooded Prisoner. They", "kick him down the last step and he stumbles. Fox moves to", "his aid.", "They dump the Hooded Man with Fox.", "Fox hears this. Pulls the bag from Wayne’s head. Wayne nods", "at him, silent. Fox nods back. The Thugs leave. Miranda", "comes over.", "Catwoman comes down the stairs with the Thugs.", "The thugs pull Wayne and Fox to their feet - Miranda", "up.", "EXT. COLONNADE, HOLDING AREA - CONTINUOUS", "The Thugs lead Wayne and Fox along the colonnade. Catwoman", "spins, takes out one Thug with a heel, one with a punch to", "the throat. Fox smiles as she unlocks his wrists.", "And she’s gone. Fox turns to Wayne. Who shrugs.", "INT. DARK SPACE - NIGHT", "Lights flicker on... Wayne and Fox are in the Bat-Bunker.", "Wayne opens a panel in the wall, takes out equipment:", "mini-mines, Batarangs, utility belt...", "Wayne nods. Smiles. The Batsuit rises from the floor...", "INT. ABANDONED STOCK EXCHANGE - EVENING (LATE DAY)", "Gordon and his men on trial. Crane presides.", "He smashes his gavel. Bane leans in to one of his men,", "indicates Miranda.", "INT. STAIRWELL, SKYSCRAPER - SUNSET", "Wayne bounds up the stairs. Fox follows, out of breath", "EXT. ROOFTOP, SKYSCRAPER, GOTHAM - MOMENTS LATER", "Fox emerges to see Wayne uncovering the Bat... As the sun", "sets, Fox starts pulling apart the gun mount.", "EXT. GOTHAM RIVER - NIGHT", "Gordon and the rest of the men stand at the edge of the ice.", "A Mercenary fires his gun in the air. Gordon takes a breath,", "then leads his men onto the ice...which creaks and groans...", "Further out, Gordon stops - sniffs - looks down: a pool of", "liquid, beside it: a flare. Gordon picks it up, puzzled.", "Gordon, energized by the familiar voice, lights the flare -", "jams it into the liquid, sending a trail of FIRE across", "ice - up into a building where it forms the shape of", "BAT...", "INT. FOLEY’S BROWNSTONE - CONTINUOUS", "Foley moves to a back window. Sees the flaming", "EXT. GOTHAM STREET - CONTINUOUS", "A Mercenary nervously approaches Bane’s back.", "Bane turns. The Mercenary points at the sign.", "INT. FOLEY’S BROWNSTONE, BEDROOM - MOMENTS LATER", "Foley yanks up the floorboards. Pull his dress blues", "their hiding place.", "EXT. OUTFLOW PIPE, ACKERMAN PARK - CONTINUOUS", "Mercenaries guarding the entrance see the sign. One of them", "moves out to get a better look. WHAM! He is taken out by a", "dark figure. The figure steps into the light - it is", "Blake...", "EXT. GOTHAM RIVER - CONTINUOUS", "Batman hands Gordon a metal box.", "EXT. OUTFLOW PIPE, ACKERMAN PARK - CONTINUOUS", "Blake takes out a second Mercenary - moves over to the open", "manhole. Ross emerges - nots at Blake, who helps him climb", "out. BANG - Ross goes down as Blake dives for cover. Blake", "is grabbed by Mercenaries. They detonate the manhole,", "sealing it, prepare to execute Blake. A dark shape drops", "onto the Mercenaries... Blake watches, in awe, as Batman", "takes them out in a fury of punches and kicks - then it", "finished. Quiet. One of the Mercenaries moves slightly.", "Batman", "Blake laughs. Then feels the back of his neck. Batman tosses", "Blake a mini-mine.", "They throw the mini-mines at the rubble of the entrance -", "the blasts barely move any rubble.", "Batman disappears into the shadows.", "KAABOOOM! The Bat’s cannons light up the night.", "Cops", "glad", "Blake nods. Turns to leave. Stops.", "Batman nods. Blake disappears into the night.", "EXT. GOTHAM STREET - CONTINUOUS", "Gordon checks the metal box. Puts it under his coat. Nods at", "his men, hiding in the doorways. Checks his GPS...", "EXT. ALLEY - NIGHT", "Batman leads Catwoman to a rusty old container. He", "revealing the Bat-Pod. Catwoman’s eyes light up.", "She hops on, feeling the controls.", "Catwoman marvels at the controls...", "VARROOOM!", "She shakes her head.", "He looks at her.", "She stares back at him. Facade slipping a touch.", "He says nothing. She looks at him, imploring.", "Batman turns. Catwoman watches him go. Then fires", "bike and takes off.", "EXT. STREETS LEADING TO SOUTH TUNNEL - NIGHT", "Catwoman tears along on the Bat-Pod. She pulls up", "tunnel entrance blocked by stacked vehicles.", "EXT. DOWNTOWN STREETS - DAWN", "The army of Cops stands at the low end of the street. At", "op is Bane’s stronghold - City Hall. Men pour out of the", "building, forming up into an opposing line.", "A Cop wearing full dress blues steps forward. It is Foley.", "The silence is eerie... The numbers look evenly matched -", "until two Tumblers arrive.", "The Cops look shaky, pale, but determined.", "He steps forward. The line follows.", "EXT. CITY HALL - CONTINUOUS", "Bane stands in the colonnade. Watching.", "EXT. STREET, DOWNTOWN GOTHAM - CONTINUOUS", "The Tumblers FIRE into the line of Cops, THROWING men into", "the air, SCREAMING. The line of Cops is about to scatter -", "WHOOOSHHH. The Bat DROPS down in front of the Cops and", "BLASTS both Tumblers, FLIPPING them sideways. The Bat RISES", "and the cops run towards the Mercenaries, firing - until", "they are close enough to fight hand-to-hand. The street is", "filled with thousands of men in pitched battle.", "EXT. STREETS LEADING TO SOUTH TUNNEL - CONTINUOUS", "Catwoman, hearing the distant battle, blasts the tunnel", "blockage...the dust settles. Her path is clear.", "EXT. GOTHAM STREET - CONTINUOUS", "Gordon heard the fighting. Checks the box. Nervous.", "EXT. DOWNTOWN STREET - CONTINUOUS", "Bane strides through the battle, taking out Cops left and", "right. A space clears - he is face the face with the", "Batman...", "Bane leaps at batman, smashing powerful blows into his head.", "Batman ducks, weaves and smashes his fists into Bane’s side.", "Someone is watching from the window of City Hall - Miranda.", "EXT. GOTHAM STREET - CONTINUOUS", "The black truck rounds the corner. Gordon signals his man in", "a Greyhound bus - who pulls across the street. The truck", "smashes into the bus and stops. Gordon and his men swarm in,", "blasting at the Guards. Gordon opens the back - empty. No", "bomb. Wrong truck.", "They sprint for the next parallel avenue...", "INT. REACTOR PLANT - CONTINUOUS", "Fox hurries into the reactor - starts throwing switches...", "EXT. ST. SWITHIN’S HOME FOR BOYS - CONTINUOUS", "Blake leads the boys out of the home - points down the", "street.", "The boys race down the street. Father Reilly climbs into the", "bus.", "EXT. DOWNTOWN STREETS - CONTINUOUS", "Batman and Bane fight, Batman pushing Bane back - a Tumbler", "roars between them, separating them. Batman chases after.", "INT. LOBBY, CITY HALL - CONTINUOUS", "Bane SMASHES backwards through the door, Batman on him.", "Batman POUNDS Bane against the marble floor. Mercenaries", "guarding Miranda move towards them -", "Bane SMASHES Batman’s head - moves in for the kill, but", "Batman SMASHES Ben to the ground, RIPS sideways across the", "tubes of Bane’s mask with the blades of his forearm. Bane", "bellows, thrashing in AGONY. Batman holds him down with", "hand on his throat - searches him with his free hand.", "Bane’s thrashing calms as he stares at batman through", "pain-soaked eyes...gasping through his broken mask", "relief.", "Bane looks at Batman, curiosity behind his pain.", "Batman flinches, frozen as Miranda leans into his", "Miranda has a knife through Batman’s suit, into his ribs...", "She pulls out the trigger...", "EXT. FIFTH STREET - CONTINUOUS", "Gordon spots the second black truck moving down the street.", "His men pull in front, slowing it. Gordon jumps into the", "back. The truck accelerates - Gordon drops, hanging on to", "the bumper, struggling with the box, trying to turn it on...", "INT. LOBBY, CITY HALL - CONTINUOUS", "Batman cannot move to defend himself. He has Bane by the", "throat, but Miranda has her knife in his side -", "INSERT CUT: the child, Talia, makes eye-contact with the", "Protector, then leaps. Down below, Prisoners swarm over the", "protector, ripping the muslin from his face. Bane looks up", "at Talia, says one quiet word -", "Then is overrun.", "INSERT CUT: Young Talia stands by the hole looking out at", "the landscape...", "Talia reaches up to touch Bane’s mask.", "INSERT CUT: the League of Shadows descend into the prison -", "at their head, Ra’s al Ghul. They slaughter prisoners. Then", "stop. Ra’s al Ghul has found Bane, bandaged.", "INT. TEMPLE, LEAGUE OF SHADOWS - DAY", "Bane in a prototype mask, stands on logs, blocking blows", "from men with sticks.", "Ra’s al Ghul watches Bane training. Turns away.", "INT. LOBBY, CITY HALL - CONTINUOUS", "Talia looks into Bane’s eyes as she holds the", "Batman’s side.", "Talia", "Talia", "Talia arms the trigger...", "She hits the button - nothing.", "EXT. FIFTH STREET - CONTINUOUS", "A light on the metal box is blinking. Gordon", "INT. LOBBY, CITY HALL - CONTINUOUS", "Talia turns, furious.", "A Mercenary steps forward -", "Talia looks around, mind racing.", "Talia jumps to her feet. Bane grabs a shotgun", "Mercenary - points it at Batman.", "Talia reaches up to Bane’s mask, reconnects his tubes,", "tenderly.", "Bane nods at her, slowly. Talia moves out with the", "Mercenaries.", "EXT. CITY HALL - CONTINUOUS", "Talia gets into a Tumbler with a Mercenary. Three Tumblers", "pull out in convoy, blowing anything out of the way - cars,", "cops.", "Foley stands in the road, firing his sidearm. Talia’s", "Tumbler SMASHES him out of the way.", "INT. LOBBY, CITY HALL - CONTINUOUS", "Bane grabs Batman, throws him into the floor - checks the", "rounds in the barrels.", "He shuts the gun - jams it into Batman’s face.", "He squeezes the trigger. BLAMMM! Bane is blasted across", "lobby by cannon fire.", "Catwoman is there, on the Bat-Pod.", "EXT. GOTHAM BRIDGE - CONTINUOUS", "Blake pulls up to the barricade, leads the kids off,", "marching them up the bridge, Father Reilly at the rear.", "Uniform shouts through the loudhailer -", "The", "EXT. DOWNTOWN STREETS - CONTINUOUS", "Talia’s convoy surrounds the black truck. Tumblers", "flank, protecting the bomb as it counts down...", "INT. LOBBY, CITY HALL - CONTINUOUS", "Batman looks at Catwoman.", "EXT. CITY HALL - MOMENTS LATER", "Catwoman roars down the steps on the Bat-Pod.", "INT. BLACK TRUCK - CONTINUOUS", "Gordon climbs into the back of the truck - the bomb is", "there, heating up. He looks at the countdown - nine", "minutes...", "EXT. GOTHAM BRIDGE - CONTINUOUS", "Blake turns back to the Uniform.", "Blake walks. Shots ring out at his feet. He keeps walking...", "EXT. GOTHAM STREETS - CONTINUOUS", "The Bat descends on the convoy, Catwoman approaches on the", "ground. A rolling battle ensues. Catwoman targets the rear", "of the Tumblers, Batman swings the Bat in low at the", "junctions, trying to force the convoy east...", "The Tumbler’s gun turrets swing around onto Catwoman. She", "swerves to avoid heave fire.", "EXT. GOTHAM BRIDGE - CONTINUOUS", "Blake continues to walk, ignoring the warning shots.", "His partner arms the detonator. Uniform shouts at Blake -", "As Blake looks, disbelieving, the bridge in front of him", "blasts upwards in a massive fireball. Blake dives backwards.", "EXT. GOTHAM STREETS - CONTINUOUS", "The Bat blasts away in front of the convoy, making a huge", "crater in front of a Tumbler and trapping it, rear in the", "air. Catwoman dodges around it, uses the Bat-Pod cannons to", "take out another Tumbler... The countdown ticks away...seven", "minutes.", "INT. REACTOR PLANT - CONTINUOUS", "As Fox fires up the reactor something catches his eye -", "something is wrong...", "EXT. GOTHAM BRIDGE - CONTINUOUS", "The smoke clears, Blake sees the impossible gap.", "INT. BLACK TRUCK - CONTINUOUS", "Gordon climbs out the back of the truck but is immediately", "strafed by gunfire from the Tumblers. He dives back inside,", "moves to the front of the trailer - looks at the bulkhead,", "gauging the driver’s position. Starts firing blind through", "the bulkhead -", "INT. CAB, BLACK TRUCK - CONTINUOUS", "Bullets fly through the cab. The driver takes one, falls", "forward, dead. Talia takes the wheel - bullets keep coming.", "EXT. GOTHAM BRIDGE - CONTINUOUS", "Blake races back. Father Reilly has the boys in a huddle,", "praying -", "EXT. GOTHAM STREETS - CONTINUOUS", "The Bat spins down in front of the black truck,", "into a hard right turn...", "INT. TRUCK - CONTINUOUS", "Talia watches the navigation screen.", "Talia smiles.", "INT. REACTOR PLANT - CONTINUOUS", "Fox runs to a ladder. Alarms sound. As he hits", "turns. A massive rumble builds - water SMASHES", "reactor, flooding in from both directions.", "EXT. GOTHAM STREETS - CONTINUOUS", "Catwoman comes up behind the lead Tumbler. She", "again and again - it flips diagonally into the", "black truck, causing the truck to lurch onto its side. Both", "vehicles careen into the mouth of the tunnel.", "INT. REACTOR PLANT - CONTINUOUS", "Fox loops his arm around a rung of the ladder and braces as", "a wave smashes into him, painfully...", "EXT. TUNNEL ENTRANCE - CONTINUOUS", "Gordon jumps out of the truck, opening the rear doors to", "expose the glowing core. Catwoman pulls up on the Bat-Pod.", "The Bat lands at the tunnel mouth. Gordon moves in to try", "and grab the core but it is too hot.", "Laughter. Gordon turns. Talia, lying half out the truck.", "Dying.", "INT. REACTOR PLANT - CONTINUOUS", "Fox pulls himself above the rising whitewater -", "EXT. TUNNEL ENTRANCE - CONTINUOUS", "Gordon looks down at Talia. Batman is at his side.", "Talia smiles as her eyes flutter closed. Gordon turns -", "Batman is at the core, plunging his hands into the heat", "attach a hoist from the Bat.", "Catwoman is at his side as he works.", "She takes this in. He stands to face her.", "She puts his arms around his neck. Kisses him.", "to the Bat, Gordon alongside.", "Batman opens the canopy.", "EXT. GOTHAM BRIDGE - CONTINUOUS", "Blake grabs at the smallest boys, shoving them", "Blake turns on Father Reilly, furious.", "EXT. TUNNEL ENTRANCE - CONTINUOUS", "Gordon puts a hand on Batman’s arm.", "Batman sits into the cockpit, then looks again at", "The canopy loses - and as the Bat fires up Gordon", "-", "INSERT CUT: Gordon, in his uniform, wraps the overcoat", "around the Young Bruce’s shoulders, his eyes reassuring,", "loving.", "Gordon looks up to the cockpit -", "- but is dusted by downdraft as the Bat RISES. Gordon LEAPS", "out of the way as the core is dragged along and out of the", "tunnel mouth.", "The Bat struggles with the weight of the smoking core... A", "building is in the way - Batman fights the controls but", "there’s no power to get over it.", "EXT. GOTHAM BRIDGE - CONTINUOUS", "Blake shouts into the bus -", "Blake turns to him, furious.", "An EXPLOSION from downtown Gotham. Blake looks across,", "startled, turns to the children on the bus.", "The smallest of the boys stares through the window past", "Blake.", "Blake turns to see the Bat thundering out of the heart of", "Gotham, trailing smoke, the core hanging from it. It curves", "dangerously close to the bridge before heading for the mouth", "of the river...the bay...the ocean...", "Until a point of light fires into an enormous nuclear BLAST", "- wind and light and dust blowing VIOLENTLY but harmlessly", "over the bridge, the tunnel mouth, all of Gotham...", "As the nuclear dawn fades over Gotham, and we see its", "inhabitants start to raise their heads, and helicopters and", "boats converge on the island, we hear a voice. Jim Gordon.", "Blake pulls out his badge. Throws it into the river.", "EXT. GARDENS, WAYNE MANOR - DAY", "Gordon is reading from A Tale of Two Cities. Opposite is", "Fox, arm in a sling, and Blake, grim. Another figure is", "there, whose face we do not yet see...", "Gordon closes the book, looking down at Bruce Wayne’s grave.", "Gordon looks up at the figure standing across from him...", "Alfred. Tears streaming.", "Fox places a gentle hand on Alfred’s shoulder, then leaves.", "Gordon and Blake follow. Alfred, alone with the Wayne", "family, turns to the grave beside Bruce’s - the grave", "Thomas and Martha Wayne.", "And the old man’s shoulders begin to shake with sobs.", "EXT. FRONT ENTRANCE, WAYNE MANOR - CONTINUOUS", "Gordon nods at Lucius. Blake is at Gordon’s side.", "EXT. PLAZA, DOWNTOWN GOTHAM - DAY", "Gordon, on a platform with dignitaries, watches a statue", "being unveiled. The curtain parts: Batman, immortalized in", "granite. We move in on the stone face...", "INT. LAWYER’S OFFICE - DAY", "The voice belongs to Wayne’s lawyer, addressing a", "group.", "He glances up to see someone slip into the room -", "EXT. WAYNE MANOR - DAY", "Movers carefully bring artworks and furniture out", "house, watched by a solitary figure. Alfred.", "INT. LAWYER’S OFFICE - DAY", "Blake shifts. Out of place. The Lawyer continues.", "EXT. WAYNE MANOR - DAY", "Different movers carry bunk beds into the huge house.", "A schoolbus pulls up. Father Reilly shepherds children", "towards the house. The children look up at the", "wide-eyed.", "A sign reads:", "THE MARTHA AND THOMAS WAYNE HOME FOR CHILDREN", "INT. LAWYER’S OFFICE - DAY", "People file out as the Lawyer stands.", "Blake approaches the Clerk. She smiles.", "Blake realizes, offers her his driving license.", "The Clerk glances at the license. Checks.", "She reaches down behind the desk, sorting through", "items, and hands him a sports bag. Blake takes it, curious.", "Blake smiles, embarrassed. Leaves.", "INT. APPLIED SCIENCES - DAY", "Fox stands in front of the second camouflage rotor.", "Techs are examining the controls in the cockpit.", "Tech 2 types some more keys. Looks surprised.", "Fox turns away from the rotor, an idea starting", "EXT. WOODS - DAY", "Blake sits in his car looking at a GPS device, puzzled.", "Beside him, the sports bag, open. In it is a piece of paper", "with coordinates, on top of some climbing rope and shackles.", "Blake gets out of the car with the bag. Follows the GPS into", "the trees.", "EXT. CAFÉ, FLORENCE - DAY", "Alfred, paper under his arm, heads to his usual table. Sits.", "EXT. WOODS - DAY", "Blake finds a large waterfall... He checks his GPS,", "confused. Stares at the waterfall. Reaches for the climbing", "gear...", "EXT. MCU - NIGHT", "Gordon steps onto the roof with his pile of arrest", "reports...", "EXT. CAFÉ, FLORENCE - DAY", "As Alfred sips his drink, he glances up at a couple at the", "next table. Strangers. Alfred looks back down...", "INT. CAVE - DAY", "Moving in on the waterfall from inside... Blake bursts", "through, landing painfully on the shale inside. he gets to", "his feet, moving cautiously into the cave...", "EXT. MCU - NIGHT", "Gordon bangs his files against the air duct, straightening", "them. He stops. Sees something. The searchlight...fixed.", "Gordon runs his fingers across a brand new, steel Bat", "symbol... He looks up into the night...", "INT. CAVE - DAY", "Blake lights his torch...then ducks, crouching, as THOUSANDS", "of SCREECHING creatures descend. BATS...", "EXT. CAFÉ, FLORENCE - DAY", "Alfred folds his paper. Pulls out his money, then stops,", "seeing...across the tables, a familiar couple... Bruce", "smiles at Alfred, who nods. Bruce turns back to the pretty", "brunette in pearls. Selina. Alfred pays his bill, content.", "INT. CAVE - DAY", "Blake lifts his head, FEELING the bats all around him...", "Blake RISES, and is SWALLOWED by the darkness of their wings", "and we -", "FADE OUT.", "CREDITS.", "END."]}