{"WOMAN (O.S.)": [" Oh god...oh god...oh god..."], "WOMAN (O.S.) (CONT’D)": [" Oh god...that's sooo good...you're the best...the best I ever had..."], "D.A. (O.S.)": [" Mr. Dufresne, describe the confrontation you had with your wife the night she was murdered.", " Samuel Norton? We have a warrant for your arrest! Open up!"], "ANDY DUFRESNE": [" is on the witness stand, hands folded, suit and tie pressed, hair meticulously combed. He speaks in soft, measured tones:"], "ANDY": [" It was very bitter. She said she was glad I knew, that she hated all the sneaking around. She said she wanted a divorce in Reno.", " I told her I would not grant one.", " If they say so. I really don't remember. I was upset.", " She packed a bag and went to stay with Mr. Quentin.", " I went to a few bars first. Later, I decided to drive to Mr. Quentin's home and confront them. They weren't there...so I parked my car in the turnout...and waited.", " I'm not sure. I was confused. Drunk. I think mostly I wanted to scare them.", " Yes. I did.", " No. I was sobering up. I realized she wasn't worth it. I decided to let her have her quickie divorce.", " I did not. I got back in the car and drove home to sleep it off. Along the way, I stopped and threw my gun into the Royal River. I feel I've been very clear on this point.", " Yes. It does.", " Yes. It does.", " Strike me as a fantastic coincidence.", " It's the truth.", " Since I am innocent of this crime, sir, I find it decidedly inconvenient the gun was never found.", " Hadn't planned on it.", " What was his name?", " I was wondering if anyone knew his name.", " Hello. I'm Andy Dufresne.", " How do you know that?", " I didn't, since you ask.", " What else have you heard?", " What do you think?", " I understand you're a man who knows how to get things.", " I wonder if you could get me a rock- hammer?", " You make your customers' motives a part of your business?", " Fair enough. A rock-hammer is about eight or nine inches long. Looks like a miniature pickaxe, with a small sharp pick on one end, and a blunt hammerhead on the other. It's for rocks.", " Quartz, sure. And look. Mica. Shale. Silted granite.", " I'm a rockhound. At least I was, in my old life. I'd like to be again, on a limited scale.", " I have no enemies here.", " Tell me something. Would it help if I explained to them I'm not homosexual?", " Thanks for the advice.", " If there's trouble, I doubt a rock- hammer will do me any good.", " You'll know when you see the rock- hammer.", " Seven dollars in any rock and gem shop.", " Ten it is.", " Oh?", " I understand. Thank you, Mr...?", " Red. I'm Andy. Pleasure doing business with you.", " You get this in your eyes, it blinds you.", " Mr. Hadley. Do you trust your wife?", " What I mean is, do you think she'd go behind your back? Try to hamstring you?", " Because if you do trust her, there's no reason in the world you can't keep every cent of that money.", " If you want to keep that money, all of it, just give it to your wife. See, the IRS allows you a one-time- only gift to your spouse. It's good up to sixty thousand dollars.", " Tax free. IRS can't touch one cent.", " It's perfectly legal. Go ask the IRS, they'll say the same thing. Actually, I feel silly telling you all this. I'm sure you would have investigated the matter yourself.", " Of course not. But you will need somebody to set up the tax-free gift, and that'll cost you. A lawyer, for example...", " ...or come to think of it, I suppose I could set it up for you. That would save you some money. I'll write down the forms you need, you can pick them up, and I'll prepare them for your signature... nearly free of charge. I'd only ask three beers apiece for my co-workers, if that seems fair.", " I think a nan working outdoors feels more like a man if he can have a bottle of suds. That's only my opinion.", " No thanks. I gave up drinking.", " Chess. Now there's a game of kings. Civilized...strategic...", " Maybe you'll let me teach you someday. I've been thinking of getting a board together.", " We might do business on a board. But the pieces, I'd like to carve those myself. One side done in quartz... the opposing side in limestone.", " Years I've got. What I don't have are the rocks. Pickings here in the exercise yard are pretty slim.", " Not yet. I suppose I should.", " I suppose we are.", " I'm innocent, remember? Just like everybody else here.", " Innocent?", " I know. I've seen it three times this month already.", " Rita Hayworth. Can you get her?", " Weeks?", " I know. I've seen it three times this month already.", " Rita Hayworth. Can you get her?", " Weeks?", " They'd never hear me over that. Let's get this over with.", " Okay.", " Anything you put in my mouth, you're going to lose.", " Okay. But you should know that sudden serious brain injury causes the victim to bite down. Hard. In fact, I understand the bite- reflex is so strong the victim's jaws have to be pried open with a crowbar.", " Good evening.", " Watch ye therefore, for ye know not when the master of the house cometh.", " John. Chapter 8, verse 12.", " It's called a rock blanket. It's for shaping and polishing rocks. Little hobby of mine.", " It's very pretty, sir.", " No, sir. Not especially.", " Hey, Jake. Where's Brooks?", " I've been reassigned to you.", " Brooks? How long have you been librarian?", " In all that time, have you ever had an assistant?", " So why now? Why me?", " I see. Well. Why don't we have a seat and talk it over?", " What did you have in mind? A weekly draw on your pay?", " He was right. You don't want your money in a bank.", " What's that gonna earn you? Two and a half, three percent a year? We can do a lot better than that. So tell me, Mr. Dekins. Where do you want to send your kids? Harvard? Yale?", " I wouldn't say \"friends.\" I'm a convicted murderer who provides sound financial planning. That's a wonderful pet to have.", " Maybe it can do more than that.", " Ask the warden for funds.", " I see. Perhaps I could write to the State Senate and request funds directly from them.", " Still, I'd like to try, with your permission. I'll send a letter a week. They can't ignore me forever.", " Moresby Prison issued you that gun, but you actually had to pay for it?", " See, that's all deductible. You get to write that off.", " Say Red, could you hand me a stack of those 1040s?", " Brooks, you're not going to hurt Heywood, we all know that. Even Heywood knows it, right Heywood?", " Why? Ask anyone, they'll tell you. Brooks Hatlen is a reasonable man.", " You're not fooling anybody, so just put the damn knife down and stop scaring the shit out of people.", " Take it easy. You'll be all right.", " I just don't understand what happened in there, that's all.", " P.S. Tell Heywood I'm sorry I put a knife to his throat. No hard feelings.", " Red!", " That's real pretty, Red. Nice work.", " What is all this?", " Dear Mr. Dufresne. In response to your repeated inquiries, the State Senate has allocated the enclosed funds for your library project... \" This is two hundred dollars.", " Only took six years. From now on, I send two letters a week instead of one.", " They broke the door down before I could take requests.", " Easiest time I ever did.", " I had Mr. Mozart to keep me company. Hardly felt the time at all.", " The music was here...and here. That's the one thing they can't confiscate, not ever. That's the beauty of it. Haven't you ever felt that way about music, Red?", " Here's where it makes most sense. We need it so we don't forget.", " That there are things in this world not carved out of gray stone. That there's a small place inside of us they can never lock away, and that place is called hope.", " Like Brooks did?", " You wonder where it went. I wonder where ten years went.", " You gonna play something?", " ...Stevenson. Next?", " Trade skills and hobbies, those go under educational. Stack right behind you.", " Dumas. You boys'll like that one. It's about a prison break.", " Two deposits, Casco Bank and New England First. Night drop, like always.", " Very nice.", " What you hear isn't half of it. He's got scams you haven't dreamed of. Kickbacks on his kickbacks. There's a river of dirty money flowing through this place.", " That's where I come in. I channel it, funnel it, filter it...stocks, securities, tax free municipals... I send that money out into the big world. And when it comes back...", " Cleaner. By the time Norton retires, I will have made him a millionaire.", " I thought you had more faith in me than that.", " Sure it will. But not to me, and certainly not to the warden.", " Peter Stevens.", " The silent, silent partner. He's the guilty one, your Honor. The man with the bank accounts.", " A phantom. An apparition. Second cousin to Harvey the Rabbit. I conjured him out of thin air. He doesn't exist...except on paper.", " Sure you can, if you know how the system works, and where the cracks are. It's amazing what you can accomplish by mail. Mr. Stevens has a birth certificate, social security card, driver's license. They ever track those accounts, they'll wind up chasing a figment of my imagination.", " It's funny. On the outside, I was an honest man. Straight as an arrow. I had to come to prison to be a crook.", " I don't run the scams, Red, I just process the profits. That's a fine line, maybe. But I've also built that library, and used it to help a dozen guys get their high school diplomas. Why do you think the warden lets me do all that?", " I work cheap. That's the trade-off.", " Perhaps it's time you considered a new profession. What I mean is, you don't seem to be a very good thief. Maybe you should try something else.", " Everyone's innocent in here. Don't you know that?", " I don't waste time on losers, Tommy.", " That's a good start. If we do this, we do it all the way. One hundred percent. Nothing half-assed.", " Well. You've come to the right place then.", " ...and the lamplight o'er him streaming throws his shadow on the floor...and my soul from out that shadow that lies floating on the floor, shall be lifted nevermore! \"", " That's right.", " Well?", " May not be as bad as you think.", " We'll see how the score comes out.", " Sir?", " I think he's telling the truth.", " It wouldn't matter. With Tommy's testimony, I can get a new trial.", " They'd have his last known address. Names of relatives... Well it's a chance. isn't it? How can you be so obtuse?", " Obtuse! Is it deliberate? The country club will have his old time cards! W-2s with his name on them!", " Look, if it's the squeeze, don't worry. I'd never say what goes on in here. I'd be just as indictable as you for laundering the money!", " I was just trying to rest your mind at ease, that's all.", " What's the matter with you? It's my chance to get out, don't you see that? It's my life! Don't you understand it's my life?", " I'm done. It stops right now. Get H&R Block to declare your income.", " My wife used to say I'm a hard man to know. Like a closed book. Complained about it all the time. She was beautiful. I loved her. But I guess I couldn't show it enough. I killed her, Red.", " No. I didn't. Someone else did, and I wound up here. Bad luck, I guess.", " It floats around. Has to land on somebody. Say a storm comes through. Some folks sit in their living rooms and enjoy the rain. The house next door gets torn out of the ground and smashed flat. It was my turn, that's all. I was in the path of the tornado. I just had no idea the storm would go on as long as it has. Think you'll ever get out of here?", " Tell you where I'd go. Zihuatanejo.", " Mexico. Little place right on the Pacific. You know what the Mexicans say about the Pacific? They say it has no memory. That's where I'd like to finish out my life, Red. A warm place with no memory. Open a little hotel right on the beach. Buy some worthless old boat and fix it up like new. Take my guests out charter fishing. You know, a place like that, I'd need a man who can get things.", " You underestimate yourself.", " Not me. I didn't shoot my wife and I didn't shoot her lover, and whatever mistakes I made I've paid for and then some. That hotel and that boat...I don't think it's too much to want.", " You're right. It's down there, and I'm in here. I guess it comes down to a simple choice, really. Get busy living or get busy dying.", " Red, if you ever get out of here, do me a favor. There's this big hayfield up near Buxton. You know where Buxton is?", " One in particular. Got a long rock wall with a big oak at the north end. Like something out of a Robert Frost poem. It's where I asked my", " You'll just have to pry up that rock and see.", " Just about done, sir.", " Just about done, sir.", " My name is Peter Stevens. I've come to close out some accounts.", " Thank you. I'm sure I will.", " Please. Would you add this to your outgoing mail?", " You look like a man who knows how to get things."], "D.A.": [" What was your response?", " (refers to his notes) I'll see you in Hell before I see you in Reno. Those were the words you used, Mr. Dufresne, according to the testimony of your neighbors.", " What happened after you and your wife argued?", " Glenn Quentin. The golf pro at the Falmouth Hills Country Club.", " With what intention?", " You had a gun with you?", " When they arrived, you went up to the house and murdered them?", " Quickie divorce indeed. A .38 caliber divorce, wrapped in a handtowel to muffle the shots, isn't that what you mean? And then you shot her lover!", " Yes, you have. Where I get hazy, though, is the part where the cleaning woman shows up the next morning and finds your wife and her lover in bed, riddled with .38 caliber bullets. Does that strike you as a fantastic coincidence, Mr. Dufresne, or is it just me?", " I'm sorry, Mr. Dufresne, I don't think the jury heard that.", " Does what?", " On that, sir, we are in accord...", " You recall Lt. Mincher's testimony? He and his men dragged that river for three days and nary a gun was found. So no comparison can be made between your gun and the bullets taken from the bloodstained corpses of the victims. That's also rather convenient, isn't it, Mr. Dufresne?", " Ladies and gentlemen, you've heard all the evidence, you know all the facts. We have the accused at the scene of the crime. We have foot prints. Tire tracks. Bullets scattered on the ground which bear his fingerprints. A broken bourbon bottle, likewise with fingerprints. Most of all, we have a beautiful young woman and her lover lying dead in each other's arms. They had sinned. But was their crime so great as to merit a death sentence?", " Byron Hadley?"], "(MORE)": ["", "", "", "", "", "", "", "", "", "", "", "", "", ""], "D.A. (CONT'D)": [" The man you had recently discovered was her lover. (Andy nods) Did you follow her?"], "D.A. (CONT’D)": [" You claim you threw your gun into the Royal River before the murders took place. That's rather convenient.", " I suspect Mr. Dufresne's answer to that would be yes. I further suspect he carried out that sentence on the night of September this year of our Lord, 1946, by pumping four bullets into his wife and another four into Glenn Quentin. And while you think about that, think about this...", " A revolver holds six bullets, not eight. I submit to you this was not a hot-blooded crime of passion! That could at least be understood, if not condoned. No, this was revenge of a much more brutal and cold-blooded nature. Consider!", " Four bullets per victim! Not six shots fired, but eight! That means he fired the gun empty...and then stopped to reload so he could shoot each of them again! An extra bullet per lover...right in the head. (a few JURORS shiver) I'm done talking. You people are all decent, God-fearing Christian folk. You know what to do.", " You have the right to remain silent. If you give up that right, anything you say will be used against you in court..."], "VOICE (O.S.)": [" Guilty. Guilty. Guilty. Guilty...", " I had your mother! She wasn't that great!", " He took the Lord's name in vain! I'm tellin' the warden!", " Return to your cellblocks for evening count.", " Lights out!"], "JUDGE": [" You strike me as a particularly icy and remorseless man, Mr. Dufresne. It chills my blood just to look at you. By the power vested in me by the State of Maine, I hereby order you to serve two life sentences, back to back, one for each of your victims. So be it."], "MAN #1": [" Sit.", " Your file says you've served forty years of a life sentence. You feel you've been rehabilitated?"], "MAN #2": [" We see by your file you've served twenty years of a life sentence.", " You feel you've been rehabilitated?", " Well, it means you're ready to rejoin society as a--", " Well...are you?"], "MAN #3": [" You feel you've been rehabilitated?"], "RED": [" Yes, sir. Absolutely. I've learned my lesson. I can honestly say I'm a changed man. I'm no longer a danger to society. That's the God's honest truth. No doubt about it.", " There they are, boys. The Human Charm Bracelet.", " Bear Catholic? Pope shit in the woods? Smokes or coin, bettor's choice.", " High roller. Who's your horse?", " That's five cigarettes on Fat-Ass. Any takers?", " Little fella on the end. Definitely. I stake half a pack. Any takers?", " C'mon, boys, who's gonna prove me wrong? Floyd, Skeet, Joe, Heywood. Four brave souls, ten smokes apiece. That's it, gentlemen, this window's closed.", " Give him some'a your cigarettes instead, cheap bastard.", " The wife-killin' banker.", " I keep my ear to the ground. Why'd you do it?", " Hell, you'll fit right in, then. Everyone's innocent in here, don't you know that? Heywood! What are you in for, boy?", " People say you're a cold fish. They say you think your shit smells sweeter than ordinary. That true?", " Ain't made up my mind yet.", " I'm known to locate certain things from time to time. They seem to fall into my hands. Maybe it's 'cause I'm Irish.", " What is it and why?", " If you wanted a toothbrush, I wouldn't ask questions. I'd just quote a price. A toothbrush, see, is a non-lethal sort of object.", " Rocks.", " So?", " Yeah, that or maybe plant your toy in somebody's skull?", " No? Just wait.", " Neither are they. You have to be human first. They don't qualify. Bull queers take by force, that's all they want or understand. I'd grow eyes in the back of my head if I were you.", " That comes free. But you understand my concern.", " Then I guess you wanna escape. Tunnel under the wall maybe? I miss the joke. What's so funny?", " What's this item usually go for?", " My standard mark-up's twenty percent, but we're talkin' about a special object. Risk goes up, price goes up. Call it ten bucks even.", " I'll see what I can do. But it's a waste of money.", " Folks who run this place love surprise inspections. They turn a blind eye to some things, but not a gadget like that. They'll find it, and you'll lose it. Mention my name, we'll never do business again. Not for a pair of shoelaces or a stick of gum.", " Red. The name's Red.", " Dufresne.", " Crying shame. Some folks got it awful bad.", " God damn it...", " King me.", " ...and totally fuckin' inexplicable. Hate that game.", " You come to the right place. I'm the man who can get things.", " That'd take you years.", " How's that rock-hammer workin' out anyway? Scratch your name on your wall yet?", " Andy? I guess we're gettin' to be friends, ain't we?", " I ask a question? Why'd you do it?", " Murder. Same as you.", " The only guilty man in Shawshank.", " Here's the good part. Bugs come out of the walls to get his ass.", " Sure. What do you want?", " No problem. Take a few weeks.", " Don't have her stuffed down my pants this very moment, sorry to say. Relax. What are you so nervous about? She's just a woman.", " Sure. What do you want?", " No problem. Take a few weeks.", " Don't have her stuffed down my pants this very moment, sorry to say. Relax. What are you so nervous about? She's just a woman.", " I'm thinkin' Andy could use a nice welcome back when he gets out of the infirmary.", " Man likes to play chess. Let's get him some rocks.", " Horse apple.", " No, horse shit. Petrified.", " Makin' yourself some friends, Andy.", " Got you out of the laundry, didn't it?", " What the hell's going on?", " No. We'll handle this. Ain't that right, Brooks? Just settle down and we'll talk about it, okay?", " Why? What's Heywood done to you?", " Yeah, that's right. That's what everybody says.", " You've had worse from shaving. What'd you do to set him off?", " Ain't that bad, old hoss. Won't be long till you're squiring pretty young girls on your arm and telling 'em lies.", " Heywood, enough. Ain't nothing wrong with Brooksie. He's just institutionalized, that's all.", " Man's been here fifty years. This place is all he knows. In here, he's an important man, an educated man. A librarian. Out there, he's nothing but a used-up old con with arthritis in both hands. Couldn't even get a library card if he applied. You see what I'm saying?", " Believe what you want. These walls are funny. First you hate 'em, then you get used to 'em. After long enough, you get so you depend on 'em. That's \"institutionalized.\"", " Goddamn right. They send you here for life, and that's just what they take. Part that counts, anyway.", " He should'a died in here, goddamn it.", " Is that Jake?", " Lord. Brooks was a sinner. Jake was just a crow. Neither was much to look at. Both got institutionalized. See what you can do for 'em. Amen.", " Oh, they let you tote that record player down there, huh? I could'a swore they confiscated that stuff.", " Played a mean harmonica as a younger man. Lost my taste for it. Didn't make much sense on the inside.", " Forget?", " Hope is a dangerous thing. Drive a man insane. It's got no place here. Better get used to the idea.", " Yes sir, without a doubt. I can say I'm a changed man. No danger to society, that's the God's honest truth. Absolutely rehabilitated.", " Same old, same old. Thirty years. Jesus. When you say it like that...", " It's very pretty, Andy. Thank you.", " Not today.", " I got here an auto repair manual, and a book on soap carving.", " Maybe that should go under educational too.", " Nobody asked you.", " Got his fingers in a lot of pies, from what I hear.", " Money like that can be a problem. Sooner or later you gotta explain where it came from.", " It's clean as a virgin's whistle?", " Jesus. They ever catch on, he's gonna wind up wearing a number himself.", " I'm sure you're good, but all that paper leaves a trail. Anybody gets too curious -- FBI, IRS, whatever -- that trail's gonna lead to somebody.", " Who then?", " Who?", " Yeah, okay, but who the hell is he?", " You can't just make a person up.", " Jesus. Did I say you were good? You're Rembrandt.", " Does it ever bother you?", " To keep you happy and doing the laundry. Money instead of sheets.", " Ass in gear, son! You're putting us behind!", " That's crap, son. He's proud of you. Proud as a hen. We been friends a long time. I know him as good as anybody.", " Smart as they come. Used to be a banker on the outside.", " Murder.", " You wouldn't think, lookin' at him. Caught his wife in bed with some golf pro. Greased 'em both. C'mon, boy, back to work...", " Andy?", " Like hell. You didn't pull the trigger, and you didn't convict him.", " Since '47. Going on nineteen years.", " Board of Education.", " Looks that way. You gonna open it or stick your thumb up your butt?", " Well, shit.", " That don't make you a murderer. Bad husband, maybe.", " Bad luck? Jesus.", " Sure. When I got a long white beard and about three marbles left rolling around upstairs.", " Zihuatanejo?", " Jesus, Andy. I couldn't hack it on the outside. Been in here too long. I'm an institutional man now. Like old Brooks Hatlen was.", " Bullshit. In here I'm the guy who can get it for you. Out there, all you need are Yellow Pages. I wouldn't know where to begin. Pacific Ocean? Hell. Like to scare me to death, somethin' that big.", " Goddamn it, Andy, stop! Don't do that to yourself! Talking shitty pipedreams! Mexico's down there, and you're in here, and that's the way it is!", " Andy?", " Lots of hayfields there.", " What? What's buried there?", " I tell you, the man was talkin' crazy. I'm worried, I truly am.", " Every man's got a breaking point.", " Yeah. Sure. That's right.", " Well what?", " No sir, he didn't!", " It's shit, it's shit, oh my God it's shit...", " I heard you. Rehabilitated. Let's see now. You know, come to think of it, I have no idea what that means.", " I know what you think it means. Me, I think it's a made-up word, a poli- tician's word. A word so young fellas like you can wear a suit and tie and have a job. What do you really want to know? Am I sorry for what I did?", " Not a day goes by I don't feel regret, and not because I'm in here or because you think I should.", " Sir? Restroom break sir?", " Yes sir. That I am.", " Things got different out here.", " Guess the world moved on.", " McNary, Texas?", " I'm known to locate certain things from time to time."], "RED (V.O.)": [" There's a con like me in every prison in America, I guess. I'm the guy who can get it for you. Cigarettes, a bag of reefer if you're partial, a bottle of brandy to celebrate your kid's high school graduation. Damn near anything, within reason.", " Yes sir, I'm a regular Sears & Roebuck.", " So when Andy Dufresne came to me in and asked me to smuggle Rita Hayworth into the prison for him, I told him no problem. And it wasn't.", " Andy came to Shawshank Prison in early 1947 for murdering his wife and the fella she was bangin'.", " On the outside, he'd been vice- president of a large Portland bank. Good work for a man as young as he was, when you consider how conservative banks were back then.", " I must admit I didn't think much of Andy first time I laid eyes on him. He might'a been important on the outside, but in here he was just a little turd in prison grays. Looked like a stiff breeze could blow him over. That was my first impression of the man.", " The first night's the toughest, no doubt about it. They march you in naked as the day you're born, fresh from a Bible reading, skin burning and half-blind from that delousing shit they throw on you...", " ...and when they put you in that cell, when those bars slam home, that's when you know it's for real. Old life blown away in the blink of an eye...a long cold season in hell stretching out ahead...nothing left but all the time in the world to think about it.", " Most new fish come close to madness the first night. Somebody always breaks down crying. Happens every time. The only question is, who's it gonna be?", " It's as good a thing to bet on as any, I guess. I had my money on Andy Dufresne...", " I remember my first night. Seems a long time ago now.", " The boys always go fishin' with first-timers...and they don't quit till they reel someone in.", " His first night in the joint, Andy Dufresne cost me two packs of cigarettes. He never made a sound...", " I could see why some of the boys took him for snobby. He had a quiet way about him, a walk and a talk that just wasn't normal around here. He strolled. like a man in a park without a care or worry. Like he had on an invisible coat that would shield him from this place. Yes, I think it would be fair to say I liked Andy from the start.", " He was a man who adapted fast.", " Years later, I found out he'd brought in quite a bit more than just ten dollars...", " When they check you into this hotel, one of the bellhops bends you over and looks up your works, just to make sure you're not carrying anything. But a truly determined man can get an object quite a ways up there.", " That's how Andy joined our happy little Shawshank family with more than five hundred dollars on his person. Determination.", " Andy was right. I finally got the joke. It would take a man about six hundred years to tunnel under the wall with one of these.", " I wish I could tell you that Andy fought the good fight, and the Sisters let him be. I wish I could tell you that, but prison is no fairy-tale world.", " He never said who did it...but we all knew.", " Things went on like that for a while. Prison life consists of routine, and then more routine.", " Every so often, Andy would show up with fresh bruises.", " The Sisters kept at him. Sometimes he was able to fight them off... sometimes not.", " He always fought, that's what I remember. He fought because he knew if he didn't fight, it would make it that much easier not to fight the next time.", " Half the time it landed him in the infirmary...", " ...the other half, it landed him in solitary. Warden Norton's \"grain & drain\" vacation. Bread, water, and all the privacy you could want.", " And that's how it went for Andy. That was his routine. I do believe those first two years were the worst for him. And I also believe if things had gone on that way, this place would have got the best of him. But then, in the spring of 1949, the powers-that-be decided that...", " It was outdoor detail, and May is one damn fine month to be workin' outdoors.", " More than a hundred men volunteered for the job.", " Wouldn't you know it? Me and some fellas I know were among the names called.", " Only cost us a pack of smokes per man. I made my usual twenty percent, of course.", " And that's how it came to pass, that on the second-to-last day of the job, the convict crew that tarred the plate factory roof in the spring of '49...", " ...wound up sitting in a row at ten o'clock in the morning, drinking icy cold Black Label beer courtesy of the hardest screw that ever walked a turn at Shawshank State Prison.", " The colossal prick even managed to sound magnanimous.", " We sat and drank with the sun on our shoulders, and felt like free men. We could'a been tarring the", " As for Andy, he spent that break hunkered in the shade, a strange little smile on his face, watching us drink his beer.", " You could argue he'd done it to curry favor with the guards. Or maybe make a few friends among us cons. Me, I think he did it just to feel normal again...if only for a short while.", " Bogs didn't put anything in Andy's mouth, and neither did his friends. What they did do is beat him within an inch of his life...", " Andy spent a month in traction.", " Bogs spent a week in the hole.", " Two things never happened again after that. The Sisters never laid a finger on Andy again...", " ...and Bogs never walked again. They transferred him to a minimum security hospital upstate. To my knowledge, he lived out the rest of his days drinking his food through a straw.", " Despite a few hitches, the boys came through in fine style...", " ...and by the week Andy was due back, we had enough rocks saved up to keep him busy till Rapture.", " Also got a big shipment in that week. Cigarettes, chewing gum, shoelaces, playing cards with naked ladies on 'em, you name it... ...and, of course, the most important item.", " Tossin' cells was just an excuse. Truth is, Norton wanted to size Andy up.", " So Andy started writing a letter a week, just like he said.", " And just like Norton said, Andy got no answers. But still he kept on.", " The following April, Andy did tax returns for half the guards at Shawshank.", " Year after that, he did them all... including the warden's.", " Year after that, they rescheduled the start of the intramural season to coincide with tax season...", " The guards on the opposing teams all remembered to bring their W- 2's.", " Yes sir, Andy was a regular H&R Block. In fact, he got so busy at tax time, he was allowed a staff.", " Got me out of the wood shop a month out of the year, and that was fine by me.", " And still he kept sending those letters...", " It never would have occurred to us, if not for Andy. It was his idea. We all agreed it was the right thing to do...", " I have no idea to this day what them two Italian ladies were singin' about. Truth is, I don't want to know. Some things are best left unsaid.", " I tell you, those voices soared. Higher and farther than anybody in a gray place dares to dream. It was like some beautiful bird flapped into our drab little cage and made these walls dissolve away...and for the briefest of moments -- every last man at Shawshank felt free.", " It pissed the warden off something terrible.", " Andy got two weeks in the hole for that little stunt.", " Andy was as good as his word. He kept writing to the State Senate. Two letters a week instead of one.", " In 1959, the folks up Augusta way finally clued in to the fact they couldn't buy him off with just a dollar check. Appropriations Committee voted an annual payment of dollars, just to shut him up.", " Those checks came once a year like clockwork.", " You'd be amazed how far Andy could stretch it. He made deals with book clubs, charity groups...he bought remaindered books by the pound...", " By the year Kennedy was shot, Andy had transformed a broom closet smelling of turpentine into the best prison library in New England.", " That was also the year Warden Norton instituted his famous \"Inside-Out\" program. You may remember reading about it. It made all the papers and got his picture in LIFE magazine.", " None of the inmates were invited to express their views...", " 'Course, Norton failed to mention to the press that \"bare minimum of expense\" is a fairly loose term. There are a hundred different ways to skim off the top. Men, materials, you name it. And, oh my Lord, how the money rolled in...", " And behind every shady deal, behind every dollar earned...", " ...there was Andy, keeping the books.", " Tommy Williams came to Shawshank in on a two year stretch for B&E. Cops caught him sneakin' TV sets out the back door of a JC Penney.", " Young punk, Mr. Rock n' Roll, cocky as hell...", " We liked him immediately.", " As it turns out, Tommy had himself a young wife and new baby girl...", " Maybe it was the thought of them on", " Whatever it was, something lit a fire under that boy's ass.", " So Andy took Tommy under his wing. Started walking him through his ABCs...", " Tommy took to it pretty well, too. Boy found brains he never knew he had.", " After a while, you couldn't pry those books out of hands.", " Before long, Andy started him on his course requirements. He really liked the kid, that was part of it. Gave him a thrill to help a youngster crawl off the shitheap. But that wasn't the only reason...", " Prison time is slow time. Sometimes it feels like stop-time. So you do what you can to keep going", " Some fellas collect stamps. Others build matchstick houses. Andy built a library. Now he needed a new project. Tommy was it. It was the same reason he spent years shaping and polishing those rocks. The same reason he hung his fantasy girlies on the wall", " In prison, a man'll do most anything to keep his mind occupied.", " By 1966...right about the time Tommy was getting ready to take his exams...it was lovely Racquel.", " I have had some long nights in stir. Alone in the dark with nothing but your thoughts, time can draw out like a blade...", " That was the longest night of my life...", " They got this skinny kid named Rory Tremont to go in the hole. He wasn't much in the brains department, but he possessed the one most important qualification for the job... ...he was willing to go.", " Probably thought he'd win a Bronze Star or something.", " It was his third day on the job.", " And then came the unmistakable sound of Rory Tremont losing his last few meals. The whole cellblock heard it. I mean, it echoed.", " I laughed myself right into solitary. Two week stretch.", " Andy once talked about doing easy time in the hole. Now I knew what he meant.", " In 1966, Andy Dufresne escaped from Shawshank Prison.", " All they found of him was a muddy set of prison clothes, a bar of soap, and an old rock-hammer damn near worn down to the nub.", " I remember thinking it would take a man six hundred years to tunnel through the wall with it. Andy did it in less than twenty.", " Andy loved geology. I imagine it appealed to his meticulous nature. An ice age here, a million years of mountain-building there, plates of bedrock grinding against each other over a span of millennia...", " Geology is the study of pressure and time. That's all it takes, really. Pressure and time.", " That and a big damn poster.", " Like I said. In prison, a man'll do most anything to keep his mind occupied.", " It turns out Andy's favorite hobby was totin' his wall out into the exercise yard a handful at a time...", " While the rest of us slept, Andy spent years workin' the nightshift...", " Probably took him most of a year just to get his head through.", " I guess after Tommy was killed, Andy decided he'd been here just about long enough.", " Andy did like he was told. Buffed those shoes to a high mirror shine.", " The guard simply didn't notice. Neither did I. I mean, seriously, how often do you really look at a man's shoes?", " Andy crawled to freedom through five hundred yards of shit-smelling foulness I can't even imagine. Or maybe I just don't want to.", " Five hundred yards. The length of five football fields. Just shy of half a mile.", " The next morning, right about the time Racquel was spilling her little secret...", " ...a man nobody ever laid eyes on before strolled into the Casco Bank of Portland. Until that moment, he didn't exist -- except on paper.", " He had all the proper I.D. Driver's license, birth certificate, social security card. The signature was a spot-on match.", " Mr. Stevens visited nearly a dozen banks in the Portland area that morning. All told, he blew town with better than 370 thousand dollars of Warden Norton's money. Severance pay for nineteen years.", " I wasn't there to see it, but I hear Byron Hadley was sobbing like a little girl when they took him away.", " Norton had no intention of goin' that quietly.", " I like to think the last thing that went through his head...other than that bullet...was to wonder how the hell Andy Dufresne ever got the best of him.", " Not long after the warden deprived us of his company, I got a postcard in the mail. It was blank. But the postmark said, \"McNary, Texas.\"", " McNary. Right on the border. That's where Andy crossed. When I picture him heading south in his own car with the top down, it makes me laugh all over again...", " Andy Dufresne, who crawled through a river of shit and came out clean on the other side. Andy Dufresne, headed for the Pacific.", " Those of us who knew him best talk about him often. I swear, the stuff he pulled. It always makes us laugh.", " Sometimes it makes me sad, though, Andy being gone. I have to remind myself that some birds aren't meant to be caged, that's all. Their feathers are just too bright...", " ...and when they fly away, the part of you that knows it was a sin to lock them up does rejoice...but still, the place you live is that much more drab and empty that they're gone.", " I guess I just miss my friend.", " But there are times I curse him for the dreams he left behind...", " ...dreams where I am lost in a warm place with no memory.", " An ocean so big it strikes me dumb. Waves so quiet they strike me deaf. Sunshine so bright it strikes me blind. It is a place that is blue beyond reason. Bluer than can possibly exist. Bluer than my mind can possibly grasp.", " I am terrified. There is no way home.", " Andy. I know you're in that place. Look at the stars for me just after sunset. Touch the sand...wade in the water...and feel free.", " Thirty years I've been asking permission to piss. I can't squeeze a drop without say-so.", " Women, too, that's the other thing. I forgot they were half the human race. There's women everywhere, every shape and size. I find myself semi-hard most of the time, cursing myself for a dirty old man.", " Not a brassiere to be seen, nipples poking out at the world. Jeezus, pleeze-us. Back in my day, a woman out in public like that would have been arrested and given a sanity hearing.", " They're calling this the Summer of Love. Summer of Loonies, you ask me.", " There is a harsh truth to face. No way I'm gonna make it on the outside.", " All I do anymore is think of ways to break my parole.", " Terrible thing, to live in fear. Brooks Hatlen knew it. Knew it all too well. All I want is to be back where things make sense. Where I won't have to be afraid all the time.", " Only one thing stops me. A promise I made to Andy.", " Get busy living or get busy dying. That is goddamn right.", " For the second time in my life, I am guilty of committing a crime.", " Parole violation. I doubt they'll toss up any roadblocks for that. Not for an old crook like me.", " I find I am so excited I can barely sit still or hold a thought in my head. I think it is the excitement only a free man can feel, a free man at the start of a long journey whose conclusion is uncertain...", " I hope I can make it across the border. I hope to see my friend and shake his hand. I hope the Pacific is as blue as it has been in my dreams. I hope."], "CON": [" Fresh fish! Fresh fish today!", " When do we eat?", " Too goddamn dark to read down there."], "TOWER GUARD": [" All clear!", ""], "HADLEY": [" On your feet before I fuck you up so bad you never walk again.", " Eyes front.", " YOU EAT WHEN WE SAY YOU EAT! YOU PISS WHEN WE SAY YOU PISS! YOU SHIT WHEN WE SAY YOU SHIT! YOU SLEEP WHEN WE SAY YOU SLEEP! YOU MAGGOT- DICK MOTHERFUCKER!", " Off with them clothes! And I didn't say take all day doing it, did I?", " What the Christ is this happy shit?", " You'll be tellin' him with my baton up your ass!", " I ain't gonna count to three! Not even to one! Now shut the fuck up 'fore I sing you a lullabye!", " ...so this shithead lawyer calls long distance from Texas, and he says, Byron Hadley? I say, yeah. He says, sorry to inform you, but your brother just died.", " I ain't. He was an asshole. Run off years ago, family ain't heard of him since. Figured him for dead anyway. So this lawyer prick says, your brother died a rich man. Oil wells and shit, close to a million bucks. Jesus, it's frigging incredible how lucky some assholes can get.", " Thirty five thousand. That's what he left me.", " Dumbshit. What do you figger the government's gonna do to me? Take a big wet bite out of my ass, is what.", " Maybe leave me enough to buy a new car with. Then what happens? You pay tax on the car. Repairs and maintenance. Goddamn kids pesterin' you to take 'em for a ride...", " That's right, wanting to drive it, wanting to learn on it, f'Chrissake! Then at the end of the year, if you figured the tax wrong, they make you pay out of your own pocket. Uncle Sam puts his hand in your shirt and squeezes your tit till it's purple. Always get the short end. That's a fact. Some brother. Shit.", " That's funny. You're gonna look funnier suckin' my dick with no fuckin' teeth.", " That's it! Step aside, Mert. This fucker's havin' hisself an accident.", " You better start making sense.", " Naw, that ain't right! Tax free?", " You're the smart banker what shot his wife. Why should I believe a smart banker like you? So's I can wind up in here with you?", " Fuckin'-A. I don't need no smart wife-killin' banker to show me where the bear shit in the buckwheat.", " Ambulance-chaaing, highway-robbing cocksuckers!", " What are you jimmies starin' at? Back to work, goddamn it!", " Drink up, boys. While it's cold.", " Poor fella must'a tripped.", " You wanna explain this?", " Looks pretty clean. Some contraband here, nothing to get in a twist over.", " HEY.' YOU MEN UP THERE.' GET YOUR ASSES OFF THAT SLOPE! YOU HAPPY ASSHOLES GONE DEAF? YOU GOT FIVE SECONDS 'FORE I SHOOT SOMEBODY!", " Dufresne! What the fuck did you do? Your ass, warden's office, now!", " You tell me, fuck-stick! They're addressed to you, every damn one!", " I want all this cleared out before the warden gets back, I shit you not.", " who?", " Last night's count."], "HEYWOOD": [" Never seen such a sorry-lookin' heap of maggot shit in my life.", " Bullshit. I'll take that action.", " You're out some smokes, son. Take my word.", " I say that chubby fat-ass...let's see...fifth from the front. Put me down for a quarter deck.", " AND IT'S FAT-ASS BY A NOSE.'", " Mornin', boys. It's a fine mornin'. You know why it's fine?", " Gee, Red. Terrible shame, your horse comin' in last and all. Hell, I sure do love that horse of mine. I believe I owe that boy a big sloppy kiss when I see him.", " Say Tyrell, you pull infirmary duty this week? How's that winnin' horse of mine, anyway?", " What? What'd you say?", " What the fuck you care, new fish? Doesn't matter what his fuckin' name was. He's dead.", " Didn't do it! Lawyer fucked me!", " Poor Byron. What terrible fuckin' luck. Imagine inheriting thirty five thousand dollars.", " Just keep spreadin' tar...", " Oh God, he's gonna do it, he's gonna throw him off the roof...", " Here's a cold one, Andy.", " Sounds good to us. Figure we owe him for the beer.", " What are you, fuckin' geologist?", " What the hell is it then?", " Bullshit.", " My ass!", " How you 'spect to do that, \"Mr. Dufresne-if-you-please?\"", " Sure. I know that. Sure.", " Him? What about me? Crazy old fool! Goddamn near slit my throat!", " Nothin'! Just came in to say fare- thee-well. Ain't you heard? His parole came through!", " Old man's crazy as a rat in a tin shithouse, is what.", " Institutionalized, my ass.", " Shovel man in. Watch the dirt.", " Couldn't play somethin' good, huh? Hank Williams?", " Shit. No such thing as easy time in the hole. A week seems like a year.", " Treasure Island. Robert Louis...", " The Count of Monte Crisco...", " ...by Alexandree Dumb-ass.", " Sounds like road-gangin', you ask me.", " Give us a break, lady.", " No, ma'am.", " You heard the lady.", " You did a stretch in Cashman too?", " Red? You saying Andy's innocent? I mean for real innocent? Sweet Jesus. How long's he been in here?", " Oh Lord. Andy come down to the loading dock today. Asked me for a length of rope. Six foot long.", " Sure I did. I mean why wouldn't I?", " How the hell was I s'pose to know?", " Probably still up in the warden's.", " Let's pull him aside tomorrow, all of us. Have a word with him. Ain't that right, Red?"], "JIGGER": [" Comin' from you, Heywood, you being so pretty and all...", " Oh, Christ, here he comes.", " C'mon, Brooksie, why don't you just calm the fuck down, okay?", " Shit. I could never get that way.", " That's fine, during the day. But at night he's got that cell all to himself.", " Andy'd never do that. Never."], "FLOYD": [" Takin' bets today, Red?", " Smokes. Put me down for two.", " That gangly sack of shit, third from the front. He'll be the first.", " You're so smart, you call it.", " Smell my ass...", " Gettin' himself killed.", " That ain't quartz. Nor limestone.", " He didn't say that!", " Red? Andy? It's Brooks.", " Red, I do believe you're talking out of your ass.", " Was it worth two weeks in the hole?", " Cristo, you dumbshit.", " A month in the hole. Longest damn stretch I ever heard of.", " Christ! Remember Brooks Hatlen?", " Where the hell is he?", " Nothing we can do. Not tonight."], "ERNIE": [" Me too.", " Heads up. They're tossin' cells.", " Say that when you been inside as long as Brooks has."], "SKEET": [" What say, Red?", " We ought to keep an eye on him.", " Christ. What do we do?"], "SNOOZE": [" Rich bet.", " What's he doing?", " Oh shit, oh fuck, oh Jesus...", " He's right, it ain't.", " You tell me, man. One second he was fine, then out came the knife. I better get the guards.", " Sounds like you done time all over New England.", " Shit! You gave it to him?"], "VOICE (AMPLIFIED)": [" Return to your cellblocks for evening count."], "NORTON": [" This is Mr. Hadley, captain of the guard. I am Mr. Norton, the warden. You are sinners and scum, that's why they sent you to me. Rule number one: no blaspheming. I'll not have the Lord's name taken in vain in my prison. The other rules you'll figure out as you go along. Any questions?", " Any other questions? I believe in two things. Discipline and the Bible. Here, you'll receive both. Put your faith in the Lord. Your ass belongs to me. Welcome to Shawshank.", " ...the roof of the license-plate factory needs resurfacing. I need a dozen volunteers for a week's work.", " Solitary. A week. Make sure he takes his Bible.", " Add another week for blasphemy.", " I'm pleased to see you reading this. Any favorite passages?", " Luke. Chapter 13, verse 35. I've always liked that one. But I prefer: \"I am the light of the world. He that followeth me shall not walk in darkness, but shall have the light of life.\"", " I hear you're good with numbers. How nice. A man should have a skill.", " I can't say I approve of this... ...but I suppose exceptions can always be made.", " My wife made that in church group.", " You like working in the laundry?", " Perhaps we can find something more befitting a man of your education.", " Not a dime. My budget's stretched thin as it is.", " Far as them Republican boys in Augusta are concerned, there's only three ways to spend the taxpayer's hard-earned when it come to prisons. More walls. More bars. More guards.", " They sure can, but you write your letters if it makes you happy. I'll even mail 'em for you, how's that?", " ...a genuine, progressive advance in corrections and rehabilitation. Our inmates, properly supervised, will be put to work outside these walls performing all manner of public service. Cutting pulpwood, repairing bridges and causeways, digging storm drains...", " Ned, we're providing a valuable community service.", " Ned, I wouldn't worry too much over this contract. Seems to me I've already got my boys committed elsewhere. You be sure and thank Maisie for this fine pie.", " Get my stuff down t'laundry. Two suits for dry-clean and a bag of whatnot. Tell 'em if they over- starch my shirts again, they're gonna hear about it from me. How do I look?", " Big charity to-do up Portland way. Governor's gonna be there. Want the rest of that? Woman can't bake worth shit.", " Well. I have to say, that's the most amazing story I ever heard. What amazes me most is you were taken in by it.", " It's obvious this fellow Williams is impressed with you. He hears your tale of woe and quite naturally wants to cheer you up. He's young, not terribly bright. Not surprising he didn't know what a state he'd put you in.", " Let's say for a moment Blatch does exist. You think he'd just fall to his knees and cry, \"Yes, I did it! I confess! By all means, please add a life term to my sentence!\"", " That's assuming Blatch is even still there. Chances are excellent he'd be released by now. Excellent.", " What? What did you call me?", " Dufresne, if you want to indulge this fantasy, that's your business. Don't make it mine. This meeting's over.", " Don't you ever mention money to me again, you sorry son of a bitch! Not in this office, not anywhere! Get in here! Now!", " Solitary! A month!", " Tommy, we've got a situation here. I think you can appreciate that.", " I tell you, son, this really came along and knocked my wind out. It's got me up nights, that's the truth.", " Would you be willing to swear before a judge and jury...having placed your hand on the Good Book and taken an oath before Almighty God Himself?", " That's what I thought.", " Terrible thing. Man that young, less than a year to go, trying to escape. Broke Captain Hadley's heart to shoot him, truly it did.", " Nothing stops! NOTHING! Or you will do the hardest time there is. No more protection from the guards. I'll pull you out of that one-bunk Hilton and put you in with the biggest bull queer I can find. You'll think you got fucked by a train! And the library? Gone! Sealed off brick by brick! We'll have us a little book-barbecue in the yard! They'll see the flames for miles! We'll dance around it like wild Indians! Do you understand me? Are you catching my drift?", " Lickety-split. I wanna get home.", " Get my stuff down t'laundry. And shine my shoes. I want 'em lookin' like mirrors.", " I want every man on that cellblock questioned! Start with that friend of his!", " Him.", " What do you mean \"he just wasn't here?\" Don't say that to me, Haig! Don't say that to me again!", " I can see that, Haig! You think I'm blind? Is that what you're saying? Am I blind, Haig?", " What about you? You blind? Tell me what this is!", " You see Dufresne's name? I sure do! Right there, see? \"Dufresne.\" He was in his cell at lights out! Stands to reason he'd still be here this morning! I want him found! Not tomorrow, not after breakfast! Now!", " I see you two all the time, you're thick as thieves, you are! He must'a said something!", " Lord! It's a miracle! Man up and vanished like a fart in the wind! Nothin' left but some damn rocks on the windowsill and that cupcake on the wall! Let's ask her! Maybe she knows! What say there, Fuzzy- Britches? Feel like talking? Guess not. Why should you be different?", " Lickety-split. I wanna get home."], "HADLEY (CONT’D)": [" First man into the shower!", " Delouse that piece of shit! Next man in!", " What's your malfunction you fat fuckin' barrel of monkey-spunk?", " Get this tub of shit down to the infirmary. If I hear so much as a mouse fart in here the rest of the night, by God and Sonny Jesus, you'll all visit the infirmary. Every last motherfucker here.", " That's him. That's the one.", " What am I, talkin' to myself?"], "DOCTOR": [" Bend over."], "CHAPLAIN (O.S.)": [" ...maketh me to lie down in green pastures. He leadeth me beside the still waters. He restoreth my soul..."], "GUARD": [" That's lights out! Good night, ladies.", " Time's up, Bogs.", " What kind'a contraband you hiding in there, boy?", " Water break! Five minutes!", " Man missing on tier two! Cell 12!"], "VARIOUS VOICES (O.S.)": [" Fishee fishee fisheeee...You're gonna like it here, new fish. A whooole lot...Make you wish your daddies never dicked your mommies...You takin' this down, new fish? Gonna be a quiz later. Sshhh. Keep it down. The screws'll hear...Fishee fishee fisheeee..."], "HEYWOOD (O.S.)": [" Fat-Ass...oh, Faaaat-Ass. Talk to me, boy. I know you're in there. I can hear you breathin'. Now don't you listen to these nitwits, hear?", " This ain't such a bad place. I'll introduce you around, make you feel right at home. I know some big ol' bull queers who'd love to make your acquaintance...especially that big white mushy butt of yours..."], "FAT-ASS": [" OH GOD! I DON'T BELONG HERE! I WANNA GO HOME!", " I WANNA GO HOME! I WANT MY MOTHER.'", " PLEASE! THIS AIN'T RIGHT! I AIN'T SUPPOSED TO BE HERE! NOT ME!"], "VOICES": [" Fresh fish...fresh fish...fresh fish...fresh fish..."], "BROOKS": [" You gonna eat that?", " You mind?", " Middle shelf, wrapped in a towel.", " Andy! Thought I heard you out here!", " I know, they told me. Ain't that a kick in the ass? Come on in, I'll give you the dime tour.", " Here she is, the Shawshank Prison Library. Along this side, we got the National Geographics. That side, the Reader's Digest Condensed books. Bottom shelf there, some Louis L'Amours and Erle Stanley Gardners. Every night I pile the cart and make my rounds. I write down the names on this clipboard here. Well, that's it. Easy, peasy, Japanesey. Any questions?", " Since 1912. Yuh, over 37 years.", " Never needed one. Not much to it, is there?", " I dunno. Be nice to have some comp'ny down here for a change.", " Pull down one'a them desks there.", " God is my witness. And Dekins, he just blinks for a second, then laughs his ass off. Afterward, he actually shook Andy's hand.", " Shook his fuckin' hand. Just about shit myself. All Andy needed was a suit and tie, a jiggly little hula girl on his desk, he would'a been Mister Dufresne, if you please.", " Son, I've had six wardens through here during my tenure, and I have learned one great immutable truth of the universe: ain't one of 'em been born whose asshole don't pucker up tight as a snare drum when you ask for funds.", " Goddamn miserable puke-eatin' sons of whores!", " Nothing left to talk about! It's all talked out! Nothing left now but to cut his fuckin' throat!", " That's what they want! It's the price I gotta pay!", " But it's the only way they'll let me stay.", " I can't take care of you no more. You go on now. You're free.", " Yes sir, double-bag, surely will."], "BROOKS (CONT’D)": [" Mmm. Nice and ripe.", " Jake says thanks. Fell out of his nest over by the plate shop. I'm lookin' after him till he's old enough to fly."], "HEYWOOD (CONT’D)": [" That's right, send 'em all down. I wanna see 'em lined up in a row, pretty as a chorus line.", " C'mon! We're showin' our tools and grinnin' like fools! Take the damn picture!"], "TYRELL": [" Dead. Hadley busted his head pretty good. Doc already went home for the night. Poor bastard lay there till this morning. By then..."], "BOGS": [" You're some sweet punk. You been broke in yet?", " Honey, hush.", " Take a walk.", " I said fuck off.", " Take a walk.", " I said fuck off.", " Now I'm gonna open my fly, and you're gonna swallow what I give you to swallow. And when you d mine, you gonna swallow Rooster's. You done broke his nose, so he ought to have somethin' to show for it.", " You don't understand. You do that, I'll put all eight inches of this steel ii your ear.", " You little fuck."], "BOGS (CONT’D)": [" Hard to get. I like that.", " That's it, fight. Better that way.", " Ain't you gonna scream?"], "RED (CONT’D)": [" Quartz?", " Word gets around. The Sisters have taken a real shine to you, yes they have. Especially Bogs.", " Hey, you nuts? Keep your eyes on your pail!", " Andy! Come back! Shit!", " Feel bad about it if you want. But you didn't pull the trigger."], "ANDY (CONT'D)": [" There's some graded limestone, from when they cut this place out of the hill.", " How about expanding the library? Get some new books in there.", " That's where the filtering process starts. They trace it back, all they're gonna find is him.", " To look at the stars just after sunset. Touch the sand. Wade in the water. Feel free."], "BOB": [" DUFRESNE! WE'RE LOW ON HEXLITE! HEAD ON BACK AND FETCH US UP SOME!", " DUFRESNE! YOU'RE OFF THE LINE!"], "NORTON (CONT'D)": [" We're gonna be taking names in this steel bucket here...", " Nice havin' you back, Andy. Place just wasn't the same without you."], "YOUNGBLOOD": [" Damn, Byron. Sorry to hear that.", " What the fuck."], "TROUT": [" A million bucks? Jeez-Louise! You get any of that?", " Dollars? Holy shit, that's great! Like winnin' a lottery... ...ain't it?", " Oh. Hadn't thought of that.", " Co-workers! Get him! That's rich, ain't it? Co-workers..."], "MERT": [" And drive it, if they're old enough.", " Damn, Byron. Look'a that.", " Warden wants to talk.", " That's what the man said."], "ANDY (CONT’D)": [" What are you in for, Red?", " Can we talk business?", " Can we talk business?", " In addition, the Library District has generously responded with a charitable donation of used books and sundries. We trust this will fill your needs. We now consider the matter closed. Please stop sending us letters. Yours truly, the State Comptroller's Office.", " Anniversary gift. Open it.", " Had to go through one of your competitors. Hope you don't mind. Wanted it to be a surprise.", " I didn't pull the trigger. But I drove her away. That's why she died. Because of me, the way I am.", " Three deposits tonight."], "PROJECTIONIST": [" I have to change reels.", " I have to change reels."], "ROOSTER": [" Me first.", " Fuck! Shit! He broke my nose!"], "GUARD (O.S.)": [" Lights out!", " Open number twelve!"], "NORTON (CONT’D)": [" Let's try the second tier.", " I almost forgot.", " I'd hate to deprive you of this. Salvation lies within.", " These men can learn the value of an honest day's labor while providing a valuable service to the community -- and at a bare minimum of expense to Mr. and Mrs. John Q. Taxpayer!", " The right decision. Sometimes it's hard to figure out what that is. You understand? Think hard, Tommy. If I'm gonna move on this, there can't be the least little shred of doubt. I have to know if you what you told Dufresne was the truth.", " Well?", " It's a conspiracy! (SMASH) That's what this is! (SMASH) It's one big damn conspiracy! (SMASH) And everyone's in on it! (SMASH) Including her!"], "HADLEY (O.S.)": [" Dufresne!", " Go on, boy! We got a hold of you!"], "DEKINS": [" I'm Dekins. I been, uh, thinkin' 'bout maybe settin' up some kinda trust fund for my kids' educations.", " Yuh. I figured just stick it in the bank, but Captain Hadley said check with you first.", " I don't?"], "THE BATTER": [" Damn right, and the holster too."], "BROOKS (V.O.)": [" Dear Fellas. I can't believe how fast things move on the outside.", " I saw an automobile once when I was young. Now they're everywhere.", " The world went and got itself in a big damn hurry.", " People even talk faster. And louder.", " The parole board got me into this halfway house called the Brewster, and a job bagging groceries at the Foodway...", " It's hard work. I try to keep up, but my hands hurt most of the time.", " Sometimes after work I go to the park and feed the birds. I keep thinking Jake might show up and say hello, but he never does. I hope wherever he is, he's doing okay and making new friends.", " I have trouble sleeping at night. The bed is too big. I have bad dreams, like I'm falling. I wake up scared. Sometimes it takes me a while to remember where I am.", " Maybe I should get me a gun and rob the Foodway, so they'd send me home. I could shoot the manager while I was at it, sort of like a bonus.", " But I guess I'm too old for that sort of nonsense anymore.", " I don't like it here. I'm tired of being afraid all the time. I've decided not to stay.", " I doubt they'll kick up any fuss. Not for an old crook like me."], "WOMAN": [" No music in your room after eight p.m. No guests after nine. No cooking except on the hotplate...", " Make sure he double-bags. Last time your man didn't double-bag and the bottom near came out."], "MANAGER": [" You double-bag like the lady says, understand?", " I must say I'm sorry to be losing your business. I hope you'll enjoy living abroad.", " You don't need to ask me every time you go take a piss. Just go. Understand?"], "BROOKS (V.O.) (CONT'D)": [" I don't think the store manager likes me very much."], "WILEY": [" Well, take it.", " Good for you, Andy.", " I believe you're crazy enough. You better get this stuff downstairs like the Captain said. I'm gonna go pinch a loaf. When I get back, this is all gone, right?", " Andy? You hear that?"], "RED (V.O.) (CONT'D)": [" I like to think they were singin' about something so beautiful it can't be expressed in words, and makes your heart ache because of it."], "WILEY (O.S.)": [" LET ME OUUUUT!"], "--": [" Red considers it, shakes his head. Softly:"], "WOMAN REPORTER": [" You there! You men! We're gonna take your picture now!", " Don't you know who I am? I'm from LIFE magazine! I was told I'd get some co-operation out here! You want me to report you to your warden? Is that what you want?", " That's more like it! Now I want you all in a row with big bright smiles on your faces! Grab hold of your tools and show 'em to me!"], "NED": [" This keeps up, you're gonna put me out of business!", " That's fine for the papers, but I got a family to feed. The State don't pay my salary. Sam, we go back a long way. I need this new highway contract. I don't get it, I go under. That's a fact. Now you just have some'a this fine pie my missus baked specially for you, and you think about that."], "NED (CONT'D)": [" With this pool of slave labor you got, you can underbid any contractor in town."], "TOMMY": [" Well. Ain't this for shit?", " C'mon there, old boys! Movin' like molasses! Makin' me look bad!", " ...so I'm backin' out the door, right? Had the TV like this... Big ol' thing. Couldn't see shit. Suddenly, here's this voice: Freeze kid! Hands in the air! Well I just stand there holdin' on to that TV, so the voice says: \"You hear what I said, boy?\" And I say, Yes sir, I sure did! But if I drop this fuckin' thing, you got me on destruction of property too!", " Yeah. That was an easy ride, let me tell you. Work programs, weekend furloughs. Not like here.", " What the hell you know about it, Capone? What are you in for?", " I'm thinkin' maybe I should try for high school equivalency. Hear you helped some fellas with that.", " Thing is, see... ...I don't read all that good.", " So this raven just sits there and won't go away?", " Why don't that fella get hisself a and dust the fucker?", " The cat sh--The cat shh... The cat shat on the welcome mat?", " Well. It's for shit. Wasted a whole fuckin' year of my time with this bullshit!", " It's worse! I didn't get a fuckin' thing right! Might as well be in Chinese!", " I'll tell you how the goddamn score comes out...", " I feel bad. I let him down.", " Smart fella, ain't he?", " What's he in for anyway?", " The hell you say.", " Oh my God...", " 'Bout four years ago, I was in Thomaston on a 2 to 3 stretch.", " It's my fault.", " The son of a bitch mailed it.", " Thumb up my butt sounds better.", " Out here?", " Warden?", " Yes sir, I sure can.", " Yes sir. Absolutely.", " Just gimme that chance."], "TOMNY": [" Been in and out since I was 13. Name the place, chances are I been there.", " I ain't no goddamn loser.", " The cat sh--shh--shimmied up the tree and crept st--stel--stealthily out on the limb..."], "BETH": [" ...said we can stay with them, but Joey's gettin' out of the service next month, and they barely got enough room as it is. Plus they got Poppa workin' double shifts and the baby cries half the night. I just don't know where we're gonna go..."], "TOMMY (CONT’D)": [" Two points! Right there! There's your goddamn score! Goddamn cats crawlin' up trees, 5 times 5 is 25, fuck this place, fuck it!", " C'mon, just throw it away. Will you please? Just throw it away?"], "TOMMY (CONT'D)": [" Stole a car. Dumbfuck thing to do. Few months left to go, I get a new cellmate in. Elmo Blatch. Big twitchy fucker. Crazy eyes. Kind of roomie you pray you don't get, know what I'm sayin'? 6 to 12 for armed burglary. Said he done hundreds of jobs. Hard to believe, high-strung as he was. Cut a loud fart, he'd go three feet in the air. Talked all the time, too, that's the other thing. Never shut up. Places he'd been, jobs he pulled, women he fucked. Even people he killed. People that gave him shit, that's how he put it. One night, like a joke, I say: \"Yeah? Who'd you kill?\" So he says..."], "BLATCH": [" ...I got me this job one time bussin' tables at a country club. So I could case all the big rich pricks that come in. I pick out this guy, go in one night and do his place. He wakes up and gives me shit. So I killed him. Him and the tasty bitch he was with. That's the best part! She's fuckin' this prick, see, this golf pro, but she's married to some other guy! Some hotshot banker. He's the one they pinned it on! They got him down-Maine somewhere doin' time for the crime! Ain't that choice?"], "MAIL CALLER": [" Thomas Williams!"], "ELDERLY GUARD": [" Kid passed. C-plus average. Thought you'd like to know."], "ANDY (CONT.) (CONT’D)": [" wife to marry me. We'd gone for a picnic. We made love under that tree. I asked and she said yes. Promise me, Red. If you ever get out, find that spot. In the base of that wall you'll find a rock that has no earthly business in a Maine hayfield. A piece of black volcanic glass. You'll find something buried under it I want you to have."], "VOICE (OVER P.A.)": [" Report to your cellblocks for evening count."], "HAIG": [" Dufresne? Get your ass out here, boy! You're holding up the show! Don't make me come down there now! I'll thump your skull for you!", " WHAT THE FUCK!", " But sir! He wasn't! He isn't!", " No sir!"], "HAIG (CONT’D)": [" Dufresne, dammit, you're putting me behind! You better be sick or dead in there, I shit you not!", " Oh my Holy God."], "RORY": [" Warden? There's a space here between the walls 'bout three feet across! Smells pretty damn bad!", " Hoo-whee! Smell's gettin' worse!", " Smells pretty damn bad, Warden! In fact, it smells just like shit."], "NORTON (O.S.)": [" I don't care what it smells like!", " Never mind, I said! Just keep going!"], "RORY (CONT’D)": [" Oh God, that's what it is, it's shit. oh my God it's shit. pull me out 'fore I blow my groceries, oh shit it's shit, oh my Gawwwwwwd!"], "FEMALE TELLER (O.S.)": [" May I help you?"], "TELLER": [" Here's your cashier's check, sir. Will there be anything else?"], "MAN": [" Hal! Dave! Get your butts in here!"], "DUTY GUARD": [" I'm not sure which one it is..."], "MAN #1 (CONT’D)": [" Shall I repeat the question?"], "RED (CONT'D)": [" I look back on myself the way I was...stupid kid who did that terrible crime...wish I could talk sense to him. Tell him how things are. But I can't. That kid's long gone, this old man is all that's left, and I have to live with that. Rehabilitated? That's a bullshit word, so you just go on ahead and stamp that form there, sonny, and stop wasting my damn time. Truth is, I don't give a shit."], "P.O.": [" You staying out of the bars, Red?", " How you doing otherwise? Adjusting okay?", " Tell me about it. Young punks protesting the war. You imagine? Even my own kid. Oughtta bust his fuckin' skull."], "ANDY (V.O.)": [" Dear Red. If you're reading this, you've gotten out."], "ANDY (V.O.) (CONT'D)": [" And if you've come this far, maybe you're willing to come a little further. You remember the name of the town, don't you? I could use a good man to help me get my project on wheels. I'll keep an eye out for you and the chessboard ready. Remember, Red. Hope is a good thing, maybe the best of things, and no good thing ever dies. I will be hoping that this letter finds you, and finds you well. Your friend. Andy."]}