{"scenarios": ["THIS SCRIPT IS FOR", "EDUCATIONAL PURPOSES ONLY", "\"Titanic\" a screenplay by James Cameron", "Cast:", "KATE WINSLET... Rose DeWitt Bukater LEONARDO DICAPRIO... Jack", "Dawson KATHY BATES... The Unsinkable Molly Brown BILLY", "ZANE... Caledon Hockley BILL PAXTON... Brock Lovett", "Written and Directed by:", "JAMES CAMERON", "BLACKNESS", "Then  two  faint  lights appear, close  together...  growing", "brighter.", "falling toward us like express elevators.", "One  is ahead of the other, and passes close enough to  FILL", "FRAME,  looking  like  a  spacecraft  blazing  with  lights,", "bristling with insectile manipulators.", "TILTING  DOWN  to  follow it as it descends  away  into  the", "limitless  blackness below.  Soon they are  fireflies,  then", "stars.  Then gone.", "EXT./ INT. MIR ONE / NORTH ATLANTIC DEEP", "PUSHING  IN  on one of the falling submersibles, called  MIR", "ONE, right up to its circular viewport to see the occupants.", "INSIDE,  it  is  a cramped seven foot sphere,  crammed  with", "equipment.", "hunched over his controls... singing softly in Russian.", "Next  to him on one side is BROCK LOVETT.  He's in his  late", "forties,  deeply tanned, and likes to wear  his  Nomex  suit", "unzipped  to  show the gold from famous shipwrecks  covering", "his  gray  chest hair.  He is a wiley, fast-talking treasure", "hunter,  a  salvage  superstar who is part  historian,  part", "adventurer and part vacuum cleaner salesman.  Right now,  he", "is  propped  against  the  CO2  scrubber,  fast  asleep  and", "snoring.", "On  the  other side, crammed into the remaining space  is  a", "bearded  wide-body named LEWIS BODINE, sho is  also  asleep.", "Lewis is an R.O.V. (REMOTELY OPERATED VEHICLE) pilot and  is", "the resident Titanic expert.", "CONTINUED:", "Anatoly  glances  at the bottom sonar and  makes  a  ballast", "adjustment.", "EXT. THE BOTTOM OF THE SEA", "A  pale,  dead-flat lunar landscape.  It gets brighter,  lit", "from  above,  as  MIR  ONE enters FRAME  and  drops  to  the", "seafloor in a downblast from its thrusters.  It hits  bottom", "after its two hour free-fall with a loud BONK.", "INT. MIR ONE", "Lovett and Bodine jerk awake at the landing.", "EXT. / INT. MIR ONE AND TWO", "5", "the sound of sidescan sonar and the THRUM of big thrusters.", "6", "lights  of the subs.  Bodine is watching the sidescan  sonar", "display,  where  the  outline of a huge  pointed  object  is", "visible.", "pressed to the center port.", "Out  of the darkness, like a ghostly apparition, the bow  of", "the ship appears.  Its knife-edge prow is coming straight at", "us,  seeming  to plow the bottom sediment like ocean  waves.", "It  towers above the seafloor, standing just as it landed 84", "years ago.", "THE  TITANIC.  Or what is left of her.  Mir One goes up  and", "over  the  bow  railing, intact except for an overgrowth  of", "\"rusticles\" draping it like mutated Spanish moss.", "CONTINUED:", "TIGHT  ON THE EYEPIECE MONITOR of a video camcorder.", "Lovett's face fills the BLACK AND WHITE FRAME.", "The image pans to the front viewport, looking over Anatoly's", "shoulder,  to the bow railing visible in the lights  beyond.", "Anatoly turns.", "CUT  WIDER,  to  show  that Brock is  operating  the  camera", "himself,  turning  it in his hand so it points  at  his  own", "face.", "Brock  resumes his serious, pensive gaze out the front port,", "with the camera aimed at himself at arm's length.", "Anatoly  rolls  his  eyes and mutters  in  Russian.", "chuckles and watches the sonar.", "7  Mir Two drives aft down the starboard side, past the huge", "anchor  while  Mir  One  passes over the  seemingly  endless", "forecastle  deck, with its massive anchor chains still  laid", "out  in  two  neat rows, its bronze windlass caps  gleaming.", "The", "enormous wreck.", "CONTINUED: (2)", "8", "Officer's Quarters.  Mir One lands on the roof of  the  deck", "hous nearby.", "Bodine slips on a pair of 3-D electronic goggles, and  grabs", "the joystick controls of the ROV.", "9", "called SNOOP DOG, lifts from its cradle and flies forward.", "SNOOP  DOG drives itself away from the sub, paying  out  its", "umbilical  behind it like a robot yo-yo.  Its  twin  stereo-", "video  cameras  swivel like insect eyes.  The  ROV  descends", "through  an  open  shaft that once was the  beautiful  First", "Class Grand Staircase.", "Snoop Dog goes down several decks, then moves laterally into", "the First Class Reception Room.", "SNOOP'S  VIDEO  POV, moving through the cavernous  interior.", "The remains of the ornate handcarved woodwork which gave the", "ship  its  elegance move through the floodlights, the  lines", "blurred", "formations.  Stalactites of rust hang down so that at  times", "it  looks  like a natural grotto, then the scene shifts  and", "the lines of a ghostly undersea mansion can be seen again.", "MONTAGE  STYLE,  as  Snoop  passes  the  ghostly  images  of", "Titanic's opulence:", "10", "side against a wall.  The keys gleam black and white in  the", "lights.", "11", "wire... glinting as Snoop moves around it.", "12", "bottle,  then some WHITE STAR LINE china... a woman's  high-", "top \"granny shoe\".  Then something eerie:  what looks like a", "child's skull resolves into the porcelain head of a doll.", "Snoop  enters  a  corridor which is much  better  preserved.", "Here and there a door still hangs on its rusted hinges.", "CONTINUED: (3)", "An ornate  piece  of  molding, a wall  sconce...  hint  at", "the grandeur of the past.", "13  THE ROV turns and goes through a black doorway, entering", "room  B-52, the sitting room of a \"promenade suite\", one  of", "the most luxurious staterooms on Titanic.", "Glinting  in the lights are the brass fixtures of the  near-", "perfectly  preserved  fireplace.  An  albino  Galathea  crab", "crawls  over  it.  Nearby are the remains of a divan  and  a", "writing  desk. The Dog crosses the ruins of the once elegant", "room", "doorframe,  scraping  rust and wood  chunks  loose  on  both", "sides.  It moves out of a cloud of rust and keeps on going.", "The  remains  of  a pillared canopy bed.  Broken  chairs,  a", "dresser.", "porcelain", "the dark.", "SEVERAL  ANGLES as the ROV deploys its MANIPULATOR ARMS  and", "starts  moving debris aside.  A lamp is lifted, its  ceramic", "colors as bright as they were in 1912.", "Lewis  grips a wardrobe door, lying at an angle in a corner,", "and pulls it with Snoop's gripper.  It moves reluctantly  in", "a  cloud  of  silt.", "clears  and  Snoop's cameras show them what  was  under  the", "door...", "CONTINUED: (4)", "CLOSE  ON LOVETT, watching his moniteors.  By his expression", "it is like he is seeing the Holy Grail.", "ON  THE SCREEN, in the glare of the lights, is the object of", "their quest: a small STEEL COMBINATION SAFE.", "EXT. STERN OF DECK OF KEDYSH - DAY", "THE SAFE, dripping wet in the afternoon sun, is lowered onto", "the deck of a ship by a winch cable.", "We  are  on  the Russian research vessel AKADEMIK  MISTISLAV", "KELDYSH.", "of  KELDYSH,  the sub crews, and a hand-wringing  money  guy", "named  BOBBY  BUELL  who  represents the  limited  partners.", "There  is also a documentary video crew, hired by Lovett  to", "cover his moment of glory.", "Everyone crowds around the safe.  In the background Mir  Two", "is  being  lowered  into its cradle on  deck  by  a  massive", "hydraulic  arm.", "Bodine following Brock Lovett as he bounds over to the  safe", "like a kid on Christman morning.", "Brock  nods to his technicians, and they set about  drilling", "the  safe's hinges.  During this operation, Brock  amps  the", "suspense, working the lens to fill the time.", "CONTINUED:", "Lovett grins wolfishly in anticipation of his greatest  find", "yet.", "Lovett  moves closer, peering into the safe's wet  interior.", "A long moment then... his face says it all.", "INT. LAB DECK, PRESERVATION ROOM - DAY", "Technicians are carefully removing some papers from the safe", "and placing them in a tray of water to separate them safely.", "Nearby, other artifacts from the stateroom are being  washed", "and preserved.", "Buell  is on the satellite phone with the INVESTORS.  Lovett", "is yelling at the video crew.", "Buell covers the phone and turns to Lovett.", "Lovett grabs the phone from Buell and goes instantly smooth.", "CONTINUED:", "A  tech  coaxes some letters in the water tray to  one  side", "with a tong... revealing a pencil (conte crayon) drawing  of", "a woman.", "Brock  looks  closely at the drawing, which is in  excellent", "shape,  though its edges have partially disintegrated.", "woman  is beautiful, and beautifully rendered.  In her  late", "teens  or early twenties, she is nude, though posed  with  a", "kind  of  casual modesty.  She is on an Empire divan,  in  a", "pool  of light that seems to radiate outward from her  eyes.", "Scrawled  in the lower right corner is the date:", "1912.  And the initials JD.", "The  girl is not entirely nude.  At her throat is a  diamond", "necklace with one large stone hanging in the center.", "Lovett  grabs a reference photo from the clutter on the  lab", "table.", "necklace on a black velvet jeller's display stand.  He holds", "it  next to the drawing.  It is clearly the same piece...  a", "complex setting with a massive central stone which is almost", "heart-shaped.", "INSERT", "A  CNN  NEWS STORY:  a live satellite feed from the deck  of", "the Keldysh, intercut with the CNN studio.", "CONTINUED:", "INT. HOUSE / CERAMICS STUDIO", "PULL BACK from the screen, showing the CNN report playing on", "a  TV set in the living room of a small rustic house.  It is", "full  of  ceramics, figurines, folk art, the  walls  crammed", "with  drawings  and  paintings... things  collected  over  a", "lifetime.", "PANNING  to show a glassed-in studio attached to the  house.", "Outside it is a quiet morning in Ojai, California.", "studio,  amid  incredible  clutter,  an  ANCIENT  WOMAN", "throwing  a  pot on a potter's wheel.  The liquid  red  clay", "covers  her hands... hands that are gnarled and age-spotted,", "but  still surprisingly strong and supple.  A woman  in  her", "early forties assists her.", "The  old  woman's  name  is ROSE CALVERT.", "wrinkled mass, her body shapeless and shrunken under a  one-", "piece African-print dress.", "But  her  eyes are just as bright and alive as  those  of  a", "young girl.", "Rose  gets up and walks into the living room, wiping pottery", "clay  from her hands with a rag.  A Pomeranian dog  gets  up", "and comes in with her.", "CONTINUED:", "The younger soman, LIZZY CALVERT, rushes to help her.", "TIGHT ON THE SCREEN.", "The video camera pans off Brock to the drawing, in a tray of", "water.", "FRAME.", "ROSE  is galvanized by this image.  Her mouth hangs open  in", "amazement.", "EXT. KELDYSH DECK - NIGHT", "CUT  TO KELDYSH.  The Mir subs are being launched.  Mir  Two", "is  already  in  the water, and Lovett is getting  ready  to", "climb into Mir One when Bobby Buell runs up to him.", "CONTINUED:", "INT. LAB DECK / KELDYSH - NIGHT", "Beull  hands  Lovett the phone, pushing  down  the  blinking", "line.", "conversation.  She is in her kitchen with a mystified Lizzy.", "Brock  almost  drops  the  phone.  Bobby  sees  his  shocked", "expression...", "EXT. OCEAN - DAY", "SMASH  CUT TO AN ENORMOUS SEA STALLION HELICOPTER thundering", "across the ocean.  PAN 180 degrees as it roars past.", "is no land at either horizon.  The Keldysh is visible in the", "distance.", "CLOSE ON A WINDOW of the monster helicopter.  Rose's face is", "visible, looking out calmly.", "EXT. KELDYSH - DAY", "Brock  and  Bodine are watching Mir 2 being sweng  over  the", "side to start a dive.", "Brock  nods and the three of them head forward to  meet  the", "approaching helo.", "The  Sea Stallion approaches the ship, BG, forcing Brock  to", "yell over the rotors.", "CONTINUED:", "EXT. KELDYSH HELIPAD", "IN  A  THUNDERING DOWNBLAST the helicopter's  wheels  bounce", "down on the helipad.", "Lovett, Buell and Bodine watch as the HELICOPTER CREW  CHIEF", "hands  out about ten suitcases, and then Rose is lowered  to", "the deck in a wheelchair by Keldysh crewmen.  Lizzy, ducking", "unnecessarily  under the rotor, follows  her  out,  carrying", "FREDDY  the  Pomeranian.  The crew  chief  hands  a  puzzled", "Keldysh crewmember a goldfish bowl with several fish in  it.", "Rose does not travel light.", "HOLD  ON  the  incongruous image of this  little  old  lady,", "looking  impossibly fragile amongst all the high tech  gear,", "grungy deck crew and gigantic equipment.", "INT. ROSE'S STATEROOM / KELDYSH - DAY", "Lizzy  is  unpacking Rose's things in the small  utilitarian", "room.", "bureau,  arranging  them carefully  next  to  the  fishbowl.", "Brock and Bodine are in the doorway.", "CONTINUED:", "Brock  glances at Bodine... oh oh.  Bodine rolls  his  eyes.", "Rose  finishes arranging her photographs.  We get a  general", "glimpse  of  them:", "grandchildren, her late husband.", "INT. LAB DECK, PRESERVATION AREA", "Rose  looks at the drawing in its tray of water, confronting", "herself  across a span of 84 years.  Until they  can  figure", "out  the  best  way to preserve it, they  have  to  keep  it", "immersed.  It sways and ripples, almost as if alive.", "TIGHT ON Rose's ancient eyes, gazing at the drawing.", "25", "creating  a  shoulder and the shape of  her  hair  with  two", "efficient lines.", "26", "water.", "27  A FLASHCUT of a man's eyes, just visible over the top of", "a sketching pad.  They look up suddenly right into the LENS.", "Soft eyes, but fearlessly direct.", "28  Rose smiles, remembering.  Brock has the reference photo", "of the necklace in his hand.", "CONTINUED:", "CONTINUED: (2)", "Laid  out  on  a  worktable are fifty or  so  objects,  from", "mundane  to  valuable.  Rose, shrunken  in  her  chair,  can", "barely  see over the table top.  With a trembling  hand  she", "lifts  a  tortoise shell hand mirror, inlaid with mother  of", "pearl.  She caresses it wonderingly.", "She  turns the mirror over and looks at her ancient face  in", "the cracked glass.", "She spies something else, a silver and moonstone art-nouveau", "brooch.", "Rose  picks  up  an ornate art-nouveau HAIR  COMB.", "butterfly takes flight on the ebony handle of the comb.  She", "turns  it  slowly,  remembering.  We can see  that  Rose  is", "experiencing  a rush of images and emotions that  have  lain", "dormant for eight decades as she handles the butterfly comb.", "CONTINUED: (3)", "INT. IMAGING SHACK / KELDYSH", "It is a darkened room lined with TV monitors.  IMAGES OF THE", "WRECK  fill the screens, fed from Mir One and Two,  and  the", "two ROVs, Snoop Dog and DUNCAN.", "ROSE stares raptly at the screens.  She is enthraled by  one", "in  particular, an image of the bow railing.", "means  something  to her.  Brock is studying  her  reactions", "carefully.", "Lizzy turns the chair so Rose can see the screen of Bodine's", "computer.  As he is calling up the file, he keeps talking.", "Bodine  starts  a COMPUTER ANIMATED GRAPHIC on  the  screen,", "which parallels his rapid-fire narration.", "CONTINUED:", "SKRTTT!!", "(making a sound in time with the animation) ...  it  splits!", "Right down  to  the keel,  which acts like a  big  hinge. Now", "the  bow  swings  down  and  the stern  falls  back level...", "but  the weight of the bow pulls the stern  up vertical,  and", "then the  bow  section detaches,  heading  for  the  bottom.", "The  stern  bobs like a cork,  floods and  goes under about", "2:20 a.m.", "collision.", "The  animation  then follows the bow section  as  it  sinks.", "Rose  watches  this  clinical  dissection  of  the  disaster", "without emotion.", "The  bow  impacts,  digging  deeply  into  the  bottom,  the", "animation now follows the stern.", "CONTINUED:", "Her  eyes go back to the screens, showing the sad ruins  far", "below them.", "A  VIEW  from one of the subs TRACKING SLOWLY over the  boat", "deck.", "place.", "echoing", "calling \"Women and children only\".", "30", "Pandemonium and terror.  People crying, praying, kneeling on", "the deck.  Just impressions... flashes in the dark.", "31  Rose Looks at another monitor.  SNOOP DOG moving down  a", "rusted,  debris-filled corridor.  Rose watches  the  endless", "row of doorways sliding past, like dark mouths.", "32", "in water in the middle of an endless corridor.  The child is", "lost alone, crying.", "33", "Her", "quietly.", "Her voice is surprisingly strong.  The sweet little old lady", "is  gone,  replaced by a woman with eyes of  steel.", "signals everyone to stay quiet.", "She  looks  from screen to screen, the images of the  ruined", "ship.", "CONTINUED: (2)", "He switches on the minirecorder and sets it near her.", "As  the underwater camera rises past the rusted bow rail, WE", "DISSOLVE / MATCH MOVE to that same railing in 1912...", "EXT. SOUTHAMPTON DOCK - DAY", "SHOT  CONTINUES  IN A FLORIOUS REVEAL as the gleaming  white", "superstructure  of  Titanic rises mountainously  beyond  the", "rail,  and above that the buff-colored funnels stand against", "the  sky  like the pillars of a great temple.  Crewmen  move", "across  the  deck,  dwarfed  by the  awesome  scale  of  the", "steamer.", "Southanmpton, England, April 10, 1912.  It is almost nnon on", "ailing  day.  A crowd of hundreds blackens the pier next  to", "Titanic like ants on a jelly sandwich.", "IN  FG  a gorgeous burgundy RENAULT TOURING CAR swings  into", "frame,  hanging from a loading crane.  It is lowered  toward", "HATCH #2.", "On  the pier horsedrawn vehicles, motorcars and lorries move", "slowly  through the dense throng.  The atmosphere is one  of", "excitement and general giddiness.  People embrace in tearful", "farewells,  or wave and shout bon voyage wishes  to  friends", "and relatives on the decks above.", "A  white RENAULT, leading a silver-gray DAIMLER-BENZ, pushes", "through  the  crowd leaving a wake in the press  of  people.", "Around  the handsome cars people are streaming to board  the", "ship,  jostling  with hustling seamen and stokers,  porters,", "and barking WHITE STAR LINE officials.", "The  Renault stops and the LIVERIED DRIVER scurries to  open", "the  door for a YOUNG WOMAN dressed in a stunning white  and", "purple  outfit, with an enormous feathered hat.  She  is", "years  old  and  beautiful, regal of bearing, with  piercing", "eyes.", "It  is the girl in the drawing.  ROSE.  She looks up at  the", "ship, taking it in with cool appraisal.", "CONTINUED:", "A PERSONAL VALET opens the door on the other side of the car", "for  CALEDON  HOCKLEY, the 30 year old  heir  to  the  elder", "Hockley's  fortune.  \"Cal\" is handsome,  arrogant  and  rich", "beyond meaning.", "Cal  turns and fives his hand to Rose's mother, RUTH  DEWITT", "BUKATER, who descends from the touring car being him.", "is  a", "Philadelphia  families.", "household with iron will.", "Cal  speaks  with  the pride of a host providing  a  special", "experience.", "This entire entourage of rich Americans is impeccably turned", "out,  a quintessential example of the Edwardian upper class,", "complete with servants.  Cal's VALET, SPICER LOVEJOY,  is  a", "tall  and  impassive,  dour as an  undertaker.", "emerge TWO MAIDS, personal servants to Ruth and Rose.", "A  WHITE  STAR LINE PORTER scurries toward them, harried  by", "last minute loading.", "CONTINUED: (2)", "Cal  nonchalantly hands the man a fiver.  The porter's  eyes", "dilate.  Five pounds was a monster tip in those days.", "Cal  never  tires  of the effect of money  on  the  unwashed", "masses.", "The  White Star man looks stricken when he sees the enormous", "pile of steamer trunks and suitcases loading down the second", "car,  including wooden crates and steel safe.", "frantically for some cargo-handlers nearby who come running.", "Cal breezes on, leaving the minions to scramble.  He quickly", "checks his pocket watch.", "He  indicates the way toward the first class gangway.", "move  into  the  crowd.", "behind  them, laden with bags of her mistress's most  recent", "purchases... things too delicate for the baggage handlers.", "Cal  leads, weaving between vehicles and handcarts, hurrying", "passengers", "wishers.", "the  smelly press of the dockside crowd by using an elevated", "boarding bridge, twenty feet above.", "CONTINUED: (3)", "They pass a line of steerage passengers in their coarse wool", "and tweeds, queued up inside movable barriers like cattle in", "a  chute.  A HEALTH OFFICER examines their heads one by one,", "checking scalp and eyelashes for lice.", "They pass a well-dressed young man cranking the handle of  a", "wooden  Biograph \"cinematograph\" camera mounted on a tripod.", "NANIEL  MARVIN", "Studio)  is filming his young bride in front of the Titanic.", "MARY MARVIN stands stiffly and smiles, self conscious.", "Mary Marvin, without an acting fiber in her body, does a bad", "Clara Bow pantomime of awe, hands raised.", "Cal  is jostled by two yelling steerage boys who shove  past", "him.", "father.", "The Cockney father pushes on, after his kids, shouting.", "CONTINUED: (4)", "Cal  guides  them  out  of the path of a  horse-drawn  wagon", "loaded  down  with two tons of OXFORD MARMALADE,  in  wooden", "cases, for Titanic's Victualling Department.", "Rose  looks  up  as the hull of Titanic looms over  them...a", "great  iron  wall, Bible black and sever.  Cal  motions  her", "forward, and she enters the gangway to the D Deck doors with", "a sense of overwhelming dread.", "CLOSE ON CAL'S HAND IN SLOW-MOTION as it closes possessively", "over  Rose's  arm.  He escorts her up the  gangway  and  the", "black hull of Titanic swallows them.", "35", "horns", "warning.", "EXT. SOUTHAMPTON DOCKS / TITANIC - DAY", "A  VIEW OF TITANIC from several blocks away, towering  above", "the  terminal  buildings like the skyline of  a  city.", "steamer's whistle echoes across Southampton.", "CONTINUED:", "PULL  BACK, revealing that we were looking through a window,", "and  back further to show the smoky inside of a pub.  It  is", "crowded with dockworkers and ship;s crew.", "Just  inside the window, a poker game is in progress.", "MEN, in working class clothes, play a very serious hand.", "JACK DAWSON and FABRIZIO DE ROSSI, both about 20, exchange a", "glance  as the other two players argue in Swedish.  Jack  is", "American,  a lanky drifter with his hair a little  long  for", "the  standards of the times.  He is also unshaven,  and  his", "clothes are rumpled from sleeping in them.  He is an artist,", "and  has  adopted the bohemian style of art scene in  Paris.", "He  is  also  very  self-possessed and sure-footed  for", "having lived on his own since 15.", "The TWO SWEDES continue their sullen argument, in Swedish.", "Jack takes the card and slips it into his hand.", "ECU JACK'S EYES.  They betray nothing.", "CLOSE ON FABRIZIO licking his lips nervously as he refuses a", "card.", "ECU  STACK in the middle of the table.  Bills and coins from", "four  counrties.", "Sitting  on  top of the money are two 3RD CLASS TICKETS  for", "RMS TITANIC.", "The Titanic's whistle blows again.  Final warning.", "Fabrizio puts his cards down.  So do the Swedes.  Jack holds", "his close.", "CONTINUED: (2)", "He slaps a full house down on the table.", "The table explodes into shouting in several languages.  Jack", "rakes in the money and the tickets.", "FABRIZIO/JACK", "L'AMERICA!!!", "Olaf  balls up one huge farmer's fist.  We think he's  going", "to  clobber Jack, but he swings round and punches Sven,  who", "flops  backward  onto  the  floor and  sits  there,  looking", "depressed.", "dancing around, and goes into a rapid harangue of his stupid", "cousin.", "Jack  kisses the tickets, then jumps on Fabrizio's back  and", "rides him around the pub.  It's like they won the lottery.", "CONTINUED:", "They run for the door.", "OMITTED", "EXT. TERMINAL - TITANIC", "Jack and Fabrizio, carrying everything they own in the world", "in  the kit bags on their shoulders, sprint toward the pier.", "They  tear  through  milling crowds next  to  the  terminal.", "Shouts", "gentlemen.", "groups  of  people.  They burst out onto the pier  and  Jack", "comes  to  a  dead stop... staring at the cast wall  of  the", "ship's hull, towering seven stories above the wharf and over", "an eighth of a mile long.  The Titanic is monstrous.", "Fabrizio  runs  back and grabs Jack, and they sprint  toward", "the  third  class gangway aft, at E deck.", "CONTINUED:", "They  reach  the bottom  of the ramp just as SIXTH OFFICER", "MOODY detaches  it at the top.  It starts to swing down from", "the gangway doors.", "Flushed and panting, he waves the tickets.", "Moody has QUARTERMASTER ROWE reattach the gangway.  Jack and", "Fabrizio  come  aboard.  Moody glances at the tickets,  then", "passes Jack and Fabrizio through to Rowe.  Rowe looks at the", "names on the tickets to enter them in the passenger list.", "He  hands  the tickets back, eyeing Fabrizio's Mediterranean", "looks suspiciously.", "Jack  and  Fabrizio whoop with victory as they run down  the", "white-painted corridero... grinning from ear to ear.", "OMITTED", "EXT. TITANIC AND DOCK - DAY", "The mooring lines, as big around as a man's arm, are dropped", "into  the water.  A cheer goes up on the pier as SEVEN  TUGS", "pull the Titanic away from the quay.", "EXT. AFT WELL DECK / POOP DECK - DAY", "JACK  AND  FABRIZIO burst through a door onto the  aft  well", "deck.  TRACKING WITH THEM as they run across the deck and up", "the steel stairs to the poop deck.  They get to the rail and", "Jack starts to yell and wave to the crowd on the dock.", "Grinning,  Fabrixio joins in, adding his voice to the  swell", "of voices, feeling the exhilaration of the moment.", "OMITTED", "EXT. SOUTHAMPTON DOCK - DAY", "The crowd of cheering well-wishers waves heartily as a black", "wall  of metal moves past them.  Impossibly tiny figues wave", "back from the ship's rails.  Titanic gathers speed.", "EXT. RIVER TEST - DAY", "IN  A  LONG LENS SHOT the prow of Titanic FILLS FRAME behind", "the lead tug, which is dwarfed.  The bow wave spreads before", "the  mighty  plow of the liner's hull as it moves  down  the", "River Test toward the English Channel.", "INT. THIRD CLASS BERTHING / G-DECK FORWARD - DAY", "Jack  and  Fabrizio walk down a narrow corridor  with  doors", "lining  both sides like a college dorm.  Total confusion  as", "people argue over luggage in several languages, or wander in", "confusion  in  the labyrinth.  They pass emigrants  studying", "the signs over the doors, and looking up the words in phrase", "books.", "They  find  their  berth.  It is a modest  cubicle,  painted", "enamel white, with four bunks.  Exposed pipes overhead.  The", "other", "GUNDERSEN.", "Jack  throws his kit on one open bunk, while Fabrizio  takes", "the other.", "INT. SUITE B-52-56 - DAY", "By  contrast, the so-called \"Millionaire Suite\"  is  in  the", "Empire  style,  and  comprises two  bedrooms,  a  bath,  WC,", "wardrobe room, and a large sitting room.  In addition  there", "is a private 50 foot promenade deck outside.", "A  room service waiter pours champagne into a tulip glass of", "orange  juice  and hands the Bucks Fizz  to  Rose.", "looking  through her new paintings.  There  is  a  Monet  of", "water  lilies, a Degas of dancers, and a few abstract works.", "They are all unknown paintings... lost works.", "Cal  is out on the covered deck, which has potted trees  and", "vines  on trellises, talking through the doorway to Rose  in", "the sitting room.", "CONTINUED:", "A porter wheels Cal's private safe (which we recognize) into", "the room on a handtruck.", "47", "dancers.", "Trudy  is", "clothes.", "Cal appears in the doorway of the bedroom.", "She  edges around Cal and makes a quick exit.  Cal comes  up", "behind Rose and puts his hands on her shoulders.  An act  of", "possession, not intimacy.", "Rose's  expression shows how bleak a prospect  this  is  for", "her, now.", "EXT. CHERBOURG HARBOR, FRANCE - LATE DUSK", "Titanic stands silhouetted against a purple post-sunset sky.", "She  is  lit  up  like a floating palace, and  her  thousand", "portholes reflect in the calm harbor waters.  The", "tender  Nomadic lies-to alongside, looking like  a  rowboat.", "CONTINUED:", "The  lights  of  a  Cherbourg harbor complete  the  postcard", "image.", "INT. FIRST CLASS RECEPTION/ D-DECK", "Entering the first class reception room from the tender  are", "a  number of prominent passengers.  A BROAD-SHOULDERED WOMAN", "in  an enormous feathered hat comes up the gangway, carrying", "a  suitcase in each hand, a spindly porter running to  catch", "up with her to take the bags.", "At", "dresses in the finery of her genteel peers but will never be", "one of them.", "OMITTED", "EXT. BOW - DAY", "The ship glows with the warm creamy light of late afternoon.", "Jack  and  Fabrizio  stand right at  the  bow  gripping  the", "curving railing so familiar from images of the wreck.", "leans  over, looking down fifty feet to where the prow", "the  surface like a knife, sending up two glassy  sheets  of", "water.", "INT. / EXT. TITANIC - SERIES OF SCENES - DAY", "ON  THE  BRIDGE,  CAPTAIN SMITH turns from the  binnacle  to", "FIRST OFFICER WILLIAM MURDOCH.", "Murdoch moves the engine telegraph lever to ALL AHEAD FULL.", "53", "to  the great ship.  The music is rhythmic, surging forward,", "with  a  soaring  melody  that  addresses  the  majesty  and", "optimism of the ship of dreams.", "IN  THE  ENGINE ROOM the telegraph clangs and moves to  \"All", "Ahead Full\".", "CHIEF ENGINEER BELL", "All ahead full!", "On  the  catwalk  THOMAS ANDREWS, the  shipbuilder,  watches", "carefully  as the engineers and greasers scramble to  adjust", "valves.", "engines,", "rods  surging  up and down with the turning of  the  massive", "crankshafts.", "marching giants.", "54", "hurl  coal into the roaring furnaces.  The \"black gang\"  are", "covered with sweat and coal dust, their muscles working like", "part of the machinery as they toil in the hellish glow.", "55", "water,  hurling the steamer forward and churning up a vortex", "of  foam that lingers for miles behind the juggernaut  ship.", "Smoke pours from the funnels as--", "56", "speeds builds.  THE CAMERA SWEEPS UP the prow to find  Jack,", "the wind streaming through his hair and--", "57", "wing.", "bit  the storybook picture of a Captain... a great patriarch", "of the sea.", "FIRST OFFICER MURDOCH", "Twenty one knots, sir!", "Smith  accepts  a  cup of tea from FIFTH OFFICER  LOWE.", "contentedly watches the white V of water hurled outward from", "the bows like an expression of his own personal power.  They", "are invulnerable, towering over the sea.", "58", "down.", "In the glassy bow-wave two dolphins appear, under the water,", "running  fast just in front of the steel blade of the  prow.", "They do it for the sheer joy and exultation of motion.  Jack", "watches the dolphins and grins.  They breach, jumping  clear", "of  the water and then dive back, crisscrossing in front  of", "the bow, dancing ahead of the juggernaut.", "FABRIZIO looks forward across the Atlantic, staring into the", "sunsparkles.", "THE  CAMERA ARCS around them, until they are framed  against", "the sea.", "NOW WE PULL BACK, across the forecastle deck.  Rising, as we", "continue  back,  and  the  ships  rolls  endlessly", "underneath.  Over the bridge wing, along the boat deck until", "her  funnels come INTO FRAME besides us and march past  like", "the  pillars  of heaven, one by one.  We pull back  and  up,", "until  we  are  looking  down the funnels,  and  the  people", "strolling  on  the  decks and standing at  the  rail  become", "antlike.", "And still we pull back until the great lady is seen whole in", "a gorgeous aerial portrait, black and severe in her majesty.", "INT. PALM COURT RESTAURANT - DAY", "CLOSE  ON  J. BRUCE ISMAY, Managing Director of  White  Star", "Line.", "He  indicates a handsome 39 year old Irish gentlemen to  his", "right, THOMAS ANDREWS, of Harland and Wolf Shipbuilders.", "WIDER,  showing the group assembled for lunch the next  day.", "Ismay  seated with Cal, Rose, Ruth, Molly Brown  and  Thomas", "Andrews  in the Palm Court, a beautiful sunny spot  enclosed", "by high arched windows.", "The waiter arrives to take orders.  Rose lights a cigarette.", "Cal takes the cigarette from her and stubs it out.", "CONTINUED:", "Molly is watching the dynamic between Rose, Cal and Ruth.", "Andrews chockes on his breadstick, suppressing laughter.", "She stalks away.", "EXT. POOP DECK / AFTER DECKS - DAY", "Jack sits on a bench in the sun.  Titanic's wake spreads out", "behind  him  to  the horizon.", "CONTINUED:", "He has his knees  pulled  up, supporting a leather bound", "sketching pad, his only  valuable possession.  With conte", "crayon he draws rapidly, using  sure strokes.  An emigrant", "from Manchester named CARTMELL has his 3  year old daughter", "CORA standing on the lower rung of  the rail.", "leaned back against his beer  barrel  of  a stomach, watching", "the seagulls.", "THE  SKETCH captures them perfectly, with a great  sense  of", "the  humanity  of the moment.  Jack is good.", "Fabrizio", "appreciatively.", "TOMMY  RYAN, a scowling young Irish emigrant, watches  as  a", "crewmember  comes by, walking three small  dogs  around  the", "deck.", "ugliest creatures on the planet.", "Jack looks up from his sketch.", "Jack glances across the well deck.  At the aft railing of  B", "deck promenade stands ROSE, in a long yellow dress and white", "gloves.", "CLOSE ON JACK, unable to take his eyes off of her.  They are", "across  from each other, about 60 feet apart, with the  well", "deck like a valley between them.  She on her promontory,  he", "on his much lower one.  She stares down at the water.", "He watches her unpin her elaborate hat and take it off.  She", "looks  at  the frilly absurd thing, then tosses it over  the", "rail.", "astern.", "by her. She looks like a figure in a romantic novel, sad and", "isolated.", "Fabrizio  taps  Tommy and they both look at  Jack  gazin  at", "Rose.  Fabrizio and Tommy grin at each other.", "Rose  turns suddenly and looks right at Jack.  He is  caught", "staring, but he doesn't look away.  She does, but then looks", "back.", "across the gulf between worlds.", "CONTINUED: (2)", "Jack  sees a man (Cal) come up behind her and take her  arm.", "She  jerks  her  arm  away.  They argue in  pantomime.", "storms away, and he goes after her, disappearing along the A-", "deck promenade.  Jack stares after her.", "INT. FIRST CLASS DINING SALOON - NIGHT", "SLOWLY PUSHING IN ON ROSE as she sits, flanked by people  in", "heated  conversation.  Cal and Ruth are  laughing  together,", "while  on  the other side LADY DUFF-GORDON is holding  forth", "animatedly.", "staring", "inconsequential babble around her.", "ANGLE BENEATH TABLE showing Rose's hand, holding a tiny fork", "from  her crab salad.  She pokes the crab-fork into the skin", "of her arm, harder and harder until it draws blood.", "INT. CORRIDOR / B DECK - NIGHT", "Rose  walks along the corridor.  A steward coming the  other", "way  greets her, and she nods with a slight smile.", "perfectly composed.", "INT. ROSE'S BEDROOM - NIGHT", "She  enters the room.  Stands in the middle, staring at  her", "reflection  in the large vanity mirror.  Just stands  there,", "then--", "CONTINUED:", "With  a  primal,  anguished cry she  claws  at  her  throat,", "ripping  off her pearl necklace, which explodes  across  the", "room.", "hair...  then  attacks the room.  She flings everything  off", "the  dresser and it flies clattering against the wall.", "hurls a handmirror against the vanity, cracking it.", "EXT. A DECK PROMENADE, AFT - NIGHT", "Rose  runs  along the B deck promenade.  She is dishevelled,", "her  hair  flying.  She is crying, her cheeks streaked  with", "tears.  But also angry, furious!  Shaking with emotions  she", "doesn't  understand... hatred, self-hatred, desperation.", "strolling  couple watch her pass.  Shocked at the  emotional", "display in public.", "EXT. POOP DECK - NIGHT", "Jack  is  kicked back on one of the benches  gazing  at  the", "stars blazing gloriously overhead.  Thinking artist thoughts", "and smoking a cigarette.", "Hearing something, he turns as Rose runs up the stairs  from", "the  well  deck.  They are the only two on the  stern  deck,", "except for QUARTERMASTER ROWE, twenty feet above them on the", "docking  bridge  catwalk.", "shadows, and runs right past him.", "TRACKING  WITH ROSE as she runs across the deserted fantail.", "Her", "suppresses.", "flagpole and clings there, panting.  She stares out  at  the", "black water.", "Then starts to climb over the railing.  She has to hitch her", "long", "methodically  she turns her body and gets her heels  on  the", "white-painted gunwale, her back to the railing,  facing  out", "toward blackness.", "are  churning  the atlantin into white foam, and  a  ghostly", "wake trails off toward the horizon.", "IN  A  LOW ANGLE, we see Rose standing like a figurehead  in", "reverse.", "\"TITANIC\".", "She  leans  out,  her  arms  straightening...  looking  down", "hypnotized, into the vortex below her.  Her dress  and  hair", "are  lifted  by the wind of the ship's movement.", "CONTINUED:", "The  only sound,  above  the rush of water below, is the", "flutter  and snap of the big Union Jack right above her.", "She  whips  her head around at the sound of his  voice.", "takes a second for her eyes to focus.", "Jack  sees  the tear tracks on her cheeks in the faint  glow", "from the stern running lights.", "Rose  is  confused now.  She can't see him very well through", "the  tears,  so she wipes them with one hand, almost  losing", "her balance.", "He takes off his jacket.", "He starts unlacing his left shoe.", "CONTINUED: (2)", "She looks down.  The reality factor of what she is doing  is", "sinking in.", "He starts unlacing his right shoe.", "CONTINUED: (3)", "He  slides  one  step closer, like moving up  on  a  spooked", "horse.", "Rose  stares at this madman for a long time.  She  looks  at", "his  eyes  and  they  somehow  suddenly  seem  to  fill  her", "universe.", "She  unfastens one hand from the rail and reaches it  around", "toward him.  He reaches out to take it, firmly.", "Rose starts to turn.  Now that she has decided to live,  the", "height  is  terrifying.  She is overcome by vertigo  as  she", "shifts her footing, turning to face the ship.  As she starts", "to  climb, her dress gets in the way, and one foot slips off", "the edge of the deck.", "She  plunges, letting out a piercing SHRIEK.  Jack, gripping", "her  hand, is jerked toward the rail.  Rose barely  grabs  a", "lower rail with her free hand.", "QUARTERMASTER  ROWE,  up  on the docking  bridge  hears  the", "scream and heads for the ladder.", "CONTINUED: (4)", "Jack  holds her hand with all his strength, bracing  himself", "on  the railing with his other hand.  Rose tries to get some", "kind of foothold on the smooth hull.  Jack tries to lift her", "bodily  over the railing.  She can't get any footing in  her", "dress  and evening shoes, and she slips back.  Rose  SCREAMS", "again.", "Jack, awkwardly clutching Rose by whatever he can get a grip", "on  as  she  flails, gets her over the railing.", "together onto the deck in a tangled heap, spinning in such a", "way that Jack winds up slightly on top of her.", "Rowe  slides  down the ladder from the docking  bridge  like", "it's a fire drill and sprints across the fantail.", "Rowe  runs  up  and  pulls Jack off of Rose,  revealing  her", "dishevelled and sobbing on the deck.  Her dress is torn, and", "the  hem  is pushing up above her knees, showing one  ripped", "stocking.", "his  jacket  off,  and  the  first  class  lady  clearly  in", "distress,  and starts drawing conclusions.  Two seamen  chug", "across the deck to join them.", "EXT. POOP DECK - NIGHT", "A  few  minutes later.  Jack is being detained by the  burly", "MASTER AT ARMS, the closest thing to a cop on board.  He  is", "handcuffing  Jack.", "furious.  He has obviously just rushed out here with Lovejoy", "and  another  man,  and none of them have coats  over  their", "black tie evening dress.  The other man is COLONEL ARCHIBALD", "GRACIE,  a  mustachioed blowhard who still  has  his  brandy", "snifter.", "on  a  bench  nearby, but she waves it away.", "concerned with Jack.  He grabs him by the lapels.", "CONTINUED:", "Rose looks at Jack, getting eye contact.", "Rose  is  begging him with her eyes not to say  what  really", "happened.", "He  looks  at Rose a moment longer.  Now they have a  secret", "together.", "Jack is uncuffed.  Cal gets Rose to her feet and moving.", "CONTINUED: (2)", "Cal is leaving without a second thought for Jack.", "Cal turns back to Jack.  He appraises him condescendingly...", "a steerage ruffian, unwashed and ill-mannered.", "Cal  turns to go, putting a protective arm around Rose.", "leans close to Gracie as they walk away.", "Lovejoy  smoothly  draws a silver cigarette  case  from  his", "jacket  and  snaps  it open.  Jack takes a  cigarette,  then", "another,  popping  it  behind his ear  for  later.", "lights Jack's cigarette.", "CONTINUED: (3)", "Lovejoy's  expression is bland, but the eyes are  cold.", "turns away to join his group.", "INT. ROSE'S BEDROOM - NIGHT", "As  she  undresses  for bed Rose sees Cal  standing  in  her", "doorway, reflected in the cracked mirror of her vanity.", "comes toward her.", "From behind his back he hands her a large black velvet jewel", "case.  She takes it, numbly.", "Rose slowly opens the box.  Inside is the necklace... \"HEART", "OF  THE OCEAN\" in all its glory.  It is huge... a malevolent", "blue stone glittering with an infinity of scalpel-like inner", "reflections.", "He  takes  the necklace and during the following  places  it", "around  her  throat.", "behind her.", "CONTINUED:", "He gazes at the image of the two of them in the mirror.", "His fingers caress her neck and throat.  He seems himself to", "be  disarmed by Rose's elegance and beauty.  His emotion is,", "for the first time, unguarded.", "CAMERA  begins  to  TRACK IN ON ROSE.", "during the following:", "Finally, when Rose's eyes FILL FRAM, we MORPH SLOWLY to  her", "eyes  as  the  are now... transforming through 84  years  of", "life...", "TRANSITION", "INT. KELDYSH IMAGING SHACK", "Without  a cut the wrinkled, weathered landscape of age  has", "appeared around her eyes.  But the eyes themselves  are  the", "same.", "THE CAMERA PUllS BACK to show her whole face.", "CONTINUED:", "But Rose laughs with Bodine.", "Lovett, standing out of Rose's sightline, checks his  watch.", "Hours have passed.  This process is taking too long.", "Lizzy picks up the cue and starts to wheel her out.", "Lizzy  takes  her  out.", "doorway in a frail wave goodbye.", "EXT. LAUNCH AREA/KELDYSH DECK - DAY", "As the big hydraulic jib swings one of the Mir subs out over", "the  water.  Lovett walks as he talks with Bobby Buell,  the", "partners'  rep.  They weave among deck cranes, launch  crew,", "sub maintenance guys.", "CONTINUED:", "Brock  turns  and sees Lizy standing behind  him.", "overheard the past part of his dialogue with Buell.  He goes", "to  her and hustles her away from Buell, toward a quite spot", "on the deck.", "CONTINUED: (2)", "She  looks  at  his hand, palm up.  Empty.", "around an imaginary shape.", "INT. IMAGING SHACK", "Bodine  starts  the tape recorder.  Rose is  gazing  at  the", "screen  seeing  THE LIVE FEED FROM THE WRECK--SNOOP  DOG  is", "moving  along  the starboard side of the hull, heading  aft.", "The  rectangular windows of A deck (forward) march  past  on", "the right.", "CONTINUED:", "EXT. B DECK TITANIC - DAY", "MATCH  DISSOLVE  from the rusting hulk to the  gleaming  new", "Titanic  in 1912, passing the end of the enclosed  promenade", "just  as Rose walks into the sunlight right in front of  us.", "She is stunningly dressed and walking with purpose.", "IT  IS SATURDAY APRIL 13, 1912.  Rose unlatches the gate  to", "go down into third class.  The steerage men on the deck stop", "what they're doing and stare at her.", "INT. THIRD CLASS GENERAL ROOM", "The  social  center  of  steerage  life.", "comparison  to the opulence of first class, but is  a  loud,", "boisterous  place.", "running between the benches yelling in several languages and", "being scolded in several more.  There are old women yelling,", "men  playing chess, girls doing needlepoint and reading dime", "novels.", "noodling around it.", "Three  boys,  shrieking and shouting, are scrambling  around", "chasing a rat under the benches, trying to whomp it  with  a", "shoe and causing general havoc.  Jack is playing with 5 year", "old  CORA  CARTMeLL,  drawing funny faces  together  in  his", "sketchbook.", "Fabrizio is struggling to get a conversation going  with  an", "attractive  Norwegian  girl, HELGA DAHL,  sitting  with  her", "family at a table across the room.", "Helga's eye is caught by something.  Fabrizio looks, does  a", "take... and Jack, curious, follows their gaze to see...", "CONTINUED:", "Rose, coming toward them.  The activity in the room stops...", "a  hush  falls.  Rose feels suddenly self-conscious  as  the", "steerage passengers stare openly at this princess, some with", "resentment,  others with awe.  She spots Jack  and  gives  a", "little  smile,  walking straight to him.  He rises  to  meet", "her, smiling.", "Fabrizio  and  Tommy  are floored.", "fitting Cinderella.", "He  motions  her ahead and follows.  Jack glances  over  his", "shoulder,  one  eyebrow raised, as he  walks  out  with  her", "leaving a stunned silence.", "EXT. BOAT DECK - DAY", "Jack  and Rose walk side by side.  They pass people  reading", "and talking in steamer chairs, some of whom glance curiously", "at  the  mismatched couple.  He feels out of  place  in  his", "rough", "reasons.", "There is an awkward pause.", "CONTINUED:", "CONTINUED: (2)", "She shows him her engagement ring.  A sizable diamond.", "They laugh together.  A passing steward scowls at Jack,  who", "is clearly not a first class passenger, but Rose just glares", "at him away.", "Looking  for  another topic, any other topic, she  indicates", "his sketchbook.", "CONTINUED: (3)", "The  question is rhetorical because she has already  grabbed", "the", "sketchbook.", "little  bit  of humanity: an old woman's hands,  a  sleeping", "man,  a  father  and  daughter at the rail.  The  faces  are", "luminous and alive.  His book is a celebration of the  human", "condition.", "Some  loose  sketches fall out and are taken  by  the  wind.", "Jack scrambles after them... catching two, but the rest  are", "gone, over the rail.", "He snaps his wrist, shaking his drawing hand in a flourish.", "For  emphasis he throws away the two he caught.", "off.", "She goes back to the book, turning a page.", "CONTINUED: (4)", "She has come upon a series of nudes.  Rose is transfixed  by", "the  languid beauty he has created.  His nudes are  soulful,", "real,  with expressive hands and eyes.  They feel more  like", "portraits", "uncomfortably intimate.  Rose blushes, raising the  book  as", "some strollers go by.", "She  studies one drawing in particular, the girl posed  half", "in sunlight, half in shadow.  Her hands lie at her chin, one", "furled  and  one open like a flower, languid  and  graceful.", "The  drawing  is like an Alfred Steiglitz print  of  Georgia", "O'Keefe.", "There it is.  That piercing gaze again.", "CONTINUED: (5)", "INT. RECEPTION ROOM / D-DECK - DAY", "Ruth is having tea with NOEL LUCY MARTHA DYER-EDWARDES,  the", "COUNTESS", "patirician  features.  Ruth sees someone coming  across  the", "room and lowers her voice.", "Molly  Brown walks up, greeting them cheerfully as they  are", "rising.", "Ruth grits her teeth as the three of them head for the Grand", "Staircase  to go up.  TRACKING WITH THEM, as they cross  the", "room, the SHOT HANDS OFF to Bruce Ismay and Captain Smith at", "another table.", "CONTINUED:", "A beat.  Then Smith nods, stiffy.", "EXT. A DECK PROMENADE - DAY", "Rose  and  Jack  stroll aft, past people  lounging  on  deck", "chairs  in  the  slanting  late-afternoon  light.", "scurry to serve tea or hot cocoa.", "CONTINUED:", "She  leaps forward, lands deftly and whirls like a  dervish.", "Then she sees something ahead and her face lights up.", "She  takes  his  hand and runs, pulling him along  the  deck", "toward--", "DANIEL  AND MARY MARVIN.  Daniel is cranking the big  wooden", "movie camera as she poses stiffly at the rail.", "SUDDENLY  Rose shoots into the shot and strikes a theatrical", "pose  at  the  rail next to Mary. Mary bursts out  laughing.", "Rose pulls Jack into the picture and makes him pose.", "Marvin grins and starts yelling and gesturing.  We see  this", "in CUTS, with music and no dialogue.", "Rose posing tragically at the rail, the back of her hand  to", "her forehead.", "Jack  on  a  deck chair, pretending to be a Pasha,  the  two", "girls pantomiming fanning him like slave girls.", "Jack,  on  his knees, pleading with his hands clasped  while", "Rose, standing, turns her head in bored disdain.", "Rose  cranking  the camera, while Daniel  and  Jack  have  a", "western  shoot-out.", "twirling an air mustache like Snidely Whiplash.", "EXT. A DECK PROMENADE / AFT - SUNSET", "Painted with orange light, Jack and Rose lean on the  A-deck", "rail aft, shoulder to shoulder.  The ship's lights come on.", "It is a magical moment... perfect.", "CONTINUED:", "CONTINUED: (2)", "He spits.  It arcs out over the water.", "Rose  screws up her mouth and spits.  A pathetic little  bit", "of  foamy  spittle which mostly runs down  her  chin  before", "falling off into the water.", "She goes through the steps.  Hawks it down, etc.  He coaches", "her  through it (ad lib) while doing the steps himself.  She", "lets  fly.  So does he.  Two comets of gob fly out over  the", "water.", "Rose  turns to him, her face alight.  Suddenly she blanches.", "He sees her expression and turns.", "RUTH,  the  Countess of Rothes, and Molly  Brown  have  been", "watching", "composed.", "Jack  has  a little spit running down his chin.  He  doesn't", "know  it.", "the introductions, we hear...", "CONTINUED: (3)", "They  all jump as a BUGLER sounds the meal call right behind", "them.", "The  Countess  exits with Ruth and Rose,  leaving  Jack  and", "Molly alone on deck.", "Jack  looks down at his clothes.  Back up at her.  He hadn't", "thought about that.", "INT. MOLLY BROWN'S STATEROOM", "Men's suits and jackets and formal wear are strewn all  over", "the  place.  Molly is having a fine time.  Jack is  dressed,", "except for his jacket, and Molly is tying his bow tie.", "CONTINUED:", "She picks up a jacket off the bed and hands it to him.  Jack", "goes  into the bathroom to put it on.  Molly starts  picking", "up the stuff off the bed.", "She turns and sees him, though we don't.", "78  EXT. BOAT DECK / FIRST CLAsS ENTRANCE - DUSK", "A  purple  sky,  shot  with orange, in the  west.", "strains  of  classic music.  We TRACK WITH  JACK  along  the", "deck.", "his  borrowed  white-tie outfit, right  down  to  his  pearl", "studs.", "A steward bows and smartly opens the door to the First Class", "Entrance.", "Jack  plays  the  role smoothly.  Nods with just  the  right", "degree of disdain.", "INT. UPPER LANDING / GRAND STAIRCASE AND A-DECK", "Jack  steps in and his breath is taken away by the  splendor", "spread out before him.  Overhead is the enormous glass dome,", "with a crystal chandelier at its center.  Sweeping down  six", "stories  is the First Class Grand Staircase, the epitome  of", "the opulent naval architecture of the time.", "And  the  people:  the women in their floor length  dresses,", "elaborate  hairstyles and abundant jewelry... the  gentlemen", "in evening dress, standing with one hand at the small of the", "back, talking quietly.", "CONTINUED:", "Jack  descends  to  A deck.  Several men nod  a  perfunctory", "greeting.  He nods back, keeping it simple.  He feels like a", "spy.", "Cal comes down the stairs, with Ruth on his arm, covered  in", "jewelry.", "gecognizeing  him.  Cal nods at him, one  gent  to  another.", "But  Jack barely has time to be amused. Because just  behind", "Cal  and  Ruth on the stairs is Rose, a vision  in  red  and", "black, her low-cut dress showing off her neck and shoulders,", "her  arms seathed in white gloves that come well above above", "the elbow.  Jack is hypnotized by her beauty.", "CLOSE  ON  ROSE  as she approaches Jack.", "gentlemen's  stance, hand behind his back.  She extends  her", "gloved  hand  and  he  takes it, kissing  the  back  of  her", "fingers.  Rose flushes, beaming noticeably.  She can't  take", "her eyes off him.", "INT. D-DECK RECEPTION ROOM", "CUT  TO  THE RECEPTION ROOM ON D DECK, as the party descends", "to  dinner.  They encounter Molly Brown, looking good  in  a", "beaded dress, in her own busty broad-shouldered way.", "grins when she sees Jack.  As they are going into the dining", "saloon she walks next to him, speaking low:", "CONTINUED:", "As  they enter the swirling throng, Rose leans close to him,", "pointing out several notables.", "Cal  becomes  engrossed in a conversations with Cosmo  Duff-", "Gordon  and  Colonel Gracie, while Ruth,  the  Countess  and", "Lucille discuss fashion.  Rose picots Jack smoothly, to show", "him another couple, dressed impeccably.", "Cal,", "counterparts,  who  are looking at Rose like  a  prize  show", "horse.", "Ruth  steps  over, hearing the last.  She takes  Cal's  arm,", "somewhat coquettishly.", "CONTINUED: (2)", "The  entourage strolls toward the dining saloon, where  they", "run into the Astor's going through the ornate double doors.", "J.J.  nods  as  if he's heard of them, then  looks  puzzled.", "Madeleine  Astor  appraises Jack and whispers  girlishly  to", "Rose:", "INT. DINING SALOON", "Like  a  ballroom  at  the  palace,  alive  and  lit  by", "constellation  of  chandeliers, full  of  elegantly  dressed", "people and beautiful music from BANDLEADER WALLACE HARTLEY'S", "small orchestra.  As Rose and Jack enter and move across the", "room to their table, Cal and Ruth beside them, we hear...", "INT. DINING SALOON", "CLOSE ON RUTH.", "WIDER:  THE  TABLE.  Jack is seated opposite  Rose,  who  is", "flanked  by Cal and Thomas Andrews.  Also at the  table  are", "Molly", "Guggenheim, Madame Aubert, and the Astors.", "Rose motions surreptitiously for Jack to take his napkin off", "his plate.", "We  see  whispers  exchanged.  Jack  becomesthe  subject  of", "furtive  glances.  Now they're all feeling terribly  liberal", "and dangerous.", "CONTINUED:", "He looks at Rose, pokerfaced, and she smiles.", "Salad  is  served.  Jack reaches for the  fish  fork.", "gives him a look and picks up the salad fork, prompting  him", "with her eyes.  He changes forks.", "Molly Brown raises her glass in a salute.", "Rose raises her glass, looking at Jack.", "Ruth,  annoyed  that  Jack has scored a point,  presses  him", "further.", "CONTINUED: (2)", "Rose  notices that Thomas Andrews, sitting next to  her,  is", "writing", "conversation.", "Andrews smiles sheepishly.", "We see that Andrews has come under Rose's spell.", "CONTINUED: (3)", "83", "arrives with cigars in a humidor on a wheeled cart.  The men", "start clipping ends and lighting.", "Actually he does, but...", "Cal and te other gentlemen exit.", "He leans over to take her hand.", "INSERT:  We see him slip a tiny folded not into her palm.", "Ruth,  scowling, watches him walk away across  the  enormous", "room.", "level.", "INT. A-DECK FOYER-NIGHT", "Rose  crosses the A-Deck foyer, sighting Jack at the landing", "above.  Overhead is the crystal dome.  Jack has his back  to", "her,  studying the ornate clock with its carved  figures  of", "Honor and Glory.  It softly strikes the hour.", "MOVING  WITH  ROSE  as  she goes up the  sweeping  staircase", "toward him.  He turns, sees her... smiles.", "INT. THIRD CLASS GENERAL ROOM", "Crow led and alive with music, laughter and raucous carrying", "on.", "honking  out lively stomping music on fiddle, accoridon  and", "tambourine.", "and wine, smoking, laughing, even brawling.", "Tommy  hands Rose a pint of stout and she hoists  it.", "meanwhile dances with 5 year old Cora Cartmell, or tries to,", "with her standing on his feet.  As the tune ends, Rose leans", "down to the little girl.", "Cora  scampers off.  Rose and Jack face each other.  She  is", "trembling as he takes her right hand in his left.  His other", "hand slides to the small of her back.  It is an electrifying", "moment.", "The  music  starts  and they are off.  A little  awkward  at", "first, she starts to get into it.  She grins at Jack as  she", "starts to get the rhythm of the steops.", "CONTINUED:", "She  bends  down,  pulling off her high  heeled  shoes,  and", "flings  them to Tommy.  Then she grabs Jack and they  plunge", "back into the fray, dancing faster as the music speeds up.", "OMITTED", "INT. THIRD CLASS GENERAL ROOM", "The  scene  is  rowdy and rollicking.  A table gets  knocked", "over as a drunk crashes into it.  And in the middle of it...", "Rose dancing with Jack in her stocking feet.  The steps  are", "fast  and she shines with sweat.  A space opens around them,", "and people watch them, clapping as the band plays faster and", "faster.", "FABRIZIO  AND HELGA.  Dancing has obviated the  need  for  a", "common  language.", "whirling  him...  Fabrizio's eyes go wide when  he  realizes", "she's stronger than he is.", "The tune ends in a mad rush.  Jack steps away from Rose with", "a  flourish,  allowing her to take a bow.", "slightly  tipsy,  she  does a graceful ballet  ployer,  feet", "turned  out perfectly.  Everyone laughs and applauds.", "is  a  hit with the steerage folks, who've never had a", "party with them.", "They  move  to  a  table, flushed and  sweaty.", "Fabrizio's  cigarette and takes a big drag.", "cocky.  Fabrizio is grinning, holding hands with Helga.", "Tommy  walks  up with a pint for each of them.", "hers, showing off.", "Everybody else is dancing again, and Bjorn Gundersen crashes", "into  Tommy,  who sloshes his beer over Rose's  dress.", "laughs,  not caring.  But Tommy lunges, grabbing  Bjorn", "wheeling him around.", "CONTINUED:", "Bjorn  comes around, his fists coming up... and  Jack  leaps", "into the middle of it, pushing them apart.", "Tommy  stands there, all piss and vinegar, chest puffed  up.", "Then he grins and claps Bjorn on the shoulder.", "In  her  stocking  feet she assumes a  ballet  stance,  arms", "raised,  and goes up on point, taking her entire  weight  on", "the  tips  of  her  toes.  The guys gape at  her  incredible", "muscle  control.  She comes back down, then her face  screws", "up in pain.  She grabs one foot, hopping around.", "Jack  catches  her  as she loses her balance,  and  everyone", "cracks up.", "THE  DOOR  to the well deck is open a few inches as  Lovejoy", "watches through the gap.  He sees Jack holding Rose, both of", "them laughing.", "LOVEJOY closes the door.", "EXT. BOAT DECK - NIGHT", "The  stars blaze overhead, so bright and clear you  can  see", "the  Milky  Way.", "lifeboats.  Still giddy from the party, they are  singing  a", "popular song \"Come Josephine in My Flying Machine\".", "CONTINUED:", "They  fumble the words and break down laughing.", "reached the First Class Entrance, but don't go straight  in,", "not wanting the evening to end.  Through the doors the sound", "of  the  ship's orchestra wafts gently.  Rose grabs a  davit", "and leans back, staring at the cosmos.", "She goes to the rail and leans on it.", "He  leans  at  the rail next to her, his hand just  touching", "hers.", "either", "where their hands are touching.", "CONTINUED: (2)", "Jack  looks  at  her, and finds that they are suddenly  very", "close  together.  It would be so easy to move another couple", "of  inches, to kiss her.  Rose seems to be thinking the same", "thing.", "After a beat, Rose pulls back.", "She  leaves  the  rail and hurries through the  First  Class", "Entrance.", "But  the  door  bangs shut, and she is gone.", "world.", "INT. ORSE AND CAL'S SUITE / PRIVATE PROMENADE - DAY", "SUNDAY  APRIL", "splashing  across the promenade.  Rose and  Cal  are  having", "breakfast in silence.  The tension is palpable.  Trudy Bolt,", "in her maid's uniform, pours the coffee and goes inside.", "CONTINUED:", "Cal  explodes,  sweeping the breakfast china off  the  table", "with  a  crash.", "glowering  over her and gripping the sides of her chair,  so", "she is trapped between his arms.", "Rose  shrinks  into  the  chair.  She  sees  Trudy,  frozen,", "partway  through  the door bringing the orange  juice.", "follows  Rose's glance and straightens up.  He  stalks  past", "the maid, entering the stateroom.", "INT. RUTH'S SUITE - DAY", "Rose is dressed for the day, and is in the middle of helping", "Ruth  with  her corset.  The tight bindings do  not  inhibit", "Ruth's fury at all.", "Rose  has her knee at the base of her mother's back  and  is", "pulling the corset strings with both hands.", "Ruth  pulls away from her, and crosses to the door,  locking", "it.  CLACK!", "CONTINUED:", "Rose  turns  her around and grabs the corset strings  again.", "Ruth sucks in her waist and Rose pulls.", "Rose  turns  to her, and we see what Rose sees--  the  naked", "fear in her mother's eyes.", "Rose pulls the corset tighter.", "INT. FIRST CLASS DINING SALOON", "At  the divine service, Captain Smith is leading a group  in", "the  hymn  \"Almighty Father Strong To Save.\"  Rose and  Ruth", "sing in the middle of the group.", "Lovejoy  stands  well back, keeping  an  eye  on  Rose.", "notices  a  commotion  at the entry doors.", "CONTINUED:", "Jack  has  been halted  there by two stewards.  He is dressed", "in  his  third class clothes, and stands there, hat in hand,", "looking out of place.", "He  holds out two twenty dollar bills, which Jack refuses to", "take.", "Jack spots Rose but she doesn't see him.", "END ON ROSE, not seeing Jack hustled out.", "CONTINUED: (2)", "INT. GYMNASIUM - DAY", "An", "recognize,  and  some  don't.  A woman pedals", "bicycle in a long dress, looking rediculous.  Thomas Andrews", "is leading a small tour group, including Rose, Ruth and Cal.", "Cal  is wroking the oars of a stationary rowing machine with", "a well trained stroke.", "T.W. McCAULEY, the gym instructor, is a bouncy little man in", "white flannels, eager to show off his modern equipment, like", "his present-day counterpart on an \"Abflex\" infomercial.", "hits  a  switch and a machine with a saddle on it starts", "undulate.  Rose puts her hand on it, curious.", "EXT. AFT WELL DECK, B-DECK AND A-DECK - DAY", "Jack,  walking  with determination, is followed  closely  by", "Tommy  and Fabrizio.  He quickly climbs the steps to  B-Deck", "and steps over the gate separating 3rd from 2nd class.", "CONTINUED:", "Jack moves furtively to the wall below the A-Deck promenade,", "aft.", "Tommy", "together, crouching down.  Jack steps into Tommy's hands and", "gets  boosted up to the next deck, where he scrambles nimbly", "over the railing, onto the First Class deck.", "EXT. A-DECK / AFT - DAY", "A  man is playing with his son, who is spinning a top with a", "string.", "chair nearby.  Jack emerges from behind one of the huge deck", "cranes  and  calmly picks up the coat and  bowler  hat.", "walks away, slipping into the coat, and slicks his hair back", "with  spit.  Then puts the hat on at a jaunty angle.", "distance he could pass for a gentlemen.", "INT. BRIDGE / CHARTROOM - DAY", "HAROLD  BRIDE,  the", "hustles in and skirts around Andrews' tour group to  hand  a", "Marconigram to Captain Smith.", "Smith  glances at the message then nonchalantly puts  it  in", "his pocket.  He nods reassuringly to Rose and the group.", "CONTINUED:", "Andrews  scowls slightly before motioning the  group  toward", "the  door.  They exit just as SECOND OFFICER CHARLES HERBERT", "LIGHTOLLER  comes  out of the chartroom,  stopping  next  to", "First Officer Murdoch.", "FIRST OFFICER MURDOCH", "Haven't seen them since Southampton.", "EXT. BOAT DECK / STARBOARD SIDE - DAY", "Andrews leads the group back from the bridge along the  boat", "deck.", "As  they are passing Boat 7, a gentlemen turns from the rail", "and walks up behind the group.  It is Jack.", "CONTINUED:", "He taps Rose on the  arm  and she turns, gasping.  He motions", "and  she  cuts away  from  the group toward a door which Jack", "holds  open. They duck into the--", "INT. GYMNASIUM - DAY", "Jack closes the door behind her, and glances out through the", "ripple-glass  window to the starboard rail,  where  the  gym", "instructor is chatting up the woman who was riding the bike.", "Rose and Jack are alone in the room.", "He takes her by the shoulders.", "-", "Rose  feels the tears coming to her eyes.  Jack is  so  open", "and real... not like anyone she has ever known.", "CONTINUED:", "INT. FIRST CLASS LOUNG - DAY", "The  most  elegant room on the ship, done  in  Louis  Quinze", "Versaille  style.  Rose sits on a divan,  with  a  group  of", "other  women arrayed around her.  Ruth, the Countess  Rothes", "and  Lady  Duff-Gordon are taking tea.  Rose is  silent  and", "still  as  a  porcelain figurine as the conversation  washes", "around her.", "TRACKING SLOWLY IN on Rose as Ruth goes on.", "REVERSE, ROSE'S POV:  A tabeau of MOTHER and DAUGHTER having", "tea.  The four year old girl, wearing white gloves, daintily", "picking  up  a  cookie.  The mother correcting  her  on  her", "posture, and the way she holds the teacup.  The little  girl", "is  trying  so  hard to please, her expression  serious.", "glimpse  of  Rose  at  that age, and we see  the  relentless", "conditioning... the pain to becoming an Edwardian geisha.", "ON ROSE.  She calmly and deliberately turns her teacup over,", "spilling tea all over her dress.", "EXT. TITANIC - DAY", "TITANIC  STEAMS TOWARD US, in the dusk light, as if  lit  by", "the  embers  of  a giant fire.  As the ship  looms,  FILLING", "FRAME,  we push in on the bow.  Jack is there, right at  the", "apex  of the bow railing, his favorite spot.  He closes  his", "eyes, letting the chill wind clear his head.", "CONTINUED:", "Jack hears her voice, behind him...", "He turns and she is standing there.", "He  smiles at her, his eyes drinking her in.  Her cheeks are", "red  with  the chill wind, and her eyes sparkle.", "blows wildly about her face.", "He  puts his hands on her waist.  As if he is going to  kiss", "her.", "She does, and he turns her to face forward, the way the ship", "is going.  He presses her gently to the rail, standing right", "behind  her.", "until  she  is  standing with her arms outstetched  on  each", "side.", "hands, her arms stay up... like wings.", "Rose  gasps.", "water.", "the two of them soaring.  The Atlantic unrolls toward her, a", "hammered copper shield under a dusk sky.  There is only  the", "wind, and the hiss of the water 50 feel below.", "She  leans forward, arching her back.  He puts his hands  on", "her waist to steady her.", "CONTINUED: (2)", "Rose  cleses  her eyes, feeling herself floating  weightless", "far  above  the sea.  She smiles dreamily, then leans  back,", "gently  pressing  her  back against his  chest.", "forward slightly against her.", "Slowly he raises his hands, arms outstretched, and they meet", "hers...  fingertips  gently touching.", "intertwine.  Moving slowly, their fingers caress through and", "around each other like the bodies of two lovers.", "Jack  tips  his face forward into her blowing hair,  letting", "the  scent of her wash over him, until his cheek is  agianst", "her ear.", "Rose turns her head until her lips are near his.  She lowers", "her  arms,  turning further, until she finds his mouth  with", "hers.", "kiss  like  this  with  her  head turned  and  tilted  back,", "surrendering  to  him, to the emotion,  to  the  inevitable.", "They  kiss,  slowly and tremulously, and then with  building", "passion.", "Jack and the ship seem to merge into one force of power  and", "optimism,  lifting  her, buoying her forward  on  a  magical", "journey, soaring onward into a night without fear.", "100  IN THE CROW'S NEST, high above and behind them, lookout", "FREDERICK FLEET nudges his mate, REGINALD LEE, pointing down", "at the figures in the bow.", "101", "SLOWLY AWAY, leaving the ruined bow of the WRECK--", "INT. KELDYSH IMAGING SHACK", "OLD  ROSE blinks, seeming to come back to the present.", "sees the wreck on the screen, the sad ghost ship deep in the", "abyss.", "Brock Lovett changes the tape in the minicassette recorder.", "CONTINUED:", "ROSE is ignoring this conversation.  She has the art-nouveau", "comb  with  the jade butterfly on the handle in  her  hands,", "turning  it slowly.  She is watching a monitor, which  shows", "the  ruins of Suite B-52/56.  PUSH IN until the image  fills", "frame.", "INT. ROSE'S SUITE", "upholstery emerge from the rusted ruin.  Jack is overwhelmed", "by  the  opulence of the room.  He sets his  sketchbood  and", "drawing materials on the marble table.", "He crouches next to the paintings stacked against the wall.", "CONTINUED:", "She  goes  into the adjoining walk-in wardrobe  closet.", "sees  her  go to the safe and start working the combination.", "He's fascinated.", "CLUNK!", "eyes  in  the  mirror behind the safe.", "removes the necklace, then holds it out to Jack who takes it", "nervously.", "Jack gazes at wealth beyond his comprehension.", "He looks up at her, surprised, and we CUT TO:", "104  ROSE'S BEDROOM.  ON THE BUTTERFLY COMB as Rose draws it", "out  of  her  hair.  She shakes her head and her hair  falls", "free around her shoulders.", "105  IN THE SITTING ROOM Jack is laying out his pencils like", "surgical tools.  His sketchbook is open and ready.  He looks", "up as she comes into the room, wearing a silk kimono.", "CONTINUED: (2)", "She  hands  him a dime and steps back, parting  the  kimono.", "The  blue  stone lies on her creamy breast.", "pounding as she slowly lowers the robe.", "Jakc  looks  so stricken, it is almost comical.  The  kimono", "drops to the floor (this is all in cuts, lyrical).", "She  poses  on  the  divan, settling like  a  cat  into  the", "position we remember from the drawing... almost.", "Jack  starts to sketch.  He drops his pencil and she stifles", "a laugh.", "TIGHT  ON  JACK as his eyes come up to look at her over  the", "top  edge of his sketchpad. We have seen this image  of  him", "before,  in her memory.  It is an image she will  carry  the", "rest of her life.", "Despite  his  nervousness, he draws with sure  strokes,  and", "what  emerges is the best thing he has ever done.  Her  pose", "is  languid,  her hands beautiful, and her eyes radiate  her", "energy.", "PUSH SLOWLY IN ON ROSE'S FACE...", "INT. KELDYSH / IMAGING SHACK", "MATCH DISSOLVE/MORPH to Rose, 101 years old.  Only her  eyes", "are the same.", "CUT  TO REVERSE: A semicircle of listeners staring in  rapt,", "frozen silence.  The story of Jack and Rose has finally  and", "completely grabbed them.", "INT. ROSE AND CAL'S SUITE - NIGHT", "BACK  TO", "her kimono again, is leaning on his shoulder, watching.", "Rose gazes at the drawing.  He has X-rayed her soul.", "He  does:", "piece  of", "She accepts the drawing from him, and crosses to the safe in", "the wardrobe.", "She  puts the diamond back in the safe, placing hte  drawing", "and the note on top of it.  Closes the door with a CLUNK!", "INT. FIRST CLASS SMOKING ROOM - NIGHT", "Lovejoy  enters  from the Palm Court through  the  revolving", "door and crosses the room toward Hockley.", "CONTINUED:", "A fire is blazing in  the  marble fireplace, and the usual", "fatcats are playing cards,  drinking and talking.  Cal sees", "Lovejoy and detaches from his group, coming to him.", "EXT. ATLANTIC - NIGHT", "TITANIC glides across an unnatural sea, blakc and calm as  a", "pool of oil.  The ships lights are mirrored almost perfectly", "in  the  black water.  The sky is brilliant with  stars.", "meteor traces a bright line across the heavens.", "110  ON THE BRIDGE, Captain Smith peers out at the blackness", "ahead of the ship.  QUARTERMASTER HITCHINS brings him a  cup", "of  hot tea with lemon.  It steams in the bitter cold of the", "open  bridge.", "staring  out  at the sheet of black glass the  Atlantic  has", "become.", "INT. ROSE AND CAL'S SUITE", "Rose, fully dressed now, returns to the sitting room.", "hear  a  key in the lock.  Rose takes Jack's hand and  leads", "him  silently through the bedrooms.  Lovejoy enters  by  the", "sitting room door.", "He  hears a door opening and goes through Cal's room  toward", "hers.", "INT. CORRIDOR OUTSIDE SUITE", "Rose  and Jack come out of her stateroom, closing the  door.", "She  leads him quickly along the corridor toward the B  deck", "foyer.", "sitting", "out.  The valet sees Jack with Rose and hustles after them.", "She and Jack break into a run, surprising the few ladies and", "gentlemen about.  Rose leads him past the stairs to the bank", "of  elevators.  They run into one, shocking the hell out  of", "the OPERATOR.", "The Operator scrambles to comply.  Jack even helps him close", "the  steel  gate.", "descend.", "makes  a  very  rude and unladylike gesture, and  laughs  as", "Lovejoy disappears above.  The Operator gapes at her.", "INT. E-DECK FOYER / ELEVATORS", "Lovejoy  emerges from another lift and runs to the one  Jack", "and Rose were in.  The Operator is just closing the gate  to", "go  back up.  Lovejoy runs around the bank of elevators  and", "scans  the  foyer... no Jack and Rose.  He tries the  stairs", "going down to F-Deck.", "INT. F-DECK CORRIDORS / FAN ROOM", "A  functional  space,  with access to a  number  of  machine", "spaces", "leaning against a wall, laughing.", "Lovejoy  has spotted them from a cross-corridor nearby.", "charges toward them.  Jack and Rose run around a corner into", "a  blind  alley.  There is one door, marked CREW  ONLY,  and", "Jack flings it open.", "115", "ladder  going down.  Jack latches the deadbolt on the  door,", "and Lovejoy slams against it a moment later.  Jack grins  at", "Rose, pointing to the ladder.", "INT. BOILER ROOM FIVE AND SIX", "Jack and Rose come down the escape ladder and look around in", "amazement.", "roaring furnaces and black figures moving in the smoky glow.", "They  run  the  length  of the boiler room,  dodging  amazed", "stokers, and trimmers with their wheelbarrows of coal.", "They  run through the open watertight door into BOILER  ROOM", "SIX.", "two  boilers and they wind up in the dark, out of  sight  of", "the  working crew.", "CONTINUED:", "Watching from the shadows, they see  the stokers  working in", "the hellish glow, shovelling  coal  into the  insatiable", "maws  of  the furnaces.", "roar of the fires.", "INT. FIRST CLASS SMOKING ROOM", "Amid  unparalled  luxury, Cal sits at a card  game,  sipping", "brandy.", "Cal  looks  at  his  gold  pocket  watch,  and  scowls,  not", "listening.", "OMITTED", "INT. BOILER ROOM SIX", "The  furnaces  roar,  silhouetting the  glistening  stokers.", "Jack  kisses  Rose's face, tasting the sweat trickling  down", "from  her  forehead.  They kiss passionately in the  steamy,", "pounding darkness.", "INT. HOLD #2", "Jack  and  Rose enter and run laughing between the  rows  of", "stacked cargo.  She hugs herself against the cold, after the", "dripping heat of the boiler room.", "They  come  upon William Carter's brand new RENAULT  touring", "car,  lashing down to a pallet.  It looks like a royal coach", "from  a fairy tale, its brass trim and headlamps nicely  set", "off by its deep burgundy color.", "Rose  climbs into the plushly upholstered back seat,  acting", "very  royal.  There are cut crystals bud vases on the  walls", "back  there,  each containing a rose.  Jack jumps  into  the", "driver's seat, enjoying hte feel of the leather and wood.", "CONTINUED:", "ON  JACK  as her hands come out of the shadows and pull  him", "over the seat into the back.  He lands next to her, and  his", "breath  seems loud in the quiet darkness.  He looks  at  her", "and she is smiling.  It is the moment of truth.", "He  strokes  her  face,  cherishing  her.", "artist's fingers.", "He  kisses  her, and she slides down in the seat  under  his", "welcome weight.", "INT. WIRELESS ROOM", "A  BRILLIANT ARC OF ELECTRICITY fills frame-- the sparks gap", "of  the Marconi instrument as SENIOR WIRELESS OPERATOR  JACK", "PHILLIPS", "Bride  looks  through  the huge stack of  outgoing  messages", "swamping them.", "Phillips start to receive an incoming message from a  nearby", "ship,  the  Leyland frieghter CALIFORNIAN,  which  jams  his", "outgoing  signal.", "deafening.", "Cursing, Phillips furiously keys a rebuke.", "INT. / EXT. WIRELESS SHAK / FREIGHTER CALIFORNIAN", "Wireless Operater CYRIL EVANS pulls his earphone off his ear", "as  the  Titanic's  spark deafens him.", "message for THIRD OFFICER GROVES.", "As Evans wearily switches off his generator, Groves goes out", "on  deck.", "yards  from  the  edge of a field of pack ice  and  icebergs", "stretching as far as the eye can see.", "EXT. OCEAN / TITANIC", "ON  TITANIC, steaming hellbent through the darkness, hurling", "up  white water at the bows.  The bow comes straight at  us,", "until the bow wave WIPES THE FRAME--", "INT. HOLD #2", "PUSHING  IN  on  the  rear window of the Renault,  which  is", "completely  fogged  up.", "against  the glass for a moment, making a handprint  in  the", "veil of condensation.", "INSIDE THE CAR, Jack's overcoat is liek a blanket over them.", "It stirs and Rose pulls it down.  They are huddled under it,", "intertwined, still mostly clothed.  Their faces are  flushed", "and  they look at each other wonderingly.  She puts her hand", "on his face, as if making sure he is real.", "CONTINUED:", "He lays his cheek against her chest.", "She  hugs his head to her chest, and just holds on for  dear", "life.", "EXT. ATLANTIC / TITANIC - NIGHT", "The  bow  sweeps under us, and the CAMERA CLIMBS toward  the", "foremast  and  the  tiny half-cylinder of the  crow's  nest,", "which  grows as we push in on lookouts Fleet and Lee.", "are  stamping their feet and swinging their arms, trying  to", "keep warm in the 22 knot freezing wind, which whips capor of", "their breath away behind.", "INT. BOILER ROOM SIX", "Without hearing hte words over the roar of the furnaces,  we", "see  stokers  telling TWO STEWARDS which way Rose  and  Jack", "went.  The stewards move off toward the forward holds.", "INT. CAL AND ROSE'S SUITE", "Cal  stands  at the open safe.  He stares at the drawing  of", "Rose  and  his  face clenches with fury.", "CONTINUED:", "He reads  the  not again:  \"DARLING, NOW YOU CAN KEEP US BOTH", "LOCKED  IN  YOUR SAFE, ROSE\".", "Lovejoy, standing behind him, looks over his shoulder at the", "drawing.  Cal crumples Rose's not, then takes the drawing in", "both  hands as if to rip it in half.  He tenses  to  do  it,", "then stops himself.", "INT. HOLD #2 - NIGHT", "The two stewards enter.  They have electric torches and play", "the  beams around the hold.  They spot the Renault with  its", "fogged up rear window and approach it slowly.", "FROM  INSIDE  we  see the torch light up  Rose's  passionate", "handprint, still there on the fogged up glass.  One  steward", "whips open the door.", "REVERSE:  the back seat is empty.", "EXT. FORWARD WELL DECK AND CROW'S NEST - NIGHT", "Rose  and Jack, fully dressed, come through a crew door onto", "the deck.  They can barely stand, they are laughing so hard.", "UP  ABOVE THEM, IN THE CROW'S NEST, lookout Fleet hears  the", "disturbance below and looks around and back down to the well", "deck, where he can see two figures embracing.", "Jack  and  Rose  stand in each others  arms.", "clouds  around them in the now freezing air, but they  don't", "even feel the cold.", "CONTINUED:", "Jack pulls her to him and kisses her fiercely.", "130  IN THE CROW'S NEST Fleet nudges Lee.", "They  both have a good laugh at that one.  It is Fleet whose", "expression falls first.  Glancing forward again, he  does  a", "double take.  The color drains out of his face.", "FLEET'S  POV:", "yards out.", "Fleet  reaches  past  Lee and rings the lookout  bell  three", "times,  then  grabs the telephone, calling the  bridge.", "waits  precious seconds for it to be picket up, never taking", "his eyes off the black mass ahead.", "INT. / EXT. BRIDGE", "Inside  the  enclosed wheelhous, SIXTH OFFICER  MOODY  walks", "unhurriedly to the telephone, picking it up.", "CONTINUED:", "Murdoch  sees  it  and rushes to the engine room  telegraph.", "While", "Quartermaster Hitchins, who is at the wheel.", "132", "warming  on  a  steam  manifold when  the  engine  telegraph", "clangs, then goes... incredibly... to FULL SPEED ASTERN.  He", "and", "unbelieving.  Then Bell reacts.", "The engineers and greasers like madmen to close steam valves", "and  start  braking  the  mighty propeller  shafts,  big  as", "Sequias, to a stop.", "133  IN BOILER ROOM SIX, Leading Stoker FREDERICK BARRETT is", "standing  with", "warning light and \"STOP\" indicator come on.", "134", "straight ahead.  The bow finally starts to come left", "the ship turns the reverse of the helm setting).", "MURDOCH'S  jaw  clenches  as the bow  turns  with  agonizing", "slowness.  He holds his breath as the horrible physics  play", "out.", "135  IN THE CROW'S NEST Frederick Fleet braces himself.", "136  THE BOW OF THE SHIP thunders right at CAMERA and--", "KRUUUNCH!!  The ship hits the berg on its starboard bow.", "CONTINUED: (2)", "137", "plates.  The iceberg bumps and scrapes along the side of the", "ship.", "under the load.", "138  IN #2 HOLD the two stewards stagger as the hull buckles", "in four feet with a sound like THUNDER.  Like a sledgehammer", "beating  along  outside the ship, the berg splits  the  hull", "plates  and the sea pour in, sweeping them off their  feert.", "The  icy water swirls around the Renault as the men scramble", "for the stairs.", "139  ON G-DECK forward Fabrizio is tossed in his bunk by the", "impact.  He hears a sound like the greatly amplified  squeal", "of a skate on ice.", "140", "hear", "starboard  side of the ship buckle in toward  them  and  are", "almost  swept  off their feet by a rush of water  coming  in", "about two feet above the floor.", "141  ON THE FORWARD WELL DECK Jack and Rose break their kiss", "and look up in astonishment as the berg sails past, blocking", "out  the  sky like a mountain.  Fragments break off  it  and", "crash  down  onto the deck, and they have to  jump  back  to", "avoid flying chunks of ice.", "142", "He quicky throws the switch that closes them.", "Judging the berg to be amidships, he is trying to clear  the", "stern.", "143", "through  the  swirling water to the watertight door  between", "Boiler  Rooms 6 and 5.  The room is full of water  vapor  as", "the cold sea strikes the red hot furnaces.  Barrett yells to", "the  stokers  scrambling through the door as it  comes  down", "like a slow guillotine.", "He  dives  through into Boiler Room 5 just before  the  door", "rumbles down with a CLANG.", "144  JACK AND ROSE rush to the starboard rail in time to see", "the berg moving aft down the side of the ship.", "CONTINUED: (3)", "145", "making notes in his ever-present book, Andrews looks  up  at", "the  sound  of a cut-crystal light fixture tinkling  like  a", "windchime.", "He feels the shudder run through the ship.  And we see it in", "his  face.  Too much of his soul is in this great  ship  for", "him not to feel its mortal wound.", "146", "highball vibrating on the table.", "147", "Brown holds up her drink to a passing waiter.", "Silently, a moving wall of ice fills the window behind  her.", "She doesn't see it.  It disappears astern.", "OMITTED", "149  IN THE CROW'S NEST Fleet turns to his Lee...", "INT. / EXT. BRIDGE", "CLOSE ON MURDOCH.  The alarm bells still clatter mindlessly,", "seeming to reflect his inner state.  He is in shock,  unable", "to  get  a  grip  on what just happened.  He  just  ran  the", "biggest  ship  in  history into an  iceberg  on  its  maiden", "voyage.", "Captain  Smith  rushes  out of his cabin  onto  the  bridge,", "tucking in his shirt.", "CONTINUED:", "Together they rush out onto the starboard wing, and  Murdoch", "points.", "around to FOURTH OFFICER BOHALL.", "INT. G-DECK FORWARD", "In  steerage, Fabrizio comes out into the hall to see what's", "going on.  He sees dozens of rats running toward him in  the", "corridor, fleeing the flooding bow.  Fabrizio jumps aside as", "the rats run by.", "152", "dark and drops down to the floor.  SPLASH!!", "He naps on the light.  The floor is covered with 3 inches of", "freezing water, and more coming in.  He pulls the door open,", "and steps out into the corridor, which is flooded.  Fabrizio", "is  running toward him, yelling something in Italian.  Tommy", "and  Fabrizio start pounding on doors, getting everybody  up", "and out.  The alarm spreads in several languages.", "INT. FIRST CLASS CORRIDOR / A-DECK", "A  couple of people have come out into the corridor in robes", "and slippers.  A STeWARD hurries along, reassuring them.", "CONTINUED:", "THOMAS  ANDREWS brushes past them, walking fast and carrying", "an armload of rolled up ship's plans.", "EXT. FORWARD WELL DECK", "Jack  and Rose are leaning over the starboard rail,  looking", "at the hull of the ship.", "Behind  them a couple of steerage guys are kicking  the  ice", "around the deck, laughing.", "INT. STEERAGE FORWARD", "Fabrizio  and Tommy are in a crowd of steerage men  clogging", "the corridors, heading aft away from the flooding.  Many  of", "them  have grabbed suitcases and duffel bags, some of  which", "are soaked.", "INT. CORRIDOR ON B DECK", "Bruce  Ismay, dressed in pajamas under the topcoat,  hurries", "down  the  corridor,  headed for the bridge.", "CONTINUED:", "An  officious steward  named  BARNES  comes  along  the", "other  direction, getting the few concerned passengers back", "into their rooms.", "He is stopped in his tracks by Cal and Lovejoy.", "INT. BRIDGE / CHARTROOM", "C.U. CAPTAIN SMITH studying the commutator.", "He turns to Andrews, standing behind him.", "SHIP'S  CARPENTER JOHN HUTCHINSON enters behind him, out  of", "breath and clearly unnerved.", "ISMAY", "frustration.  Smith glances at him with annoyance.", "CONTINUED:", "Smith pushes past him, with Andrews and Hutchinson in tow.", "INT. BOILER ROOM 6", "Strokers and firemen are struggling to draw the fires.  They", "are  working in waist deep water churning around as it flows", "into the boiler room, ice cold and swirling with grease from", "the  machinery.  Chief Engineer Bell comes partway down  the", "ladder and shouts.", "They scramble up the escape ladders.", "EXT. B-DECK FORWARD / WELL DECK", "The  gentlemen,  now joined by another  man,  leans  on  the", "forward  rail watching the steerage men playing soccer  with", "chunks of ice.", "A", "over pajamas.", "Rose  and  Jack come up the steps from the well deck,  which", "are  right next to the three men.  They stare as the  couple", "climbs over the locked gate.", "A  moment later Captain Smith rounds the corner, followed by", "Andrews and Carpenter Hutchinson.  They have come down  from", "the  bridge  by  the outside stairs.  The three  men,  their", "faces  grim, crush right past Jack and Rose.  Andrews barely", "glances at her.", "The inspection party goes down the stairs to the well deck.", "CONTINUED:", "Jack follows Rose through the door inside the ship.", "INT. B-DECK FOYER / CORRIDOR", "Jack  and  Rose  cross  the foyer,  entering  the  corridor.", "Lovejoy is waiting for them in the hall as they approach the", "room.", "Lovejoy  follows  and, unseen, moves close behind  Jack  and", "smoothly slips the diamond necklace into the pocket  of  his", "overcoat.", "INT. ROSE AND CAL'S SUITE", "Cal and Ruth wait in the sitting room, along with the Master", "at  Arms  and two stewards (Steward #1 and Barnes).  Silence", "as  Rose and Jack enter.  Ruth closes her robe at her throat", "when she sees Jack.", "CONTINUED:", "The Master at Arms steps up to Jack.", "Lovejoy  pulls at Jack's coat and Jack shakes  his  head  in", "dismay,  shrugging out of it.  The Master at Arms  pats  him", "down.", "Steward  Barnes  pulls the Heart of the  Ocean  out  of  the", "pocket of Jack's coat.", "Rose is stunned.  Needless to say, so is Jack.", "He starts to handcuff Jack.", "FLASHBACK:", "meeting Jack's eyes as he stands behind her, watching.", "CONTINUED: (2)", "Lovejoy  shows the coat to the Master at Arms.  There  is  a", "label inside the collar with the owner's name.", "Rose feels utterly betrayed, hurt and confused.  She shrinks", "away from him.  He starts shouting to her as Lovejoy and the", "Master  at Arms drag him out into the hall.  She can't  look", "him in the eye.", "She is devastated.  Her mother lays a comforting hand on her", "shoulder as te tears well up.", "INT. MAIL SORTING ROOM / HOLD", "Smith  and  Andrews come down the steps to the Mail  Sorting", "Room  and finds the clerks scrambling to pull mail from  the", "racks.  They are furiously hauling wet sacks of mail up from", "the hold below.", "Andrews climbs partway down the stairs to the hold, which is", "almost  full.  Sacks of mail float everywhere.", "are  still on below the surface, casting an eerie glow.", "CONTINUED:", "The Renault  is  visible  under the water,  the  brass", "glinting cheerfully.", "covers  his shoe, and scrambles back up the stairs.", "INT. BRIDE / CHARTROOM", "Andrews  unrolls  a  big  drawing of  the  ship  across  the", "chartroom  table.  It is a side elevation, showing  all  the", "watertight  bulkheads.  His hands are shaking.  Murdoch  and", "Ismay hover behind Andrews and the Captain.", "Smith  glares  at  him and turns his attention  to  Andrews'", "drawing.  The builder points to it for emphasis as he talks.", "CONTINUED:", "Smith looks like he has been gutpunched.", "Ismay reels as his dream turns into his worst nightmare.", "A long beat.  Smith turns to his employer.", "EXT. BOAT DECK", "Andrews  is  striding  along the boat deck,  as  seamen  and", "officers scurry to uncover the boats.  Steam is venting from", "pipes  on  the  funnes overhead, and the din is  horrendous.", "Speech", "disorganization.", "mechanism of one of the Wellin davits and yells to them over", "the roar of steam.", "He  looks  around, disguisted as the crew  fumble  with  the", "davits,  and  the tackle for the \"falls\"...", "CONTINUED:", "the ropes  which are  used  to lower the boats.  A few", "passengers are  coming out on deck, hesitantly in the noise", "and bitter cold.", "INT. ROSE AND CAL'S SUITE", "From  inside  the  sitting room they can hear  knocking  and", "voices in the corridor.", "Ruth  exits  and  Hockley crosses to Rose.  He  regards  her", "coldly for a moment, then SLAPS her across the face.", "To Rose the blow is inconsequential compared to the blow her", "heart has been given.  Cal grabs her shoulders roughly.", "There is a loud knock on the door and an urgent voice.", "door opens and their steward puts his head in.", "The  steward  persists, coming in to get the lifebelts  down", "from the top of a dresser.", "CONTINUED:", "In the corridor outside the stewards are being so polite and", "obsequious they are conveying no sense of danger whatsoever.", "However, it's another story in...", "INT. STEERAGE BERTHING AFT", "BLACKNESS.  Then  BANG!  The door is  thrown  open  and  the", "lights  snapped on by a steward.  The Cartmell family rouses", "from a sound sleep.", "IN  THE CORRIDOR outside, another steward is going from door", "to door along the hall, pouncing and yelling.", "People  come out of the doors behind the steward, perplexed.", "In  the foreground a SYRIAN WOMAN asks her husband what  was", "said.  He shrugs.", "INT. WIRELESS ROOM", "ON PHILLIPS, looking shocked.", "Smith hurries out.", "CONTINUED:", "Phillips  laughs  in  spite of himself  and  starts  sending", "history's  first  S.O.S.  Dit dit dit, da  da  da,  dit  dit", "dit... over and over.", "EXT. BOAT DECK", "Thomas Andrews looks around in amazement.  The deck is empty", "except for the crew fumbling with the davits. He yells  over", "the roar of the steam to First Officer Murdoch.", "Andrews  feels like he is in a bad dream.  He looks  at  his", "pocketwatch and heads for the foyer entrance.", "INT. A-DECK FOYER", "A  large number of First Class passengers have gathered near", "the", "confusion.  Molly Brown snags a passing YOUNG STEWARD.", "The  young  steward backs away, actually  stumbling  on  the", "stairs.", "The  jumpy piano rhythm of \"Alexander's Ragtime Band\"  comes", "out of the first class lounge a few yards away.  Band leader", "WALLACE  HARTLEY has assembled some of his men on  Captain's", "orders, to allay panic.", "Hockley's  entourage comes up to the A-deck foyer.", "carrying the lifebelts, almost as an afterthought.  Rose  is", "like a sleepwalker.", "CONTINUED:", "Thomas Andrews enters, looking around the magnificent  room,", "which  he knows is doomed.  Rose, standing nearby, sees  his", "heartbroken expression.  She walks over to him and Cal  goes", "after her.", "Now  it  is  Cal's  turn  to  look  stunned.", "Sinking?", "Andrews  goes  off, moving among the passengers  and  urging", "them to put on their lifebelts and get to the boats.", "INT. MASTER AT ARMS OFFICE", "Lovejoy and the Master at Arms are handcuffing Jack to a", "WATER  PIPE  as  a  crewman rushes in anxiously  and  almost", "blurts to the Master at Arms--", "Lovejoy pulls a pearl handled Colt .45 automatic from  under", "his  coat.  The Master at Arms nods and tosses the  handcuff", "key  to Lovejoy, then exits with the crewman.  Lovejoy flips", "the key in the air.  Catches it.", "INT. BRIDGE", "Junior  Wireless  Operator Bride is relaying  a  message  to", "Captain Smith from the CUNARD LINER CARPATHIA.", "The enormity of it hits Smith like a sledgehammer blow.", "He turns as Bride exits, and looks out onto the blackness.", "EXT. BOAT DECK - NIGHT", "Lightoller has his boats swung out.  He is standing amidst a", "crowd  of  uncertain passengers in all states of  dress  and", "undress.  One first class woman is barefoot.  Others are  in", "stockings.  The maitre of the restaurant is in top  hat  and", "overcoat.  Others are still in evening dress, while some are", "in  bathrobes and kimonos.  Women are wearing lifebelts over", "velvet  gowns,  then  topping it  with  sble  stoles.", "brought jewels, others books, even small dogs.", "Lightoller sees Smith walking stiffly toward him and quickly", "goes  to  him.", "cupped hands, over the roar of the steam...", "Smith just nods, a bit abstractly.  The fire has gone out of", "him.  Lightoller sees the awesome truth in Smith's face.", "The  appalling  din  of escaping steam  abruptly  cuts  off,", "leaving  a  sudden  unearthly silence in which  Lightoller's", "voice echoes.", "ON WALLACE HARTLEY raising his violin to play.", "The  band  has  reassembled just  outside  the  First  Class", "Entrance,  port side, near where Lightoller is  calling  for", "the  boats to be loaded.  They strike up a waltz, lively and", "elegant.  The music wafts all over the ship.", "Finally  one  soman  steps across the gap,  into  the  boat,", "terrified of the drop to the water far below.", "WOMAN IN CROWD", "You  watch.  They'll put  us  off  in these  silly little", "boats to  freeze, and  we'll  all be back on  board  by", "breakfast.", "CONTINUED:", "Cal, Rose and Ruth come out of the doors near the band.", "She  turns back to go to her room but Cal takes her  by  the", "arm,  refusing  to  let her go.  The firmness  of  his  hold", "surprises her.", "Ruth sees his expression, and knows fear for the first time.", "INT. STEERAGE BERTHING AFT / CORRIDORS AND STAIRWELL", "It  is chaos, with stewards pushing their way through narrow", "corridors  clogged  with peopel carrying  suitcases,  duffel", "bags, children.  Some have lifebelts on, others don't.", "He  throws up his hand at the sight of a family, loaded down", "with cases and bags, completely blocking the corridor.", "Fabrizio  and Tommy push past the stewards, going the  other", "way.", "MAIN", "rest", "in hand.  He reaches her and she grins, hugging him.", "Tommy  pushes  to  where he can see what's  holding  up  the", "group.", "with several stewards and seamen on the other side.", "Near  Tommy, an IRISHWOMAN stands stoically with  two  small", "children and their battered luggage.", "CONTINUED:", "EXT. STARBOARD SIDE", "Boat", "for 65.", "FIRST OFFICER MURDOCH", "Lower  away!  By the left  and  right together, stady lads!", "The  boat lurches as the falls start to pay out through  the", "pulley  blocks.  The women gasp.  The boat descends, swaying", "and jerking, toward the water 60 feet below.  The passengers", "are terrified.", "EXT. / INT. TITANIC HULL AND MASTER AT ARMS OFFICE", "TRACKING  along the rows of portholes angling down into  the", "water.  Under the surface, they glow green.  PUSHING  IN  on", "one  porthole which is have submerged.  Inside we see  Jack,", "looking apprehensively at the water rising up the glass.", "INSIDE  THE MASTER AT ARMS' OFFICE Jack sits chained to  the", "waterpipe, next to the porthole.  Lovejoy sits on  the  edge", "of  a desk.  He puts a .45 bullet on the desk and watches it", "roll across and fall off.  He picks up the bullet.", "He  punches Jack hard in the stomach, knocking the wind  out", "of him.", "CONTINUED:", "Lovejoy  flips the handcuff key in the air, catches  it  and", "puts  it  in  his pocket.  He exits.  Jack is left  gasping,", "handcuffed to the pipe.", "EXT. BOAT DECK / STARBOARD SIDE, FORWARD", "At  the  stairwell rail on the bridge wing,  Fourth  Officer", "Boxhall  and  Quartermaster Rowe light  the  first  distress", "rocket.", "thunderclap  over  the  ship, sending out  white  starbursts", "which light up the entire deck as they fall.", "WHIP PAN off the starbursts to Ismay.  The Managing Director", "of  White  Star Line is cracking.  Already at  the  breaking", "point  from  his immense guilt, the rocket panics  him.", "starts shouting at the officers struggling with the falls of", "BOAT 5.", "FIFTH  OFFICER  LOWE,  a baby-faced", "officer, looks up from the tangled falls at the madman.", "Lowe, not having a clue nor caring, squares up to Ismay.", "EXT. BOAT DECK / PORT SIDE", "SECOND  OFFICER LIGHTOLLER is loading the boat  nearest  Cal", "and Rose... Boat 6.", "Another", "Startled faces turn upward.  Fear now in the eyes.", "DANIEL  MARVIN  has  his Biograph camera  set  up,  cranking", "away...  hoping  to get an exposure off the rocket's  light.", "he has Mary posed in front of the scene at the boats.", "Either she suddenly learned to act or she is petrified.", "ROSE watches the farewells taking pace right in front of her", "as they step closer to the boat.  Husbands saying goodbye to", "wives  and  children.", "MOLLY is getting a reluctant woman to board the boat.", "PUSH  IN  ON  ROSE'S FACE as it hits her like a thunderbolt.", "Jack  is  third class.  He doesn't stand a chance.", "rocket bursts overhead, bathing her face in white light.", "CONTINUED:", "Molly  practically hands her over to Lightoller, then  looks", "around for some other women who might need a push.", "Rose steps back, shaking her head.", "Ruth,  standing in the tippy lifeboat, can do nothing.", "grabs  Rose's arm but she pulls free and walks away  through", "the  crowd.", "roughly.", "He  clenches his jaw and squeezes her arm viciously, pulling", "her  back toward the lifeboat.  Rose pulls out a hairpin and", "jabs him with it.  he lets go with a curse and she runs into", "the crowd.", "The boat lurches downward as the falls are paid out.", "CONTINUED: (2)", "TRACKING  WITH  ROSE, as she runs through  the  clusters  of", "people.", "her.  She runs breathlessly up to two proper looking men.", "Appalled,  they turn to see Cal running toward  them.", "runs  on as the two men grab Cal, restraining him.  She runs", "throught the First Class entrance.", "Cal  breaks  free  and  runs  after  her.", "entrance,  but  runs into a knot of people coming  out.", "pushes rudely through them...", "INT. BOAT DECK FOYER / STAIRCASE / A-DECK FOYER", "Cal  runs  in,  and  down to the landing, pushing  past  the", "gentlemen  and  ladies who are filling up  the  stairs.", "scans the A-deck foyer.  Rose is gone.", "EXT. OCEAN / TITANIC / BOAT 6", "The  hull  of Titanic looms over Boat 6 like a  cliff.", "enormous  mass is suddenly threatening to those in the  tiny", "boat.", "but to get away from the ship.  Unfortunately his two seamen", "can't row.  They flail like a duck with a broken wing.", "She  climbs  over Ruth to get at the oars, stepping  on  her", "feet.", "Around  them the evacuation is in full swing, with boats  in", "the water, others being lowered.", "INT. MASTER AT ARMS OFFICE / CORRIDOR", "Jack  pulls  on  the pipe with all his strength.", "budging.", "door, spreading rapidly across the floor.", "He  tries  to pull one hand out of the cuffs, working  until", "the skin is raw... no good.", "181  THE CORRIDOR outside is deserted.  Flooded a couple  of", "inches  deep.  Jack's voice comes faintly through the  door,", "but there is no one to hear it.", "INT. FIRST CLASS CORRIDOR", "Thomas  Andrews  is opening stateroom doors,  checking  that", "people are out.", "Rose runs up to him, breathless.", "CONTINUED:", "INT. FOYER / ELEVATORS", "Rose runs up as the last Elecator Operator is closing up his", "lift to leave.", "Without thinking she grabs him and shoves him back into  the", "lift.", "The operator fumbles to close the gate and start the lift.", "EXT. OCEAN / BOAT 6", "Molly and the two seamen are rowing, and they've made  it  a", "hundret  feet or so.  Enough to see that the ship is  angled", "down  into the water, with the bow rail less than  ten  feet", "above the surface.", "Ruth  just  stares at the spectacle of the great liner,  its", "rows  of lights blazing, slanting down into the sullen black", "mirror of the Atlanic.", "INT. FIRST CLASS ELEVATOR / CORRIDORS", "Through  the wrought iron door of the elevator car Rose  can", "see  the  decks going past.  The lift slows.", "WATER is swirling around her legs.  She SCREAMS in surprise.", "So does the operator.", "CONTINUED:", "The car has landed in a foot of freezing water, shocking the", "hell  out of her.  She claws the door open and splashes out,", "hiking up her floor-length skirt so she can move.  The  lift", "goes back up, behind her, as she looks around.", "She spots it and slogs down the flooded corridor.  The place", "is understandably deserted.  She is on her own.", "She turns into a cross-corridor, splashing down the hall.  A", "row of doors on each side.", "INT. MASTER AT ARMS OFFICE / CORRIDOR", "Jack  is  hopelessly  pulling on the pipe  again,  straining", "until  he  turns  red.", "realizing he's screwed.", "187  IN THE HALL Rose hears his voice behind her.  She spins", "and runs back, locating the right door, then pushes it open,", "creating a small wave.", "She splashes over Jack and puts her arms around him.", "They are so happy to see each other it's embarrassing.", "CONTINUED:", "She  kisses his face and hugs him again, then starts  to  go", "through the desk.", "They  share  a  look, then she goes back to  ransacking  the", "room,  searching drawers and cupboards.  Jack sees  movement", "out the porthole and looks out.", "A LIFEBOAT hits the surface of the water, seen from below.", "EXT. TITANIC / BOAT ONE", "While  the seamen detach the falls, Boat One rocks  next  to", "the  hull.", "others in a boat made for four times that many.", "In  a lit porthole beneath the surface she sees Jack looking", "up at her... a face in a bubble of light under the water.", "INT. MASTER AT ARMS OFFICE", "Rose  stops  trashing the room, and stands there,  breathing", "hard.", "They  look  around at the water, now almost two  feet  deep.", "Jack has pulled his feet up onto the bench.", "CONTINUED:", "She  runs  out, looking back at him once from  the  doorway,", "then splashes away.  Jack looks down at the swirling water.", "INT. STAIRWELL AND CORRIDORS", "Rose  splashes down the hall to a stairwell going up to  the", "next deck.  She climbs the stairs, her long skirt leaving  a", "trail  like  a  giant snail.  The weight  of  it  is  really", "slowing  her  down.", "quickly out of the thing.  She bounds up the stairs  in  her", "stockings and knee-length slip, to find herself in--", "191", "hallways  forward.", "stressing  metal echoes along the hall as the ship continues", "to settle.  She runs down the hall, unimpeded now.", "She  turns  a  corner and runs along another corridor  in  a", "daze.", "reflecting the light.  The margin of the water creeps toward", "her.", "sending  up  geysers of spray.  He pelts  past  her  without", "slowing, his eyes crazed...", "He  doesn't  look back.  It is like a bad dream.", "gongs with terrifying sounds.", "The  lights  flicker and go out, leaving utter darkness.", "beat.", "hyperventilating.  That one moment of blackness was the most", "terrifying of her life.", "A  STEWARD runs around the nearest corner, his arms full  of", "lifebelts.  He is upset to see someone still in his section.", "CONTINUED:", "He  grabs  her forcefully by the arm, pulling her  with  him", "like a wayward child.", "He's not listening.  And he won't let her go.", "She  SHOUTS  in his ear, and when he turns, she punches  him", "squarely  in the nose.  Shocked, he lets her go and staggers", "back.", "The  steward runs off, holding his bloody nose.", "after him.  Just the way Jack taugh:  her.", "She turns around, SEES:  a glass case with a fire-axe in it.", "She breaks the glass with a battered suitcase which is lying", "discarded nearby, and seizes the axe, running back  the  way", "she came.", "192", "has flooded the bottom five steps.  She goes down and has to", "crouch to look along the corridor to the room where Jack  is", "trapped.", "Rose plunges into the water, which is up to her waist... and", "powers forward, holding the axe above her head in two hands.", "She grimaces at the pain from the literally freezing water.", "INT. MASTER AT ARMS OFFICE", "Jack  has  climbed  up  on the bench,  and  is  hugging  the", "waterpipe.  Rose wades in, holding the axe above her head.", "CONTINUED:", "They  are both terrified, but trying to keep panic  at  bay.", "He  positions the chain connecting the two cuffs, stretching", "it  taut across the steel pipe.  The chain is of course very", "short, and his exposed wrists are on either side of it.", "Rose hefts the axe and thunks it into a wooden cabinet.", "She swings hard and the blade thunks in four inches from the", "mark.", "He  winces, bracing himself as she raises the axe.  She  has", "to hit a target about an inch wide with all the foce she can", "muster, with his hands on either side.", "Jack closes his eyes.  So does she.", "The  axe comes down.  K-WHANG! Rose gingerly opens her  eyes", "looks... Jack is grinning with two separate cuffs.", "Rose drops the axe, all the strength going out of her.", "He climbs down into the water next to her.  He can't breathe", "for a second.", "CONTINUED: (2)", "They  wade out into the hall.  Rose starts toward the stiars", "going up, but Jack stops her.  There is only about a foot of", "the stairwell opening visible.", "EXT. BOAT 6 AND TITANIC", "TIGHT  ON THE LETTERS TITANIC painted two feet high  on  the", "bow", "waterline, they now quietly slip below the surface.  We  see", "them, gold on black, rippling and dimming to a pale green as", "they go deeper.", "195  IN BOAT SIX, Ruth looks back at the Titanic, transfixed", "by the sight of the dying liner.  The bowsprit is now barely", "above  the waterline.  Another of Boxhall's rockets EXPLODES", "overhead.  K-BOOM!  It lights up the whole area, and we  see", "half  a  dozen  boats in the water, spreading out  from  the", "ship.", "INT. SCOTLAND ROAD / E-DECK", "The  widest passageway in the ship, it is used by  crew  and", "steerage  alike,  and runs almost the length  of  the  ship.", "Right  now  steerage passengers move along it like refugees,", "heading aft.", "CRASH!", "open  under  the force of Jack's shoulder.", "stumble  through,  into the corridor.  A  STEWARD,  who  was", "nearby herding people along, marches over.", "CONTINUED:", "Jack leads her past the dumbfounded steward.  They join  the", "steerage  stragglers going aft.  In places the  corridor  is", "almost  completely  blocked by large families  carrying  all", "their luggage.", "AN  IRISH WOMAN gives Rose a blanket, more for modesty  than", "because she is blue-lipped and shivering.", "Jack  rubs  her arms and tries to warm her up as  they  walk", "along.  The woman's husband offers them a flask of whiskey.", "Rose takes a mighty belt and hands it to Jack.  He grins and", "follows  suit.  Jack tries a number of DOORS and IRON  GATES", "along the way, finding them all locked.", "EXT. BOAT DECK", "ON  THE BOAT DECK, the action has moved to the aft group  of", "boats,  numbers 9, 11, 13 and 15 on the starboard side,  and", "10,", "more frantic.  You see crew and officers running now to work", "the davits, their previous complacency gone.", "CAL pushes through the crowd, scanning for Rose.  Around him", "is  chaos and confusion.  A woman is calling for a child who", "has become seperated from the crowd.  A man is shouting over", "people's  heads.", "Lightoller's arm as he is about to launch Boat 10.", "Lightoller  grabs her and shoves her bodily into  the  boat.", "Thomas Andrews rushes up to him just then.", "Lightoller steps past him, helping a seaman clear a  snarled", "fall.", "CONTINUED:", "The  shot HANDS OFF to Cal, who sees Lovejoy hurrying toward", "him  through  the  aisle connecting the port  and  starboard", "sides of the boat deck.", "Cal  charges off, heading forward, followed by Lovejoy.  The", "SHOT  HANDS OFF to a finely dressed elderly couple, IDA  and", "ISADOR STRAUSS.", "CONTINUED:", "He  looks at her with sadness and great love.  They  embrace", "gently.", "EXT. BRIDGE / FORWARD WELL DECK / FOC'SLE", "AT  THE BOW... the place where Jack and Rose first kissed...", "the bow railing goes under water water.  Water swirls around", "the captsans and windlasses on the foc'sle deck.", "Smith strides to the bridge rail and looks down at the  well", "deck.  Water is shipped over the sides and the well deck  is", "awash.", "spray.  Behind Smith, Boxhall fires another rocket.  WHOOSH!", "OMITTED", "OMITTED", "INT. E-DECK CORRIDORS AND STAIRWELL", "Fabrizio,  standing with Helga Dahl and  her  family,  hears", "Jack's voice.", "Fabrizio  turns and sees Jack and Rose pushing  through  the", "crowd.  He and Jack hug like brothers.", "Fabrizio  points over the heads of the solidly packed  crowd", "to the stairwell.", "CONTINUED:", "Tommy  has  his  hands on the bars of the steel  gate  which", "blocks the head of the stairwell.  The crew open the gate  a", "foot or so and a few women are squeezing through.", "But  some terrified men, not understanding English,  try  to", "rush  through the gap, forcing the gate open.", "and stewards push them back, shoving and punching them.", "They struggle to get the gate closed again, while Steward #2", "brandishes  a  small revolver.  Another holds  a  fire  axe.", "They  lock the gate, and a cry goes up among the crowd,  who", "surge  forward, pounding against the steel and  shouting  in", "several languages.", "But the crewmen are scared now.  They have let the situation", "get  out  of hand, and now they have a mob.  Tommy gives  up", "and  pushes his way back through the crowd, going  down  the", "stairs.  He rejoins Jack, Rose and Fabrizio.", "Fabrizio  turns  to  Helga,  praying  he  can  make  himself", "understood.", "They  can't understand what he's saying.  They can  see  his", "urgency, but OLUF DAHL, the patriarch of the family,  shakes", "his head.  He will not panic, and will not let his family go", "with this boy.  Fabrizio turns to Helga.", "CONTINUED: (2)", "She kisses him, then steps back to be with her family.  Jack", "lays a hand on his shoulder, his eyes saying \"Let's go\".", "He  turns  to  Jack,  who leads the way out  of  the  crowd.", "Looking  back  Fabrizio  sees her face  disappear  into  the", "crowd.", "OMITTED", "OMITTED", "INT. CAL AND ROSE'S SUITE", "CLUNK!", "watches,  he pulls out two stacks of bills, still banded  by", "bank  wrappers.", "putting  it  in  the pocket of his overcoat, and  locks  the", "safe.", "Cal grins, putting the money in his pocket as they go out.", "INT. STEERAGE, AFT", "Jack, Rose, Fabrizio and Tommy are lost, searching for a way", "out.", "changing  her  baby's diaper on top of an  upturned  steamer", "trunk... past a woman arguing heatedly with a man in  Serbo-", "Croatian,  a  wailing  child next  to  them...  past  a  man", "kneeling  to  console  a woman who is just  sitting  on  the", "floor,", "English/Arabic  dictionary, trying to figure  out", "signs mean, while his wife and children wait patiently.", "CONTINUED:", "Jack  et al come upon a narrow stairwell and they go up  two", "decks  before they are stopped by a small group  pressed  up", "against  a  steel gate.  The steerage men are yelling  at  a", "scared STEWARD.", "Jack takes one look at this scene and finally just loses it.", "He  grabs  one  end of a bench bolted to the  floor  on  the", "landing.", "pitch  in", "figures  out  what they are doing and clears a path  up  the", "stairs between the waiting people.", "Jack  and Tommy run up the steps with the bench and  RAM  IT", "INTO  THE GATE with all their strength.  It rips loose  from", "its  track  and falls outward, narrowly mssing the  steward.", "Led  by Jack, the crowd surges though.  Rose steps up to the", "cowering steward and says in her most imperious tone:", "Class wins out. He nods dumbly motions form them to follow.", "EXT. BOAT 6 / TITANIC - NIGHT", "Ruth  rows  with  Molly  Brown,  two  other  women  and  the", "incompetent sailors.  She rests on her oars, exhausted,  and", "looks back at the ship.", "It  slants  down  into the water, still ablaze  with  light.", "Nothing is above water forward of the bridge except for  the", "foremast.", "CONTINUED:", "Another rocket goes off, lighting up the  entire area...", "there  are a dozen boats moving  outward  from  the ship.", "207  AT THE BOAT DECK RAIL Captain Smith is shouting to Boat", "6 through a large metal megaphone.", "CHIEF OFFICER WILDE joins him, blowing his silver whistle.", "208  FROM BOAT 6 the whistle comes shrilly across the water.", "Quartermaster Hitchins grips the rudder in fear.", "209  CAPTAIN SMITH, at the rail of the boat deck, lowers his", "megaphone slowly", "INT. A-DECK FOYER", "As  Cal  and  Lovejoy  cross  the foyer  encounter  Benjamin", "Guggenheim  and his valet, coth dressed in white tie,  tail-", "coats and top hats.", "INT. FIRST CLASS SMOKING ROOM", "There  are  still two cardgames in progress.", "quiet and civilized.  A silver serving cart, holding a large", "humidor, begins to roll slowly across the room.  One of  the", "cardplayers takes a cigar from it as it rolls by.", "EXT. / INT. A-DECK PROMENADE", "Cal  and  Lovejoy are walking aft with a purposeful  stride.", "They  pass  CHIEF BAKER JOHGHIN, who is working up  a  sweat", "tossing  deck  chairs  over the rail.", "Joughin  takes a break and pulls a bottle of scotch  from  a", "pocket,  opening it.  He drains it, and tosses it  over  the", "side too, then stands there a little unteadily.", "EXT. BOAT DECK AND A-DECK, AFT", "PANIC  IS  SETTING IN around the remaining boats  aft.", "crowd  here  is  now  a mix of all three classes.", "repeatedly  warn men back from the boats. The crowd  presses", "in closer.", "Seamen  SCAROTT  brandishes  the  tiller  of  boat", "discourage a close press of men who look ready to  rush  the", "boat.  Several men break ranks and rush forward.", "Lightoller  pulls out his Webley revolver  and  aims  it  at", "them.", "The men back down.  Fifth Officer Lowe standing in the boat,", "yells to the crew.", "Lightoller  turns  away from the crowd  and,  out  of  their", "sight,  breaks his pistol open.  Letting out a long  breath,", "he starts to LOAD IT.", "EXT. BOAT DECK, STARBOARD SIDE, AFT", "Cal  and Lovejoy arrive in time to see Murdoch lowering  his", "last boat.", "215", "already  in  the water but still attached to its  falls,  is", "pushed  aft by the discharge water being pumped out  of  the", "ship.", "downt he right on top of it.", "The  passengers  shout in panic to the crew  above  to  stop", "lowering.", "trying  futilely to keep the 5 tons of boat 15 from crushing", "them.", "Fred  Barrett, the stoker, gets out his knife and  leaps  to", "the  after falls, climbing rudely over people.  He cuts  the", "aft falls while another crewman cuts the forward lines.", "drifts  out  from beneath 15 just seconds before it  touches", "the water with a slap.", "Cal, looking down from the rail hears GUNSHOTS--", "EXT. BOAT DECK / A-DECK, PORT, AFT", "Fifth  Officer  Lowe,  in Boat 14 is firing  his  gun  as  a", "warning to a bunch of men threatening to jump into the  boat", "as it passes the open promenade on A-Deck.", "BLAM!  BLAM!", "EXT. BOAT DECK, STARBOARD, AFT", "The shots echo away.", "CONTINUED:", "Cal  sees  three  dogs run by, including  the  black  French", "bulldog.  Someone has released the pets from the kennels.", "Cal  sees Murdoch turn from the davits of boat 15 and  start", "walking  toward the bow.  He catches up and falls in  beside", "him.", "OMITTED", "EXT. BOAT DECK, PORT", "Jack, Rose et al burst out onto the boat deck from the  crew", "stairs just aft of the third funnel.  They look at the empty", "davits.", "She  sees  Colonel Gracie chugging forward along  the  deck,", "escorting two first class ladies.", "Jack  grabs her hand and they sprint past Gracie, with Tommy", "and Fabrizio close behind.", "ANGLE  ON  THE  BAND... incredibly they are  still  playing.", "Jack, Rose and the others run by.", "EXT. BOAT DECK, STARBOARD, FORWARD", "Water  pours like a spillway over the forward railing on  B-", "Deck.", "Murdoch and his team are loading Collapsible Car the forward-", "most davits.", "NOTE:  There are four so-called collapsibles, or Engelhardts", "boats,  including two which are stored on the  roof  of  the", "officer's quarters.", "The  crowd is sparse, with most people still aft.  Cal slips", "his  hand  out  of hte pocket of his overcoat and  into  the", "waist  pocket of Murdoch's greatcoat, leaving the stacks  of", "bills there.", "Cal,  satisfied, steps back.  He finds himself waiting  next", "to  J.  Bruce  Ismay.", "anyone's.  Lovejoy come sup to Cal at that moment.", "Cal looks longingly at his boat... his moment has arrived.", "He  and  Lovejoy head for the port side, taking a  short-cut", "through the bridge.", "Bruce  Ismay,  seeing his oppurtunity,  steps  quickly  into", "Collapsible  C.", "Murdoch's eyes.", "CONTINUED:", "EXT. BOAT DECK / PORT SIDE - NIGHT", "ON  THE PORT SIDE Lightoller is getting people into Boat", "He  keeps his pistol in his hand at this point.  Twenty feet", "below them the sea is pouring into the doors and windows  of", "B  deck  staterooms.", "cascading into the ship.", "Even  with Jack's arms wrapped around her, Rose is shivering", "in  the  cold.", "looks  into the eyes of a HUSBAND she knows she may not  see", "again", "The woman stumbles to the boat with the children, hiding her", "tears  from them.  Beneath the false good cheer, the man  is", "choked with emotion.", "Some  of  the  women  are stoic, others are  overwhelmed  by", "emotion  and  have  to  be helped into  the  boats.", "scribbles  a  note and hands it to a woman who is  about  to", "board.", "Jack looks at Tommy and Fabrizio.", "They  nod  and  run  off, searching for  a  way  around  the", "deckhouse.", "CONTINUED:", "Cal walks up just then.", "She is shocked to see him.  She steps instinctively to Jack.", "Cal  looks at her, standing there shivering in her wet  slip", "and stockings, a shocking display in 1912.", "She  numbly shrugs into it.  He is doing it for modesty, not", "the cold.", "She doesn't even care that Cal is standing right there.", "sees the emotion between Jack and Rose and his jaw clenches.", "But then he leans close to her and says...", "CONTINUED: (2)", "Lightoller grabs her arm and pulls her toward the boat.  She", "reaches out for Jack and her fingers brush his for a moment.", "Then  she  finds herself stepping down into the boat.", "all a rush and blur.", "The two men watch at the rail as the boat begins to descend.", "Jack  knows  he  is  screwed.  He looks down  at  Rose,  not", "wanting to waste a second of his last view of her.", "222", "through the pulleys as the seamen start to lower.  All sound", "going  away... Lightoller giving orders, his lips  moving...", "but  Rose hears only the blood pounding in her ears...  this", "cannot be happening... a rocket bursts above in slow-motion,", "outlining Jack in a halo of light... Rose's hair blowing  in", "slow  motion  as she gazes up at him, descending  away  from", "him... she sees his hand trembling, the tears at the corners", "of  his eyes, and cannot believe the unbearable pain she  is", "feeling...", "Rose is still staring up, tears pouring down her face.", "SUDDENLY SHE IS MOVING.  She lunges across the women next to", "her.  Reaches the gunwale, climbing it...", "Hurls  herself  out of the boat to the rail  of  the  A-Deck", "promenade, catching it, and scrambling over the  rail.", "Boat 2 continues down.  But Rose is back on Titanic.", "Jack  spins from the rail, running for the nearest way  down", "to A-Deck.", "CONTINUED: (3)", "Hockley  too has seen her jump.  She is willing to  die  for", "this man, this gutter scum.  He is overwhelmed by a rage  so", "all consuming it eclipses all thought.", "INT. GRAND STAIRCASE", "TRACKING  WITH  JACK as he bangs through the  doors  to  the", "foyer and sprints down the stairs.  He sees her coming  into", "A-deck foyer, running toward him, Cal's long coat flying out", "behind her as she runs.", "They  meet  at the bottom of the stairs, and collide  in  an", "embrace.", "And  all the while he's kissing her and holding her as tight", "as he can.", "Hockley  comes in and runs to the railing.  Looking down  he", "sees  them locked in their embrace.  Lovejoy comes up behind", "Cal  and  puts  a  restraining HAND on him,  but  Cal  whips", "around, grabbing the pistol from Lovejoy's waistband in  one", "cobra-fast move.", "He  RUNS  along the rail and down the stairs.  As he reaches", "the  landing  above  them he raises the gun.", "rage, he FIRES.", "The  carved  cherub  at  the  foot  of  the  center  railing", "EXPLODES.  Jack pulls Rose toward the stairs going  down  to", "the  next  deck.", "toward  them.", "panelling behind Jack's head as he pulls Rose down the  next", "flight of stairs.", "Hockley  steps  on the skittering head of the cherub  statue", "and  goes  sprawling.  The gun clatters  across  the  marble", "floor.", "retrieve it.", "INT. D-DECK RECEPTION ROOM", "The  bottom  of the grand staircase is flooded several  feet", "deep.  Jack and Rose come down the stairs two at a time  and", "run  straight  into the water, fording across  the  room  to", "where  the floor slopes up, until they reach dry footing  at", "the entrance to the dining saloon.", "STEADICAM WITH HOCKLEY as he reels down the stairs  in  time", "to  see Jack and Rose splashing through the water toward the", "dining  saloon.  He FIRES twice.  Big gouts  of  spray  near", "them, but he's not a great shot.", "The  water boils up around his feet and he retreast  up  the", "stairs  a  couple of steps.  Around him the woodward  groans", "and creaks.", "Lovejoy", "something and starts to laugh.", "He  turns  to  Lovejoy  with a sickly expression,  his  eyes", "glittering.", "He  hands  Lovejoy the pistol and goes back up  the  stairs.", "Lovejoy  thinks about it... then slogs into the water.", "icewater is up to his waist as he crosses the pool into", "dining saloon.", "INT. DINING SALOON", "Lovejoy", "searching... listening... his eyes tracking rapidly.  It  is", "a  sea  of  tables,  and they could be anywhere.", "serving  tolley  rolls  downhill, bumping  into  tables  and", "pillars.", "CONTINUED:", "He  glances behind him.  The water is following him into the", "room,  advancing in a hundred foot wide tide.  The reception", "room  is  now  a  roiling lake, and the grand  staircase  is", "submerged  past  the first landing.  Monstrous  groans  echo", "through the ship.", "ON  JACK AND ROSE, crouched behind a table, somewhere in the", "middle.", "over  the floor.  They crawl ahead of it to the next row  of", "tables.", "He moves off as--", "Lovejoy  moves  over  one row and looks  along  the  tables.", "Nothing.", "The ship GROANS and CREAKS.  He moves another row.", "ANGLE  ON A METAL CART... five feet tall and full of  stacks", "of  china dishes.  It starts to roll down the aisle  between", "tables.", "ON  ROSE as the cart rolls toward her.  It hits a table  and", "the  stacks of dishes topple out, EXPLODING across the floor", "and showering her.", "She scrambles out of the way and--", "Lovejoy  spins,  seeing her.  He moves rapidly  toward  her,", "keeping the gun aimed--", "That's  when  Jack  tackles him from the  side.", "together into a table, crashing over it, and toppling to the", "floor.", "between the tables.", "Jack  and  Lovejoy grapple in the icy water.  Jack jams  his", "knee  down  on  Lovejoy's hand, breaking  his  grip  on  the", "pistol,  and kicks it away.  Lovejoy scrmbles up and  lunges", "at  him,  but Jack GUTPUCHES him right in the solar  plexus,", "doubling him over.", "He  grabs  Lovejoy  and  slams him into  an  ornate  columb.", "Lovejoy drops to the floor with a splas, stunned.", "CONTINUED: (2)", "Jack  and  Rose  run aft... uphill... entering  the  galley.", "Behind them the tables have become islands in a lake...  and", "the far end of the room is flooded up to the ceiling.", "Lovejoy  gets up and looks around for his gun.  He pulls  it", "up out of the water and wades after them.", "INT. GALLEY / STAIRWELL", "They run throught the galley and Rose spots the stairs.  She", "starts up and Jack grabs her hand.  He leads her DOWN.", "They  crouch together on the landing as Lovejoy runs to  the", "stairs.", "clombs up them two at a time.", "They  wait  for  the footstep to recede.", "GROAN.", "They go down a frew steps to looks along the next deck.", "INT. E-DECK CORRIDORS", "The  corridor is awash, about a foot deep.  Standing against", "the wall, about 50 feet away, is a little BOY, aobut 3.  The", "water swirls around his legs and he is wailing.", "Jack  nods  and  they leave the promise  of  escape  up  the", "stairwell to run to the child.  Jack scoops up the  kid  and", "they run back to the stairs but--", "A  torrent  of  water  comes pouring down  the  stairs  like", "rapids.", "against.", "Charging  the  other  way down the flooding  corridor,  they", "blast  up spray with each footstep.  At the end of the  hall", "are  heavy  double doors.  As Jack approaches them  he  sees", "water spraying through the gap between the doors right up to", "the  ceiling.  The doors groan and start to crack under  the", "tons of pressure.", "CONTINUED:", "Rose  pivots and runs back the way they came, taking a  turn", "into  a cross-corridor.  A MAN is coming the other way.", "sees the boy in Jack's arms and cries out, grabbing him away", "from  Jack.  Starts cursing him in Russian.  He runs on with", "the boy--", "228  DOUBLE DOORS BLAST OPEN.  A wall of water thunders into", "the corridor.  The father and child DISAPPEAR instantly.", "Jack  and  Rose  run  as a wave blasts  around  the  corner,", "foaming  from  floor to ceiling.  It gains on  them  like  a", "locomotive.  They make it to a stairway going up.", "INT. STAIRWELL", "Jack  and  Rose pound up the steps as white water swirls  up", "behind  them.  PULL BACK to reveal that a steel gate  blocks", "the  top  of  the  stairs.", "gripping the bars.", "A  terrified  steward standing guard on  the  landing  above", "turns  to  run at the sight of the water thundering  up  the", "stairs.", "The  steward  runs on.  The water wells up around  Jack  and", "Rose, pouring through the gate and slamming them against it.", "In seconds it is up to their waist.", "The steward stops and looks back.  He sees Jack and Rose  at", "the  gate,  their  arms raching through...  sees  the  water", "POURING through the gate onto the landing.", "He  runs back, slogging against the curretn.  He pulls a key", "ring  from  his belt and struggles to unlock the padlock  as", "the water fountains up around them.", "CONTINUED:", "The  lights  short  out  and the  landing  is  plunged  into", "darkness.", "The water rises over the lock and he's doing it by feel.", "Jack and Rose are right up against the ceiling...", "Suddenly  the gate gives and SWINGS OPEN.  They are  pushing", "through  by the force of the water.  They make it to  stairs", "on  the other side of the landing and follow the steward  up", "to the next deck.", "EXT. BOAT DECK, STARBOARD SIDE", "Cal  comes reeling out of the first class entrance,  looking", "wild-eyed.", "Waltz  music  wafts over the ship.  Somewhere  the  band  is", "still playing.", "CAL'S  POV:  A little girl, maybe two years old,  is  crying", "along in the alcove.  She looks up at Cal beseechingly.  Cal", "moves  on  without a glance back... reaching a  large  crowd", "clustered  around COLLAPSIBLE A just aft of the bridge.", "sees Murdoch and a number of crewmen struggling to drag  the", "boat to the davits, with no luck.", "Cal  pushes  forward,  trying to  signal  Murdoch,  but  the", "officer  ignores him.  Nearby Tommy and Fabrizio  are  being", "pushed  forward by the crowd behind.  PURSER MCELROY  pushes", "them  back,  getting a couple of seamen  to  help  him.", "brandishes  his gun, waving it in the air, yelling  for  the", "crowd to stay back.", "EXT. BOAT DECK, PORT SIDE / ROOF OF OFFICERS' QUARTERS", "Lightoller, with a group of crew and passengers,  is  trying", "to get Collapsible B down from the roof.  They slide it down", "a pair of oars leaned against the deck house.", "CONTINUED:", "The  weight of the boat snaps the oars and it crashes to the", "deck, upside down.  The two Swedish cousins, OLAUS and BJORN", "GUNERSEN, jump back as the boat nearly hits them.", "OMITTED", "INT. STAIRWELL", "Jack  and  Rose run up seemingly endless stairs as the  ship", "groans and torgues around them.", "EXT. BOAT DECK, STARBOARD SIDE", "Murdoch,  at  Collapsible A, is no longer in  control.", "crowd  is  threatening  to rush the  boat.", "jostle,  yelling and shouting at the officers.  The pressure", "from  behind pushes them forward, and one guy falls off  the", "edge of the deck into the water less than ten feet below.", "Murdoch fires his Webley twice in the air, then point it  at", "the crowd.", "Cal steps up to him.", "Murdoch pushes him back, pointing the pistol at Cal.", "A man next to Tommy rushes forward, and Tommy is shoved from", "behind.", "coming forward, puts a bullet into his chest.", "Tommy collapses, and Fabrizio grabs him, holding him in  his", "arms as his life flows out over the deck.", "Murdoch turns to his men and salutes smartly.  Then he  puts", "the  pistol  to  his temple and... BLAM!", "CONTINUED:", "He  drops  like  a puppet with the strings cut and topples", "over the edge of the boat deck into the water only a few feet", "below.", "Cal  stares in horror at Murdoch's body bobbing in the black", "water.  The MONEY FLOATS out of the pocket of his greatcoat,", "the bills spreading across the surface.", "The crew rush to get the last few women aboart the boat.", "THE  CHILD crying in the alcove.  Cal scoops her up and runs", "forward, cradling her in his arms.", "McElroy nods curtly and pushes him into the boat.  He  spins", "with  his  gun, brandishing it in the air to keep the  other", "men  back.  Cal gets into the boat, holding the little girl.", "He takes a seat with the women.", "INT. FIRST CLASS SMOKE ROOM", "Thomas Andrews stands in front of the fireplace, staring  at", "the large painting above the mantle. The fire is still going", "in the fireplace.", "The  room is empty except for Andrews.  An ashtray falls off", "the  table.  Behind him Jack and Rose run into the room, out", "of  breath  and  soaked.  They run through, toward  the  aft", "revolving  door... then Rose recognizes him.  She sees  that", "his lifebelt is off, lying on a table.", "CONTINUED:", "Andrews picks up his lifebelt and hands it to her.", "Jack pulls her away and they run through the revolving door.", "EXT. BOAT DECK AND VARIOUS LOCATIONS", "The  band finishes the waltz.  Wallace Hartley looks at  the", "orchestra members.", "They  leave  him, walking forward along the  deck.", "puts  his  violin to his chin and bows the  first  notes  of", "\"Nearer My God to Thee\".  One by one the band memebers turn,", "hearing the lonely melody.", "Without  a  word they walk back and take their places.  They", "join  in  with  Hartley, filling out the sound  so  that  it", "reaches all over the ship on this still night.  The vocalist", "begins:  \"If in my dreams I be, nearer my God to thee...\"", "THE HYMN PLAYS OVER THE FOLLOWING SEQUENCE:", "237", "Captain  Smith as he walks to the bridge.  He  proffers  it,", "but  Smith  seems to stare through him.  Without a  word  he", "turns  and  goes  onto the bridge.  He enters  the  enclosed", "WHEELHOUSE and closes the door.  He is alone, surrounded  by", "the  gleaming  brass  instruments.", "collapse.", "238", "statue.", "CONTINUED:", "Then he opens the face of the mantle clock and adjusts it to", "the correct time:", "239  IN CAL'S PARLOUR SUITE water swirls in from the private", "promenade  deck.", "Picasso tranforms under the water's surface.  Degas'  colors", "run.  Monet's water lilies come to life.", "240", "clothed, on a bed in a FIRST CLASS CABIN.  Elderly  Ida  and", "Isador  Strauss  stare at the ceiling,  holding  hands  like", "young  lovers.  Water pours into the room through a doorway.", "It swirls around the bed, two feet deep rising fast.", "241", "ship, the young IRISH MOTHER, seen earlier stoically waiting", "at  the stairs, is tucking her two young children into  bed.", "She  pulls up the covers, making sure they are all warm  and", "cozy.", "soothingly and holding them.", "EXT. BOAT DECK / BRIDGE", "242  IN A WIDE SHOT we see a wave travel up the boat deck as", "the bridge house sinks into the water.", "243", "Working frantically, the men try to detach it from the falls", "so  the  ship  won't  drag it under.  Colonel  Gracie  hands", "Lightoller a pocket knife and he saws furiously at the ropes", "as the water swirls around his legs.  The boat, still upside", "down,  is swept off the ship.  Men start diving in, swimming", "to stay with it.", "244", "whom", "rising  around the men as they work, scrambling to  get  the", "ropes cut so the ship won't drag the collapsible under.", "Fabrizio", "struggles to put it on as the water rises around him.", "245", "black water climbing the windows of the enclosed wheelhouse.", "He has the stricken expression of a damned sould on Judgment", "Day.", "with  shards of glass slams into Smith.  He disappears in  a", "vortex of foam.", "246", "suddenly.", "the  deck.", "CONTINUED:", "Over a hundred passengers are plunged  into  the freezing", "water and the area around the boat becomes a frenzy of", "splashing, screaming people.", "As  men are trying to climb into the callapsible, Cal  grabs", "an oar and pushes them back into the water.", "Fabrizio, swimming for his life, gets swirled under a davit.", "The  ropes  and pulleys tangle around him as the davit  goes", "under  the  water,  and he is dragged down.", "struggles  to  free  himself, and then  kicks  back  to  the", "surface.", "water.", "247", "deck", "sustain, and then lowers his violin.", "EXT. A-DECK AFT, PORT SIDE", "Jack  and Rose run out of the PALM COURT into a dense crowd.", "Jack  pushes his way to the rail and looks at the  state  of", "the  ship.  The bridge is under water and tehre is chaos  on", "deck.", "around them, shouting and pushing.", "They push their way aft through the panicking crowd.", "EXT. FORWARD FUNNEL", "Collapsible A is whirled like a leaf in the currents  around", "the  sining ship.  It slams against the side of the  forward", "funnel.", "CONTINUED:", "250  NEARBY:  Fabrizio is drawn up against the grating of  a", "STOKEHOLD VENT as water pours through it. The force of  tons", "of  water roaring down the ship traps him against it, and he", "is  dragged  down under the surface as the ship  sinks.", "struggles to free himself but cannot.", "Suddenly  there is a concussion deep in the  bowels  of  the", "ship  as  a furnace explodes and a blast of hot air  belches", "out of hte ventilator, ejecting Fabrizio.  He surfaces in  a", "roar of foam and keeps swimming.", "EXT. A-DECK / B-DECK / WELL DECK, AFT", "Jack and Rose clamber over the A-Deck aft rail.  Then, using", "all  his  strength,  he lowers her toward  the  deck  below,", "holding  on  with one hand.  She dangles, then falls.", "jumps down behind her.", "They join a crush of people literally clawing and scrambling", "over  each other to get down the narrow stairs to  the  well", "deck... the only way aft.", "Seeing that the stairs are impossible, Jack climbs over  the", "B-Deck  railing and helps Rose over.  He lowers  her  again,", "and she falls in a heap.  Baker Joughin, now three sheets to", "the  wind, happens to be next to her.  He hauls Rose to  her", "feet.", "the  crowd  across the well deck.  Near them, at  the  rail,", "people are jumping into the water.", "The  ship  GROANS and SHUDDERS.  The man ahead  of  Jack  is", "walking like a zombie.", "EXT. FORWARD FUNNEL", "The  stay cables along the top of the funnel snap, and  they", "lash  like  steel whips down into the water. Cal watches  as", "the  funnel topples from its mounts.  Falling like a  temple", "pillar  twenty  eight feet across it whomps into  the  water", "with  a  tremendous splash.  People swimming  underneath  it", "disappear in an instant.", "CONTINUED:", "Fabrizio,  a few feet away, is hurled back by a  huge  wave.", "He  comes up, gasping... still swimming.  The water  pouring", "into  the  open end of the funnel draws in several swimmers.", "The funnel sinks, disappearing, but--", "Hundreds of tons of water pour down through the 30 foot hole", "where  the funnel stood, thundering down into the  belly  of", "the  ship.  A whirlpool forms, a hole in the ocean, like  at", "enormous  toiler-flush.  T. W. McCauley, the gym  instructor", "swims  in a frenzy as the vortex draws him in.  He is sucked", "down like a spider going down a drain.", "Fabrizio, nearby, swims like Hell as more people are  sucked", "down  behind him.  He manages to get clear.  He's  going  to", "live no matter what it takes.", "INT. BOAT DECK FOYER / GRAND STAIRCASE", "Water  raors  through the doors and windows, cascading  down", "the  stairs  like a rapids.  John Jacob Astor is swept  down", "the  marble  steps to A-Deck, which is already flooded...  a", "roiling vortex.  He grabs the headless cherub at the  bottom", "of the staircase and wraps his arms around it.", "Astor  looks  up  in  time to see the", "overhead EXPLOSE INWARD with the wave of water washing  over", "it.", "blasting  through  the  first class  opulence.", "Armageddon of elegance.", "OMITTED", "INT. BELOWDECKS", "The  flooding  is horrific.  Walls and doors are  splintered", "like  kindling.  Water roars down corridors with pile-driver", "force.", "The  CARTMELL  FAMILY is at the top of a  stairwell,  jammed", "against a locked gate like Jack and Rose were.  Water  boils", "up the stairwell behind them.  Bert Cartmell shakes the gate", "futilely, shouting for help.  Little Cora wails as the water", "boils up around them all.", "EXT. STERN", "Rose and Jack struggle to climb the well deck stairs as  the", "ship  tilts.", "Rose's butt and shoves her up onto the deck.", "Hundreds  of people are already on the poop deck,  and  more", "are  pouring up every second.  Jack and Rose cling  together", "as tehy struggle across the tilting deck.", "257", "which  is  just off the stern, passengers gape as the  giant", "bronze  propellers rise out of the water like  gods  of  the", "deep, FILLING FRAME behind them.", "People  are JUMPING from the well deck, the poop  deck,  the", "gangway doors.  Some hit debris in the water and are hurt or", "killed.", "OMITTED", "OMITTED", "EXT. STERN", "ON  THE  POOP DECK Jack and Rose struggle aft as  the  angle", "increases.  Hundreds of passengers, clinging to every  fixed", "object  on deck, huddle on their knees around FATHER  BYLES,", "who  has  his  voice  raised in prayer.  They  are  praying,", "sobbing, or just staring at nothing, their minds blank  with", "dread.", "Pulling  himself from handhold to handhold, Jack  tugs  Rose", "aft along the deck.", "They struggle on, pushing through the praying people.  A MAN", "loses  his footing ahead and slides toward them.  Jack helps", "him.", "261", "rising faster.", "262", "base", "other  people.", "onto the ship, just two night... and a liftime... ago.", "CONTINUED:", "Above  the wailing and sobbing, Father Byles' voice carries,", "cracking with emotion.", "The  lights flicker, threatening to go out.  Rose grips Jack", "as the stern rises into a night sky ablaze with stars.", "Rose stares about her at the faces of the doomed.  Near them", "are  the  DAHL  FAMILY, clinging together stoically.", "looks at her briefly, and her eyes are infinitely sad.", "Rose  sees  a young mother next to her, clutching  her  five", "year old son, who is crying in terror.", "INT. SHIP-- VARIOUS", "As  the ship tilts further everything not bolted down inside", "shifts.", "263", "with", "crashing into a wall.  FURNITURE tumbles across the  Smoking", "Room floor.", "CONTINUED:", "264", "slide  down the wooden deck like a bobsled run, hundreds  of", "feet  before  they hit the water.  TRUDY BOLT, Rose's  maid,", "slips  as  she struggles along the railing and  slides  away", "screaming.", "265", "water and rising.  Panicking people leap from the poop  deck", "rail,  fall screaming and hit the water like mortar  rounds.", "A  man  falls from the poop deck, hitting the bronze hub  of", "the starboard propeller with a sickening smack.", "266", "like", "110 feet.", "267", "seemingly forever, right past one of the giant screws.", "water rushes up--", "EXT. TITANIC / BOAT 6", "268", "ship and the screaming people come across the water.", "269  REVERSE / HER POV:  IN A WIDE SHOT we see the spectacle", "of  the Titanic, her lights blazing, reflecting in the still", "water.  Its  stern is high in the air, angles up over  forty", "five degrees.  The propellers are 150 feet out of the water.", "Over  a thousand passengers cling to the decks, looking from", "a distance like a swarm of bees.", "The  image  is  shocking, unbelieveable, unthinkable.", "stares  at the spectacle, unable to frame it or put it", "any proportion.", "The great liner's lights flicker.", "INT. ENGINE ROOM", "In  darkness  Chief Engineer Bell hangs onto a pipe  at  the", "master  braker  panel.  Around him men climb through  tilted", "cyclopean  mahcines  with electric hand-torches.", "black  hell of breaking pipes, spraying water, and  groaning", "machinery threatening to tear right out of its bedplates.", "CONTINUED:", "Water sprays down, hitting the breaker panel, but Bell  will", "not  leave his post.  CLUNK.  The breakers kick.", "them  in  again  and-- WHOOM! a blast of  light!", "melts  and  arcing  fills the engine room  with  nightmarish", "light--", "EXT. TITANIC", "WIDE  SHOT.", "becomes a vast black silhouette against the stars.", "IN  COLLAPSIBLE  C: BRUCE ISMAY has his back  to  the  ship,", "unable to watch the great steamer die.  He is catatonic with", "remorse, his mind overloaded.  He can avert his eyes, but he", "can't block out the sounds of dying people and machinery.", "A loud CRACKING REPORT comes across the water.", "EXT. BOAT DECK", "Near  the  third funnel a man clutches the ship's rail.", "stares  down as the DECK SPLITS right between his  feet.", "yawning chasm opens with a THUNDER of breaking steel", "LOVEJOY  is  clutching  the  railing  on  the  roof  of  the", "Officers'  Mess.", "structure  RIPS APART right in front of him.  He gapes  down", "into a widening maw, seeing straight down into the bowels of", "the  ship,  amid  a  BOOMING CONCUSSION like  the  sound  of", "artillery.", "like dolls.", "The stay cables on the funnel part and snap across the decks", "like  whips, ripping off davits and ventilators.  A  man  is", "hit  by a whipping cable and snatched OUT OF FRAME.  Another", "cable smashes the rail next to Lovejoy and it rips free.  He", "falls backward into the pit of jagged metal.", "Fires, explosions and sparks light the yawning chasm as  the", "hull  splits down through nine decks to the keel.", "pours into the gaping wound--", "INT. ENGINE ROOM", "It  is  a  thundering black hell.  Men scream  as  monstrous", "machinery  comes  apart around them, steel  frames  twisting", "like  taffy.", "CONTINUED:", "Their torches illuminate the roaring,  foaming demon  of", "water  as it races at the through the  manchines. Trying to", "climb they are overtaken in seconds.", "EXT. TITANIC - NIGHT", "The  STERN  ALF of the ship, almost four hundred feet  long,", "falls  back  toward  the water.  On the poop  deck  everyone", "screams as they feel themselves plummeting.  The sound  goes", "up like the roar of fans at a baseball stadium when a run is", "scored.", "Swimming  in  the  water  directly under  the  stern  a  few", "unfortunates shriek as they see the keel coming down on them", "like  God's bootheel.  The massive stern section falls  back", "almost level, thundering down into the sea and pushing out a", "mighty wave of displaced water.", "Jack  and  Rose struggle to hole onto the stern rail.", "feel the ship seemingly RIGHT ITSELF.  Some of those praying", "think it is salvation.", "Jack looks at Rose and shakes his head, grimly.", "Now  the  horrible mechanics play out.  Pulled down  by  the", "awesome  weight of the flooded bow, the buoyant stern  tilts", "up  rapidly.", "angles up again.  Everyone is clinging to benches, railings,", "ventilators... anything to keep from sliding  as  the  stern", "lifts.", "The stern goes up and up, past 45 degrees, then past sixty.", "People start to fall, sliding and tumbling.  They skid  down", "the  deck,  screaming and flailing to grab  onto  somehting.", "They  wrench other people loose and pull them down as  well.", "There is a pile-up of bodies at the forward rail.  The  DAHL", "FAMILY falls one by one.", "He  climbs  over the stern rail and reaches back  for  Rose.", "She is terrified to move.  He grabs her hand.", "CONTINUED:", "Jack  pulls  her  over the rail.  It is the  same  place  he", "pulled her over the rail two nights earlier, going the other", "direction.", "HORIZONTAL, and the deck VERITCAL.  Jack grips her fiercely.", "The  stern is now straight up in the air... a rumbling black", "monolith  standing against the stars.  It hangs  there  like", "that for a long grace note, its buoyancy stable.", "Rose  lies  on the railing, looking down fifteen stories  to", "the  boiling  sea at the base of the stern section.", "near  them,  who didn't climb over, hang from  the  railing,", "their  legs dangling over the long drop.  They fall  one  by", "one,  plummeting down the vertical face of  the  poop  deck.", "Some", "ventilators.", "Jack and Rose lie side by side on what was the vertical face", "of  the hull, gripping the railing, which is now horizontal.", "Just  beneath  their  feet  are  the  gold  letters  TITANIC", "emblazoned across the stern.", "Rose  stares down terrified at the black ocean waiting below", "to  claim  them.", "Joughin,  crouching on the hull, holding onto  the  railing.", "It is a surreal moment.", "The  final  relentless plunge begins as  the  stern  section", "floods.", "like an elevator with Jack and Rose.", "She  stares  at the water coming up at them, and  grips  his", "hand harder.", "Below  them  the  poop  deck  is disappearing.", "gathers  speed...  the boiling surface engulfs  the  docking", "bridge and then rushes up the last thirty feet.", "CONTINUED: (2)", "278", "boiling  sea.", "figures of Jack and Rose vanish under the water.", "Where  the ship stood, now there is nothing.  Only the black", "ocean.", "EXT. OCEAN / UNDERWATER AND SURFACE", "Bodies  are  whirled and spun, some limp  as  dolls,  others", "struggling spasmodically, as the vortex sucks them down  and", "tumbles them.", "280", "surface... holding tightly to Rose, pulling her up.", "281", "thrashing  people.  Over a thousand people are now  floating", "where  the  ship went down.  Some are stunned,  gasping  for", "breath.", "screaming.", "Jack and Rose surface among them.  They barely have time  to", "gasp  for  air  before people are clawing at  them.", "driven insane by the water, 4 degrees below freezing, a cold", "so intense it is indistinguishable form death by fire.", "A  man  pushes Rose under, trying to climb on top of  her...", "senselessly  trying to get out of the water, to  climb  onto", "anything.  Jack PUNCHES him repeatedly, pulling her free.", "She  tries,  but  her strokes are not as  effective  as  his", "because  of her lifejacket.  They break out of the  clot  of", "people.  He has to find some kind of flotation, anything  to", "get her out of the freezing water.", "All  about them there is a tremendous wailing, screaming and", "moaning... a chorus of tormented souls.  And beyond  that...", "nothing  but  black water stretching to  the  horizon.", "sense of isolation and hopelessness is overwhelming.", "OMITTED", "EXT. OCEAN", "Jack  strokes  rhythmically, the  effort  keeping  him  from", "freezing.", "His  words keep her focused, taking her mind off the wailing", "around them.  Rose scans the water, panting, barely able  to", "draw a breath.  She turns and... SCREAMS.", "A  DEVIL  is  right in from of her face.  It  is  the  black", "FRENCH  BULLDOG, swimming right at her like a seamonster  in", "the  darkness, its coal eyes bugging.  It motors  past  her,", "like it is headed for Newfoundland.", "Beyond it Rose sees somehting in the water.", "Jack  sees  what she is pointing to, and they  make  for  it", "together.", "carved.  He  pushes her up and she slithers  onto  it  belly", "down.", "But  when Jack tries to get up onto the thing, it tilts  and", "submerges, almost dumping Rose off.  It is clearly only  big", "enough  to  support  her.  He clings to it,  close  to  her,", "keeping his upper body out of the water as best he can.", "Their breath floats around them in a cloud as they pant from", "exertion.", "of debris.", "CONTINUED:", "EXT. COLLAPSIBLE A / OCEAN", "The  boat is overloaded and half-flooded.  Men cling to  the", "sides  in the water.  Others, swimming, are drawn to  it  as", "their  only hope.  Cal, standing in the boat, slaps his  oar", "in the water as a warning.", "Fabrizio,  exhausted and near the limit, makes it almost  to", "the  boat.", "scalp.", "CLOSE  ON FABRIZIO as he floats, panting each breath  agony.", "You see the spirit leave him.", "FABRIZIO'S  POV:  Cal in SLOW MOTION, yelling  and  wielding", "the oar.  A demon in a tuxedo. The image fades to black.", "EXT. OCEAN", "JACK AND ROSE still float amid a chorus of hte damned.  Jack", "sees the ship's officer nearby, CHIEF OFFICER WILDE.  He  is", "blowing his whistle furiously, knowing the sound will  carry", "over the water for miles.", "CONTINUED:", "She", "uncontrollably, her lips blue and her teeth chattering.", "People are still screaming, calling to the lifeboats.", "SAVE ON LIFE!", "EXT. LIFEBOATS / OCEAN", "IN BOAT 6:  Ruth has her ears covered against the wailing in", "the  darkness.", "stunned, listening to the sounds of hundreds screaming.", "The  women  won't  meet her eyes.  They  huddle  into  their", "ermine wraps.", "Ruth keeps her ears covered and her eyes closed, shutting it", "all out.", "CONTINUED:", "287  IN BOAT ONE:  Sir Cosmo and Lucile Duff-Gordon sit with", "ten  other people in a boat that is two thirds empty.", "are two hundred yards from the screaming in the darkness.", "Lucile  squeezes Cosmo's hand and pleads him with her  eyes.", "She is terrified.", "The crewmembers, intimidated by a nobleman, acquiesce.  They", "hunch guiltily, hoping the sound will stop soon.", "TWENTY  BOATS, most half full, float in the darkness.", "of them make a move.", "EXT. OCEAN", "Jack  and Rose drift under the blazing stars.  The water  is", "glassy,  with only the faintest undulating swell.  Rose  can", "actually see the stars reflecting on the black mirror of the", "sea.", "Jack squeezes the water out of her long coat, tucking it  in", "tightly  around her legs.  He rubs her arms.", "chalk  with  in the darkness.  A low MOANING in the  darknes", "around them.", "Rose  is  unmoving, just staring into space.  She knows  the", "truth.  There won't be any boats.  Behind Jack she sees that", "Officer  Wilde  has stopped moving.  He is  slumped  in  his", "lifejacket, looking almost asleep.  He has died of  exposure", "already.", "CONTINUED:", "She  laughs weakly, but it sounds like a gasp of fear.  Rose", "finds his eyes in the dim light.", "He takes her hand.", "Jack is having trouble getting the breath to speak.", "His  voice  is trembling with the cold which is working  tis", "way to his heart.  But his eyes are unwavering.", "CONTINUED: (2)", "She  grips  his hand and they lie with their heads together.", "It is quiet now, except for the lapping of the water.", "EXT. LIFEBOATS / OCEAN - NIGHT", "Fifth Officer Lowe, the impetuous young Welshman, has gotten", "Boats", "14.", "together  and is transferring passengers from", "others, to empty his boat for a rescue attempt.", "As the women step gingerly across the other boats, Lowe sees", "a  shawled figure in too much of a hurry.  He rips the shawl", "off,  and finds himself staring into the face of a man.", "angrily  shoves the stowaway into another boat and turns", "his crew of three.", "EXT. OCEAN / BOAT 14", "The beam of an electric torch plays across the water like  a", "searchlight as boat 14 comes toward us.", "ANGLE  FROM  THE  BOAT  as  the torch  illuminates  floating", "debris,  a  poignant trail of flotsam:  a violin, a  child's", "wooden soldier, a framed photo of a steerage family.  Daniel", "Marvin's wooden Biograph camera.", "Then,  their  white lifebelts bobbing in the  darkness  like", "signoposts,  the  first bodies come into the  torch's  beam.", "The  people are dead but not drowned, killed by the freezing", "water.  Some look like they could be sleeping.  Others stare", "with frozen eyes at the stars.", "Soon  bodies are so thick the seamen cannot row.", "the  oars on the heads of floating men and women... a wooden", "thunk.", "with her arms frozen around her lifeless baby.", "CONTINUED:", "EXT. OCEAN", "IN A HOVERING DOWNANGLE we see Jack and Rose floating in the", "black  water.", "and  the  two  of  them seem to be floating in  interstellar", "space.", "together.", "wheeling  above her.  The music is transparent,  floating...", "as the long sleep steals over Rose, and she feels peace.", "CLOSE  ON  Rose's face.  Pale, like the faces of  the  dead.", "She  seems  to be floating in a void.  Rose is  in  a  semi-", "hallucinatory  state.  She knows she  is  dying.", "barely move as she sings a scrap of Jack's song:", "ROSE'S  POV:  The stars.  Like you've never seen them.", "Milky Way a glorious band from horizon to horizon.", "A  SHOOTING  STAR  flares... a  line  of  light  across  the", "heavens.", "TIGHT  ON  ROSE again.  We see that her hair is dusted  with", "frost  crystals.  Her breathing is so shallow, she is almost", "motionless.", "water.", "ROSE'S  POV...  SLOW  MOTION:  The  silhouetter  of  a  boat", "crossing  the stars.  She sees men in it, rowing  so  slowly", "the  oars  lift out of the syrupy water, leaving  weightless", "pearls  floating in the air.  The VOICES of  the  men  sound", "slow and DISTORTED.", "Then  the lookout flashes his torch toward her and the light", "flares across the water, silouetting the bobbing corpses  in", "between.", "The boat is 50 feet away, and moving past her.  The men look", "away.", "Rose  lifts her head to turn to Jack.  We see that her  hair", "has frozen to the wood under her.", "CONTINUED:", "She  touches  his shoulder with her free hand.", "respond.", "rimed with frost.", "He seems to be sleeping peacefully.", "But he is not asleep.", "Rose  can  only  stare at his still face as the  realization", "goes through her.", "All hope, will and spirit leave her.  She looks at the boat.", "It  is  further away now, the voices fainter.  Rose  watches", "them go.", "She  closes her eyes.  She is so weak, and there just  seems", "to be no reason to even try.", "And then... her eyes snap open.", "She  raises her head suddenly, cracking the ice as she  rips", "her  hair off the wood.  She calls out, but her voice is  so", "weak  they don't hear her.  The boat is invisible  now,  the", "torch  light  a star impossibly far away.  She struggles  to", "draw breath, calling again.", "292", "to something ahead, turning the tiller.", "293", "actually  frozen to Jack's.  She breaths on it, melting  the", "ice a little, and gently unclasps their hands, breaking away", "a thin tinkling film.", "She  releases  him and he sinks into the  black  water.", "seems to fade out like a spirit returning to some immaterial", "plane.", "Rose  rolls off the floating staircase and plunges into  the", "icy  water.", "grabs his whistle.  She starts to BLOW THE WHISTLE with  all", "the  strength in her body.  Its sound slaps across the still", "water.", "CONTINUED: (2)", "294", "whistle.", "Rose  keeps blowing as the boat comes to her.  She is  still", "blowing  when Lowe takes the whistle from her mouth as  they", "haul  her into the boat.  She slips into uncosciousness  and", "they scramble to cover her with blankets...", "INT. IMAGING SHACK / KELDYSH", "EXTREME  CLOSEUP of Rose's ancient, wrinkled face.", "day.", "As  she speaks THE CAMERA TRACKS slowly across the faces  of", "Lizzy  and  the  salvage crew on KELDYSH.", "Buell,  the others... the reality of what happened  here", "years before has hit them like never before.  With her story", "Rose has put them on Titanic in its final hours, and or  the", "first time, they do feel like graverobbers.", "Lovett, for the first time, has even forgotten to ask  about", "the diamond.", "EXT. LIFEBOATS / OPEN SEA - PRE-DAWN", "MATCHING  MOVE as the camera tracks along the faces  of  the", "saved.", "CONTINUED:", "DISSOLVE  TO:  ANOTHER BOAT, and then ANOTHER, seeing  faces", "we  know  among  the  survivors:  Ismay in  a  trance,  just", "staring  and  trembling... Cal, sipping  from  a  hip  flask", "offered  to  him  by  a black-faced stoker...  Ruth  hugging", "herself, rocking gently.", "IN  BOAT 14:  CLOSE ON ROSE, lying swaddled.  Only her  face", "is visile, white as the moon.  The man next to her jumps up,", "pointing and yelling.  Soon everyone is looking and shouting", "excitedly.  In Rose's POV it is all silent, SLOW MOTION.", "IN  SLOW-MOTION SILENCE we see Lowe light a green flare  and", "wave  it as everyone shouts and cheers.  Rose doesn't react.", "She floats beyond all human emotion.", "EXT. LIFEBOATS / OPEN SEA - DAWN", "Golden lgiht washes across the white boats, which gloat in a", "calm  sea reflecting the rosy sky.  All around them, like  a", "flotilla of sailing ships, are icebergs.  The CARPATHIA sits", "nearby, as boats row toward her.", "EXT. LIFEBOATS / OCEAN / CARPATHIA MONTAGE - DAY", "IMAGES  DISSOLVE into one another:  a ship's  hull  looming,", "with  the  letters  CARPATHIA visible  on  the  bow...  Rose", "watching,  rocked  by  the  sea, her  face  blank...  seamen", "helping  survivors  up the rope ladder  to  the  Carpathia's", "gangway  doors...  two women crying and hugging  each  other", "inside the ship... ALL SILENT, ALL IN SLOW-MOTION.  There is", "just  music, so gentle and sad, part elegy, part hymn,  part", "aching song of love lost forever.", "THE  IMAGES  CONTINUE  to music... Rose,  outside  of  time,", "outside  of herself, coming into Carpathia, barely  able  to", "stand... Rose being draped wtih warm blankets and given  hot", "tea...  BRUCE  ISMAY climbing aboard.  He has the  face  and", "eyes of a damned soul.", "As  Ismay  walks along the hall, guided by a crewman  toward", "the  doctor's  cabin, he passes rows of seated and  standing", "widows.  He must run the gauntlet of their accusing gazes.", "EXT. DECK / CARPATHIA - DAY", "It is the afternoon of the 15th.  Cal is searching the faces", "of  the widows lining the deck, looking for Rose.", "CONTINUED:", "The  deck of  Carpathia is crammed with huddled people, and", "even  the recovered  lifeboats of Titanic.  On a hatch cover", "sits  an enormous pile of lifebelts.", "He  keeps walking toward the stern.  Seeing Cal's tuxedo,  a", "steward approaches him.", "Cal ignores him and goes amongst this wrecked group, looking", "under shawls and blankets at one bleak face after another.", "Rose  is  sipping  hot tea.  Her eyes focus  on  him  as  he", "approaches her.  He barely recognizes her.  She looks like a", "refugee, her matted hair hanging in her eyes.", "She holds up her hand, stopping him.", "She fixes him with a glare as cold and hard as the ice which", "changed their lives.", "CONTINUED: (2)", "She  stands, turning to the rail.  Dismissing him.", "Cal stricken with emotion.", "We see that in his way, the only way he knows, he does truly", "love her.", "After a moment, he turns and walks away.", "301", "April", "just  as  it does today, welcoming her home with her glowing", "torch.", "mind.", "302", "pier,  Pier 54.  Over 30,000 people line the dock  and  fill", "the  surrounding  streets.", "photographers go off like small bombs, lighting  an  amazing", "tableau.", "Several  hundred  police keep the mob  back.", "packes  with  friends and reletives, officials,  ambulances,", "and the press--", "Reporters  and photographers swarm everywhere... 6  deep  at", "the  foot  of  the  gangways, lining the tops  of  cars  and", "trucks... it is the 1912 equicalent of a media circus.  They", "jostle  to  get close to the survivors, tugging on  them  as", "they", "questions.", "Rose  is  covered with a whoollen shawl and walking  with  a", "group  of  steerage  passengers.  Immigration  officers  are", "asking them questions as they come off the gangway.", "CONTINUED: (3)", "The officer steers her toward a holding area for processing.", "Rose walks forward with the dazed immigrants.  The BOOM!  of", "photographer's magnesium flashes cause them to  flinch,  and", "the  glare is blinding.  There is a sudden disturbance  near", "her  as two men burst through the cordon, running to embrace", "an  older woman along the survivors, who cries out with joy.", "The  reporters converge on this emotional scene, and flashes", "explode.", "Rose  uses  this  moment to slip away into the  crowd.", "pushes through the jostling people, moving with purpose, and", "none challenges her in the confusion.", "TRACKING  WITH  HER as she walks away, further  and  further", "until  she flashes and the roar are far behind her, and  shi", "is till walking, determined.", "INT. IMAGING SHACK / KELDYSH", "Old  Rose sits with the group in the Imaging Shack,  lit  by", "the  blue glow of the screens.  She holds the haircomb  with", "the jade butterfly on the handle in her gnarled hands.", "CONTINUED:", "OMITTED", "EXT. OCEAN FLOOR / TITANIC WRECK", "The Mir submersibles make their last pass over the ship.  We", "hear Yuri the pilot on the UQC:", "The  sub  rises off the deck of the wreck, taking its  light", "with  it,  leaving the Titanic once again it  its  fine  and", "private darkness.", "EXT. KELDYSH DECK", "A  desultory  wrap party for the expedition is in  progress.", "There  is  music  and some of the (co-ed) Russian  crew  are", "dancing.  Bodine is getting drunk in the aggressive style of", "Baker Joughin.", "Lovett  stands  at  the rail, looking down  into  the  black", "water.", "her hand on his arm.", "Lovett notices a figure move through the lights far down  at", "the stern of the ship.", "EXT. KELDYSH STERN DECK", "Rose  walks through the shadows of the deck machinery.", "nightgown blows in the wind.  Her feet are bare.  Her  hands", "are clutched at her chest, almost as if she is praying.", "CONTINUED:", "ON  LOVETT  AND LIZZY running down the stairs from  the  top", "deck, hauling ass.", "ROSE  reaches the sern rail.  Her gnarled fingers wrap  over", "the  rail.", "pushes  herself up, leaning forward.  Over her shoulder,  we", "see the black water glinting far below.", "LOVETT AND LIZZY run up behind her.", "ROSE  TURNS  her head, looking at them.  She turns  further,", "and  we see she has something in her hand, something she was", "about to drop overboard.", "It is the \"Heart of the Ocean\".", "Lovett sees his holy grail in her hand and his eyes go wide.", "Rose  keeps  it  over  the railing where  she  can  drop  it", "anytime.", "FLASH  CUT  TO:  A SILENT IMAGE OF YOUNG ROSE  walking  away", "from  Pier", "battle  behind her.  She has her hands in her pockets.", "stops,  feeling something, and pulls out the necklace.", "stares at it in amazement.", "BACK ON KELDYSH, Rose smiles at Brock's incomprehension.", "She holds it out over the water.  Bodine and a couple of the", "other  guys  come up behind Lovett, reacting to what  is  in", "Rose's hand.", "CONTINUED: (2)", "The  massive diamond glitters.  Brock edges closer and holds", "out his hand...", "He  comes  closer to her.  It is reminiscent of Jack  slowly", "moving up to her at the stern of Titanic.", "Surprisingly,  she calmly places the massice  stone  in  the", "palm  of  his  hand, while still holding onto the  necklace.", "Lovett  gazes  at the object of his quest.  An  infinity  of", "cold  scalpels glint in its blue depths.  It is mesmerizing.", "It fits in his hand just like he imagined.", "His grip tightens on the diamond.", "He  looks  up,  meeting  her gaze.  Her  eyes  are  suddenly", "infinitely wise and deep.", "His  fingers relax.  He opens them slowly.  Gently she slips", "the diamond out of his hand.  He feels it sliding away.", "CONTINUED: (3)", "Then,  with an impish little grin, Rose tosses the  necklace", "over  the rail.  Lovett gives a strangled cry and rushes  to", "the  rail  in  time  to see it hit the water  and  disappear", "forever.", "Brock Lovett goes through ten changes before he settles on a", "reaction...  HE LAUGHS.  He laughs until the tears  come  to", "his eyes.  Then he turns to Lizzy.", "Lizzy grins at him and nods.  Rose smiles.  She looks up  at", "the stars.", "308", "twinkling end over end, into the infinate depths.", "INT. ROSE'S CABIN / KELDYSH", "A  GRACEFUL  PAN  across Rose's shelf of carefully  arranged", "pictures:", "Rose  as  a  young  actress  in  California,  radiant...", "theatrically  lit  studio publicity  shot...  Rose  and  her", "husband, with their two children... Rose with her son at his", "college", "grandchildren at her 70th birthday.  A collage of images  of", "a life lived well.", "THE  PAN STOPS on an image filling frame.  Rose, circa 1920.", "She  is  at  the beach, sitting on a horse at the  surfline.", "The Santa Monica pier, with its rollercoaster is behind her.", "She is grinning, full of life.", "We  PAN  OFF the last picture to Rose herself, warm  in  her", "bunk.", "sleeping, or maybe something else.", "BLACKNESS", "310", "dark.", "mind.", "CONTINUED:", "We  pass  over the endless forecastle  deck  to  the", "superstructure, moving faster than subs can  move...  almost", "like we are flying.", "WE  GO  INSIDE, and the echoing sound of distant waltz music", "is  heard.  The rust fades away from the walls of  the  dark", "corridor  and it is transformed... WE EMERGE onto the  grand", "staircase, lit by glowing chandelier.  The music is  vibrant", "now,  and  the  room is populated by men in tie  and  tails,", "women in gowns.  It is exquisitely beautiful.", "IN  POV we sweep down the staircase.  The crowd of beautiful", "gentlmen and ladies turn as we descend toward them.  At  the", "bottom  a man stands with his back to us... he turns and  it", "is Jack.  Smiling he holds his hand out toward us.", "IN  A SIDE ANGLE Rose goes into his arms, a girl of 17.  The", "passengers, officers and crew of the RMS Titanic  smile  and", "applaud in the utter silence of the abyss."]}